// Общий модуль "Обработка событий документа (сервер)"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


// Процедура производит очистку полей розничной цены документа в случае когда склад не является розничным.
//
// Параметры:
//  Форма         - УправляемаяФорма - Форма, в которой возникло событие.
//  СкладКомпании - СправочникСсылка - Склад, на который поступают товары.
//  Условия - Структура - (необязательное) содержит обязательное и достаточное условия:
//    * Обязательное - Булево - обязательное условие (по умолчанию ИСТИНА)
//    * Достаточное - Булево - достаточное условие(по умолчанию ЛОЖЬ)
//
Процедура ОчиститьПолеЦенаРозничнаяДляНеРозничныхСкладов(Объект, СкладКомпании, ИмяТабличнойЧасти = "Товары", СуффиксКолонок = "", Условия=Неопределено) Экспорт
	
	Если Условия = Неопределено Тогда
		Условия = Новый Структура;
	КонецЕсли;
	Если НЕ Условия.Свойство("Обязательное") Тогда
		Условия.Вставить("Обязательное", Истина);
	КонецЕсли;
	Если НЕ Условия.Свойство("Достаточное") Тогда
		Условия.Вставить("Достаточное", Ложь);
	КонецЕсли;
	
	// Проверим есть ли реквизит % наценки
	ЕстьПроцентНаценки = ЕстьРеквизит(Объект, "ПроцентНаценки", ИмяТабличнойЧасти);
	
	// Определим, имеет ли смысл давать возможность пользователю редактировать колонки розничной цены.
	ЭтоРозничныйСклад = (ЗначениеЗаполнено(СкладКомпании) И ТипЗнч(СкладКомпании)=Тип("СправочникСсылка.СкладыКомпании") И СкладКомпании.Розничный);
	ЕстьРозничныеЦены = (ЭтоРозничныйСклад И Условия.Обязательное ИЛИ Условия.Достаточное);
	
	// Произведем установку видимости у колонок табличной части
	Если НЕ ЕстьРозничныеЦены Тогда
		Для каждого СтрокаТабличнойЧасти Из Объект[ИмяТабличнойЧасти] Цикл
			СтрокаТабличнойЧасти["ЦенаРозничная"+СуффиксКолонок]  = 0;
			СтрокаТабличнойЧасти["СуммаРозничная"+СуффиксКолонок] = 0;
			Если ЕстьПроцентНаценки Тогда
				СтрокаТабличнойЧасти["ПроцентНаценки"+СуффиксКолонок] = 0;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // ОчиститьПолеЦенаРозничнаяДляНеРозничныхСкладов()

Функция ВводСПустымОснованием(ДанныеЗаполнения) Экспорт
	
	Возврат(ДанныеЗаполнения = Неопределено ИЛИ ТипЗнч(ДанныеЗаполнения) = Тип("Структура"));
	
КонецФункции

Функция ПолучитьРежимПроведенияПоПартиям() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	РежимПроведенияПоПартиям = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().РежимПроведенияПоПартиям;
	Если НЕ ЗначениеЗаполнено(РежимПроведенияПоПартиям) Тогда
		РежимПроведенияПоПартиям = Перечисления.РежимыПроведенияПартий.ПартииОтсутствуют;
	КонецЕсли;
	
	Возврат РежимПроведенияПоПартиям;
	
КонецФункции //ПолучитьРежимПроведенияПоПартиям()

// Возвращает перечень имен реквизитов, которые не должны переноситься при вводе документов на основании и копировании.
//
Функция ПолучитьИменаИсключаемыхРеквизитов() Экспорт
	
	// Составим перечень реквизитов, значения которых не должны копироваться из переданных данных заполнения.
	ИменаИсключаемыхРеквизитов = ",БлокироватьПерерасчетСкидок,ДокументОснование,Комментарий,СтатусУтверждения,НомерЧека,ДатаФР,НомерСмены,НомерДокумента";
	
	// Перечень исключений дополним служебными реквизитами
	ИменаИсключаемыхРеквизитов = ИменаИсключаемыхРеквизитов + ",Номер,Дата,ДатаСоздания,ДатаОперации,Автор,РегламентированныйУчет,ДополнительныеРеквизиты,ОбластьДанныхВспомогательныеДанные,ОбластьДанныхОсновныеДанные";
	
	Возврат ИменаИсключаемыхРеквизитов;
	
КонецФункции // ПолучитьИменаИсключаемыхРеквизитов()

// Процедура производит проверку соответствия вида номенклатуры и хозоперации.
//
// Параметры:
//  ЭтотОбъект    - ДокументОбъект - Документ, который обрабатывается.
//
Процедура ПроверитьСоответствиеВидаНоменклатурыХозОперации(Объект,Отказ)
	
	// Проверяем целесообразность проверки строк текущей таблицы
	Если НЕ ЕстьРеквизит(Объект,"ХозОперация") Тогда
		Возврат;
	КонецЕсли;
	
	// Получим параметры текущего проверяемого объекта
	ОбъектМетаданных      = Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка));
	ВидыНоменклатуры = Справочники.ХозОперации.ПолучитьВидыНоменклатуры(Объект.ХозОперация);
	
	// Считаем, что набор должен быть разложен на составляющие и самого набора в тч не должно быть.
	Набор = ВидыНоменклатуры.Найти(Перечисления.ВидыНоменклатуры.Набор);
	Если НЕ Набор = Неопределено Тогда
		ВидыНоменклатуры.Удалить(Набор);
	КонецЕсли;
	
	// Последовательно обработаем каждую табличную часть объекта
	Для каждого ОбъектМетаданныхТаблицы Из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		// Проверяем целесообразность проверки строк текущей таблицы
		Если НЕ ЕстьРеквизит(Объект,"Номенклатура",ОбъектМетаданныхТаблицы.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем таблицу признаков запрета продажи и закупки по товарам табличной части
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	Номенклатура.ВидНоменклатуры
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&СписокНоменклатуры)
		|	И НЕ Номенклатура.ВидНоменклатуры В (&ВидНоменклатуры)";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("СписокНоменклатуры", Объект[ОбъектМетаданныхТаблицы.Имя].ВыгрузитьКолонку("Номенклатура"));
		Запрос.УстановитьПараметр("ВидНоменклатуры", ВидыНоменклатуры);
		ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
		
		// Проверяем целесообразность дальнейших действий
		Если ТаблицаНоменклатуры.Количество()=0 Тогда
			Продолжить;
		КонецЕсли;
		
		// Выполняем проверку корректности заполнения
		Для каждого СтрокаТабличнойЧасти Из Объект[ОбъектМетаданныхТаблицы.Имя] Цикл
			Если СтрокаТабличнойЧасти.Номенклатура.ЭтоГруппа Тогда //skud 2020-02-18 группы не проверяем.
				Продолжить;
			КонецЕсли;	
			// Получим вид номенклатуры по текущей номенклатуре
			НеСоответствующаяНоменклатура = ТаблицаНоменклатуры.Найти(СтрокаТабличнойЧасти.Номенклатура, "Номенклатура");
			
			// Проверяем целесообразность дальнейших действий
			Если ЗначениеЗаполнено(НеСоответствующаяНоменклатура) Тогда
				
				// Сообщим пользователю что-то не так
				ВывестиСообщение(НСтр("ru = 'Вид номенклатуры ""%1"" недопустим для выбранной операции ""%2"".'"), Объект, ОбъектМетаданныхТаблицы.Имя+"[#].Номенклатура", СтрокаТабличнойЧасти.НомерСтроки,Отказ, НеСоответствующаяНоменклатура.Номенклатура,Объект.ХозОперация);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьСоответствиеВидаНоменклатурыХозОперации()

// Процедура производит проверку признаков запрета номенклатуры.
//
// Параметры:
//  ЭтотОбъект    - ДокументОбъект - Документ, который обрабатывается.
//
Процедура ПроверитьПараметрыЗапретаВыбораНоменклатуры(Объект,Отказ)
	
	// Если выполняется восстановление последовательностей, то отключим проверку
	Если ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ЭтоВосстановлениеПоследовательностей", Ложь) Тогда
		Возврат;
	КонецЕсли;
	
	НастройкиВыбораНоменклатуры = УправлениеДиалогомДокументаСервер.ПроверитьВозможныеОперацийСНоменклатурой(Объект);
	Если НастройкиВыбораНоменклатуры.ЗапретЗакупки ИЛИ НастройкиВыбораНоменклатуры.ЗапретПродажи ИЛИ НастройкиВыбораНоменклатуры.Предупреждать Тогда
		
		// Получим параметры текущего проверяемого объекта
		ОбъектМетаданных      = Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка));
		
		// Последовательно обработаем каждую табличную часть объекта
		Для каждого ОбъектМетаданныхТаблицы Из ОбъектМетаданных.ТабличныеЧасти Цикл
			
			// Проверяем целесообразность проверки строк текущей таблицы
			Если НЕ ЕстьРеквизит(Объект,"Номенклатура",ОбъектМетаданныхТаблицы.Имя) Тогда
				Продолжить;
			КонецЕсли;
			
			// Получаем таблицу признаков запрета продажи и закупки по товарам табличной части
			ТекстЗапроса =
				"ВЫБРАТЬ РАЗРЕШЕННЫЕ
				|	Номенклатура.Ссылка КАК Номенклатура,
				|	Номенклатура.ЗапретЗакупки КАК ЗапретЗакупки,
				|	Номенклатура.ЗапретПродажи КАК ЗапретПродажи,
				|	Номенклатура.СнятаСПроизводства КАК СнятаСПроизводства,
				|	ВЫБОР
				|		КОГДА Номенклатура.ЗапретПродажи = ИСТИНА
				|				ИЛИ Номенклатура.ЗапретЗакупки = ИСТИНА
				|			ТОГДА ИСТИНА
				|		ИНАЧЕ ЛОЖЬ
				|	КОНЕЦ КАК Выбрано
				|ПОМЕСТИТЬ ВремТаб
				|ИЗ
				|	Справочник.Номенклатура КАК Номенклатура
				|ГДЕ
				|	Номенклатура.Ссылка В(&СписокНоменклатуры)
				|;
				|
				|////////////////////////////////////////////////////////////////////////////////
				|ВЫБРАТЬ
				|	ВремТаб.ЗапретЗакупки КАК ЗапретЗакупки,
				|	ВремТаб.ЗапретПродажи КАК ЗапретПродажи,
				|	ВремТаб.Номенклатура КАК Номенклатура,
				|	ВремТаб.СнятаСПроизводства КАК СнятаСПроизводства,
				|	ВремТаб.Номенклатура.Артикул КАК НоменклатураАртикул
				|ИЗ
				|	ВремТаб КАК ВремТаб
				|ГДЕ
				|	ВремТаб.Выбрано";
			
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("СписокНоменклатуры", Объект[ОбъектМетаданныхТаблицы.Имя].ВыгрузитьКолонку("Номенклатура"));
			ПараметрыЗапрета = Запрос.Выполнить().Выгрузить();
			
			// Выполняем проверку корректности заполнения
			Для каждого СтрокаТабличнойЧасти Из Объект[ОбъектМетаданныхТаблицы.Имя] Цикл
		
				// получим параметры запрета по текущей номенклатуре
				ПараметрыЗапретаНоменклатуры = ПараметрыЗапрета.Найти(СтрокаТабличнойЧасти.Номенклатура, "Номенклатура");
				
				// Проверяем целесообразность дальнейших действий
				Если ЗначениеЗаполнено(ПараметрыЗапретаНоменклатуры) Тогда
				
					// Проверим и сообщим пользователю если что-то не так
					Если ПараметрыЗапретаНоменклатуры.ЗапретЗакупки И НастройкиВыбораНоменклатуры.ЗапретЗакупки Тогда
						ВывестиСообщение(
							НСтр("ru = 'Номенклатура [%1] ""%2"" блокируется для закупки.'"),
							Объект,
							ОбъектМетаданныхТаблицы.Имя+"[#].Номенклатура",
							СтрокаТабличнойЧасти.НомерСтроки,
							Отказ,
							ПараметрыЗапретаНоменклатуры.НоменклатураАртикул,
							ПараметрыЗапретаНоменклатуры.Номенклатура);
					КонецЕсли;
					Если ПараметрыЗапретаНоменклатуры.ЗапретПродажи И НастройкиВыбораНоменклатуры.ЗапретПродажи Тогда
						ВывестиСообщение(
							НСтр("ru = 'Номенклатура [%1] ""%2"" блокируется для продажи.'"),
							Объект,
							ОбъектМетаданныхТаблицы.Имя+"[#].Номенклатура",
							СтрокаТабличнойЧасти.НомерСтроки,
							Отказ,
							ПараметрыЗапретаНоменклатуры.НоменклатураАртикул,
							ПараметрыЗапретаНоменклатуры.Номенклатура);
					КонецЕсли;
					Если (ПараметрыЗапретаНоменклатуры.ЗапретПродажи ИЛИ ПараметрыЗапретаНоменклатуры.ЗапретЗакупки) И НастройкиВыбораНоменклатуры.Предупреждать Тогда
						ВывестиСообщение(
							НСтр("ru = 'Номенклатура [%1] ""%2"" блокируется для %3.'"),
							Объект,
							ОбъектМетаданныхТаблицы.Имя +"[#].Номенклатура",
							СтрокаТабличнойЧасти.НомерСтроки,,
							ПараметрыЗапретаНоменклатуры.НоменклатураАртикул,
							ПараметрыЗапретаНоменклатуры.Номенклатура,
							?(ПараметрыЗапретаНоменклатуры.ЗапретЗакупки, НСтр("ru = 'закупки'"), "")
								+ ?(ПараметрыЗапретаНоменклатуры.ЗапретПродажи И ПараметрыЗапретаНоменклатуры.ЗапретЗакупки, " " + НСтр("ru = 'и'") + " ", "")
								+ ?(ПараметрыЗапретаНоменклатуры.ЗапретПродажи, НСтр("ru = 'продажи'"), ""));
					КонецЕсли;
					Если ПараметрыЗапретаНоменклатуры.СнятаСПроизводства И НастройкиВыбораНоменклатуры.СнятаСПроизводства Тогда
						ВывестиСообщение(
							НСтр("ru = 'Номенклатура [%1] ""%2"" снята с производства.'"),
							Объект,
							ОбъектМетаданныхТаблицы.Имя+"[#].Номенклатура",
							СтрокаТабличнойЧасти.НомерСтроки,
							Отказ,
							ПараметрыЗапретаНоменклатуры.НоменклатураАртикул,
							ПараметрыЗапретаНоменклатуры.Номенклатура);
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьПараметрыЗапретаВыбораНоменклатуры()

// Процедура производит очистку номенклатуры с несоответствующим видом.
//
// Параметры:
//  Объект            - ДокументОбъект - Документ, который обрабатывается.
//  ИмяТабличнойЧасти - Строка         - Название табличной части для которой производится очистка.
//  СуффиксКолонок    - Строка         - Префикс колонки в которой содержится номенклатура.
//
Процедура УдалитьНесоответствующуюПоВидуНоменклатуру(Объект, ИмяТабличнойЧасти = "Товары", СуффиксКолонок = "")
	
	// Получим параметры текущего проверяемого объекта
	ВидыНоменклатуры = Справочники.ХозОперации.ПолучитьВидыНоменклатуры(Объект.ХозОперация);
	
	// Получаем таблицу с допустимыми видами номенклатуры в табличной части
	ТекстЗапроса =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Номенклатура.Ссылка КАК Номенклатура,
	|	Номенклатура.ВидНоменклатуры
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В(&СписокНоменклатуры)
	|	И НЕ Номенклатура.ВидНоменклатуры В (&ВидНоменклатуры)";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("СписокНоменклатуры", Объект[ИмяТабличнойЧасти].ВыгрузитьКолонку("Номенклатура"+СуффиксКолонок));
	Запрос.УстановитьПараметр("ВидНоменклатуры", ВидыНоменклатуры);
	ТаблицаНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	// Получим строки с недопустимым видом номенклатуры
	Для Каждого НеСоответствующийВидНоменклатуры Из ТаблицаНоменклатуры Цикл
		
		ПараметрыОтбора = Новый Структура;
		ПараметрыОтбора.Вставить("Номенклатура", НеСоответствующийВидНоменклатуры.Номенклатура); 
		МассивНесоответствующихСтрок = Объект[ИмяТабличнойЧасти].НайтиСтроки(ПараметрыОтбора);
		
		// Удалим строки с недопустимым видом номенклатуры
		Для каждого НеСоответствующаяСтрока Из МассивНесоответствующихСтрок Цикл
			Объект[ИмяТабличнойЧасти].Удалить(Объект[ИмяТабличнойЧасти].Индекс(НеСоответствующаяСтрока));
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // УдалитьНесоответствующуюПоВидуНоменклатуру()

// Процедура устанавливает ставку НДС в документе в зависимости от указанных ставок в таблицах документа основания
//
// Параметры:
//  Основание    - объект, на основании которого выполняется заполнение.
//  Объект       - заполняемый документ.
//  ИмяРеквизита - реквизит, в который будет помещено вычисленное значение ставки НДС. Значение по умолчанию - СтавкаНДС
Процедура УстановитьСтавкуНДС(Основание, Объект, СуммаОплаты = 0, ИмяРеквизитаСтавкаНДС = "СтавкаНДС", ИмяРеквизитаСуммаНДС = "СуммаНДС") Экспорт
	
	НоваяСтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();
	ФормироватьСтавкуНДС = ЕстьРеквизит(Объект, ИмяРеквизитаСтавкаНДС);
	ФормироватьСуммуНДС = (СуммаОплаты > 0) И ЕстьРеквизит(Объект, ИмяРеквизитаСуммаНДС);
	МетаданныеОснование = Основание.Метаданные();
	
	ЗапросСтавка = Новый Массив;
	ЗапросСумма  = Новый Массив;
	
	ШаблонЗапроса = "
				|	%1%2.%3
				|ИЗ
				|	Документ.%1.%2 КАК %1%2
				|ГДЕ
				|	%1%2.Ссылка = &Основание";
	
	ИмяДокумента = МетаданныеОснование.Имя;
	
	// Сформируем запрос для получения ставки НДС и суммы НДС из сделки
	Для Каждого ТабличнаяЧасть Из МетаданныеОснование.ТабличныеЧасти Цикл
		
		ИмяТабличнойЧасти = ТабличнаяЧасть.Имя;
		
		Если ФормироватьСтавкуНДС И ЕстьРеквизит(ТабличнаяЧасть, "СтавкаНДС")  Тогда
			ЗапросСтавка.Добавить(СтрШаблон(ШаблонЗапроса, ИмяДокумента, ИмяТабличнойЧасти,"СтавкаНДС"));
		КонецЕсли;
		
		Если ФормироватьСуммуНДС И ЕстьРеквизит(ТабличнаяЧасть, "СуммаНДС") Тогда
			ЗапросСумма.Добавить(СтрШаблон(ШаблонЗапроса, ИмяДокумента, ИмяТабличнойЧасти,"СуммаНДС"));
		КонецЕсли;
		
	КонецЦикла;
	
	ЕстьСтавкиНДС = (ЗапросСтавка.Количество() > 0);
	ЕстьСуммыНДС  = (ЗапросСумма.Количество() > 0);
	
	СтрокаСоединения = "
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ";
	
	НачалоЗапроса = "Выбрать РАЗРЕШЕННЫЕ ";
	
	СтрокаРазделения = "
		|;
		|////////////////
		|";
	
	Запрос = Новый Запрос;
	ТекстЗапроса = ?(ЕстьСтавкиНДС, НачалоЗапроса + СтрСоединить(ЗапросСтавка, СтрокаСоединения), "")
					+ ?(ЕстьСуммыНДС, ?(ЕстьСтавкиНДС, СтрокаРазделения, "") + НачалоЗапроса + СтрСоединить(ЗапросСумма, СтрокаСоединения), "");
	
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("Основание", Основание);
		
		ПакетЗапросов = Запрос.ВыполнитьПакет();
	КонецЕсли;
	
	Если ЕстьСтавкиНДС Тогда
		
		Выборка = ПакетЗапросов[0].Выбрать();
		Пока Выборка.Следующий() Цикл
			Если НоваяСтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка() Тогда
				НоваяСтавкаНДС = Выборка.СтавкаНДС;
			ИначеЕсли НЕ НоваяСтавкаНДС = Выборка.СтавкаНДС Тогда
				НоваяСтавкаНДС = Справочники.СтавкиНДС.ПустаяСсылка();  // В документе есть несколько значений ставки
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
	Если ФормироватьСтавкуНДС И Объект[ИмяРеквизитаСтавкаНДС] <> НоваяСтавкаНДС Тогда
		
		// Получим менеджер текущего объекта
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
		
		Объект[ИмяРеквизитаСтавкаНДС] = НоваяСтавкаНДС;
		МенеджерОбъекта.СтавкаНДСПриИзменении(Объект);
	КонецЕсли;
	
	Если ЕстьСуммыНДС И (НЕ ФормироватьСтавкуНДС ИЛИ ЗначениеЗаполнено(НоваяСтавкаНДС)) Тогда
		СуммаНДСДокумента = 0;
		НомерПакета = ?(ЕстьСтавкиНДС, 1, 0);
		Выборка = ПакетЗапросов[НомерПакета].Выбрать();
		
		Пока Выборка.Следующий() Цикл
			СуммаНДСДокумента = СуммаНДСДокумента + Выборка.СуммаНДС;
		КонецЦикла;
		
		ДанныеОснования = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Основание, "СуммаДокумента,ВалютаДокумента,КурсДокумента");
		СуммаСделки = ДанныеОснования.СуммаДокумента;
		
		// Перерасчитаем суммы
		Если НЕ ДанныеОснования.ВалютаДокумента=Объект.ВалютаДокумента Тогда
				СуммаОплатыДокумента = Окр(РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(
				СуммаОплаты,
				Объект.ВалютаДокумента,
				Объект.КурсДокумента,
				ДанныеОснования.ВалютаДокумента,
				ДанныеОснования.КурсДокумента), 2);
		Иначе
			СуммаОплатыДокумента = СуммаОплаты;
		КонецЕсли;
		
		// пропорционально установим сумму НДС
		Если СуммаСделки > СуммаОплатыДокумента Тогда
			СуммаНДСДокумента = Окр((СуммаОплатыДокумента * СуммаНДСДокумента) / СуммаСделки, 2);
		КонецЕсли;
		
		Объект[ИмяРеквизитаСуммаНДС] = РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(
			СуммаНДСДокумента,
			ДанныеОснования.ВалютаДокумента,
			ДанныеОснования.КурсДокумента,
			Объект.ВалютаДокумента,
			Объект.КурсДокумента);
		
	ИначеЕсли ЕстьСуммыНДС Тогда
		Объект[ИмяРеквизитаСуммаНДС] = 0;
	КонецЕсли;
	
КонецПроцедуры

// Процедура проверяет возможность редактирования документа при наличии подчиненных.
//
// Параметры:
//  Объект - ДокументСсылка - Объект, для которого выполняется обработка события.
//  ПроверкаИзмененияПриНаличииПодчиненных - Булево - Признак необходимости проверки.
//  Отказ  - Булево - Признак отказа от совершения операции.
//
Процедура ПроверитьРедактированиеДокументаПриНаличииПодчиненных(Объект, Отказ) Экспорт
	
	// Проверим на наличие подчиненных документов
	Если ЗначениеЗаполнено(Объект.Ссылка)
		И НЕ ПравоПользователя("РедактированиеДокументовПриНаличииПодчиненных") Тогда
		
		ПредставлениеСписка = "";
		Для Каждого ПодчиненныйСсылка Из КритерииОтбора.ПодчиненныеДокументы.Найти(Объект.Ссылка) Цикл
			
			Если ПравоПользователя("РедактированиеДокументовПриНаличииПодчиненных", ПодчиненныйСсылка) Тогда
				ПредставлениеСписка = ПредставлениеСписка + Символы.ПС + "- " + ПодчиненныйСсылка;
			КонецЕсли;
			
		КонецЦикла;
		
		Если НЕ ПустаяСтрока(ПредставлениеСписка) Тогда
			ВывестиСообщение(НСтр("ru='Недостаточно прав для изменения документа, на основании которого уже были сформированы подчиненные операции:%1'"), Объект,,, Отказ, Символы.ПС + ПредставлениеСписка);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьРедактированиеДокументаПриНаличииПодчиненных()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ОБЪЕКТА

// Общий обработчик события заполнения объекта при вводе на основании существующего.
//
// Параметры:
//  Объект               - ДокументОбъект- Объект, для которого выполняется обработка события.
//  ДанныеЗаполнения     - Произвольный  - Значение, которое используется как основание для заполнения.
//  СтандартнаяОбработка - Булево        - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполненияНаОсновании(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ИменаИсключаемыхРеквизитов="") Экспорт
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ЗащищенныеФункцииСервер.ОбработкаЗаполненияНаОсновании(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ИменаИсключаемыхРеквизитов,"ОбработкаСобытийДокументаСервер");
	
КонецФункции // ОбработкаЗаполненияНаОсновании()

// Общий обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  Объект               - ДокументОбъект- Объект, для которого выполняется обработка события.
//  ДанныеЗаполнения     - Произвольный  - Значение, которое используется как основание для заполнения.
//  ТекстЗаполнения      - Строка        - Текст, используемый для формирования наименования/кода нового элемента.
//  СтандартнаяОбработка - Булево        - В данный параметр передается признак выполнения системной обработки события.
//
Функция ОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ИменаИсключаемыхРеквизитов="") Экспорт
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ЗащищенныеФункцииСервер.ОбработкаЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка, ИменаИсключаемыхРеквизитов,"ОбработкаСобытийДокументаСервер");
	
КонецФункции // ОбработкаЗаполнения()

// Общий обработчик события вызываемый по подписке после заполнения объекта как при создании нового,
// так и при вводе на основании существующего.
//
// Параметры
//  Объект               - ДокументОбъект - Объект, для которого выполняется обработка события.
//  ДанныеЗаполнения     - ДокументСсылка - Содержит ссылку на передаваемый объект метаданных.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ПослеЗаполнения(Объект, ДанныеЗаполнения, ТекстЗаполнения="", СтандартнаяОбработка=Истина) Экспорт
	
	// Проверим на отказ от выполнения стандартной обработки события
	Если НЕ СтандартнаяОбработка Тогда
		Возврат;
	КонецЕсли;
	
	// Получим менеджер текущего объекта
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	Если Объект.ДополнительныеСвойства <> Неопределено И Объект.ДополнительныеСвойства.Свойство("ПараметрыДействия") И Объект.ДополнительныеСвойства.ПараметрыДействия.Количество() <> 0 Тогда
		// Производим пересчет суммовых показателей объекта
		МенеджерОбъекта.ОбработкаПересчетаПоказателейОбъекта(Объект, Объект.ДополнительныеСвойства.ПараметрыДействия);
	КонецЕсли;
	
	// Производим расчет и заполнение итоговых показателей документа
	Попытка
		ИтогиОперации = МенеджерОбъекта.РассчитатьИтогиОперации(Объект);
		ЗаполнитьЗначенияСвойств(Объект, ИтогиОперации);
	Исключение
		// Метод у объекта не существует
		ПричинаОшибки = ИнформацияОбОшибке();
	КонецПопытки;
	
КонецПроцедуры // ПослеЗаполнения()

// Общий обработчик события заполнения объекта как при создании нового, так и при вводе на основании существующего.
//
// Параметры:
//  Объект            - ДокументОбъект - Объект, для которого выполняется обработка события.
//  ОбъектКопирования - ДокументОбъект - Исходный объект, который является источником копирования.
//
Функция ПриКопировании(Объект, ОбъектКопирования) Экспорт
	
	// Инициализируем реквизиты, зависящие от текущего контекста ввода
	Если ЕстьРеквизит(Объект, "ДатаСоздания") Тогда
		Объект.ДатаСоздания = Дата("00010101");
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "ДатаОперации") Тогда
		Объект.ДатаОперации = Дата("00010101");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "Автор") Тогда
		Объект.Автор = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
	// Производим корректировку копируемых реквизитов
	Если ЕстьРеквизит(Объект, "ХозОперация") И (НЕ Справочники.ХозОперации.ПолучитьСоответствиеХозОперацииОбъекта(Объект)) Тогда
		Объект.ХозОперация = Справочники.ХозОперации.ПолучитьХозОперациюПоУмолчанию(Объект);
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "ДокументОснование") Тогда
		Объект.ДокументОснование = Неопределено;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "Комментарий") Тогда
		Объект.Комментарий = "";
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "СтатусУтверждения") Тогда
		Объект.СтатусУтверждения = Неопределено;
	КонецЕсли;
	
	// Производим заполнение связанных реквизитов
	Если ЕстьРеквизит(Объект, "Менеджер") И НЕ ЗначениеЗаполнено(Объект.Менеджер) Тогда
		Объект.Менеджер = Объект.Автор.Сотрудник;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "КурсДокумента") И ЕстьРеквизит(Объект, "ВалютаДокумента") Тогда
		Объект.КурсДокумента = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "КурсВалютыУпр") Тогда
		Объект.КурсВалютыУпр = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчетаКомпании.Получить(), Объект.Дата);
	КонецЕсли;
	Если ЕстьРеквизит(Объект,"КурсВалютыВзаиморасчетов") Тогда
		Объект.КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалютыВзаиморасчетов(Объект);
	КонецЕсли;
	
	// Значения фискальных реквизитов не могут копироваться
	Если ЕстьРеквизит(Объект, "НомерЧека") Тогда
		Объект.НомерЧека      = 0;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "ДатаФР") Тогда
		Объект.ДатаФР         = '00010101';
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "НомерСмены") Тогда
		Объект.НомерСмены     = 0;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "НомерДокумента") Тогда
		Объект.НомерДокумента = 0;
	КонецЕсли;
	
	// Если есть реквизит договор, запустим обработчик "При изменении"
	Если ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") Тогда
		ОбработкаРеквизитовДокументаСервер.ДоговорВзаиморасчетовПриИзменении(Объект);
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ПриКопировании()

// Общий обработчик события возникающего при необходимости проверки заполнения реквизитов при записи объекта.
//
// Параметры:
//  Объект               - ДокументОбъект - Объект, для которого выполняется обработка события.
//  Отказ                - Булево         - Признак отказа от продолжения работы после выполнения проверки заполнения.
//  ПроверяемыеРеквизиты - Массив         - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//  КонтрольЗаполненияХарактеристик - Булево - Позволяет отключить проверку заполнения характеристик для текущего
//                                             объекта. Если установлено в ИСТИНА, то проверка производиться не
//                                             зависимо от установленного режима автоматического списания.
//
Функция ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты) Экспорт
	
	// Получим признак обработки события в упрощенном режиме, когда проверка корректности не производиться.
	Если ОбработкаСобытийОбъектаСервер.РежимУпрощеннойЗагрузкиОбъекта(Объект) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// В некоторых случаях контроль корректности заполнения объекта может быть отключен.
	Если НЕ ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаЗаполнения", ИСТИНА) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Прекращаем обработку если пользователь работает в "супер" режиме
	Если НЕ ПравоПользователя("ПроверкаЗаполненияСправочниковИДокументов", Объект) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Выполняем общую проверку корректности заполнения реквизитов объекта
	ОбработкаСобытийОбъектаСервер.ПроверитьЗаполнениеРеквизитовОбъекта(Объект, Отказ, ПроверяемыеРеквизиты);
	
	// Выполняем общую проверку соответствия установленным в конфигураторе параметрам выбора.
	ОбработкаСобытийОбъектаСервер.ПроверитьПараметрыВыбораРеквизитовОбъекта(Объект, Отказ);
	
	// Проверяем заполненность поля "Характеристика" в соответствии с правилами ведения учета.
	ПроверитьЗаполнениеХарактеристикиНоменклатуры(Объект, Отказ);
	
	// Проверим корректность заполнения количества для серийного товара
	ОбработкаСобытийОбъектаСервер.ПроверитьКоличествоСерийнойНоменклатуры(Объект, Отказ);
	
	// Проверим соответствие вида номенклатуры выбранной ХозОперации
	Если  НЕ ТипЗнч(Объект) = Тип("ДокументОбъект.ОтчетПроизводстваЗаСмену") И 
		  НЕ ТипЗнч(Объект) = Тип("ДокументОбъект.итЗаявкаНаВозврат")	Тогда //Мистер костыль
		ПроверитьСоответствиеВидаНоменклатурыХозОперации(Объект,Отказ);
	КонецЕсли;
	
	// Проверим параметры запрета для номенклатуры
	ПроверитьПараметрыЗапретаВыбораНоменклатуры(Объект,Отказ);
	
	// Если в строке табличной части указана ГТД, то при этом необходимо чтобы Партия также была указана.
	ПроверитьЗаполнениеПартииПоГТД(Объект, Отказ);
	
	// Проверим реквизиты объекта "Подразделение компании" и "Организация" на соответствие.
	ОбработкаСобытийОбъектаСервер.ПроверитьСоответствиеОрганизацииПодразделения(Объект, Отказ);
	
	// Выполняем проверку корректности заполнения по организации и подразделению
	ПроверитьЗаполнениеРеквизитовПоОрганизации(Объект, Отказ);
	
	// Выполняем проверку корректности заполнения подразделения
	ПроверитьЗаполнениеПодразделенияКомпании(Объект, Отказ);
	
	// Проверяем соответствие выполняемой операции параметрам, указанным в договоре.
	ПроверитьПараметрыОперацииНаСоответствиеДоговору(Объект, Отказ);
	
	// Необходимо проверить уникальность задания номеров
	ПроверитьУникальностьНомеровВходящихДокументов(Объект, Отказ);
	
	// Проверим соответствие валют в документе
	ПроверитьСоответствиеВалют(Объект, Отказ);
	
	// !!!_Переход на ставку НДС 20%
	// Удалить после перехода
	РаботаСоСтавкамиНДСВызовСервера.ПроверкаКорректностиВводаСтавкиНДС(Объект, Отказ);
	
	ДополнительныеОтчетыИОбработки.ОбработкаПроверкиЗаполнения(Объект, Отказ, ПроверяемыеРеквизиты);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаПроверкиЗаполнения()

// Общий обработчик события возникающего после начала транзакции записи, но до начала записи объекта.
//
// Параметры:
//  Объект          - ДокументОбъект           - Объект, для которого выполняется обработка события.
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимЗаписи     - РежимЗаписиДокумента     - Текущий режим записи документа.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Функция ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	// Получим признак обработки события в упрощенном режиме, когда проверка корректности не производиться.
	Если ОбработкаСобытийОбъектаСервер.РежимУпрощеннойЗагрузкиОбъекта(Объект) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Проверим нужно ли сдвигать дату при проведении
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение И РежимПроведения = РежимПроведенияДокумента.Оперативный Тогда
		РежимИспользования = Константы.ИспользованиеОперативногоПроведенияДокументов.Получить();
		Если (РежимИспользования = Перечисления.ИспользованиеОперативногоПроведенияДокументов.ОперативноеПроведениеДляНовыхИНепроведенных И Объект.Проведен) 
				ИЛИ (РежимИспользования = Перечисления.ИспользованиеОперативногоПроведенияДокументов.ОперативноеПроведениеТолькоДляНовых И ЗначениеЗаполнено(Объект.Ссылка)) Тогда
			РежимПроведения = РежимПроведенияДокумента.Неоперативный;
		КонецЕсли;
	КонецЕсли;
	
	// Запомним в каком режиме осуществляется операция записи документа
	Объект.ДополнительныеСвойства.Вставить("РежимЗаписи",     РежимЗаписи);
	Объект.ДополнительныеСвойства.Вставить("РежимПроведения", РежимПроведения);
	
	// Выполним проверку документа на корректность заполнения
	ПроверитьЗаполнениеОбъектаПередЗаписью(Объект, Отказ, РежимЗаписи);
	
	// Произведем проверку возможности записи/модификации объекта в текущих условиях
	ПроверитьВозможностьИзмененияОбъекта(Объект,Отказ,РежимЗаписи,РежимПроведения);
	
	// Дальнейшие операции будем выполнять только в случае успешного выполнения предшествующих.
	Если Отказ Тогда
		Возврат ИСТИНА;
	КонецЕсли;
	
	// Получим параметры текущего проверяемого объекта
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка));
	МенеджерОбъекта  = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	// Флаг используется для регистрации извещений менеджеров о событии резервирования по заказу.
	Если ПолучитьФункциональнуюОпцию("ИспользоватьЗначимыеСобытия") И РежимЗаписи=РежимЗаписиДокумента.Проведение И (ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.КорректировкаЗаказаПокупателя") ИЛИ ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.ПеремещениеТоваров") ИЛИ ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.ПоступлениеТоваров") ИЛИ ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.РезервированиеЗаказовПокупателя")) Тогда
		Объект.Движения.ЗаказыПокупателей.ИнтерактивноеПроведение = (НЕ Объект.Проведен);
	КонецЕсли;
	
	Попытка
		// Заполним итоговую сумму
		ИтогиОперации = МенеджерОбъекта.РассчитатьИтогиОперации(Объект);
		ЗаполнитьЗначенияСвойств(Объект, ИтогиОперации);
	Исключение
		// Метод у объекта не существует
		ПричинаОшибки = ИнформацияОбОшибке();
	КонецПопытки;
	
	// Установим дату создания документа
	Если Объект.ЭтоНовый() И ЕстьРеквизит(Объект, "ДатаСоздания") Тогда
		Объект.ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Установим дату операции
	Если ЕстьРеквизит(Объект, "ДатаОперации") Тогда
		Если РежимЗаписи=РежимЗаписиДокумента.Проведение Тогда
			Объект.ДатаОперации = ТекущаяДатаСеанса();
			
		ИначеЕсли Объект.Проведен И РежимЗаписи=РежимЗаписиДокумента.Запись Тогда
			// Оставляем как есть
		ИначеЕсли ОбъектМетаданных.Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить Тогда
			Объект.ДатаОперации = ТекущаяДатаСеанса();
		Иначе
			Объект.ДатаОперации = Дата("00010101");
		КонецЕсли;
	КонецЕсли;
	
	Объект.ДополнительныеСвойства.Вставить("ЭтоНовый", ?(Объект.ЭтоНовый(), ИСТИНА, ЛОЖЬ));

	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ПередЗаписью()

// Общий обработчик события возникающего после записи объекта в базу данных, но до окончания транзакции записи.
//
// Параметры:
//  Объект - ДокументОбъект - Объект, для которого выполняется обработка события.
//  Отказ  - Булево - Признак отказа от совершения операции.
//
Функция ПриЗаписи(Объект, Отказ) Экспорт
	
	// Получим признак обработки события в упрощенном режиме, когда проверка корректности не производиться.
	Если ОбработкаСобытийОбъектаСервер.РежимУпрощеннойЗагрузкиОбъекта(Объект) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Проверка разрешения на проведение документа при использовании утверждения документов.
	Если УтверждениеДокументовСервер.ИспользоватьУтверждениеДокументов() Тогда
		УтверждениеДокументовСервер.ОбработкаУтвержденияПриЗаписи(Объект, Отказ);
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ПриЗаписи()

// Общий обработчик события возникающего в транзакции удаления перед непосредственным удалением объекта из базы данных.
//
// Параметры:
//  Объект - ДокументОбъект - Объект, для которого выполняется обработка события.
//  Отказ  - Булево         - Признак отказа от совершения операции.
//
Функция ПередУдалением(Объект, Отказ) Экспорт
	
	// Получим признак обработки события в упрощенном режиме, когда проверка корректности не производится.
	Если ОбработкаСобытийОбъектаСервер.РежимУпрощеннойЗагрузкиОбъекта(Объект) Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	// Вызываем обработчик из подсистемы БСП
	ДатыЗапретаИзмененияСлужебный.ПроверитьДатыЗапретаИзмененияЗагрузкиДанных(Объект, Отказ,,, ИСТИНА);
	
	РаботаСГраницами.ПередУдалением(Объект, Отказ);
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ПередУдалением()

// Общий обработчик события возникающего в транзакции записи для формирования движений по подчиненным регистрам.
//
// Параметры:
//  Объект          - ДокументОбъект           - Объект, для которого выполняется обработка события.
//  Отказ           - Булево                   - Признак отказа от совершения операции.
//  РежимПроведения - РежимПроведенияДокумента - Текущий режим проведения.
//
Функция ОбработкаПроведения(Объект, Отказ, РежимПроведения, УдалитьДвижения=ИСТИНА) Экспорт
	
	// Производим очистку регистров, по которым ранее были совершены движения
	Если Объект.Метаданные().УдалениеДвижений=Метаданные.СвойстваОбъектов.УдалениеДвижений.НеУдалятьАвтоматически И УдалитьДвижения Тогда
		УдалениеДвиженийДокумента(Объект, Ложь);
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаПроведения()

// Общий обработчик события возникающего при отмене проведения документа. Выполняется в транзакции записи.
//
// Параметры:
//  Объект - ДокументОбъект - Объект, для которого выполняется обработка события.
//  Отказ  - Булево         - Признак отказа от совершения операции.
//
Функция ОбработкаУдаленияПроведения(Объект, Отказ) Экспорт
	
	// Получим признак удаления документа в процессе проведения, при этом движения должны быть удалены в любом случае.
	ЭтоУдалениеОбъекта = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "УдалениеОбъекта", ЛОЖЬ);
	
	// Получим признак обработки события в упрощенном режиме, когда проверка корректности не производится.
	Если ОбработкаСобытийОбъектаСервер.РежимУпрощеннойЗагрузкиОбъекта(Объект) И НЕ ЭтоУдалениеОбъекта Тогда
		Возврат ЛОЖЬ;
	КонецЕсли;
	
	РаботаСГраницами.ОбработкаУдаленияПроведения(Объект, Отказ);
	
	// Производим чистку только тех регистров, по которым были совершены ранее движения.
	Если Объект.Метаданные().УдалениеДвижений = Метаданные.СвойстваОбъектов.УдалениеДвижений.НеУдалятьАвтоматически Тогда
		
		УдалениеДвиженийДокумента(Объект, Истина);
		
	КонецЕсли;
	
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ОбработкаУдаленияПроведения()

//событие возникающее при проведении документа ввода в ассортимент
Процедура СобытиеОбработкаПроведенияДокумента(Источник, Отказ, РежимПроведения) Экспорт
	
	Если Источник.ХозОперация=Справочники.ХозОперации.ВводТоваровВАссортимент Тогда
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ Номенклатура
		|ИЗ	Документ."+Источник.Метаданные().Имя+".Товары
		|ГДЕ Ссылка.Проведен И Номенклатура.ДатаПервогоВводаВАссортимент=ДАТАВРЕМЯ(1,1,1)");
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			обНоменклатура = Выборка.Номенклатура.ПолучитьОбъект();
			обНоменклатура.ДатаПервогоВводаВАссортимент = Источник.ДатаВводаВАссортимент;
			Попытка
				обНоменклатура.ОбменДанными.Загрузка = Истина;
				обНоменклатура.Записать();
			Исключение КонецПопытки;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //СобытиеОбработкаПроведенияДокумента()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ОБЪЕКТА

Функция ЗаполнитьОбъектПоУмолчанию(Объект, ТекстЗаполнения, ПараметрыДействия, ИменаИсключаемыхРеквизитов="") Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Произведем инициализацию реквизитов, которые устанавливаются один раз при создании объекта.
	Если Объект.ЭтоНовый() Тогда
		
		// Инициализируем реквизиты, зависящие от текущего контекста ввода
		Если ЕстьРеквизит(Объект, "ДатаСоздания") Тогда
			Объект.ДатаСоздания = Дата("00010101");
		КонецЕсли;
		Если ЕстьРеквизит(Объект, "ДатаОперации") Тогда
			Объект.ДатаОперации = Дата("00010101");
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.Дата) Тогда
			Объект.Дата = ТекущаяДатаСеанса();
		КонецЕсли;
		Если ЕстьРеквизит(Объект, "Автор") И (НЕ ЗначениеЗаполнено(Объект.Автор)) Тогда
			Объект.Автор = Пользователи.ТекущийПользователь();
		КонецЕсли;
		Если ЕстьРеквизит(Объект, "РегламентированныйУчет") Тогда
			ТипОтношения = ПравоПользователя("ЗначениеРегламентированногоУчета", Объект);
			Объект.РегламентированныйУчет = ТипОтношения;
		КонецЕсли;
		
	КонецЕсли;
	
	// Получим менеджер текущего объекта
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	// Производим инициализацию реквизитов, которые имеют сложную логику начального заполнения.
	Если ЕстьРеквизит(Объект, "ХозОперация") И (НЕ ЗначениеЗаполнено(Объект.ХозОперация) ИЛИ НЕ Справочники.ХозОперации.ПолучитьСоответствиеХозОперацииОбъекта(Объект)) Тогда
		Объект.ХозОперация = Справочники.ХозОперации.ПолучитьХозОперациюПоУмолчанию(Объект);
	КонецЕсли;
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ОчищатьНеСоответствующийВидНоменклатуры", Истина) И ЕстьРеквизит(Объект, "ХозОперация") И ЕстьРеквизит(Объект,"Номенклатура","Товары") Тогда
		УдалитьНесоответствующуюПоВидуНоменклатуру(Объект);
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "ПодразделениеКомпании") И (НЕ ЗначениеЗаполнено(Объект.ПодразделениеКомпании)) Тогда
		Объект.ПодразделениеКомпании = ПараметрыСеанса.ПодразделениеКомпании;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "Организация") И (НЕ ЗначениеЗаполнено(Объект.Организация)) Тогда
		Объект.Организация = ПараметрыСеанса.Организация;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "Менеджер") И (НЕ ЗначениеЗаполнено(Объект.Менеджер)) Тогда
		Объект.Менеджер = Объект.Автор.Сотрудник;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "СкладКомпании") И (НЕ ЗначениеЗаполнено(Объект.СкладКомпании)) Тогда
		Объект.СкладКомпании = ПравоПользователя("ОсновнойСкладКомпании", Объект);
		
		// Проверим соответствие организации и склада
		Если ЕстьРеквизит(Объект, "Организация") И (Объект.СкладКомпании.Организация <> Объект.Организация) Тогда
			Объект.СкладКомпании = Справочники.СкладыКомпании.ПустаяСсылка();
		КонецЕсли;
		
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "КассаКомпании") И (НЕ ЗначениеЗаполнено(Объект.КассаКомпании)) Тогда
		Объект.КассаКомпании = ПравоПользователя("ОсновнаяКассаКомпании", Объект);
		МенеджерОбъекта.КассаКомпанииПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "СтруктурнаяЕдиница") И (НЕ ЗначениеЗаполнено(Объект.СтруктурнаяЕдиница)) Тогда
		Объект.СтруктурнаяЕдиница = ПравоПользователя("ОсновнаяКассаКомпании", Объект);
		ПараметрыДействия.Вставить("КассаКомпании", Объект.СтруктурнаяЕдиница);
		МенеджерОбъекта.КассаКомпанииПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "КассаККМ") И (НЕ ЗначениеЗаполнено(Объект.КассаККМ)) И (НЕ ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.ПриходныйКассовыйОрдер")) И (НЕ ТипЗнч(Объект.Ссылка)=Тип("ДокументСсылка.РасходныйКассовыйОрдер")) Тогда
		Объект.КассаККМ = Справочники.КассыККМ.ПолучитьОсновнуюКассуККМ();
		МенеджерОбъекта.КассаККМПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "ВалютаДокумента") И (НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента)) Тогда
		Если ЕстьРеквизит(Объект, "КассаККМ") И ЗначениеЗаполнено(Объект.КассаККМ) Тогда
			Объект.ВалютаДокумента = Объект.КассаККМ.ВалютаДенежныхСредств;
		ИначеЕсли ЕстьРеквизит(Объект, "КассаКомпании") И ЗначениеЗаполнено(Объект.КассаКомпании) И НЕ Объект.КассаКомпании.МноговалютнаяКасса Тогда
			Объект.ВалютаДокумента = Объект.КассаКомпании.ВалютаДенежныхСредств;
		ИначеЕсли ЗначениеЗаполнено(Объект.ПодразделениеКомпании) И ЗначениеЗаполнено(Объект.ПодразделениеКомпании.Валюта) Тогда
			Объект.ВалютаДокумента = Объект.ПодразделениеКомпании.Валюта;
		Иначе
			Объект.ВалютаДокумента = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
		КонецЕсли;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "ВалютаДокумента") И ЕстьРеквизит(Объект, "КурсДокумента") Тогда
		Объект.КурсДокумента = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.Дата);
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "КурсВалютыУпр") Тогда
		Объект.КурсВалютыУпр = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчетаКомпании.Получить(), Объект.Дата);
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "ТипЦен") Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ТипЦен) И ЕстьРеквизит(Объект, "СкладКомпании") И ТипЗнч(Объект.СкладКомпании)=Тип("СправочникСсылка.СкладыКомпании") И Объект.СкладКомпании.Розничный И ЕстьРеквизит(Объект, "ХозОперация") И Объект.ХозОперация.ВидОперации=Перечисления.ВидыОперацийДоговора.Продажа Тогда
			Объект.ТипЦен = Объект.СкладКомпании.ТипЦенРозничнойТорговли;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.ТипЦен) Тогда
			Объект.ТипЦен = Справочники.ХозОперации.ПолучитьОсновнойТипЦен(Объект.ХозОперация);
		КонецЕсли;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "Контрагент") И НЕ ЗначениеЗаполнено(Объект.Контрагент) И СтрНайти(ИменаИсключаемыхРеквизитов, "Контрагент")=0 Тогда
		Объект.Контрагент = Справочники.ХозОперации.ПолучитьОсновногоКонтрагента(Объект.ХозОперация);
		МенеджерОбъекта.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") И (НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов)) И ЗначениеЗаполнено(Объект.Контрагент) И ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
		ВидДоговора = Неопределено;
		Если ЕстьРеквизит(Объект, "ХозОперация") И ЗначениеЗаполнено(Объект.ХозОперация) Тогда
			ВидДоговора = Справочники.ХозОперации.ПолучитьВидДоговора(Объект.ХозОперация);
		КонецЕсли;
		Объект.ДоговорВзаиморасчетов = ОбработкаРеквизитовДокументаСервер.ПолучитьДоговорВзаиморасчетов(Объект.Контрагент,ВидДоговора,Объект);
		ПараметрыДействия.Вставить("НеПерезаполнятьПоДоговоруВзаиморасчетов", ИСТИНА);
		МенеджерОбъекта.ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
	ИначеЕсли ЕстьРеквизит(Объект, "АвтоЗакрытиеСделок") И ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") И ЕстьРеквизит(Объект, "ДокументОснование") И НЕ ЕстьРеквизит(Объект.ДокументОснование, "АвтоЗакрытиеСделок") Тогда
		Объект.АвтоЗакрытиеСделок = Объект.ДоговорВзаиморасчетов.АвтоЗакрытиеСделок;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "КурсВалютыВзаиморасчетов") Тогда
		Объект.КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалютыВзаиморасчетов(Объект,?(ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов"),Объект.ДоговорВзаиморасчетов,Неопределено));
	КонецЕсли;
	Если ЕстьРеквизит(Объект,"ДоговорВзаиморасчетов") И Объект.ДоговорВзаиморасчетов.СохранятьКурсСделки И ЕстьРеквизит(Объект,"ДокументОснование") И ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
		Если ЕстьРеквизит(Объект, "КурсВалютыВзаиморасчетов") И ЕстьРеквизит(Объект.ДокументОснование,"КурсВалютыВзаиморасчетов") Тогда
			Если ЗначениеЗаполнено(Объект.ДокументОснование.КурсВалютыВзаиморасчетов)
				И ЕстьРеквизит(Объект.ДокументОснование,"ДоговорВзаиморасчетов") И Объект.ДокументОснование.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов=Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов Тогда
				Объект.КурсВалютыВзаиморасчетов = Объект.ДокументОснование.КурсВалютыВзаиморасчетов;
			Иначе //если не удалось получить курс из основания, получим на дату основания
				Объект.КурсВалютыВзаиморасчетов = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалюты(Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, Объект.ДокументОснование.Дата);
			КонецЕсли;
		КонецЕсли;
		Если ЕстьРеквизит(Объект,"КурсДокумента") И ЕстьРеквизит(Объект.ДокументОснование,"КурсДокумента") И ЕстьРеквизит(Объект,"ВалютаДокумента") Тогда
			Если ЗначениеЗаполнено(Объект.ДокументОснование.КурсДокумента) И ЕстьРеквизит(Объект.ДокументОснование,"ВалютаДокумента") И Объект.ДокументОснование.ВалютаДокумента=Объект.ВалютаДокумента Тогда
				Объект.КурсДокумента = Объект.ДокументОснование.КурсДокумента;
			Иначе //если не удалось получить курс из основания, получим на дату основания
				Объект.КурсДокумента = РаботаСКурсамиВалютПлатформа.ПолучитьКурсВалюты(Объект.ВалютаДокумента, Объект.ДокументОснование.Дата);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	Если ЕстьРеквизит(Объект, "Проект") Тогда
		Если ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") И ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов.ОсновнойПроект) Тогда
			Если ЗначениеЗаполнено(Объект.Проект) И (НЕ Объект.Проект=Объект.ДоговорВзаиморасчетов.ОсновнойПроект) Тогда
				
				КонтролироватьСоответствиеПроектов = ПравоПользователя("КонтролироватьСоответствиеПроектов", Объект);
				
				Если НЕ КонтролироватьСоответствиеПроектов=Перечисления.ВидыКонтроля.НеКонтролировать Тогда
					ВывестиСообщение(НСтр("ru='Проект %1 договора %2 отличается от проекта %3 документа'"), Объект, "Проект",,, Объект.ДоговорВзаиморасчетов.ОсновнойПроект, Объект.ДоговорВзаиморасчетов, Объект.Проект);
				КонецЕсли;
				
				Если КонтролироватьСоответствиеПроектов = Перечисления.ВидыКонтроля.Запрещать Тогда
					Объект.Проект = Объект.ДоговорВзаиморасчетов.ОсновнойПроект;
				КонецЕсли;
				
			ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
				Объект.Проект = Объект.ДоговорВзаиморасчетов.ОсновнойПроект;
			КонецЕсли;
		ИначеЕсли НЕ ЗначениеЗаполнено(Объект.Проект) Тогда
			Если ЕстьРеквизит(Объект, "ПодразделениеКомпании") Тогда
				Объект.Проект = Объект.ПодразделениеКомпании.ОсновнойПроект;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Если ЕстьРеквизит(Объект, "СтавкаНДС") Тогда
		Если Объект.ХозОперация.ВидОперации=Перечисления.ВидыОперацийДоговора.Покупка Тогда
			ОсвобожденОтНДС = ЕстьРеквизит(Объект,"Контрагент") И (Объект.Контрагент.ОсвобожденОтНДС ИЛИ Объект.Контрагент.ФормаСобственности=Перечисления.ФормыСобственности.ЧастноеЛицо);
		Иначе
			ОсвобожденОтНДС = ОсвобожденОтУплатыНДС(Объект.Организация, Объект.ПодразделениеКомпании, Объект.Дата);
		КонецЕсли;
		Объект.СтавкаНДС = ?(ОсвобожденОтНДС, Справочники.СтавкиНДС.БезНДС, Справочники.СтавкиНДС.ОсновнаяСтавкаНДС);
		МенеджерОбъекта.СтавкаНДСПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
	// + Конов
	ит_СпециальныйМодульСервер.ЗаполнитьОбъектПоУмолчанию(Объект);
	// + Конов
	// Возвращаем признак возможности дальнейшей обработки события
	Возврат ИСТИНА;
	
КонецФункции // ЗаполнитьОбъектПоУмолчанию()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ПРОВЕРКИ КОРРЕКТНОСТИ ЗАПОЛНЕНИЯ

// Производит проверку возможности записи или модификации объекта в целом в текущих условиях.
//
Функция ПроверитьВозможностьИзмененияОбъекта(Объект, Отказ, РежимЗаписи, РежимПроведения = Неопределено) Экспорт
	
	// Получим текущие значения флагов управляющих проверками возможности записи или модификации объекта.
	ПроверкаДатыЗапретаИзменения               = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаДатыЗапретаИзменения",               ИСТИНА);
	ПроверкаИсторическогоПорядкаОпераций       = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаИсторическогоПорядкаОпераций",       ИСТИНА);
	ПроверкаИзмененияОбъектовПараметровУчета   = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаИзмененияОбъектовПараметровУчета",   ИСТИНА);
	ПроверкаИзмененияПометкиУдаления           = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаИзмененияПометкиУдаления",           ИСТИНА);
	ПроверкаИзмененияПроведенных               = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаИзмененияПроведенных",               ИСТИНА);
	ПроверкаИзмененияПриНаличииПодчиненных     = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаИзмененияПриНаличииПодчиненных",     ИСТИНА);
	ПроверкаПроведенияЗаднимЧислом             = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаПроведенияЗаднимЧислом",             ИСТИНА);
	ПроверкаВводаДокументовПоКураторам         = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаВводаДокументовПоКураторам",         ИСТИНА);
	ПроверкаИспользованияУтвержденияДокументов = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаИспользованияУтвержденияДокументов", ИСТИНА);
	ПроверкаИзмененияДокументовДругогоАвтора   = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаИзмененияДокументовДругогоАвтора",   ИСТИНА);
	ПроверкаИзмененияМенеджерамиПортфеля       = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаИзмененияМенеджерамиПортфеля",       ИСТИНА);		
	
	// Контроль возможности изменения состояния пометки удаления объекта
	Если ПроверкаИзмененияПометкиУдаления И НЕ Объект.ЭтоНовый() И Объект.Модифицированность() И НЕ РольПользователя("УправлениеПометкойУдаленияОбъектов") И Объект.ПометкаУдаления<>Объект.Ссылка.ПометкаУдаления Тогда
		Если Объект.ПометкаУдаления Тогда
			ВывестиСообщение(НСтр("ru='Недостаточно прав для установки пометки удаления документа ""%1""'"), Объект,,, Отказ, Объект);
		Иначе
			ВывестиСообщение(НСтр("ru='Недостаточно прав для снятия пометки удаления документа ""%1""'"), Объект,,, Отказ, Объект);
		КонецЕсли;
	КонецЕсли;
	
	// Проверим объект на использование его в константах
	Если ПроверкаИзмененияОбъектовПараметровУчета И НЕ Объект.ЭтоНовый() И Объект.Модифицированность() И НЕ ПравоПользователя("РедактированиеОбъектовЗначенийКонстант", Объект) Тогда
		ИмяКонстанты = "";
		Если ОбработкаСобытийОбъектаСервер.ПроверитьИспользованиеСсылкиВКонстантах(Объект.Ссылка, ИмяКонстанты) Тогда
			ВывестиСообщение(НСтр("ru='Недостаточно прав для изменения документа указанного в значении параметра учета ""%1""'"), Объект,,, Отказ, ИмяКонстанты);
		КонецЕсли;
	КонецЕсли;
	
	// Проверка на допустимость редактирования по датам разрешенного интервала редактирования.
	Если ПроверкаДатыЗапретаИзменения Тогда
		
		// Вызываем обработчик из подсистемы БСП
		ДатыЗапретаИзмененияСлужебный.ПроверитьДатыЗапретаИзмененияЗагрузкиДанных(Объект, Отказ);
				
	КонецЕсли;
	
	// Проверим соблюдение исторического порядка ввода операций
	Если ПроверкаИсторическогоПорядкаОпераций И ЕстьРеквизит(Объект, "ДокументОснование") И ЗначениеЗаполнено(Объект.ДокументОснование) И РежимЗаписи=РежимЗаписиДокумента.Проведение И НЕ РежимПроведения=РежимПроведенияДокумента.Оперативный И Объект.Дата < Объект.ДокументОснование.Дата Тогда
		
		Если ПравоПользователя("ЗаписьРаньшеДокументаОснования", Объект) Тогда
			ВывестиСообщение(НСтр("ru='Документ ""%1"" проводится раньше, чем документ-основание ""%2""'"), Объект,,,, Объект, Объект.ДокументОснование);
		Иначе
			ВывестиСообщение(НСтр("ru='Недостаточно прав для проведения документа ""%1"" раньше, чем документ-основание ""%2""'"), Объект,,, Отказ, Объект, Объект.ДокументОснование);
		КонецЕсли;
		
	КонецЕсли;
	
	// Можно ли изменять уже проведенные документы
	Если ПроверкаИзмененияПроведенных И Объект.Проведен И (НЕ ПравоПользователя("РедактированиеПроведенныхДокументов", Объект)) Тогда
		ВывестиСообщение(НСтр("ru='Недостаточно прав для изменения проведенных документов'"), Объект,,, Отказ);
	КонецЕсли;
	
	// Проверим на наличие подчиненных документов
	Если НЕ Объект.ЭтоНовый()
		И ПроверкаИзмененияПриНаличииПодчиненных Тогда
		ПроверитьРедактированиеДокументаПриНаличииПодчиненных(Объект.Ссылка, Отказ);
	КонецЕсли;
	
	// Проверим на право проведения не текущей датой
	Если ПроверкаПроведенияЗаднимЧислом И РежимЗаписи=РежимЗаписиДокумента.Проведение И НачалоДня(Объект.Дата) < НачалоДня(ТекущаяДатаСеанса()) И НЕ ПравоПользователя("ПроведениеЗаднимЧислом", Объект) Тогда
		ВывестиСообщение(НСтр("ru='Недостаточно прав для проведения документов задним числом'"), Объект, "Дата",, Отказ);
	КонецЕсли;
	
	// Проверка куратора контрагента
	Если ПроверкаВводаДокументовПоКураторам И ЕстьРеквизит(Объект, "Контрагент") И ЗначениеЗаполнено(Объект.Контрагент) И (НЕ ПравоПользователя("ВводДокументовДляВсехКонтрагентов", Объект)) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	Кураторы.Контрагент,
		|	Кураторы.Куратор
		|ИЗ
		|	РегистрСведений.Кураторы КАК Кураторы
		|ГДЕ
		|	Кураторы.Контрагент = &Контрагент
		|	И Кураторы.Куратор = &Куратор";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
		Запрос.УстановитьПараметр("Куратор",    Пользователи.ТекущийПользователь().Сотрудник);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Количество()=0 Тогда
			ВывестиСообщение(НСтр("ru='Недостаточно прав для ввода документов по контрагенту ""%1""'"), Объект, "Контрагент",, Отказ, Объект.Контрагент);
		КонецЕсли;
		
	КонецЕсли;
	
	// Проверка разрешения на проведение документа при использовании утверждения документов.
	Если УтверждениеДокументовСервер.ИспользоватьУтверждениеДокументов() И ПроверкаИспользованияУтвержденияДокументов Тогда
		УтверждениеДокументовСервер.ОбработкаУтвержденияПередЗаписью(Объект, Отказ, РежимЗаписи);
	КонецЕсли;
	
	//Проверка разрешения изменения документов всех авторов
	Если ПроверкаИзмененияДокументовДругогоАвтора И НЕ Объект.ЭтоНовый() И ЕстьРеквизит(Объект, "Автор")
		И ПравоПользователя("РедактированиеТолькоСвоихДокументов", Объект) И Объект.Ссылка.Автор<>ПараметрыСеанса.ТекущийПользователь Тогда
		ВывестиСообщение(НСтр("ru='Недостаточно прав для изменения документа, созданного другим пользователем'"), Объект,,, Отказ);
	КонецЕсли;
	
	//проверка разрешения изменения документа только менеджерами портфеля
	Если ПроверкаИзмененияМенеджерамиПортфеля И НЕ Объект.ЭтоНовый() И ЕстьРеквизит(Объект, "ПортфельКатегорий")
		И ЗначениеЗаполнено(Объект.ПортфельКатегорий) И ПравоПользователя("РедактированиеДокументаТолькоМенеджеромПортфеля", Объект) Тогда
		
		текПользователь = ПараметрыСеанса.ТекущийПользователь;
		НашлиМенеджера = Ложь;
		Для Каждого текМенеджер Из Объект.ПортфельКатегорий.Менеджеры Цикл
			начПериода = текМенеджер.НачалоПериода;
			конПериода = текМенеджер.КонецПериода;
			ДатаОбъекта = Объект.Дата;
			
			Если текМенеджер.Менеджер=ПараметрыСеанса.ТекущийПользователь И (НЕ ЗначениеЗаполнено(начПериода) ИЛИ начПериода<=ДатаОбъекта) И (НЕ ЗначениеЗаполнено(конПериода) ИЛИ конПериода>=ДатаОбъекта) Тогда
				НашлиМенеджера = Истина;;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ НашлиМенеджера Тогда
			ВывестиСообщение(НСтр("ru='Редактирование документа, разрешено только менеджерам портфеля, указанного в данном документе.'"), Объект,,, Отказ);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Отказ;
	
КонецФункции // ПроверитьВозможностьИзмененияОбъекта()

// Вызывает обработчик проверки корректности заполнения документа в режиме "Запись" в зависимости от значения права.
//
Процедура ПроверитьЗаполнениеОбъектаПередЗаписью(Объект, Отказ, РежимЗаписи)
	
	// Интересует только режим "Запись", в противном случае платформа сама проверит при проведении.
	Если (НЕ РежимЗаписи=РежимЗаписиДокумента.Запись) Тогда
		Возврат;
	КонецЕсли;
	
	// Если объект помечается на удаление, то проверку его заполнения выполнять не требуется.
	Если Объект.ПометкаУдаления Тогда
		Возврат;
	КонецЕсли;
	
	// Если объект не принадлежит для проведения, то проверку его заполнения выполнять по общим правилам.
	Если Объект.Метаданные().Проведение = Метаданные.СвойстваОбъектов.Проведение.Запретить Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим возможность пользователя записывать объекты без проверки корректности
	Если ПравоПользователя("КонтролироватьЗаполнениеТолькоПриПроведении", Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Выполняем проверку заполнения
	Если НЕ Объект.ПроверитьЗаполнение() Тогда
		Отказ = ИСТИНА;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеОбъектаПередЗаписью()

// Производит проверку корректности заполнения поля "Характеристика" в соответствии с правилами ведения учета.
//
Процедура ПроверитьЗаполнениеХарактеристикиНоменклатуры(Объект, Отказ=ЛОЖЬ)
	
	// Нет смысла выполнять проверку, если контроль не требуется или учет по характеристикам не ведется.
	Если НЕ ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "КонтрольЗаполненияХарактеристик", ИСТИНА) ИЛИ НЕ ПолучитьФункциональнуюОпцию("ИспользоватьХарактеристики") Тогда
		Возврат;
	КонецЕсли;
	
	// Получим параметры текущего проверяемого объекта
	ОбъектМетаданных      = Метаданные.НайтиПоТипу(ТипЗнч(Объект.Ссылка));
	МенеджерОбъекта       = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	ОбязательныеРеквизиты = МенеджерОбъекта.ПолучитьОбязательныеРеквизиты(Объект);
	
	// Последовательно обработаем каждую табличную часть объекта
	Для каждого ОбъектМетаданныхТаблицы Из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		// Проверяем целесообразность проверки строк текущей таблицы
		Если НЕ ЕстьРеквизит(Объект, "ХарактеристикаНоменклатуры", ОбъектМетаданныхТаблицы.Имя) ИЛИ ОбязательныеРеквизиты.Найти(ОбъектМетаданныхТаблицы.Имя+".Номенклатура")=Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		// Получаем таблицу признаков ведения учета для по товарам табличной части
		ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Номенклатура.Ссылка КАК Номенклатура,
		|	ВЫБОР
		|		КОГДА Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик = ЗНАЧЕНИЕ(Перечисление.РежимыАвтоСписанияХарактеристик.РучноеСписание)
		|				ИЛИ Номенклатура.ТипНоменклатуры.АвтоСписаниеХарактеристик = ЗНАЧЕНИЕ(Перечисление.РежимыАвтоСписанияХарактеристик.ПустаяСсылка)
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК РучноеСписаниеХарактеристик,
		|	ВЫБОР
		|		КОГДА Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 1
		|				ИЛИ Номенклатура.ТипНоменклатуры.ИспользованиеХарактеристик = 2
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК УчетВедется
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Номенклатура.Ссылка В(&СписокНоменклатуры)";
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("СписокНоменклатуры", Объект[ОбъектМетаданныхТаблицы.Имя].ВыгрузитьКолонку("Номенклатура"));
		ПараметрыУчета = Запрос.Выполнить().Выгрузить();
		
		// Выполняем проверку корректности заполнения
		Для каждого СтрокаТабличнойЧасти Из Объект[ОбъектМетаданныхТаблицы.Имя] Цикл
			
			Если ТипЗнч(СтрокаТабличнойЧасти.Номенклатура)<>Тип("СправочникСсылка.Номенклатура") Тогда
				Продолжить;
			КонецЕсли; 
			
			// Проверять нужно только те строки у которых заполнена номенклатура и не заполнена характеристика.
			Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Номенклатура) ИЛИ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ХарактеристикаНоменклатуры) Тогда
				Продолжить;
			КонецЕсли;
			
			// Получим признак обязательного выполнения контроля заполнения характеристик товаров.
			ЗапретАвтоСписанияХарактеристик = ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, ОбъектМетаданныхТаблицы.Имя+"ЗапретАвтоСписанияХарактеристик", ЛОЖЬ);
			
			// получим параметры ведения учета по текущей номенклатуре
			ПараметрыУчетаНоменклатуры = ПараметрыУчета.Найти(СтрокаТабличнойЧасти.Номенклатура, "Номенклатура");
			
			// Проверим и сообщим пользователю если что-то не так
			Если ПараметрыУчетаНоменклатуры.УчетВедется И (ЗапретАвтоСписанияХарактеристик ИЛИ ПараметрыУчетаНоменклатуры.РучноеСписаниеХарактеристик) Тогда
				ВывестиСообщение(НСтр("ru='Поле ""%1"" строки # таблицы ""$2"" не заполнено'"), Объект, ОбъектМетаданныхТаблицы.Имя+"[#]"+".ХарактеристикаНоменклатуры", СтрокаТабличнойЧасти.НомерСтроки, Отказ, "ХарактеристикаНоменклатуры", ОбъектМетаданныхТаблицы.Имя);
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеХарактеристикиНоменклатуры()

// Производит проверку заполненности поля Партия в случае, если указан номер ГТД.
//
Процедура ПроверитьЗаполнениеПартииПоГТД(Объект, Отказ=ЛОЖЬ)
	
	// Нет смысла выполнять проверку, если учет по ГТД не ведется
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьГТД") ИЛИ НЕ ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "ПроверкаЗаполненияПартииПоГТД", ИСТИНА) ИЛИ ТипЗнч(Объект)=Тип("ДокументОбъект.СчетФактураВыданный") Тогда
		Возврат;
	КонецЕсли;
	
	// Получим описание объекта метаданных
	ОбъектМетаданных = Метаданные.НайтиПоТипу(ТипЗнч(Объект));
	
	// Последовательно обработаем каждую табличную часть объекта
	Для каждого ОбъектМетаданныхТаблицы Из ОбъектМетаданных.ТабличныеЧасти Цикл
		
		// Проверяем целесообразность перебора строк текущей таблицы
		Если НЕ ЕстьРеквизит(ОбъектМетаданных, "Партия", ОбъектМетаданныхТаблицы.Имя) ИЛИ НЕ ЕстьРеквизит(ОбъектМетаданных, "ГТД", ОбъектМетаданныхТаблицы.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		// Выполняем проверку корректности заполнения
		Для каждого СтрокаТабличнойЧасти Из Объект[ОбъектМетаданныхТаблицы.Имя] Цикл
			Если ЗначениеЗаполнено(СтрокаТабличнойЧасти.ГТД) И НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.Партия) Тогда
				ВывестиСообщение(НСтр("ru='Поле ""%1"" строки # таблицы ""$2"" не заполнено при указанном значении поля ""%3""'"), Объект, ОбъектМетаданныхТаблицы.Имя+"[#]"+".Партия", СтрокаТабличнойЧасти.НомерСтроки, Отказ, "Партия", ОбъектМетаданныхТаблицы.Имя, "ГТД");
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеПартииПоГТД()

// Производит проверку корректности заполнения реквизитов документа по соответствию организации.
//
Процедура ПроверитьЗаполнениеРеквизитовПоОрганизации(Объект, Отказ=ЛОЖЬ)
	
	// Проверка имеет смысл только в случае если соответствующие реквизиты документа заполнены.
	Если НЕ (ЕстьРеквизит(Объект, "ПодразделениеКомпании") И ЗначениеЗаполнено(Объект.ПодразделениеКомпании)) ИЛИ НЕ (ЕстьРеквизит(Объект, "Организация") И ЗначениеЗаполнено(Объект.Организация)) Тогда
		Возврат;
	КонецЕсли;
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов.
	СпособКонтроляКорректности = ПравоПользователя("КонтрольКорректностиДоговораИСкладаДокумента", Объект);
	СпособВеденияБаланса       = ПолучитьЗначениеУчетнойПолитики("СпособВеденияБаланса", Неопределено, Объект.Дата);
	
	// Определим параметры проверки
	КонтрольОтсутствует             = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольОтсутствует                 И СпособВеденияБаланса=Перечисления.СпособВеденияБаланса.ПоКомпании);
	КонтрольПоПодразделению         = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению);
	КонтрольПоИерархииПодразделения = (СпособКонтроляКорректности=Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИИерархииПодразделению);
	
	// Проверка необходима, если ведется баланс по организации или требуется контроль корректности договора и склада.
	Если КонтрольОтсутствует Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим соответствие Подразделения и Организации объекта
	Если НЕ Объект.ПодразделениеКомпании.Организация=Объект.Организация Тогда
		ВывестиСообщение(НСтр("ru = 'Подразделение ""%1"" не принадлежит организации ""%2""'"), Объект, "Организация",, Отказ, Объект.ПодразделениеКомпании, Объект.Организация);
	КонецЕсли;
	
	// Получим перечень проверяемых реквизитов для текущего объекта
	Попытка
		МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
		КонтролируемыеРеквизиты = МенеджерОбъекта.ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению ИЛИ КонтрольПоИерархииПодразделения);
	Исключение
		КонтролируемыеРеквизиты = Новый Структура;
	КонецПопытки;
	
	// Проверяем, имеется ли необходимость в дальнейших операциях
	Если КонтролируемыеРеквизиты.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	// Получим описание метаданных текущего и объекта
	ОбъектМетаданных = Объект.Метаданные();
	
	// Последовательно выполняем проверку каждого из указанных реквизитов
	Для каждого КонтролируемыйРеквизит Из КонтролируемыеРеквизиты Цикл
		
		// Обработаем в зависимости от вида реквизита
		Если ТипЗнч(КонтролируемыйРеквизит.Значение)=Тип("Структура") Тогда
			
			// Выполняем обход строк проверяемой табличной части и устанавливаемых табличных частей.
			// Здесь должна быть структура с наименованиями табличных частей.
			Для Каждого СтрокаТабличнойЧасти Из Объект[КонтролируемыйРеквизит.Ключ] Цикл
				Для Каждого КонтролируемыйРеквизитТаблицы Из КонтролируемыйРеквизит.Значение Цикл
					
					// Получаем значение проверяемого реквизита
					Реквизит = СтрокаТабличнойЧасти[КонтролируемыйРеквизитТаблицы.Ключ];
					
					// Возможно проверяемый реквизит необязательный, да еще к тому же не типизированный, поэтому пропустим пустые.
					Если НЕ ЗначениеЗаполнено(Реквизит) Тогда
						Продолжить;
					КонецЕсли;
					ТекстОшибки = "";
					
					// Проверяем на соответствие подразделению и организации
					Если КонтролируемыйРеквизитТаблицы.Значение = Истина
						И (КонтрольПоПодразделению И НЕ Реквизит.ПодразделениеКомпании=Объект.ПодразделениеКомпании) Тогда
						
						ТекстОшибки = 
							НСтр("ru = 'Значение поля ""%1"" в строке №# таблицы ""%2"" не соответствует подразделению документа'");
						
					ИначеЕсли КонтролируемыйРеквизитТаблицы.Значение = Истина
						И КонтрольПоИерархииПодразделения
						И НЕ Объект.ПодразделениеКомпании.ПринадлежитЭлементу(Реквизит.ПодразделениеКомпании)
						И НЕ Реквизит.ПодразделениеКомпании=Объект.ПодразделениеКомпании Тогда
						
						ТекстОшибки =
							НСтр("ru = 'Значение поля ""%1"" в строке №# таблицы ""%2"" не соответствует подчиненности подразделению документа'");
						
						ИначеЕсли КонтролируемыйРеквизитТаблицы.Значение <> Неопределено
							И НЕ Реквизит.Организация = Объект.Организация Тогда
						
						ТекстОшибки = 
							НСтр("ru = 'Значение поля ""%1"" в строке №# таблицы ""%2"" не соответствует организации документа'");
						
					КонецЕсли;
					
					// Информируем пользователя о найденной коллизии
					Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
						ВывестиСообщение(
							ТекстОшибки,
							Объект,
							КонтролируемыйРеквизит.Ключ+"[#]."+КонтролируемыйРеквизитТаблицы.Ключ,
							СтрокаТабличнойЧасти.НомерСтроки,
							Отказ,
							КонтролируемыйРеквизитТаблицы.Ключ,
							КонтролируемыйРеквизит.Ключ);
					КонецЕсли;
					
				КонецЦикла
			КонецЦикла;
			
		Иначе
			
			// Получаем значение проверяемого реквизита
			Реквизит = Объект[КонтролируемыйРеквизит.Ключ];
			
			// Возможно проверяемый реквизит необязательный, да еще к тому же не типизированный, поэтому пропустим пустые.
			Если НЕ ЗначениеЗаполнено(Реквизит) Тогда
				Продолжить;
			КонецЕсли;
			
			// Получим организацию текущего реквизита
			Организация = ?(ТипЗнч(Реквизит)=Тип("СправочникСсылка.БанковскиеСчета"), Реквизит.Владелец, Реквизит.Организация);
			ТекстОшибки = "";
			
			// Проверяем на соответствие подразделению и организации
			Если КонтролируемыйРеквизит.Значение = Истина
				И (КонтрольПоПодразделению И НЕ Реквизит.ПодразделениеКомпании=Объект.ПодразделениеКомпании) Тогда
				
				ТекстОшибки = НСтр("ru = 'Значение поля ""$1"" не соответствует подразделению документа'");
				
			ИначеЕсли КонтролируемыйРеквизит.Значение = Истина
				И КонтрольПоИерархииПодразделения 
				И НЕ Объект.ПодразделениеКомпании.ПринадлежитЭлементу(Реквизит.ПодразделениеКомпании)
				И НЕ Реквизит.ПодразделениеКомпании=Объект.ПодразделениеКомпании Тогда
				
				ТекстОшибки = НСтр("ru = 'Значение поля ""$1"" не соответствует подчиненности подразделению документа'");
				
			ИначеЕсли КонтролируемыйРеквизит.Значение <> Неопределено И НЕ Организация=Объект.Организация Тогда
				
				ТекстОшибки = НСтр("ru = 'Значение поля ""$1"" не соответствует организации документа'");
				
			КонецЕсли;
			
			// Информируем пользователя о найденной коллизии
			Если НЕ ПустаяСтрока(ТекстОшибки) Тогда
				ВывестиСообщение(ТекстОшибки, Объект, КонтролируемыйРеквизит.Ключ,, Отказ, КонтролируемыйРеквизит.Ключ);
			КонецЕсли;
			
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры // ПроверитьЗаполнениеРеквизитовПоОрганизации()

// Производит проверку корректности заполнения подразделения у документа.
//
Процедура ПроверитьЗаполнениеПодразделенияКомпании(Объект, Отказ=ЛОЖЬ)
	
	// Проверка имеет смысл только в случае если соответствующие реквизиты документа заполнены.
	Если НЕ (ЕстьРеквизит(Объект, "ПодразделениеКомпании")) Тогда
		Возврат;
	КонецЕсли;
	
	// Проведем проверку соответствия организации документа организациям некоторых реквизитов.
	СпособКонтроляКорректности = ПравоПользователя("КонтролироватьПодразделение", Объект);
	
	// Определим параметры проверки
	КонтрольОтсутствует		= (СпособКонтроляКорректности=Перечисления.ВидыКонтроля.НеКонтролировать);
	КонтрольЗапрещать		= (СпособКонтроляКорректности=Перечисления.ВидыКонтроля.Запрещать);
	
	Если КонтрольОтсутствует Тогда
		Возврат;
	КонецЕсли;
	
	ДоступноеПодразделение = ПараметрыСеанса.ПодразделениеКомпании;
	
	// Проверим соответствие Подразделения объекта и пользователя
	Если НЕ Объект.ПодразделениеКомпании=ДоступноеПодразделение Тогда
		ВывестиСообщение(НСтр("ru = 'Подразделение ""%1"" не соответсвует подразделению текущего пользователя'"), Объект, "КонтролироватьПодразделение",,, Объект);
		Отказ = КонтрольЗапрещать;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьЗаполнениеРеквизитовПоОрганизации()

// Проверяет соответствие параметров текущей операции, параметрам указанного договора.
//
Процедура ПроверитьПараметрыОперацииНаСоответствиеДоговору(Объект, Отказ=ЛОЖЬ)
	
	// Если у операции нет реквизита договора, то и проверку выполнять не требуется
	Если НЕ ЕстьРеквизит(Объект, "ДоговорВзаиморасчетов") ИЛИ НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) ИЛИ НЕ ПолучитьЗначениеПараметраСтруктуры(Объект.ДополнительныеСвойства, "КонтрольОперацииНаСоответствиеДоговору", Истина) Тогда
		Возврат;
	КонецЕсли;
	
	// Проверим соответствие вида договора хоз. операции документа
	Если ЕстьРеквизит(Объект, "ХозОперация") И НЕ Справочники.ХозОперации.ДоговорСоответствуетХозОперации(Объект.ХозОперация, Объект.ДоговорВзаиморасчетов) Тогда
		ВывестиСообщение(НСтр("ru='Вид договора не соответствует Хоз. операции'"), Объект, "ДоговорВзаиморасчетов",, Отказ);
	КонецЕсли;
	
	// Получим текущий режим контроля соответствия проектов
	РежимКонтроляПроектов = ПравоПользователя("КонтролироватьСоответствиеПроектов", Объект);
	
	// выполняем проверку соответствия проекта документа и договора
	Если НЕ Константы.ИспользоватьПроекты.Получить() ИЛИ РежимКонтроляПроектов=Перечисления.ВидыКонтроля.НеКонтролировать ИЛИ (НЕ ЕстьРеквизит(Объект, "Проект")) ИЛИ Объект.ДоговорВзаиморасчетов.ОсновнойПроект=Объект.Проект Тогда
		// Проверку выполнять не требуется
	Иначе
		
		// Получим представления проектов договора и документа
		ПредставлениеПроектаДокумента = ?(ЗначениеЗаполнено(Объект.Проект), СокрЛП(Объект.Проект), "пустой");
		ПредставлениеПроектаДоговора  = ?(ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов.ОсновнойПроект), Объект.ДоговорВзаиморасчетов.ОсновнойПроект, "пустой");
		
		// Формируем текст сообщения пользователю
		ТекстСообщения = НСтр("ru='Проект <%1> договора ""%2"" отличается от проекта <%3> документа'");
		
		Если РежимКонтроляПроектов=Перечисления.ВидыКонтроля.Предупреждать Тогда
			ВывестиСообщение(ТекстСообщения, Объект, "Проект",,,       ПредставлениеПроектаДоговора, Объект.ДоговорВзаиморасчетов, ПредставлениеПроектаДокумента);
			
		ИначеЕсли РежимКонтроляПроектов=Перечисления.ВидыКонтроля.Запрещать Тогда
			ВывестиСообщение(ТекстСообщения, Объект, "Проект",, Отказ, ПредставлениеПроектаДоговора, Объект.ДоговорВзаиморасчетов, ПредставлениеПроектаДокумента);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьПараметрыОперацииНаСоответствиеДоговору()

// Производит проверку уникальности указанного входящего номера документа.
//
Процедура ПроверитьУникальностьНомеровВходящихДокументов(Объект, Отказ=ЛОЖЬ)
	
	// Получим текущий режим контроля номеров входящих документов
	РежимКонтроляНомеров = ПравоПользователя("ПроверятьУникальностьВходящихИВнешнихНомеровДокументов", Объект);
	
	// Прекращаем обработку, если контроль не требуется
	Если РежимКонтроляНомеров=Перечисления.ВидыКонтроля.НеКонтролировать Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем в зависимости от вида документа
	Если ЕстьРеквизит(Объект, "ВхДокНомер") И ЗначениеЗаполнено(Объект.ВхДокНомер) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	" + Объект.Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.ВхДокНомер = &ВхДокНомер
		|	И Таблица.Ссылка <> &Ссылка
		|	И Таблица.ВхДокДата МЕЖДУ &НачВхДокДата И &КонВхДокДата 
		| И Таблица.Контрагент = &Контрагент
		|УПОРЯДОЧИТЬ ПО
		|	Таблица.ВхДокДата";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка",       Объект.Ссылка);
		Запрос.УстановитьПараметр("ВхДокНомер",   Объект.ВхДокНомер);
		Запрос.УстановитьПараметр("НачВхДокДата", НачалоГода(Объект.ВхДокДата));
		Запрос.УстановитьПараметр("КонВхДокДата", КонецГода(Объект.ВхДокДата));
		Запрос.УстановитьПараметр("Контрагент",   Объект.Контрагент);
		
		// Формируем текст сообщения пользователю
		ТекстСообщения = НСтр("ru='Повторение входящих номеров документов в пределах контрагента ""%1"": %2'");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если РежимКонтроляНомеров=Перечисления.ВидыКонтроля.Предупреждать Тогда
				ВывестиСообщение(ТекстСообщения, Объект, "ВхДокНомер",,,       Объект.Контрагент, Выборка.Ссылка);
			Иначе
				ВывестиСообщение(ТекстСообщения, Объект, "ВхДокНомер",, Отказ, Объект.Контрагент, Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
		
	ИначеЕсли ЕстьРеквизит(Объект, "ВнешнийНомерЗаказа") И ЗначениеЗаполнено(Объект.ВнешнийНомерЗаказа) Тогда
		
		ТекстЗапроса = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Таблица.Ссылка КАК Ссылка
		|ИЗ
		|	" + Объект.Метаданные().ПолноеИмя() + " КАК Таблица
		|ГДЕ
		|	Таблица.ВнешнийНомерЗаказа = &ВнешнийНомерЗаказа
		|	И Таблица.Ссылка <> &Ссылка
		|	И Таблица.Контрагент = &Контрагент
		|УПОРЯДОЧИТЬ ПО
		|	Таблица.Дата";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка",             Объект.Ссылка);
		Запрос.УстановитьПараметр("ВнешнийНомерЗаказа", Объект.ВнешнийНомерЗаказа);
		Запрос.УстановитьПараметр("Контрагент",         Объект.Контрагент);
		
		// Формируем текст сообщения пользователю
		ТекстСообщения = НСтр("ru='Повторение внешних номеров документов в пределах контрагента ""%1"": %2'");
		
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			Если РежимКонтроляНомеров=Перечисления.ВидыКонтроля.Предупреждать Тогда
				ВывестиСообщение(ТекстСообщения, Объект, "ВнешнийНомерЗаказа",,,       Объект.Контрагент, Выборка.Ссылка);
			Иначе
				ВывестиСообщение(ТекстСообщения, Объект, "ВнешнийНомерЗаказа",, Отказ, Объект.Контрагент, Выборка.Ссылка);
			КонецЕсли;
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры // ПроверитьУникальностьНомеровВходящихДокументов()

// Производит проверку соответствия валюты документа и кассы, кассы ККМ и банковскому счету.
//
Процедура ПроверитьСоответствиеВалют(Объект, Отказ=ЛОЖЬ)
	
	// Если у нет реквизита валюты, то и проверку выполнять не требуется
	Если НЕ ЕстьРеквизит(Объект, "ВалютаДокумента") ИЛИ НЕ ЗначениеЗаполнено(Объект.ВалютаДокумента) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЕстьРеквизит(Объект, "КассаКомпании") И ЗначениеЗаполнено(Объект.КассаКомпании) И НЕ Объект.КассаКомпании.МноговалютнаяКасса И Объект.ВалютаДокумента <> Объект.КассаКомпании.ВалютаДенежныхСредств Тогда
		ВывестиСообщение(НСтр("ru='Валюта документа (<%1>) не соответствует валюте кассы компании (<%2>).'"), Объект,,, Отказ,Объект.ВалютаДокумента, Объект.КассаКомпании.ВалютаДенежныхСредств);
	КонецЕсли;
	
	Если ЕстьРеквизит(Объект, "КассаККМ") И ЗначениеЗаполнено(Объект.КассаККМ) И Объект.ВалютаДокумента <> Объект.КассаККМ.ВалютаДенежныхСредств
		И (ЕстьРеквизит(Объект, "ДляПробитияНаФР") И Объект.ДляПробитияНаФР ИЛИ НЕ ЕстьРеквизит(Объект, "ДляПробитияНаФР")) Тогда
		ВывестиСообщение(НСтр("ru='Валюта документа (<%1>) не соответствует валюте кассы ККМ (<%2>).'"), Объект,,, Отказ,Объект.ВалютаДокумента, Объект.КассаККМ.ВалютаДенежныхСредств);
	КонецЕсли;
	
	Если ЕстьРеквизит(Объект, "БанковскийСчет") И ЗначениеЗаполнено(Объект.БанковскийСчет) И Объект.ВалютаДокумента <> Объект.БанковскийСчет.ВалютаДенежныхСредств Тогда
		ВывестиСообщение(НСтр("ru='Валюта документа (<%1>) не соответствует валюте банковского счета (<%2>).'"), Объект,,, Отказ,Объект.ВалютаДокумента, Объект.БанковскийСчет.ВалютаДенежныхСредств);
	КонецЕсли;
	
КонецПроцедуры // ПроверитьСоответствиеВалют()

// Производит проверку соответствия банковского счета документа и организации либо подразделения компании.
//
Функция ПроверитьКорректностьБанковскогоСчета(Счет, Организация, Подразделение, ДополнительныеСвойства=Неопределено) Экспорт
	
	Если ПолучитьЗначениеПараметраСтруктуры(ДополнительныеСвойства, "ЭтоВосстановлениеПоследовательностей", Ложь) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если Счет.Владелец = Организация Тогда
		Возврат Истина;
	КонецЕсли;
	
	Родитель = Подразделение;
	Пока ЗначениеЗаполнено(Родитель) Цикл
		
		Если Счет.Владелец = Родитель Тогда
			Возврат Истина;
		КонецЕсли;
		
		Родитель = Родитель.Родитель;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции // ПроверитьКорректностьБанковскогоСчета()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ФОРМИРОВАНИЯ ДВИЖЕНИЙ ДОКУМЕНТОВ

// Удаляет движения документа по тем регистрам, по которым действительно были движения.
Процедура УдалениеДвиженийДокумента(Объект, УдалениеПроведения)
	
	// новые не чистим
	Если Объект.Движения.Количество()=0 Тогда
		Возврат;
	КонецЕсли;
	
	// подготавливаемся к поиску регистров для очистки
	ТекстЗапроса = "";
	Для Каждого Движение Из Объект.Движения Цикл
		
		ДвижениеМетаданные = Движение.Метаданные();
		ИмяРегистра        = ДвижениеМетаданные.Имя;
		
		Если ИмяРегистра="СостоянияДокументов" Тогда
			Продолжить;
		КонецЕсли;
		
		ПутьРегистра = ДвижениеМетаданные.ПолноеИмя();
		ТекстЗапроса = ТекстЗапроса + "ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ ПЕРВЫЕ 1 """ + ИмяРегистра + """ КАК ИмяРегистра ИЗ " + ПутьРегистра + " ГДЕ Регистратор = &Ссылка
		|";
		
	КонецЦикла;
	
	// чистим движения
	Если НЕ ПустаяСтрока(ТекстЗапроса) Тогда
		
		Запрос = Новый Запрос("//" + ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
		
		Результат = Запрос.Выполнить();
		Если Результат.Пустой() Тогда
			Возврат;
		КонецЕсли;
		
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			Движение = Объект.Движения[Выборка.ИмяРегистра];
			Движение.Записывать = Истина;
			
			Движение.ДополнительныеСвойства.Вставить("РассчитатьОстаток", УдалениеПроведения);
			Движение.Очистить();
		КонецЦикла;
		
		Объект.Движения.Записать();
		
	КонецЕсли;
	
КонецПроцедуры // УдалениеДвиженийДокумента()

// Устанавливает управляемую блокировку таблицы
//
// Параметры:
//  СтруктураПараметров 		- Структура. Структура параметров блокировки. Обязательный параметр.
//								Обязательно должна содержать свойства:
//								"ИмяТаблицы" - Строка - имя таблицы, на которую накладывается блокировка.
//									Например: "АвансовыйОтчет"
//								Необязательные свойства:
//								"ТипТаблицы" - Строка - тип таблицы, на которую накладывается блокировка.
//									Пространство блокировки состоит из типа таблицы и имени таблицы.
//									Например: "Документ"
//									Значение по умолчанию: "РегистрНакопления"
//								"РежимБлокировки" - РежимБлокировкиДанных - режим накладываемой блокировки.
//									Значение по умолчанию: РежимБлокировкиДанных.Исключительный
//								"ИсточникДанных" - источник данных для блокировки.
//									Может передаваться значение любого типа, поддерживаемого свойством ИсточникДанных элемента блокировки,
//									а также типа "Менеджер временных таблиц".
//									Если в структуре нет этого свойства - блокировки через ИспользоватьИзИсточникаДанных() не накладываются.
//								"ИмяВременнойТаблицы" - Строка - имя временной таблицы менеджера временных таблиц,
//									которая служит источником данных для блокировки. Обязательно должно указываться,
//									если в качестве источника данных процедуре передан менеджер временных таблиц.
//  КоллекцияЗначенийБлокировки	- Структура или Соответствие - описывает значения блокировки,
//								  накладываемые с помощью УстановитьЗначение().
//									Ключ - поле блокировки - Строка или (только для соответствия) ПланыВидовХарактеристикСсылка,
//										ПланыВидовХарактеристикСсылка используется для блокировки регистра бухгалтерии по виду субконто.
//									Значение - блокируемое значение - Произвольный тип.
//									Если передано Неопределено или если коллекция не содержит ни одного элемента -
//									блокировки методом УстановитьЗначение() не накладываются.
//  КоллекцияОписанияИсточника	- Структура или Соответствие - описывает значения блокировки,
//								  накладываемые с помощью ИспользоватьИзИсточникаДанных().
//									Ключ - поле блокировки - Строка или (только для соответствия) ПланыВидовХарактеристикСсылка, 
//										ПланыВидовХарактеристикСсылка используется для блокировки регистра бухгалтерии по виду субконто.
//									Значение - поле таблицы источника данных - Строка.
//									Если передано Неопределено или если коллекция не содержит ни одного элемента -
//									блокировки методом ИспользоватьИзИсточникаДанных() не накладываются.
//  Отказ 						- Булево - при ошибке в процессе установки блокировки в этот параметр процедура
//								           возвращает значение Истина.
//
Процедура УстановитьУправляемуюБлокировку(СтруктураПараметров, КоллекцияЗначенийБлокировки = Неопределено, КоллекцияОписанияИсточника = Неопределено, Отказ = Ложь) Экспорт
	
	Если НЕ ТипЗнч(СтруктураПараметров) = Тип("Структура") ИЛИ НЕ Константы.НомерРелизаКонфигурации.Получить() = "" Тогда
		Возврат;
	КонецЕсли;
	
	ИспользоватьЗначенияБлокировки = КоллекцияЗначенийБлокировки <> Неопределено 
		И (ТипЗнч(КоллекцияЗначенийБлокировки) = Тип("Структура") 
		 ИЛИ ТипЗнч(КоллекцияЗначенийБлокировки) = Тип("Соответствие"))
		И КоллекцияЗначенийБлокировки.Количество() > 0;
		
	ИспользоватьИсточникДанных = КоллекцияОписанияИсточника <> Неопределено 
		И (ТипЗнч(КоллекцияОписанияИсточника) = Тип("Структура") 
		 ИЛИ ТипЗнч(КоллекцияОписанияИсточника) = Тип("Соответствие"))
		И КоллекцияОписанияИсточника.Количество() > 0
		И СтруктураПараметров.Свойство("ИсточникДанных");
	
	Если (НЕ ИспользоватьЗначенияБлокировки) И (НЕ ИспользоватьИсточникДанных) Тогда
		Возврат;
	КонецЕсли;
	
	Блокировка = Новый БлокировкаДанных;
	
	ТипТаблицы = ?(СтруктураПараметров.Свойство("ТипТаблицы"), СтруктураПараметров.ТипТаблицы, "РегистрНакопления");
	ИмяТаблицы = СтруктураПараметров.ИмяТаблицы;
	ПространствоБлокировки = ТипТаблицы + "." + ИмяТаблицы;
	ЭлементБлокировки = Блокировка.Добавить(ПространствоБлокировки);
	
	РежимБлокировки = ?(СтруктураПараметров.Свойство("РежимБлокировки"), СтруктураПараметров.РежимБлокировки, РежимБлокировкиДанных.Исключительный);
	ЭлементБлокировки.Режим = РежимБлокировки;
	
	Если ИспользоватьЗначенияБлокировки И НЕ ИспользоватьИсточникДанных Тогда
		Для Каждого ЭлементКоллекции Из КоллекцияЗначенийБлокировки Цикл
			ЭлементБлокировки.УстановитьЗначение(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
		КонецЦикла;
	Иначе
		ИсточникДанных = СтруктураПараметров.ИсточникДанных; 
		Если ТипЗнч(ИсточникДанных) = Тип("МенеджерВременныхТаблиц") Тогда
			Запрос = Новый Запрос;
			Запрос.МенеджерВременныхТаблиц = ИсточникДанных;
			ТекстЗапроса = "";
			Для Каждого ЭлементКоллекции Из КоллекцияОписанияИсточника Цикл
				ТекстЗапроса = ТекстЗапроса + ",
				|	Таб." + ЭлементКоллекции.Значение;
			КонецЦикла;
			ТекстЗапроса = Сред(ТекстЗапроса, 2);
			ТекстЗапроса = 
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ"
			+ ТекстЗапроса + "
			|ИЗ
			|	" + СтруктураПараметров.ИмяВременнойТаблицы + " КАК Таб";
			Запрос.Текст = ТекстЗапроса;
			ИсточникДанных = Запрос.Выполнить();
		КонецЕсли;
		
		Если ИспользоватьЗначенияБлокировки Тогда
			Если ТипЗнч(ИсточникДанных) = Тип("ТаблицаЗначений") Тогда
				ИсточникДанных = ИсточникДанных.Скопировать();
			Иначе
				ИсточникДанных = ИсточникДанных.Выгрузить();
			КонецЕсли;
			
			ТекстКолонок = "";
			Для Каждого ЭлементКоллекции Из КоллекцияОписанияИсточника Цикл
				Если ИсточникДанных.Колонки.Найти(ЭлементКоллекции.Значение) = Неопределено Тогда
					ВывестиСообщение(НСтр("ru = '<%1>. Не установлена блокировка по полю ""%2"" колонки ""%3"" нет в источнике данных.'"),,,,, ПространствоБлокировки, ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
					Продолжить;
				КонецЕсли;
				ТекстКолонок = ТекстКолонок + ?(ТекстКолонок = "", "", ", ") + ЭлементКоллекции.Значение;
			КонецЦикла;
			ИсточникДанных.Свернуть(ТекстКолонок);
			
			Для Каждого ЭлементКоллекции Из КоллекцияЗначенийБлокировки Цикл
				Если ИсточникДанных.Колонки.Найти(ЭлементКоллекции.Ключ) = Неопределено Тогда
					ТипКолонки = Новый Массив;
					ТипКолонки.Добавить(ТипЗнч(ЭлементКоллекции.Значение));
					ИсточникДанных.Колонки.Добавить(ЭлементКоллекции.Ключ, Новый ОписаниеТипов(ТипКолонки));
				КонецЕсли;
				ИсточникДанных.ЗаполнитьЗначения(ЭлементКоллекции.Значение, ЭлементКоллекции.Ключ);
			КонецЦикла;
		КонецЕсли;
		
		ЭлементБлокировки.ИсточникДанных = ИсточникДанных;
		
		Для Каждого ЭлементКоллекции Из КоллекцияОписанияИсточника Цикл
			ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ЭлементКоллекции.Ключ, ЭлементКоллекции.Значение);
		КонецЦикла;
		
		Если ИспользоватьЗначенияБлокировки Тогда
			Для Каждого ЭлементКоллекции Из КоллекцияЗначенийБлокировки Цикл
				ЭлементБлокировки.ИспользоватьИзИсточникаДанных(ЭлементКоллекции.Ключ, ЭлементКоллекции.Ключ);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	Попытка
		Блокировка.Заблокировать();
	Исключение
		Отказ = Истина;
		ВывестиСообщение(ОписаниеОшибки());
		ВызватьИсключение НСтр("ru = 'Операция не выполнена'");
	КонецПопытки;
	
КонецПроцедуры // УстановитьУправляемуюБлокировку()

// Допроводит документ по партионным регистрам 
//
// Параметры:
// Ссылка - ДокументСсылка. Передается если надо провести только указанный документ.
//
Процедура ДопровестиПоПартиям(Ссылка = Неопределено) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(Метаданные.РегламентныеЗадания.ДопроведениеПоПартиям);
	
	// проверим можно ли в этом узле допроводить по партиям
	РежимПроведенияПоПартиям = ПолучитьРежимПроведенияПоПартиям();
	
	// Допроведение выполняем только если партии используются и допроведение выполняется в этом узле.
	Если НЕ РежимПроведенияПоПартиям = Перечисления.РежимыПроведенияПартий.ПервичнымиДокументамиДопроведение Тогда
		Возврат;
	КонецЕсли; 
	
	// Сначала попытаемся произвести корректировку ошибок, которые могли возникнуть при обмене.
	Для Каждого Документ Из Метаданные.Документы Цикл
		
		// посмотрим проводится ли документ по регистру ДопроведениеПоПартиям
		ЕстьДопроведение = Ложь;
		Для Каждого Рег Из Документ.Движения Цикл
			Если ВРЕГ(Рег.Имя) = ВРЕГ("ДопроведениеПоПартиям") Тогда
				ЕстьДопроведение = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		ЕстьОстаткиТоваровКомпании = Ложь;
		Для Каждого Рег Из Документ.Движения Цикл
			Если ВРЕГ(Рег.Имя) = ВРЕГ("ОстаткиТоваровКомпании") Тогда
				ЕстьОстаткиТоваровКомпании = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		Если НЕ ЕстьОстаткиТоваровКомпании Тогда
			Продолжить;
		КонецЕсли;
		
		// пропустим то что не будем рассматривать
		Если НЕ ЕстьДопроведение Тогда
			Продолжить;
		КонецЕсли;
		
		// Уберем из корректировки ошибок те документы по которым может быть, а может и не быть
		// движений по регистру "ПартииТоваровКомпании".
		Если РегистрыСведений.ДопроведениеПоПартиям.ДокументНеВсегдаПроводитьсяПоПартиям(Документ) Тогда
			Продолжить;
		КонецЕсли;
		
		// Ищем проведенные документы, у которых не пустая табл. часть и нет движений по регистру партий
		// и нет записей в регистре допроведения.
		Попытка
			Запрос = Новый Запрос("
			|ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	Док.Ссылка,
			|	Док.Дата,
			|	Док.ПодразделениеКомпании
			|ИЗ
			|	Документ." + Документ.Имя + " КАК Док
			|	
			|ГДЕ
			|	НЕ Док.Ссылка В (ВЫБРАТЬ ПЕРВЫЕ 1 ВЫРАЗИТЬ(Регистратор КАК Документ." + Документ.Имя + ") ИЗ РегистрСведений.ДопроведениеПоПартиям ГДЕ Регистратор = Док.Ссылка)
			|	И Док.Ссылка В (ВЫБРАТЬ ПЕРВЫЕ 1 ВЫРАЗИТЬ(Регистратор КАК Документ." + Документ.Имя + ") ИЗ РегистрНакопления.ОстаткиТоваровКомпании ГДЕ Регистратор = Док.Ссылка)
			|	И НЕ Док.Ссылка В (ВЫБРАТЬ ПЕРВЫЕ 1 ВЫРАЗИТЬ(Регистратор КАК Документ." + Документ.Имя + ") ИЗ РегистрНакопления.ПартииТоваровКомпании ГДЕ Регистратор = Док.Ссылка)
			|	И Док.Проведен
			|	И НЕ 0 В (ВЫБРАТЬ КОЛИЧЕСТВО(*) КАК КоличествоСтрок ИЗ Документ." + Документ.Имя + ".Товары ГДЕ Ссылка = Док.Ссылка)		
			|");
			Рез = Запрос.Выполнить();
			Если Рез.Пустой() Тогда
				Продолжить;
			КонецЕсли;
			
			// для таких документов создадим запись в регистре допроведения
			Выборка = Рез.Выбрать();
			МассивУзловПолучателей = Неопределено;
			
			Пока Выборка.Следующий() Цикл
				ТекРегистратор = Выборка.Ссылка;
				НаборЗаписейДопроведение = РегистрыСведений.ДопроведениеПоПартиям.СоздатьНаборЗаписей();
				НаборЗаписейДопроведение.Отбор.Регистратор.Значение = ТекРегистратор;
				НаборЗаписейДопроведение.Отбор.Регистратор.Использование = Истина;
				НоваяЗапись = НаборЗаписейДопроведение.Добавить();
				НоваяЗапись.Период = Выборка.Дата;
				НоваяЗапись.Регистратор = ТекРегистратор;
				НоваяЗапись.ПодразделениеКомпании = Выборка.ПодразделениеКомпании;
				
				Попытка НаборЗаписейДопроведение.Записать(Истина);
				Исключение
					ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать движения по регистру ""Допроведение по партиям""'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()), УровеньЖурналаРегистрации.Ошибка,,, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				КонецПопытки;
				
			КонецЦикла;
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	// Массив партионных регистров
	МассивПартионныхРегистров = РегистрыСведений.ДопроведениеПоПартиям.ПолучитьПартионныеРегистры();
	
	// Метаданные регистров
	Для Инд = 0 По МассивПартионныхРегистров.ВГраница() Цикл
		МассивПартионныхРегистров[Инд] = Метаданные.РегистрыНакопления[МассивПартионныхРегистров[Инд]];
	КонецЦикла; 
	
	// Выберем все документы которые надо допровести
	Запрос = Новый Запрос("
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ДопроведениеПоПартиям.Регистратор
	|ИЗ
	|	РегистрСведений.ДопроведениеПоПартиям КАК ДопроведениеПоПартиям
	|" + ?(НЕ ЗначениеЗаполнено(Ссылка), "", "ГДЕ ДопроведениеПоПартиям.Регистратор = &Ссылка") + "
	|УПОРЯДОЧИТЬ ПО Регистратор.Дата Возр, Регистратор");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	// если работает робот, то все документы в которых были ошибки, запишем в лог
	ЭтотУзелОбъект = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().ПолучитьОбъект();
	
	КешМетаданныхОбъектов = Новый Соответствие;
	КешУзловПолучателей = Новый Соответствие; 
	
	// идем по документам которые надо допровести
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВыбранныйДокумент = Выборка.Регистратор;
		ТипДанных = ТипЗнч(ВыбранныйДокумент);
		
		// создадим пустой документ-объект того же вида что и допроводимый документ
		ДокОбъект = Документы[ВыбранныйДокумент.Метаданные().Имя].СоздатьДокумент();
		ДокОбъект.ДополнительныеСвойства.Вставить("МоментВремениБыл");
		
		// инициализируем начало проведения
		ОбработкаСобытийДокументаСервер.ОбработкаПроведения(ДокОбъект, Ложь, РежимПроведенияДокумента.Неоперативный);
		
		// Вызываем функцию ПровестиПоПартиям(...), пустого документа, передав в нее ссылку на документ,
		// для которого хотим сформировать движения.
		НачатьТранзакцию();
		Попытка
			
			Если НЕ ДокОбъект.ПровестиПоПартиям(РежимПроведенияДокумента.Неоперативный, ВыбранныйДокумент) Тогда
				СтрЛога = "";
				ОтменитьТранзакцию();
				Продолжить;
			КонецЕсли;
			
		Исключение
			ОтменитьТранзакцию();
			Продолжить;
		КонецПопытки;
		
		// Сформированные движения "сидят" в пустом документе. Надо их взять оттуда и дописать к тому документу,
		// который хотим допровести.
		Для Каждого Рег Из МассивПартионныхРегистров Цикл
			
			Попытка
				НаборЗаписейОбъекта = ДокОбъект.Движения[Рег.Имя];
			Исключение
				Продолжить;
			КонецПопытки;
			
			НаборЗаписей = РегистрыНакопления[Рег.Имя].СоздатьНаборЗаписей();
			НаборЗаписей.Загрузить(НаборЗаписейОбъекта.Выгрузить());
			НаборЗаписей.Отбор.Регистратор.Значение = ВыбранныйДокумент;
			НаборЗаписей.Отбор.Регистратор.Использование = Истина;
			
			// Если имеем дело с доходами и расходами, то надо взять из допроводимого документа уже сформированные движения по ДиР,
			// исключив статью "Себестоимость неоприходованных партий".
			Если ВРЕГ(Рег.Имя) = ВРЕГ("ДоходыИРасходы") Тогда
				ЗапросДиР = Новый Запрос("ВЫБРАТЬ * ИЗ РегистрНакопления.ДоходыИРасходы ГДЕ Регистратор = &Ссылка И СтатьяДоходовИРасходов <> &СебестоимостьНеоприходованныхПартий");
				ЗапросДиР.УстановитьПараметр("Ссылка",ВыбранныйДокумент);
				ЗапросДиР.УстановитьПараметр("СебестоимостьНеоприходованныхПартий", Справочники.СтатьиДоходовИРасходов.СебестоимостьНеоприходованныхПартий);
				РезультатДиР = ЗапросДиР.Выполнить();
				Если НЕ РезультатДиР.Пустой() Тогда
					ВыборкаДиР = РезультатДиР.Выбрать();
					Пока ВыборкаДиР.Следующий() Цикл
						НоваяЗапись = НаборЗаписей.Добавить();
						ЗаполнитьЗначенияСвойств(НоваяЗапись,ВыборкаДиР);
					КонецЦикла;
				КонецЕсли;
			КонецЕсли;
			
			
			Попытка
				НаборЗаписей.Записать(Истина);
			Исключение
				СтрОшибки = ОписаниеОшибки();
				ОтменитьТранзакцию(); Прервать;
			КонецПопытки;
			
			// Почистим движения пустого документа
			НаборЗаписейОбъекта.Очистить();
		КонецЦикла;
		
		// В инвентаризации еще есть взаиморасчеты
		Если ТипЗнч(ВыбранныйДокумент) = Тип("ДокументСсылка.Инвентаризация") Тогда
			НаборЗаписейОбъекта = ДокОбъект.Движения.ВзаиморасчетыКомпании;
			НаборЗаписей = РегистрыНакопления.ВзаиморасчетыКомпании.СоздатьНаборЗаписей();
			НаборЗаписей.Загрузить(НаборЗаписейОбъекта.Выгрузить());
			НаборЗаписей.Отбор.Регистратор.Значение = ВыбранныйДокумент;
			НаборЗаписей.Отбор.Регистратор.Использование = Истина;
			
			Попытка 
				НаборЗаписей.Записать(Истина);
			Исключение
				СтрОшибки = ОписаниеОшибки();
				ОтменитьТранзакцию();
				Продолжить;
			КонецПопытки;
			
			НаборЗаписейОбъекта.Очистить();
			
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.ДопроведениеПоПартиям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Значение = ВыбранныйДокумент;
		НаборЗаписей.Отбор.Регистратор.Использование = Истина;
		НаборЗаписей.Записать(Истина);
		ЗафиксироватьТранзакцию();
		ДокОбъект = Неопределено;
	КонецЦикла;
	
КонецПроцедуры // ДопровестиПоПартиям()

// Производит получение фактической суммы списания и устанавливает это значение как итоговую сумму документа.
//
Процедура ПересчитатьСуммуДокументаПоСебестоимостиСписания(Объект, Отказ, ИмяРегистра=Неопределено, СуммаДополнительная=0, РежимОтменыПроведения=ЛОЖЬ) Экспорт
	
	// Проверяем, есть ли смысл производить дальнейшие действия
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// В режиме отмены проведения записывать повторно документ не нужно, просто обнулим итоговую сумму.
	Если РежимОтменыПроведения Тогда
		Объект.СуммаДокумента = СуммаДополнительная;
		Возврат;
	КонецЕсли;
	
	ПараметрыПолучения = ЗащищенныеФункцииСервер.СоздатьПараметрыПолученияСуммыСписания();
	ПараметрыПолучения.ИмяРегистра = ИмяРегистра;
	СуммаДокумента = СуммаДополнительная + ЗащищенныеФункцииСервер.ПолучитьСуммуСписания(Объект, ПараметрыПолучения);
	
	Если Объект.СуммаДокумента=СуммаДокумента Тогда
		Возврат;
	КонецЕсли;
	
	Попытка
		Объект.СуммаДокумента = СуммаДокумента;
		Объект.ОбменДанными.Загрузка = ИСТИНА;
		Объект.Записать(РежимЗаписиДокумента.Запись);
	Исключение
		ПричинаОшибки = ИнформацияОбОшибке();
		Отказ = ИСТИНА;
	КонецПопытки;
	
	Объект.ОбменДанными.Загрузка = ЛОЖЬ;
	
КонецПроцедуры // ПересчитатьСуммуДокументаПоСебестоимостиСписания()

// Производит списание разницы сумм активной и пассивной части движений документа,
// возникшей в результате округления.
//
// Параметры:
// ОбъектДокумент - "ОбъектДокумент" - Документ.
//
// Возвращаемое значение:
// Истина - если списание успешно произведено, в противном случае - Ложь.
// 
Функция СписаниеКопейкиПриОкругленииВалютныхСчетов(ОбъектДокумент) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Определяем способ ведения баланса
	БалансВедетсяПоПодразделениям =  БалансВедетсяПоПодразделениям(ОбъектДокумент.Дата);
	
	// Создаем таблицу значений, в которой будет происходит накопление сумм.
	ТаблицаАктивовИПассивов = Новый ТаблицаЗначений;
	ТаблицаАктивовИПассивов.Колонки.Добавить("ПодразделениеКомпании", Новый ОписаниеТипов("СправочникСсылка.ПодразделенияКомпании"));
	ТаблицаАктивовИПассивов.Колонки.Добавить("СуммаАктива",           Новый ОписаниеТипов("Число"));
	ТаблицаАктивовИПассивов.Колонки.Добавить("СуммаПассива",          Новый ОписаниеТипов("Число"));
	
	// 1. Взаиморасчеты.
	// Движения вида "Расход" образуют пассивную часть, "Приход" - активную часть.
	НаборВзаиморасчетыКомпании = ОбъектДокумент.Движения.Найти("ВзаиморасчетыКомпании");
	Если НЕ НаборВзаиморасчетыКомпании = Неопределено Тогда
		СуммаВзаиморасчетовИтого = 0;
		Для каждого ТекДвижение Из НаборВзаиморасчетыКомпании Цикл
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ДоговорВзаиморасчетов.ПодразделениеКомпании, ОбъектДокумент.ПодразделениеКомпании);
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива = ТекДвижение.СуммаУпр;
			Иначе
				НоваяСтрока.СуммаПассива = ТекДвижение.СуммаУпр;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// 2. Партии товаров компании
	// Партии являются активом. Отрицательное значение остатка по этому регистру - ошибочное состояние.
	// Особенность: учитываются только партии, имеющие статус "ТоварКупленный".
	НаборПартииТоваровКомпании = ОбъектДокумент.Движения.Найти("ПартииТоваровКомпании");
	Если НЕ НаборПартииТоваровКомпании = Неопределено Тогда
		СуммаПартийТоваровКомпанииИтого = 0;
		Для каждого ТекДвижение Из НаборПартииТоваровКомпании Цикл
			Если ТекДвижение.СтатусПартии = Перечисления.СтатусыПартий.ТоварКупленный Тогда
				НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
				НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.СкладКомпании.ПодразделениеКомпании, ОбъектДокумент.ПодразделениеКомпании);
				Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
					НоваяСтрока.СуммаАктива = ТекДвижение.СуммаУпр;
				Иначе
					НоваяСтрока.СуммаАктива = -ТекДвижение.СуммаУпр;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	// 3. Доходы и расходы.
	// Ресурс "Расходы" отражает активную часть, "Доход" - пассивную часть.
	НаборДоходыИРасходы = ОбъектДокумент.Движения.Найти("ДоходыИРасходы");
	Если НЕ НаборДоходыИРасходы = Неопределено Тогда
		Для каждого ТекДвижение Из НаборДоходыИРасходы Цикл
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ПодразделениеКомпании, ОбъектДокумент.ПодразделениеКомпании);			
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива  = ТекДвижение.РасходУпр;
				НоваяСтрока.СуммаПассива = ТекДвижение.ДоходУпр;
			Иначе
				НоваяСтрока.СуммаАктива  = - ТекДвижение.РасходУпр;
				НоваяСтрока.СуммаПассива = - ТекДвижение.ДоходУпр;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// 4. Денежные средства компании.
	// Является активом. Движения вида "Приход" увеличивают актив, "Расход" - актив уменьшают.
	НаборДенежныеСредстваКомпании = ОбъектДокумент.Движения.Найти("ДенежныеСредстваКомпании");
	Если НЕ НаборДенежныеСредстваКомпании = Неопределено Тогда
		Для каждого ТекДвижение Из НаборДенежныеСредстваКомпании Цикл
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.СтруктурнаяЕдиница.ПодразделениеКомпании, ОбъектДокумент.ПодразделениеКомпании);			
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива = ТекДвижение.СуммаУпр;
			Иначе
				НоваяСтрока.СуммаАктива = - ТекДвижение.СуммаУпр;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// 5. Касса ККМ.
	// Является активом. Движения вида "Приход" увеличивают актив, "Расход" - актив уменьшают.
	// Особенность: необходимо учитывать "способ оплаты". Только способы "Наличными" и "Безналичными" 
	// учитываются в балансе.
	НаборКассыККМ = ОбъектДокумент.Движения.Найти("КассыККМ");
	Если НЕ НаборКассыККМ = Неопределено Тогда
		СпособОплатыНаличными = Перечисления.ВидыОплат.Наличные;
		СпособОплатыБезНаличными = Перечисления.ВидыОплат.Безналичные;
		Для каждого ТекДвижение Из НаборКассыККМ Цикл
			Если (ТекДвижение.СпособОплаты.ВидОплаты = СпособОплатыНаличными) Или (ТекДвижение.СпособОплаты.ВидОплаты = СпособОплатыБезНаличными) Тогда
				НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
				НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.КассаККМ.ПодразделениеКомпании, ОбъектДокумент.ПодразделениеКомпании);			
				Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
					НоваяСтрока.СуммаАктива = ТекДвижение.СуммаУпр;
				Иначе
					НоваяСтрока.СуммаАктива = -ТекДвижение.СуммаУпр;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// 6. Партии товаров отданные.
	// Является активом. Движения вида "Приход" увеличивают актив, "Расход" - актив уменьшают.
	// Особенность: ресурсом, влияющих на баланс является "СуммаСебестоимостиУпр".
	НаборПартииТоваровОтданные = ОбъектДокумент.Движения.Найти("ПартииТоваровОтданные");
	Если НЕ НаборПартииТоваровОтданные = Неопределено Тогда
		Для каждого ТекДвижение Из НаборПартииТоваровОтданные Цикл
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ДоговорВзаиморасчетов.ПодразделениеКомпании, ОбъектДокумент.ПодразделениеКомпании);			
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива = ТекДвижение.СуммаСебестоимостиУпр;
			Иначе
				НоваяСтрока.СуммаАктива = - ТекДвижение.СуммаСебестоимостиУпр;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// 7. Реализованные товары.
	// Является пассивом. Движения вида "Приход" увеличивают пассив, "Расход" - актив уменьшают.
	НаборРеализованныеТовары = ОбъектДокумент.Движения.Найти("РеализованныеТовары");
	Если НЕ НаборРеализованныеТовары = Неопределено Тогда
		Для каждого ТекДвижение Из НаборРеализованныеТовары Цикл
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ДоговорВзаиморасчетов.ПодразделениеКомпании, ОбъектДокумент.ПодразделениеКомпании);			
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаПассива = ТекДвижение.СуммаУпр;
			Иначе
				НоваяСтрока.СуммаПассива = - ТекДвижение.СуммаУпр;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	// 8. Прочие активы в эксплуатации.
	// Является активом. Движения вида "Приход" увеличивают пассив, "Расход" - актив уменьшают.
	// Особенность: показателем, влияющим на баланс является разница ресурсов 
	// (БалансоваяСтоимостьУпрПриход-СуммаАмортизацииУпрПриход).
	НаборПрочиеАктивыВЭксплуатации = ОбъектДокумент.Движения.Найти("ПрочиеАктивыВЭксплуатации");
	Если НЕ НаборПрочиеАктивыВЭксплуатации = Неопределено Тогда
		Для каждого ТекДвижение Из НаборПрочиеАктивыВЭксплуатации Цикл
			НоваяСтрока = ТаблицаАктивовИПассивов.Добавить();
			НоваяСтрока.ПодразделениеКомпании = ?(БалансВедетсяПоПодразделениям, ТекДвижение.ПодразделениеКомпании, ОбъектДокумент.ПодразделениеКомпании);			
			ОстаточнаяСтоимость = ТекДвижение.БалансоваяСтоимостьУпр - ТекДвижение.СуммаАмортизацииУпр;
			Если ТекДвижение.ВидДвижения = ВидДвиженияНакопления.Приход Тогда
				НоваяСтрока.СуммаАктива = ОстаточнаяСтоимость;
			Иначе
				НоваяСтрока.СуммаАктива = - ОстаточнаяСтоимость;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Результат = Истина;
	
	// Сворачиваем таблицу.
	ТаблицаАктивовИПассивов.Свернуть("ПодразделениеКомпании", "СуммаАктива, СуммаПассива"); 
	
	// Если баланс ведется по подразделениям, то необходимо еще раз пройти таблицу и заменить подразделения, на 
	// соответствующие им балансовые подразделения.
	Если БалансВедетсяПоПодразделениям Тогда
		Для каждого ТекСтрока Из ТаблицаАктивовИПассивов Цикл
			ТекСтрока.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ПолучитьБалансовоеПодразделение(ТекСтрока.ПодразделениеКомпании,ОбъектДокумент.Дата);	
		КонецЦикла;
		
		// Повторно сворачиваем таблицу.
		ТаблицаАктивовИПассивов.Свернуть("ПодразделениеКомпании", "СуммаАктива, СуммаПассива"); 
	КонецЕсли;
	
	Для каждого ТекСтрока Из ТаблицаАктивовИПассивов Цикл
		
		// Сравниваем Пассив и Актив.
		Разница = ТекСтрока.СуммаАктива - ТекСтрока.СуммаПассива;
		
		Если (Разница > - 1) И (Разница < 1) Тогда
			НаборЗаписейДиР = ОбъектДокумент.Движения.ДоходыИРасходы;
			НаборЗаписейДиР.ДокументОбъект = ОбъектДокумент;
			НаборЗаписейДиР.Подразделение  = ТекСтрока.ПодразделениеКомпании;
			НаборЗаписейДиР.СтатьяДоходовИРасходов = Справочники.СтатьиДоходовИРасходов.КопейкиОтОкругленияПриПересчетах;
			НаборЗаписейДиР.ВУпрВалюте     = Истина;
			Если Разница > 0 Тогда
				// Необходимо увеличить пассив.
				НаборЗаписейДиР.Доход = Разница;
			Иначе
				// Необходимо увеличить актив.
				НаборЗаписейДиР.Расход = -Разница; 
			КонецЕсли;
			
			Результат = Результат И НаборЗаписейДиР.Приход();
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // СписаниеКопейкиПриОкругленииВалютныхСчетов() 


////////////////////////////////////////////////////////////////////////////////
// ВОССТАНОВЛЕНИЕ ПОСЛЕДОВАТЕЛЬНОСТЕЙ

// Выполняет восстановление последовательностей документов
Процедура ВосстановлениеПоследовательностей(Знач ПараметрыЗадания) Экспорт
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(
		Метаданные.РегламентныеЗадания.ВосстановлениеПоследовательностей);
	
	// Приводим параметры по типу.
	Если ТипЗнч(ПараметрыЗадания) <> Тип("Структура") Тогда
		ПараметрыЗадания = Новый Структура;
	КонецЕсли;
	
	// Проверяем свойство СписокПоследовательностей.
	Если НЕ ПараметрыЗадания.Свойство("СписокПоследовательностей")
		ИЛИ ТипЗнч(ПараметрыЗадания.СписокПоследовательностей) <> Тип("Структура") Тогда
		
		ПараметрыЗадания.Вставить("СписокПоследовательностей", Новый Структура);
		
	КонецЕсли;
	
	ПоДату = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗадания, "ПоДату", Неопределено);
	
	Если ТипЗнч(ПоДату) <> Тип("Дата") Тогда
		
		ПоДату = Неопределено;
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПоДату) Тогда
		
		ПараметрыЗадания.Вставить("ОграничениеПоДате", ПоДату);
		
	КонецЕсли;
	
	// Проверяем свойство СписокОрганизаций.
	Если НЕ ПараметрыЗадания.Свойство("СписокОрганизаций")
		ИЛИ ТипЗнч(ПараметрыЗадания.СписокОрганизаций) <> Тип("СписокЗначений") Тогда
		
		ПараметрыЗадания.Вставить("СписокОрганизаций", Новый СписокЗначений);
		
	КонецЕсли;
	
	СписокОрганизаций = Новый Массив;
	Для Каждого КлючЗначение Из ПараметрыЗадания.СписокОрганизаций Цикл
		
		Если КлючЗначение.Пометка Тогда
			
			СписокОрганизаций.Добавить(КлючЗначение.Значение);
			
		КонецЕсли;
		
	КонецЦикла;
	
	НеРегистрироватьДокументыВОбмене = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗадания, "НеРегистрироватьДокументыВОбмене", Истина);
	
	Если ТипЗнч(НеРегистрироватьДокументыВОбмене) <> Тип("Булево") Тогда
		
		НеРегистрироватьДокументыВОбмене = Истина;
		
	КонецЕсли;
	
	ПараметрыЗадания.Вставить("НеРегистрироватьДокументыВОбмене", НеРегистрироватьДокументыВОбмене);
	
	Для Каждого Строка Из ПараметрыЗадания.СписокПоследовательностей Цикл
		
		ПараметрыЗадания.СписокПоследовательностей.Вставить(Строка.Ключ,СписокОрганизаций);
		
	КонецЦикла;
	
	Обработки.ВосстановлениеПоследовательностей.Восстановить(ПараметрыЗадания);
	
КонецПроцедуры // ВосстановлениеПоследовательностей()



