
Функция НастройкиПодключения()
	Структура = Новый Структура();
	Структура.Вставить("ИмяСервиса","GetPricesOfPartners");
	Структура.Вставить("Адрес","http://wwwserv.work.local/ERP_Prodact_integ77/WS/GetPricesOfPartners.1cws?wsdl"); 
	Структура.Вставить("ИмяФункции","GetTableNotFmmr");

	Возврат(Структура);
КонецФункции

Функция НастройкиПодключенияWSHS(ИмяФункции)  Экспорт
	
	

	СтруктураПодключения = НастройкиПодключения();
	
	ИмяСервиса = "GetPricesOfPartners";
	Адрес = "http://wwwserv.work.local/ERP_Prodact_integ77/WS/GetPricesOfPartners.1cws?wsdl"; 	
	
	
	СтруктураПодключения = Новый Структура();
	СтруктураПодключения.Вставить("ИмяПользователя", "WS");
	СтруктураПодключения.Вставить("Пароль", "WS");
	СтруктураПодключения.Вставить("URIПространстваИменСервиса", "GetPricesOfPartners");
	//Цепелев  +++ 2019-08-26-03-18
	//СтруктураПодключения.Вставить("Адрес","" + "http://wwwserv.work.local/ERP_Prodact_integ77/WS/GetPricesOfPartners?wsdl");
	СтруктураПодключения.Вставить("Адрес","" + "http://wwwserv.work.local/erp_prodact_integ77/ws/GetPricesOfPartners?wsdl");
	//Цепелев  --- 2019-08-26-03-18              
	СтруктураПодключения.Вставить("ИмяСервиса","GetPricesOfPartners");
	СтруктураПодключения.Вставить("ИмяФункции",ИмяФункции);	
	СтруктураПодключения.Вставить("СерверныйРежим",2);
	
	Возврат СтруктураПодключения;
	
КонецФункции


Функция ПолучитьДанныеПоЦенамИзЕРП(ПараметрДляОтправкиНаСервер, СтруктураПодключения) Экспорт   
	Если ТипЗнч(ПараметрДляОтправкиНаСервер)= тип("HTTPСервисЗапрос") Тогда
		ПараметрДляОтправкиНаСервер = ПараметрДляОтправкиНаСервер.ПолучитьТелоКакСтроку();	
	КонецЕсли;	
	
	Если СтруктураПодключения.СерверныйРежим = 2 Тогда
		ВСОпределение = Новый WSОпределения(СтруктураПодключения.Адрес,СтруктураПодключения.ИмяПользователя,СтруктураПодключения.Пароль,300);
		ВСервис       = ВСОпределение.Сервисы.Получить(СтруктураПодключения.URIПространстваИменСервиса,СтруктураПодключения.ИмяСервиса);
		ВТочкаВхода   = ВСервис.ТочкиПодключения.Получить(СтруктураПодключения.ИмяСервиса + "Soap");
		ВОперация     = ВТочкаВхода.Интерфейс.Операции.Получить(СтруктураПодключения.ИмяФункции);    
		
		ВСПрокси = Новый WSПрокси(ВСОпределение, СтруктураПодключения.URIПространстваИменСервиса,СтруктураПодключения.ИмяСервиса,СтруктураПодключения.ИмяСервиса + "Soap"); 
		ВСПрокси.Пользователь = СтруктураПодключения.ИмяПользователя;
		ВСПрокси.Пароль = СтруктураПодключения.Пароль;
		Ответ = "";
				
		Если СтруктураПодключения.ИмяФункции = "GetPricesOfPartners" Тогда
			Ответ = ВСПрокси.GetTableNotFmmr(ПараметрДляОтправкиНаСервер.ДатаОтгрузки, ПараметрДляОтправкиНаСервер.Подразделение.МастерКлючСГП);
		КонецЕсли;		
		
		Если Ответ <> "" Тогда
			Возврат Ответ;
		КонецЕсли; 
		
	КонецЕсли; 
	

	Если СтруктураПодключения.СерверныйРежим = 3 Тогда
		HS = Новый HTTPСоединение(
		СтруктураПодключения.Адрес,,СтруктураПодключения.ИмяПользователя,СтруктураПодключения.Пароль,,
		0, // таймаут в секундах
		);
		Попытка
			HSЗапрос = Новый HTTPЗапрос;
			HSЗапрос.АдресРесурса= "/hs/" + СтруктураПодключения.ИмяСервиса + "/" + СтруктураПодключения.ИмяФункции;
			HSЗапрос.УстановитьТелоИзСтроки(ПараметрДляОтправкиНаСервер);
			Ответ = hs.ОтправитьДляОбработки(HSЗапрос);
			HS = Неопределено;
		Исключение
			Сообщить(ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
		КонецПопытки;
		Возврат Ответ;	
	КонецЕсли; 
	
КонецФункции



Функция ПолучитьТаблицуЦенЕРПНаДату(ДатаОтгрузки,ПодразделениеОтгрузки) Экспорт
	
	ПараметрыОперации = Новый Структура;
	КлючФункции = "GetPricesOfPartners";	
    ПодключениеКВебСервисуЦеныИзЕРП = НастройкиПодключенияWSHS(КлючФункции);
		
	ПараметрыОперации = Новый Структура("ДатаОтгрузки, Подразделение", ДатаОтгрузки, ПодразделениеОтгрузки);
	ХранилищеЗначенияОтвет = ПолучитьДанныеПоЦенамИзЕРП(ПараметрыОперации,  ПодключениеКВебСервисуЦеныИзЕРП);
	Результат = глДесериализовать(ХранилищеЗначенияОтвет.Получить());
	//СтруктураТаблицыВозвратаЦен
	//КустИдентификатор	""	Строка
	//КустНаименование		Null
	//НоменклатураМастерКлюч	"00-00022443"	Строка
	//НоменклатураНаименование	""Кордон Блю""	Строка
	//ПартнерМастерКлюч	"00-00039470"	Строка
	//ПартнерНаименование	"АВИАТОРОВ 14 МОСКВА / ИП ПЛАТОНОВА О В /"	Строка
	//Цена	390	Число
	Возврат Результат;
КонецФункции



