
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	// !!!_ Реализовать команду когда будет переработан отчет
	УправлениеДиалогомВызовСервера.ОбработкаДействияНеРеализована();
	
	// заполним параметры отчета
	//Отчет=Отчеты.ВнешниеПрайсЛистыКонтрагентов.Создать();
	//Отчет.ВидОтчета         = Перечисления.ВидыОтчетов.Остатки;
	//Отчет.ДатаКонца         = КонецДня(ТекущаяДата());
	//Отчет.РежимВыводаОтчета = Перечисления.РежимыВыводаОтчета.ТабличныйДокумент;
	//Отчет.РежимНастройки    = Перечисления.РежимыНастройкиОтчетов.Эксперт;
	//Отчет.ИмяФормыНастроек  = "НастройкиОстатки";
	//Отчет.ЗаполнитьНачальныеНастройки("ТекстЗапросаОстатки");
	//
	//Отчет.ВыбиратьВалюту    = Истина;
	//Отчет.ВалютаОтчета      = ТекущийДокумент.ВалютаДокумента;
	//
	//Отчет.ИзмеренияСтроки.Очистить();
	//ПолеАртикул   = Отчет.ДеревоДоступныхПолей.Строки.Найти("Артикул", "ПутьКДанным");
	//ПолеПрайсЛист = Отчет.ДеревоДоступныхПолей.Строки.Найти("ПрайсЛист", "ПутьКДанным");
	//
	// Измерение Элемент прайс-листа
	//НоваяСтрока = Отчет.ИзмеренияСтроки.Добавить();
	//НоваяСтрока.Использование = Истина;
	//НоваяСтрока.ПутьКДанным   = "Артикул";
	//НоваяСтрока.Представление = ПолеАртикул.Представление;
	//НоваяСтрока.ТипИзмерения  = "Элементы";
	//
	// Измерение Прайс-лист
	//НоваяСтрока=Отчет.ИзмеренияСтроки.Добавить();
	//НоваяСтрока.Использование = Истина;
	//НоваяСтрока.ПутьКДанным   = "ПрайсЛист";
	//НоваяСтрока.Представление = ПолеПрайсЛист.Представление;
	//НоваяСтрока.ТипИзмерения  = "Элементы";
	//
	// Расставим показатели
	//Для Каждого ОтчетПоказатель Из Отчет.Показатели Цикл
	//	ОтчетПоказатель.Использование=Истина;
	//КонецЦикла; 

	// Расставим функции
	//Для Каждого ОтчетФункция Из Отчет.Функции Цикл
	//	ОтчетФункция.Использование=Истина;
	//КонецЦикла;

	// Уберем лишние отборы
	//Для Каждого ОтчетОтбор Из Отчет.ПостроительОтчета.Отбор Цикл
	//	ОтчетОтбор.Использование=Ложь;
	//КонецЦикла;
	//
	//СписокТоваров      = Новый СписокЗначений();
	//МассивНоменклатуры = ТекущийДокумент.Товары.ВыгрузитьКолонку("Номенклатура");
	//ИмяРеквизитаКода   = "Артикул";
	//
	//Для Каждого ЭлементМассива Из МассивНоменклатуры Цикл
	//	АртикулЗначение = дкПолучитьЗначениеКолонкиКода(ЭлементМассива, ИмяРеквизитаКода,); //ЭтотОбъект);
	//	СписокТоваров.Добавить(АртикулЗначение);
	//КонецЦикла;
	//
	// Установим фильтр по заказ-наряду
	//ОтборАртикул = Отчет.ПостроительОтчета.Отбор.Найти("Артикул");
	//Если ОтборАртикул = Неопределено Тогда
	//	ОтборАртикул  = Отчет.ПостроительОтчета.Отбор.Добавить("Артикул", "Артикул", ПолеАртикул.Представление);
	//КонецЕсли;
	//ОтборАртикул.ВидСравнения  = ВидСравнения.ВСписке;
	//ОтборАртикул.Значение      = СписокТоваров;
	//ОтборАртикул.Использование = Истина;
	//
	//ФормаОтчета = ПолучитьОбщуюФорму("Отчет");
	//ФормаОтчета.ОтчетОбъект = Отчет;
	//ФормаОтчета.Заголовок   = "Наличие во внешних прайс-листах контрагентов";
	//ФормаОтчета.Открыть();
	
КонецПроцедуры
