
#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Инвентаризация = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Инвентаризация", Неопределено);
	
	ПересчитатьДанныеНаСервере();
	
	//// Условное оформление товаров заказа
	//НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваровЗаказа.Имя);
	//
	//ОтборЭлемента = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.Использование  = Истина;
	//ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваровЗаказа.Номенклатура");
	//ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	//ОтборЭлемента.ПравоеЗначение = НоменклатураИзСопоставления;
	//
	//НовоеУсловноеОформление.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 150, 0));
	//
	//// Условное оформление подобранных товаров
	//НовоеУсловноеОформление = УсловноеОформление.Элементы.Добавить();
	//
	//ПолеЭлемента = НовоеУсловноеОформление.Поля.Элементы.Добавить();
	//ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТаблицаТоваров.Имя);
	//
	//ОтборЭлемента = НовоеУсловноеОформление.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	//ОтборЭлемента.Использование  = Истина;
	//ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ТаблицаТоваров.Номенклатура");
	//ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.ВСписке;
	//ОтборЭлемента.ПравоеЗначение = НоменклатураИзСопоставления;
	//
	//НовоеУсловноеОформление.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0, 150, 0));
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Распределена", Истина);
	
	Элементы.Результат.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
	//ОтборСтрок = Новый Структура;
	//ОтборСтрок.Вставить("Распределена", Ложь);
	//
	//Элементы.Излишки.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//ПроверитьСопоставление();
	//ОтображатьСопоставленныеПриИзменении();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура НедостачаПриАктивизацииСтроки(Элемент)
	
	ОтборСтрок = Новый Структура;
	Если НЕ ОтображатьРаспределенные Тогда
		ОтборСтрок.Вставить("Распределена", Ложь);
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Недостача.ТекущиеДанные;
	Если НЕ ТекущиеДанные = Неопределено Тогда
		ОтборСтрок.Вставить("КодыГруппы", ТекущиеДанные.КодВида+",");
	КонецЕсли;
	
	Элементы.Излишки.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиРаспределенаПриИзменении(Элемент)
	
	СтрокаНедостачи = Элементы.Недостача.ТекущиеДанные;
	СтрокаИзлишки   = Элементы.Излишки.ТекущиеДанные;
	
	Если СтрокаИзлишки.Распределена Тогда
		
		Если СтрокаНедостачи = Неопределено Тогда
			СтрокаИзлишки.Распределена = Ложь;
			Возврат;
		КонецЕсли;
		
		КоличествоРаспределено = СтрокаИзлишки.Количество;
		Если СтрокаИзлишки.Количество > СтрокаНедостачи.Количество Тогда
			НоваяСтрока = Излишки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИзлишки);
			НоваяСтрока.Количество   = СтрокаИзлишки.Количество - СтрокаНедостачи.Количество;
			НоваяСтрока.Распределена = Ложь;
			КоличествоРаспределено = СтрокаНедостачи.Количество;
			СтрокаИзлишки.Количество = СтрокаИзлишки.Количество - НоваяСтрока.Количество;
		КонецЕсли;
		
		СтрокаНедостачи.Количество = СтрокаНедостачи.Количество - КоличествоРаспределено;
		СтрокаНедостачи.КоличествоРаспределено = СтрокаНедостачи.КоличествоРаспределено + КоличествоРаспределено;
		СтрокаНедостачи.Распределена = (СтрокаНедостачи.Количество=0);
		//Если СтрокаИзлишки.Количество < СтрокаНедостачи.Количество Тогда
		//	ДопСтрока = Недостача.Добавить();
		//	ЗаполнитьЗначенияСвойств(ДопСтрока, СтрокаНедостачи);
		//	ДопСтрока.Количество       = СтрокаНедостачи.Количество-СтрокаИзлишки.Количество;
		//	ДопСтрока.Распределена     = Ложь;
		//	СтрокаНедостачи.Количество = СтрокаИзлишки.Количество;
		//КонецЕсли;
		
		//СтрокаНедостачи.Распределена = Истина;
		
		СтрокаИзлишки.ИдентификаторНедостачи     = СтрокаНедостачи.ИдентификаторСтроки;
		СтрокаИзлишки.АлкогольнаяПродукцияПриход = СтрокаНедостачи.АлкогольнаяПродукция;
		СтрокаИзлишки.ВидПродукцииПриход         = СтрокаНедостачи.ВидПродукции;
		СтрокаИзлишки.Распределена = Истина;
		
	Иначе
		
		ОтборСтрок = Новый Структура("ИдентификаторСтроки", СтрокаИзлишки.ИдентификаторНедостачи);
		СтрокиНедостачи = Недостача.НайтиСтроки(ОтборСтрок);
		
		Для Каждого СтрокаНедостачи Из СтрокиНедостачи Цикл
			СтрокаНедостачи.Количество = СтрокаНедостачи.Количество + СтрокаИзлишки.Количество;
			СтрокаНедостачи.КоличествоРаспределено = СтрокаНедостачи.КоличествоРаспределено - СтрокаИзлишки.Количество;
			СтрокаНедостачи.Распределена = (СтрокаНедостачи.Количество=0);
		КонецЦикла;
		
		ОтборСтрок = Новый Структура("ИдентификаторСтроки, Распределена", СтрокаИзлишки.ИдентификаторСтроки, Ложь);
		СтрокиДляОбъединения = Излишки.НайтиСтроки(ОтборСтрок);
		
		ИтоговаяСтрока = Неопределено;
		Для Каждого ТекущаяСтрока Из СтрокиДляОбъединения Цикл
			
			ТекущаяСтрока.ИдентификаторНедостачи     = "";
			ТекущаяСтрока.АлкогольнаяПродукцияПриход = Неопределено;
			ТекущаяСтрока.ВидПродукцииПриход         = Неопределено;
			
			Если ИтоговаяСтрока = Неопределено Тогда
				ИтоговаяСтрока = ТекущаяСтрока;
				Продолжить;
			КонецЕсли;
			
			ИтоговаяСтрока.Количество = ИтоговаяСтрока.Количество + ТекущаяСтрока.Количество;
			
			Излишки.Удалить(ТекущаяСтрока);
			
		КонецЦикла;
		
	КонецЕсли;
	
	ОбновитьОтборРаспределенных();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатРаспределенаПриИзменении(Элемент)
	
	СтрокаИзлишки   = Элементы.Результат.ТекущиеДанные;
	
	ОтборСтрок = Новый Структура("ИдентификаторСтроки", СтрокаИзлишки.ИдентификаторНедостачи);
	СтрокиНедостачи = Недостача.НайтиСтроки(ОтборСтрок);
	
	Для Каждого СтрокаНедостачи Из СтрокиНедостачи Цикл
		СтрокаНедостачи.Количество = СтрокаНедостачи.Количество + СтрокаИзлишки.Количество;
		СтрокаНедостачи.КоличествоРаспределено = СтрокаНедостачи.КоличествоРаспределено - СтрокаИзлишки.Количество;
		СтрокаНедостачи.Распределена = (СтрокаНедостачи.Количество=0);
	КонецЦикла;
	
	ОтборСтрок = Новый Структура("ИдентификаторСтроки, Распределена", СтрокаИзлишки.ИдентификаторСтроки, Ложь);
	СтрокиДляОбъединения = Излишки.НайтиСтроки(ОтборСтрок);
	
	ИтоговаяСтрока = Неопределено;
	Для Каждого ТекущаяСтрока Из СтрокиДляОбъединения Цикл
		
		ТекущаяСтрока.ИдентификаторНедостачи     = "";
		ТекущаяСтрока.АлкогольнаяПродукцияПриход = Неопределено;
		ТекущаяСтрока.ВидПродукцииПриход         = Неопределено;
		
		Если ИтоговаяСтрока = Неопределено Тогда
			ИтоговаяСтрока = ТекущаяСтрока;
			Продолжить;
		КонецЕсли;
		
		ИтоговаяСтрока.Количество = ИтоговаяСтрока.Количество + ТекущаяСтрока.Количество;
		
		Излишки.Удалить(ТекущаяСтрока);
		
	КонецЦикла;
	
	ОтборСтрок = Новый Структура;
	ОтборСтрок.Вставить("Распределена", Истина);
	
	Элементы.Результат.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	ОбновитьОтборРаспределенных();
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

Процедура СформироватьПересортицы()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Недостача", Недостача.Выгрузить());
	Запрос.УстановитьПараметр("Излишки",   Излишки.Выгрузить());
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Излишки.АлкогольнаяПродукцияРасход КАК АлкогольнаяПродукцияРасход,
	|	Излишки.АлкогольнаяПродукцияПриход КАК АлкогольнаяПродукцияПриход,
	|	Излишки.ВидПродукцииПриход КАК ВидПродукцииПриход,
	|	Излишки.ВидПродукцииРасход КАК ВидПродукцииРасход,
	|	Излишки.Количество КАК Количество,
	|	Излишки.ИдентификаторСтроки КАК ИдентификаторСтрокиРасход,
	|	Излишки.ИдентификаторНедостачи КАК ИдентификаторСтрокиПриход
	|ПОМЕСТИТЬ
	|	Излишки
	|ИЗ
	|	&Излишки КАК Излишки
	|ГДЕ
	|	Излишки.Распределена = ИСТИНА
	|;
	|
	|ВЫБРАТЬ
	|	Излишки.АлкогольнаяПродукцияРасход КАК АлкогольнаяПродукцияРасход,
	|	Излишки.АлкогольнаяПродукцияПриход КАК АлкогольнаяПродукцияПриход,
	|	Излишки.ВидПродукцииПриход КАК ВидПродукцииПриход,
	|	Излишки.ВидПродукцииРасход КАК ВидПродукцииРасход,
	|	Излишки.Количество КАК Количество,
	|	Излишки.ИдентификаторСтрокиРасход,
	|	Излишки.ИдентификаторСтрокиПриход
	|ИЗ
	|	Излишки КАК Излишки
	|ИТОГИ
	|ПО
	|	ВидПродукцииПриход,
	|	ВидПродукцииРасход
	|";
	
	ПричинаСписания               = Перечисления.ПричиныСписанияЕГАИС.Пересортица;
	ПричинаПостановкиНаБаланс     = Перечисления.ПричиныПостановкиНаБалансЕГАИС.Пересортица;
	ХозОперацияАктСписанияЕГАИС   = Справочники.ХозОперации.АктСписанияСТорговогоЗалаЕГАИС;
	ХозОперацияАктПостановкиЕГАИС = Справочники.ХозОперации.АктПостановкиНаБалансВТорговыйЗалЕГАИС;
	ОрганизацияЕГАИС              = Инвентаризация.ОрганизацияЕГАИС;
	
	ОрганизацияИПодразделение = Справочники.КлассификаторОрганизацийЕГАИС.НайтиОрганизациюИПодразделение(ОрганизацияЕГАИС.ИНН, ОрганизацияЕГАИС.КПП, ОрганизацияЕГАИС);
	
	ВыборкаВидПродукцииПриход = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидПродукцииПриход.Следующий() Цикл
		ВыборкаВидПродукцииРасход = ВыборкаВидПродукцииПриход.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВидПродукцииРасход.Следующий() Цикл
			
			АктСписанияЕГАИС = Документы.АктСписанияЕГАИС.СоздатьДокумент();
			АктСписанияЕГАИС.Заполнить(Неопределено);
			АктСписанияЕГАИС.ПричинаСписания   = ПричинаСписания;
			АктСписанияЕГАИС.ХозОперация       = ХозОперацияАктСписанияЕГАИС;
			АктСписанияЕГАИС.ДокументОснование = Инвентаризация;
			АктСписанияЕГАИС.ОрганизацияЕГАИС  = ОрганизацияЕГАИС;
			АктСписанияЕГАИС.Товары.Очистить();
			АктСписанияЕГАИС.Марки.Очистить();
			
			АктСписанияЕГАИС.Организация           = ОрганизацияИПодразделение.Организация;
			Документы.АктСписанияЕГАИС.ОрганизацияПриИзменении(АктСписанияЕГАИС);
			АктСписанияЕГАИС.ПодразделениеКомпании = ОрганизацияИПодразделение.ПодразделениеКомпании;
			Документы.АктСписанияЕГАИС.ПодразделениеКомпанииПриИзменении(АктСписанияЕГАИС);
			
			АктПостановкиНаБалансЕГАИС = Документы.АктПостановкиНаБалансЕГАИС.СоздатьДокумент();
			АктПостановкиНаБалансЕГАИС.Заполнить(Неопределено);
			АктПостановкиНаБалансЕГАИС.ПричинаПостановкиНаБаланс = ПричинаПостановкиНаБаланс;
			АктПостановкиНаБалансЕГАИС.ХозОперация       = ХозОперацияАктПостановкиЕГАИС;
			АктПостановкиНаБалансЕГАИС.ДокументОснование = Инвентаризация;
			АктПостановкиНаБалансЕГАИС.ОрганизацияЕГАИС  = ОрганизацияЕГАИС;
			АктПостановкиНаБалансЕГАИС.Товары.Очистить();
			АктПостановкиНаБалансЕГАИС.Марки.Очистить();
			
			АктПостановкиНаБалансЕГАИС.Организация           = ОрганизацияИПодразделение.Организация;
			Документы.АктПостановкиНаБалансЕГАИС.ОрганизацияПриИзменении(АктПостановкиНаБалансЕГАИС);
			АктПостановкиНаБалансЕГАИС.ПодразделениеКомпании = ОрганизацияИПодразделение.ПодразделениеКомпании;
			Документы.АктПостановкиНаБалансЕГАИС.ПодразделениеКомпанииПриИзменении(АктПостановкиНаБалансЕГАИС);
			
			Выборка = ВыборкаВидПродукцииРасход.Выбрать();
			Пока Выборка.Следующий() Цикл
				СтрокаСписания = АктСписанияЕГАИС.Товары.Найти(Выборка.ИдентификаторСтрокиРасход, "ИдентификаторСтроки");
				Если СтрокаСписания = Неопределено Тогда
					СтрокаСписания = АктСписанияЕГАИС.Товары.Добавить();
					СтрокаСписания.ИдентификаторСтроки  = Выборка.ИдентификаторСтрокиРасход;
					СтрокаСписания.АлкогольнаяПродукция = Выборка.АлкогольнаяПродукцияРасход;
				КонецЕсли;
				СтрокаСписания.Количество = СтрокаСписания.Количество + Выборка.Количество;
				
				
				СтрокаПостановки = АктПостановкиНаБалансЕГАИС.Товары.Найти(Выборка.ИдентификаторСтрокиПриход, "ИдентификаторСтроки");
				Если СтрокаПостановки = Неопределено Тогда
					СтрокаПостановки = АктПостановкиНаБалансЕГАИС.Товары.Добавить();
					СтрокаПостановки.АлкогольнаяПродукция = Выборка.АлкогольнаяПродукцияПриход;
					СтрокаПостановки.ИдентификаторСтроки  = Выборка.ИдентификаторСтрокиПриход;
				КонецЕсли;
				СтрокаПостановки.Количество = СтрокаПостановки.Количество + Выборка.Количество;
			КонецЦикла;
			
			Если АктСписанияЕГАИС.Товары.Количество() > 0 Тогда
				АктСписанияЕГАИС.Записать(РежимЗаписиДокумента.Проведение);
				
				//ДальнейшееДействие = Перечисления.ДальнейшиеДействияЕГАИС.ПередайтеДанные;
				//ДанныеДляВыполненияОбменаНаКлиенте = ИнтеграцияЕГАИСВызовСервера.ПодготовитьКПередаче(АктСписанияЕГАИС.Ссылка, ДальнейшееДействие);
				
				АктПостановкиНаБалансЕГАИС.АктСписания = АктСписанияЕГАИС.Ссылка;
				//АктПостановкиНаБалансЕГАИС.НомерАктаСписания = АктСписанияЕГАИС.
				АктПостановкиНаБалансЕГАИС.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	СформироватьПересортицы();
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьСтрокуНедостачи(СтрокаНедостачи, СтрокаИзлишки)
	
	КоличествоРаспределено = СтрокаИзлишки.Количество;
	Если СтрокаИзлишки.Количество > СтрокаНедостачи.Количество Тогда
		НоваяСтрока = Излишки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИзлишки);
		НоваяСтрока.Количество   = СтрокаИзлишки.Количество - СтрокаНедостачи.Количество;
		НоваяСтрока.Распределена = Ложь;
		КоличествоРаспределено = СтрокаНедостачи.Количество;
		СтрокаИзлишки.Количество = СтрокаИзлишки.Количество - НоваяСтрока.Количество;
	КонецЕсли;
	
	СтрокаНедостачи.Количество = СтрокаНедостачи.Количество - КоличествоРаспределено;
	СтрокаНедостачи.КоличествоРаспределено = СтрокаНедостачи.КоличествоРаспределено + КоличествоРаспределено;
	СтрокаНедостачи.Распределена = (СтрокаНедостачи.Количество=0);
	
	СтрокаИзлишки.ИдентификаторНедостачи     = СтрокаНедостачи.ИдентификаторСтроки;
	СтрокаИзлишки.АлкогольнаяПродукцияПриход = СтрокаНедостачи.АлкогольнаяПродукция;
	СтрокаИзлишки.ВидПродукцииПриход         = СтрокаНедостачи.ВидПродукции;
	СтрокаИзлишки.Распределена = Истина;
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьСтроки()
	
	ТабНедостача = Недостача.Выгрузить(,"ВидПродукции, Распределена");
	ТабНедостача.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(5)));
	Номер = 0;
	Для Каждого ТекущаяСтрока Из ТабНедостача Цикл
		ТекущаяСтрока.НомерСтроки = Номер;
		Номер = Номер + 1;
	КонецЦикла;
	
	ТабИзлишки = Излишки.Выгрузить(, "ВидПродукцииРасход,Распределена,ИдентификаторСтроки");
	ТабИзлишки.Колонки.Добавить("НомерСтроки", Новый ОписаниеТипов("Число",,,Новый КвалификаторыЧисла(5)));
	Номер = 0;
	Для Каждого ТекущаяСтрока Из ТабИзлишки Цикл
		ТекущаяСтрока.НомерСтроки = Номер;
		Номер = Номер + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Недостача", ТабНедостача);
	Запрос.УстановитьПараметр("Излишки",   ТабИзлишки);
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Излишки.ВидПродукцииРасход КАК ВидПродукции,
	|	Излишки.НомерСтроки КАК ИндексСтроки,
	|	Излишки.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ
	|	Излишки
	|ИЗ
	|	&Излишки КАК Излишки
	|ГДЕ
	|	Излишки.Распределена = ЛОЖЬ
	|;
	|
	|ВЫБРАТЬ
	|	Недостача.ВидПродукции,
	|	Недостача.НомерСтроки КАК ИндексСтроки
	|ПОМЕСТИТЬ
	|	Недостача
	|ИЗ
	|	&Недостача КАК Недостача
	|ГДЕ
	|	Недостача.Распределена = ЛОЖЬ
	|;
	|
	|
	|ВЫБРАТЬ
	|	Недостача.ВидПродукции КАК ВидПродукции,
	|	Недостача.ИндексСтроки КАК ИндексСтроки,
	|	ГруппыПересортаПродукции.Группа
	|ПОМЕСТИТЬ
	|	НедостачиРазбитыеПоГруппам
	|ИЗ
	|	Недостача КАК Недостача
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ВидыАлкогольнойПродукции.ГруппыПересортаПродукции КАК ГруппыПересортаПродукции
	|ПО
	|	Недостача.ВидПродукции = ГруппыПересортаПродукции.Ссылка
	|;
	|
	|УНИЧТОЖИТЬ
	|	Недостача
	|;
	|
	|ВЫБРАТЬ
	|	ГруппыНедостачи.ВидПродукции КАК ВидПродукции,
	|	ГруппыНедостачи.ИндексСтроки КАК ИндексСтроки,
	|	ГруппыПересортаПродукции.Ссылка КАК ДоступныйВидПродукции
	|ПОМЕСТИТЬ
	|	НедостачиРазбитыеПоВидам
	|ИЗ
	|	НедостачиРазбитыеПоГруппам КАК ГруппыНедостачи
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Справочник.ВидыАлкогольнойПродукции.ГруппыПересортаПродукции КАК ГруппыПересортаПродукции
	|ПО
	|	ГруппыНедостачи.Группа = ГруппыПересортаПродукции.Группа
	|;
	|
	|УНИЧТОЖИТЬ
	|	НедостачиРазбитыеПоГруппам
	|;
	|
	|ВЫБРАТЬ
	|	Недостачи.ИндексСтроки КАК ИндексСтроки,
	|	Излишки.ИндексСтроки КАК ИндексСтрокиИзлишков,
	|	Излишки.ИдентификаторСтроки КАК ИдентификаторСтрокиИзлишков
	|ИЗ
	|	НедостачиРазбитыеПоВидам КАК Недостачи
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	Излишки КАК Излишки
	|ПО
	|	Недостачи.ДоступныйВидПродукции = Излишки.ВидПродукции
	|ИТОГИ
	|ПО
	|	ИндексСтроки
	|";
	
	ВыборкаНедостачи = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаНедостачи.Следующий() Цикл
		СтрокаНедостачи = Недостача.НайтиПоИдентификатору(ВыборкаНедостачи.ИндексСтроки);
		Если СтрокаНедостачи = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаНедостачи.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Выборка = ВыборкаНедостачи.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			Если СтрокаНедостачи.Количество = 0 Тогда
				Прервать;
			КонецЕсли;
			
			СтрокаИзлишки = Излишки.НайтиПоИдентификатору(Выборка.ИндексСтрокиИзлишков);
			Если СтрокаИзлишки = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаИзлишки.Распределена Тогда
				ОтборСтрок = Новый Структура("ИдентификаторСтроки, Распределена", Выборка.ИдентификаторСтрокиИзлишков, Ложь);
				НеРаспределенныеСтроки = Излишки.НайтиСтроки(ОтборСтрок);
				Для Каждого ТекущаяСтрока Из НеРаспределенныеСтроки Цикл
					Если СтрокаНедостачи.Количество = 0 Тогда
						Прервать;
					КонецЕсли;
					РаспределитьСтрокуНедостачи(СтрокаНедостачи, ТекущаяСтрока);
				КонецЦикла;
			Иначе
				РаспределитьСтрокуНедостачи(СтрокаНедостачи, СтрокаИзлишки);
			КонецЕсли;
			
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРаспределить(Команда)
	
	РаспределитьСтроки();
	ОбновитьОтборРаспределенных();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтборРаспределенных()
	
	Если ОтображатьРаспределенные Тогда
		
		Элементы.Недостача.ОтборСтрок = Неопределено;
		
	Иначе
		
		ОтборСтрок = Новый Структура;
		ОтборСтрок.Вставить("Распределена", Ложь);
		
		Элементы.Недостача.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
		
	КонецЕсли;
	
	ОтборСтрок = Новый Структура;
	Если НЕ ОтображатьРаспределенные Тогда
		ОтборСтрок.Вставить("Распределена", Ложь);
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Недостача.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		ОтборСтрок.Вставить("КодыГруппы", "--");
	Иначе
		ОтборСтрок.Вставить("КодыГруппы", ТекущиеДанные.КодВида+",");
	КонецЕсли;
	
	Элементы.Излишки.ОтборСтрок = Новый ФиксированнаяСтруктура(ОтборСтрок);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьРаспределенныеПриИзменении(Элемент)
	
	ОбновитьОтборРаспределенных();
	
КонецПроцедуры

&НаСервере
Процедура ПересчитатьДанныеНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Инвентаризация", Инвентаризация);
	Запрос.УстановитьПараметр("ДатаДокумента",  Новый Граница(Инвентаризация.МоментВремени(), ВидГраницы.Исключая));
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ГруппыПересортаПродукции.Ссылка КАК ВидПродукции,
	|	ГруппыПересортаПродукции.Ссылка.Код КАК КодВида,
	|	ГруппыПересортаПродукции.Группа
	|ПОМЕСТИТЬ
	|	ГруппыПересорта
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции.ГруппыПересортаПродукции КАК ГруппыПересортаПродукции
	|ГДЕ
	|	ГруппыПересортаПродукции.Ссылка.ПометкаУдаления = ЛОЖЬ
	|;
	|
	|ВЫБРАТЬ
	|	ГруппыПересорта.Группа КАК Группа,
	|	ГруппыПересорта.ВидПродукции КАК ВидПродукции,
	|	ГруппыПересортаПродукции.КодВида КАК КодВида
	|ИЗ
	|	ГруппыПересорта КАК ГруппыПересорта
	|ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|	ГруппыПересорта КАК ГруппыПересортаПродукции
	|ПО
	|	ГруппыПересорта.Группа = ГруппыПересортаПродукции.Группа
	|ИТОГИ ПО
	|	ВидПродукции
	|";
	
	ДоступныеВиды = Новый Соответствие;
	ДоступныеГруппы = Новый Соответствие;
	
	ВыборкаВидПродукции = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаВидПродукции.Следующий() Цикл
		//ВидыГруппы = Новый Массив;
		КодыГруппы = "";
		Группы = "";
		МассивГрупп = Новый Массив;
		Выборка = ВыборкаВидПродукции.Выбрать();
		Пока Выборка.Следующий() Цикл
			КодыГруппы = КодыГруппы + Выборка.КодВида + ",";
			Если МассивГрупп.Найти(Выборка.Группа) = Неопределено Тогда
				МассивГрупп.Добавить(Выборка.Группа);
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого ТекГр Из МассивГрупп Цикл
			Группы = Группы + ТекГр + ",";
		КонецЦикла;
		
		ДоступныеВиды.Вставить(ВыборкаВидПродукции.ВидПродукции, КодыГруппы);
		ДоступныеГруппы.Вставить(ВыборкаВидПродукции.ВидПродукции, Группы);
	КонецЦикла;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары.АлкогольнаяПродукция.ВидПродукции КАК ВидПродукции,
	|	ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары.АлкогольнаяПродукция.ВидПродукции.Код КАК КодВида,
	|	ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары.Справка2,
	|	(ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары.КоличествоФакт) КАК КоличествоФакт,
	|	ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	(ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары.КоличествоКнижн) КАК КоличествоКнижн
	|ПОМЕСТИТЬ
	|	ТаблицаТоваров
	|ИЗ
	|	Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Товары КАК ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары
	|ГДЕ
	|	ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары.Ссылка = &Инвентаризация И 
	|	(ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары.Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка) ИЛИ 
	|	(ИнвентаризацияАлкогольнойПродукцииЕГАИСТовары.Справка2.ПоштучныйУчет = ЛОЖЬ) )
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	МАКСИМУМ(ТаблицаТоваров.ВидПродукции) КАК ВидПродукции,
	|	МАКСИМУМ(ТаблицаТоваров.КодВида) КАК КодВида,
	|	СУММА(ТаблицаТоваров.КоличествоКнижн) КАК КоличествоКнижн,
	|	СУММА(ТаблицаТоваров.КоличествоФакт) КАК КоличествоФакт,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
	|ПОМЕСТИТЬ
	|	ТаблицаПартионныхТоваров
	|ИЗ
	|	ТаблицаТоваров КАК ТаблицаТоваров
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрНакопления.ОстаткиМарокЕГАИС.Остатки(&ДатаДокумента, Справка2 В (ВЫБРАТЬ Справка2 ИЗ ТаблицаТоваров ГДЕ (НЕ Справка2 = ЗНАЧЕНИЕ(Справочник.Справки2ЕГАИС.ПустаяСсылка)))) КАК ОстаткиМарокЕГАИС
	|ПО
	|	ТаблицаТоваров.Справка2 = ОстаткиМарокЕГАИС.Справка2
	|ГДЕ
	|	ОстаткиМарокЕГАИС.Справка2 ЕСТЬ NULL
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаТоваров.АлкогольнаяПродукция,
	|	ТаблицаТоваров.ИдентификаторСтроки
	|;
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	МАКСИМУМ(ВложенныйЗапрос.ВидПродукции) КАК ВидПродукции,
	|	МАКСИМУМ(ВложенныйЗапрос.КодВида) КАК КодВида,
	|	СУММА(ВложенныйЗапрос.КоличествоФакт)-СУММА(ВложенныйЗапрос.КоличествоКнижн) КАК КоличествоНедостача,
	|	СУММА(ВложенныйЗапрос.КоличествоКнижн)-СУММА(ВложенныйЗапрос.КоличествоФакт) КАК КоличествоИзлишки,
	|	СУММА(ВложенныйЗапрос.КоличествоФакт) КАК КоличествоФакт,
	|	ВложенныйЗапрос.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ВЫБОР
	|		КОГДА СУММА(ВложенныйЗапрос.КоличествоФакт)>0 ТОГДА
	|			ИСТИНА
	|		ИНАЧЕ
	|			ЛОЖЬ
	|	КОНЕЦ КАК ЕстьФакт
	|ПОМЕСТИТЬ
	|	ТаблицаНемаркированныхТоваров
	|ИЗ
	|	(ВЫБРАТЬ
	|		ТаблицаТоваров.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|		ТаблицаТоваров.ВидПродукции КАК ВидПродукции,
	|		ТаблицаТоваров.КодВида КАК КодВида,
	|		ТаблицаТоваров.КоличествоКнижн КАК КоличествоКнижн,
	|		ТаблицаТоваров.КоличествоФакт КАК КоличествоФакт,
	|		ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
	|	ИЗ
	|		ТаблицаПартионныхТоваров КАК ТаблицаТоваров
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		ТаблицаТоваров.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|		МАКСИМУМ(ТаблицаТоваров.ВидПродукции) КАК ВидПродукции,
	|		МАКСИМУМ(ТаблицаТоваров.КодВида) КАК КодВида,
	|		0 КАК КоличествоКнижн,
	|		-КОЛИЧЕСТВО(ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки) КАК КоличествоФакт,
	|		ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки
	|	ИЗ
	|		ТаблицаПартионныхТоваров КАК ТаблицаТоваров
	|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ
	|		Документ.ИнвентаризацияАлкогольнойПродукцииЕГАИС.Марки КАК ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки
	|	ПО
	|		ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.Ссылка = &Инвентаризация И 
	|		ТаблицаТоваров.ИдентификаторСтроки = ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.ИдентификаторСтроки И 
	|		(НЕ ВЫРАЗИТЬ(ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки КАК Строка(68)) = ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки)
	|	ГДЕ
	|		ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.Ссылка = &Инвентаризация
	|	СГРУППИРОВАТЬ ПО
	|		ТаблицаТоваров.АлкогольнаяПродукция,
	|		ТаблицаТоваров.ИдентификаторСтроки
	|	ИМЕЮЩИЕ
	|		КОЛИЧЕСТВО(ИнвентаризацияАлкогольнойПродукцииЕГАИСМарки.КодМарки)>0) КАК ВложенныйЗапрос
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.АлкогольнаяПродукция,
	|	ВложенныйЗапрос.ИдентификаторСтроки
	|ИМЕЮЩИЕ
	|	(НЕ (СУММА(ВложенныйЗапрос.КоличествоФакт)-СУММА(ВложенныйЗапрос.КоличествоКнижн))=0)
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.АлкогольнаяПродукция КАК АлкогольнаяПродукция,
	|	ТаблицаТоваров.ВидПродукции КАК ВидПродукции,
	|	ТаблицаТоваров.КодВида КАК КодВида,
	|	ТаблицаТоваров.КоличествоНедостача КАК Количество,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаТоваров.КоличествоФакт КАК КоличествоФакт,
	|	ТаблицаТоваров.ЕстьФакт КАК ЕстьФакт
	|ИЗ
	|	ТаблицаНемаркированныхТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоНедостача > 0
	|;
	|
	|ВЫБРАТЬ
	|	ТаблицаТоваров.АлкогольнаяПродукция КАК АлкогольнаяПродукцияРасход,
	|	ТаблицаТоваров.ВидПродукции КАК ВидПродукцииРасход,
	|	ТаблицаТоваров.КодВида КАК КодВида,
	|	ТаблицаТоваров.КоличествоИзлишки КАК Количество,
	|	ТаблицаТоваров.ИдентификаторСтроки КАК ИдентификаторСтроки,
	|	ТаблицаТоваров.КоличествоФакт КАК КоличествоФакт,
	|	ТаблицаТоваров.ЕстьФакт КАК ЕстьФакт
	|ИЗ
	|	ТаблицаНемаркированныхТоваров КАК ТаблицаТоваров
	|ГДЕ
	|	ТаблицаТоваров.КоличествоИзлишки > 0
	|";
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	РезультатНедостача = ПакетЗапросов[ПакетЗапросов.Количество()-2];
	РезультатИзлишки   = ПакетЗапросов[ПакетЗапросов.Количество()-1];
	
	Недостача.Очистить();
	Выборка = РезультатНедостача.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Недостача.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Группы = ДоступныеГруппы.Получить(Выборка.ВидПродукции);
		НоваяСтрока.Группы = Группы;
	КонецЦикла;
	
	Излишки.Очистить();
	Выборка = РезультатИзлишки.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Излишки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		КодыГруппы = ДоступныеВиды.Получить(Выборка.ВидПродукцииРасход);
		НоваяСтрока.КодыГруппы = КодыГруппы;
		Группы = ДоступныеГруппы.Получить(Выборка.ВидПродукцииРасход);
		НоваяСтрока.Группы = Группы;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьДанные(Команда)
	
	ПересчитатьДанныеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатАлкогольнаяПродукцияРасходНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РезультатАлкогольнаяПродукцияПриходНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ИзлишкиАлкогольнаяПродукцияРасходНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура НедостачаАлкогольнаяПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти
