
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Попытка
		ЗначениеВДанныеФормы(ЗначениеИзСтрокиВнутр(Параметры.Расшифровка), ТаблицаЗначений);
	Исключение
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаЗначенийПередНачаломИзменения(Элемент, Отказ)
	
	Попытка
		ФормаТаблицыЗначений = ПолучитьФорму("Справочник.НСИИсторияИзмененияОбъектов.Форма.ФормаТаблицыЗначений");
		ФормаТаблицыЗначений.Параметры.Расшифровка = Элемент.ТекущиеДанные[Элемент.ТекущаяКолонка.Данные];
		ФормаТаблицыЗначений.Параметры.КлючУникальности = Новый УникальныйИдентификатор();
		ФормаТаблицыЗначений.Открыть();
	Исключение
	КонецПопытки;
	
КонецПроцедуры
