////////////////////////////////////////////////////////////////////////////////
// Модуль формы ДополнительныеРеквизитыНоменклатуры:
// Служит для заполнения дополнительных параметров номенклатуры
// в разрезе подразделений компании.
////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ Параметры.Свойство("Номенклатура") Тогда
		Отказ = Истина;
	КонецЕсли;
	
	Номенклатура = Параметры.Номенклатура;
	ЗаполнитьРеквизитыНоменклатуры();
	ЗагрузитьЗамены();
	
	ПравоДоступаИзменение = ПравоДоступа("Изменение", Метаданные.РегистрыСведений.Замены);
	Элементы.ДобавитьЗамену.Видимость = ПравоДоступаИзменение;
	Элементы.УдалитьЗамену.Видимость  = ПравоДоступаИзменение;
	
КонецПроцедуры // ПриСозданииНаСервере()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеДиалогомНаКлиенте(Элементы.ГруппаЗаменыЗаменители.ТекущаяСтраница.Имя);
	
КонецПроцедуры // ПриОткрытии()

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ГруппаЗаменыЗаменителиПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	УправлениеДиалогомНаКлиенте(ТекущаяСтраница.Имя);
	
КонецПроцедуры //ГруппаЗаменыЗаменителиПриСменеСтраницы()

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ДобавитьЗамену(Команда)
	
	// Сформируем параметры
	ПараметрыФормы = Новый Структура;
	Если Элементы.ГруппаЗаменыЗаменители.ТекущаяСтраница.Имя = "СтраницаЗаменители" Тогда
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("Артикул", Артикул));
	Иначе
		ПараметрыФормы.Вставить("ЗначенияЗаполнения", Новый Структура("АртикулЗамены", Артикул));
	КонецЕсли;
	
	ОбработчикОповещения = Новый ОписаниеОповещения("Подключаемый_ОбработкаРезультатаДобавленияЗаменыНоменклатуры",
		ЭтотОбъект);
	
	ОткрытьФорму("РегистрСведений.Замены.ФормаЗаписи",
		ПараметрыФормы,
		ЭтотОбъект,
		,,,
		ОбработчикОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры // ДобавитьЗамену()

&НаСервереБезКонтекста
Процедура УдалитьЗаменуНаСервере(Параметры)
	
	Если Параметры = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи               = РегистрыСведений.Замены.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Артикул       = Параметры.Артикул;
	МенеджерЗаписи.АртикулЗамены = Параметры.АртикулЗамены;
	МенеджерЗаписи.Производитель = Параметры.Производитель;
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры // УдалитьЗаменуНаСервере()

&НаКлиенте
Процедура УдалитьЗамену(Команда)
	
	ДополнительныеПараметры = Новый Структура;
	
	Если Элементы.ГруппаЗаменыЗаменители.ТекущаяСтраница.Имя = "СтраницаЗаменители" Тогда
		
		Данные = Элементы.ТаблицаЗаменНовые.ТекущиеДанные;
		Если Данные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДополнительныеПараметры.Вставить("Артикул",       Артикул);
		ДополнительныеПараметры.Вставить("АртикулЗамены", Данные.Артикул);
		ДополнительныеПараметры.Вставить("Производитель", Данные.Производитель);
		
	Иначе
		
		Данные = Элементы.ТаблицаЗаменСтарые.ТекущиеДанные;
		Если Данные = Неопределено Тогда
			Возврат;
		КонецЕсли;
		ДополнительныеПараметры.Вставить("Артикул",       Данные.Артикул);
		ДополнительныеПараметры.Вставить("АртикулЗамены", Артикул);
		ДополнительныеПараметры.Вставить("Производитель", Данные.Производитель);
		
	КонецЕсли;
	
	УдалитьЗаменуНаСервере(ДополнительныеПараметры);
	
	ЗагрузитьЗамены();
	
	УправлениеДиалогомНаКлиенте(Элементы.ГруппаЗаменыЗаменители.ТекущаяСтраница.Имя);
	
КонецПроцедуры // УдалитьЗамену()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗагрузитьЗамены()
	
	ЗаменыСтарые.Очистить();
	ЗаменыНовые.Очистить();
	
	ТаблицаЗамен = Справочники.Номенклатура.ПолучитьТаблицуЗамен(Номенклатура, Артикул, Производитель);
	ЗаменыСтарые.Загрузить(Справочники.Номенклатура.ПолучитьЗаменыНоменклатуры(Ложь, ТаблицаЗамен));
	ЗаменыНовые.Загрузить(Справочники.Номенклатура.ПолучитьЗаменыНоменклатуры(Истина, ТаблицаЗамен));
	
	// Заполним номера строк в ТЧ
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ЗаменыСтарые Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	НомерСтроки = 1;
	Для Каждого ТекущаяСтрока Из ЗаменыНовые Цикл
		ТекущаяСтрока.НомерСтроки = НомерСтроки;
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;
	
КонецПроцедуры // ЗагрузитьЗамены()

&НаСервере
Процедура ЗаполнитьРеквизитыНоменклатуры()
	
	РеквизитыНоменклатуры = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Номенклатура, "Артикул,Производитель");
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыНоменклатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаДобавленияЗаменыНоменклатуры(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	ЗагрузитьЗамены();
	УправлениеДиалогомНаКлиенте(Элементы.ГруппаЗаменыЗаменители.ТекущаяСтраница.Имя);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаДобавленияЗаменыНоменклатуры()

&НаКлиенте
Процедура УправлениеДиалогомНаКлиенте(ТекущаяСтраница)
	
	Если ТекущаяСтраница = "СтраницаЗаменители" Тогда
		Элементы.УдалитьЗамену.Доступность = (ЗаменыНовые.Количество()>0);
	Иначе
		Элементы.УдалитьЗамену.Доступность = (ЗаменыСтарые.Количество()>0);
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогомНаКлиенте()

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗаменСтарые");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыСтарые.Количество");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0,128,0));
	
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗаменНовые");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыНовые.Количество");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Больше;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(0,128,0));
	
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗаменСтарые");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыСтарые.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(127,127,127));
	// Цвет текста
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("ТаблицаЗаменНовые");
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("ЗаменыНовые.Номенклатура");
	ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеЗаполнено;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветТекста", Новый Цвет(127,127,127));
	
КонецПроцедуры

#КонецОбласти





