
#Область ОбменТК8

Процедура ОбменСТК8(ПараметрыОбмена) Экспорт
	
	МногопоточныйОбмен = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбмена, "МногопоточныйОбмен", Ложь);
	КаталогОбмена      = ПолучитьЗначениеПараметраСтруктуры(ПараметрыОбмена, "КаталогОбмена", "");
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбменСТК8;
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	
	ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	Если МногопоточныйОбмен Тогда
		ВыполнитьМногопоточныйОбменСТК8(КаталогОбмена);
	Иначе
		ВыполнитьОбменСТК8(КаталогОбмена);
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ВыполнитьМногопоточныйОбменСТК8(КаталогОбмена)
	
	Если ОбщегоНазначения.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначения.ИнформационнаяБазаФайловая() Тогда
		ВызватьИсключение НСтр("ru = 'Многопоточный обмен с конфигурацией ""Торговый комплекс"", редакция 8 работает только в клиент-серверном режиме!'");
	КонецЕсли;
	
	КаталогПротоколовОшибок = КаталогОбмена + "\Протоколы загрузки ошибки";
	КаталогОшибок         = КаталогОбмена + "\Ошибки загрузки";
	КаталогАрхива         = КаталогОбмена + "\Архив загрузки";
	КаталогОбработки      = КаталогОбмена + "\Обработка загрузки";
	КаталогПротоколов     = КаталогОбмена + "\Протоколы загрузки";
	КаталогИсходныхФайлов = КаталогОбмена + "\Файлы к загрузке";
	
	ИнФТекущегоСеанса = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ИнФТекущегоСеанса.ПолучитьФоновоеЗадание();
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ФайлКаталогОбмена = Новый Файл(КаталогОбмена);
	Если НЕ ФайлКаталогОбмена.Существует() Тогда
		СоздатьКаталог(КаталогОбмена);
	КонецЕсли;
	
	ФайлКаталогОшибок = Новый Файл(КаталогОшибок);
	Если НЕ ФайлКаталогОшибок.Существует() Тогда
		СоздатьКаталог(КаталогОшибок);
	КонецЕсли;
	
	ФайлКаталогАрхива = Новый Файл(КаталогАрхива);
	Если НЕ ФайлКаталогАрхива.Существует() Тогда
		СоздатьКаталог(КаталогАрхива);
	КонецЕсли;
	
	ФайлКаталогОбработки = Новый Файл(КаталогОбработки);
	Если НЕ ФайлКаталогОбработки.Существует() Тогда
		СоздатьКаталог(КаталогОбработки);
	КонецЕсли;
	
	ФайлКаталогПротоколов = Новый Файл(КаталогПротоколов);
	Если НЕ ФайлКаталогПротоколов.Существует() Тогда
		СоздатьКаталог(КаталогПротоколов);
	КонецЕсли;
	
	ФайлКаталогПротоколовОшибок = Новый Файл(КаталогПротоколовОшибок);
	Если НЕ ФайлКаталогПротоколовОшибок.Существует() Тогда
		СоздатьКаталог(КаталогПротоколовОшибок);
	КонецЕсли;
	
	ФайлКаталогИсходныхФайлов = Новый Файл(КаталогИсходныхФайлов);
	Если НЕ ФайлКаталогИсходныхФайлов.Существует() Тогда
		СоздатьКаталог(КаталогИсходныхФайлов);
	КонецЕсли;
	
	ВидЗадания = Справочники.МногопоточныеЗадания.ОбменСТорговыйКомплекс8;
	
	УникальныйИдентификатор = ФоновоеЗадание.УникальныйИдентификатор;
	МенеджерПотоков = Строка(УникальныйИдентификатор);
	ВремяЖизниПотока = 1800;
	Пакеты           = Новый Массив;
	
	ТаблицаПотоков = ПолучитьТекущуюТаблицуПотоков(Пакеты, ВидЗадания, МенеджерПотоков, ВремяЖизниПотока);
	
	ТаблицаФайлов = ПолучитьФайлыОбменовСТК8(КаталогИсходныхФайлов, КаталогОбработки);
	Если ТаблицаФайлов.Количество() = 0 И Пакеты.Количество() Тогда
		Возврат;
	КонецЕсли;
	
	ИмяМетода = "РаботаСМногопоточнымиЗаданиями.ЗапуститьПотокОбменаСБазойТК8";
	
	Ошибки = Новый Массив;
	Для Каждого СтрокаФайла Из ТаблицаФайлов Цикл
		
		Если ПустаяСтрока(СтрокаФайла.ПолноеИмя) Тогда
			Продолжить;
		КонецЕсли;
		
		Файл = Новый Файл(СтрокаФайла.ПолноеИмя);
		Если НЕ Файл.Существует() Тогда
			Событие                = НСтр("ru = 'Получение данных обмена с ТК8'");
			ОписаниеПредупреждения = СтрШаблон(НСтр("ru='Файл %1 не существует.'"), СтрокаФайла.ПолноеИмя);
			ЗаписьЖурналаРегистрации(Событие, УровеньЖурналаРегистрации.Информация,, КаталогИсходныхФайлов, ОписаниеПредупреждения);
			//ПереместитьФайл(Файл.ПолноеИмя, КаталогОшибок+"\"+Файл.Имя);
			Ошибки.Добавить(СтрокаФайла.ПолноеИмя);
			Ошибки.Добавить(ОписаниеПредупреждения);
			Ошибки.Добавить(" ");
			Продолжить;
		КонецЕсли;
		
		ВставкаИмя = "_" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm-ss")+".xml";
		ИмяФайлаОбмена = СтрЗаменить(Файл.Имя, ".xml", ВставкаИмя);
		ПолноеИмяФайла = КаталогОбработки + "\" + ИмяФайлаОбмена;
		ПереместитьФайл(Файл.ПолноеИмя, ПолноеИмяФайла);
		
		ПараметрыПакета = Новый Структура;
		ПараметрыПакета.Вставить("КаталогОбмена",   КаталогОбмена);
		ПараметрыПакета.Вставить("ПолноеИмяФайла",  ПолноеИмяФайла);
		ПараметрыПакета.Вставить("ИмяФайла",        ИмяФайлаОбмена);
		ПараметрыПакета.Вставить("КаталогИсходныхФайлов", КаталогИсходныхФайлов);
		
		НомерПакета = Строка(Новый УникальныйИдентификатор);
		Пакеты.Добавить(НомерПакета);
		
		МенеджерЗаписи = РегистрыСведений.ПакетыМногопоточныхЗаданий.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВидЗадания      = ВидЗадания;
		МенеджерЗаписи.НомерПакета     = НомерПакета;
		МенеджерЗаписи.МенеджерПотоков = МенеджерПотоков;
		МенеджерЗаписи.КОбработке      = Истина;
		МенеджерЗаписи.Объект          = СтрокаФайла.ПолноеИмя;
		МенеджерЗаписи.ДатаСоздания    = СтрокаФайла.ДатаСоздания;
		//МенеджерЗаписи.ДатаСоздания    = ТекущаяДатаСеанса();
		МенеджерЗаписи.ПараметрыПакета = Новый ХранилищеЗначения(ПараметрыПакета);
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибок = СтрСоединить(Ошибки, Символы.ПС);
		
		ЗаголовокФайлаОшибок = КаталогОшибок + "\Описание ошибок-" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm-ss")+".txt";
		
		ЗаписьТекста = Новый ЗаписьТекста(ЗаголовокФайлаОшибок, "windows-1251");
		ЗаписьТекста.Записать(ТекстОшибок);
		ЗаписьТекста.Закрыть();
	КонецЕсли;
	
	ПараметрыФонового = Новый Структура;
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИмяМетода", ИмяМетода);
	
	ВыполнитьПакетыЗаданий(Пакеты, ВидЗадания, УникальныйИдентификатор, ДопПараметры, ПараметрыФонового, ТаблицаПотоков);
	
КонецПроцедуры

Процедура ВыполнитьОбменСТК8(КаталогОбмена)
	
	КаталогПротоколовОшибок = КаталогОбмена + "\Протоколы загрузки ошибки";
	КаталогОшибок     = КаталогОбмена + "\Ошибки загрузки";
	КаталогАрхива     = КаталогОбмена + "\Архив загрузки";
	КаталогОбработки  = КаталогОбмена + "\Обработка загрузки";
	КаталогПротоколов = КаталогОбмена + "\Протоколы загрузки";
	КаталогИсходныхФайлов = КаталогОбмена + "\Файлы к загрузке";
	
	ФайлКаталогОбмена = Новый Файл(КаталогОбмена);
	Если НЕ ФайлКаталогОбмена.Существует() Тогда
		СоздатьКаталог(КаталогОбмена);
	КонецЕсли;
	
	ФайлКаталогОшибок = Новый Файл(КаталогОшибок);
	Если НЕ ФайлКаталогОшибок.Существует() Тогда
		СоздатьКаталог(КаталогОшибок);
	КонецЕсли;
	
	ФайлКаталогАрхива = Новый Файл(КаталогАрхива);
	Если НЕ ФайлКаталогАрхива.Существует() Тогда
		СоздатьКаталог(КаталогАрхива);
	КонецЕсли;
	
	ФайлКаталогОбработки = Новый Файл(КаталогОбработки);
	Если НЕ ФайлКаталогОбработки.Существует() Тогда
		СоздатьКаталог(КаталогОбработки);
	КонецЕсли;
	
	ФайлКаталогПротоколов = Новый Файл(КаталогПротоколов);
	Если НЕ ФайлКаталогПротоколов.Существует() Тогда
		СоздатьКаталог(КаталогПротоколов);
	КонецЕсли;
	
	ФайлКаталогПротоколовОшибок = Новый Файл(КаталогПротоколовОшибок);
	Если НЕ ФайлКаталогПротоколовОшибок.Существует() Тогда
		СоздатьКаталог(КаталогПротоколовОшибок);
	КонецЕсли;
	
	ФайлКаталогИсходныхФайлов = Новый Файл(КаталогИсходныхФайлов);
	Если НЕ ФайлКаталогИсходныхФайлов.Существует() Тогда
		СоздатьКаталог(КаталогИсходныхФайлов);
	КонецЕсли;
	
	ФайлыКаталога = НайтиФайлы(КаталогИсходныхФайлов, "*.*");
	Если ФайлыКаталога.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФайлов = Новый ТаблицаЗначений;
	ТаблицаФайлов.Колонки.Добавить("ПолноеИмя",    Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(500)));
	ТаблицаФайлов.Колонки.Добавить("ДатаСоздания", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	Для Каждого ФайлКаталога Из ФайлыКаталога Цикл
		
		Файл = Новый Файл(ФайлКаталога.ПолноеИмя);
		Если НЕ Файл.Существует() Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаФайлов.Добавить();
		НоваяСтрока.ПолноеИмя    = ФайлКаталога.ПолноеИмя;
		НоваяСтрока.ДатаСоздания = Файл.ПолучитьВремяИзменения();
		
	КонецЦикла;
	
	Если ТаблицаФайлов.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаФайлов.Сортировать("ДатаСоздания");
	
	УниверсальныйОбменДаннымиXML = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	//УниверсальныйОбменДаннымиXML.ДописыватьДанныеВПротоколОбмена = Истина;
	
	Ошибки = Новый Массив;
	Для Каждого СтрокаФайла Из ТаблицаФайлов Цикл
		
		Файл = Новый Файл(СтрокаФайла.ПолноеИмя);
		Если НЕ Файл.Существует() Тогда
			Событие                = НСтр("ru = 'Обмен с ТК8'");
			ОписаниеПредупреждения = СтрШаблон(НСтр("ru='Файл %1 не существует.'"), СтрокаФайла.ПолноеИмя);
			ЗаписьЖурналаРегистрации(Событие,УровеньЖурналаРегистрации.Информация,, ФайлКаталогИсходныхФайлов, ОписаниеПредупреждения);
			//ПереместитьФайл(Файл.ПолноеИмя, КаталогОшибок+"\"+Файл.Имя);
			Ошибки.Добавить(СтрокаФайла.ПолноеИмя);
			Ошибки.Добавить(ОписаниеПредупреждения);
			Ошибки.Добавить(" ");
			Продолжить;
		КонецЕсли;
		
		Попытка
			ВставкаИмя = "_" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm-ss")+".xml";
			ВставкаПротокола = "_" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm-ss")+".txt";
			ИмяФайлаОбмена = СтрЗаменить(Файл.Имя, ".xml", ВставкаИмя);
			ИмяФайлаПротокола = СтрЗаменить(Файл.Имя, ".xml", ВставкаПротокола);
			ПолноеИмяФайла = КаталогОбработки + "\" + ИмяФайлаОбмена;
			ПереместитьФайл(Файл.ПолноеИмя, ПолноеИмяФайла);
			
			ЗаголовокФайлаПротокола = КаталогПротоколов + "\" + ИмяФайлаПротокола;
			//ЗаписьТекста = Новый ЗаписьТекста(ЗаголовокФайлаПротокола, "windows-1251");
			//ЗаписьТекста.Закрыть();
			
			УниверсальныйОбменДаннымиXML.ФлагОшибки      = Ложь;
			УниверсальныйОбменДаннымиXML.ИмяФайлаПротоколаОбмена = ЗаголовокФайлаПротокола;
			УниверсальныйОбменДаннымиXML.ИмяФайлаОбмена  = ПолноеИмяФайла;
			УниверсальныйОбменДаннымиXML.БезопасныйРежим = Истина;
			УниверсальныйОбменДаннымиXML.ЗагружатьДанныеВРежимеОбмена = Истина;
			УниверсальныйОбменДаннымиXML.КодировкаФайлаПротоколаОбмена = "КодировкаТекста.UTF8";
			УниверсальныйОбменДаннымиXML.РежимОбмена = "Загрузка";
			УниверсальныйОбменДаннымиXML.ВыполнитьЗагрузку();
			
			Если УниверсальныйОбменДаннымиXML.ФлагОшибки Тогда
				ПереместитьФайл(ПолноеИмяФайла, КаталогОшибок + "\" + ИмяФайлаОбмена);
				КопироватьФайл(ЗаголовокФайлаПротокола, КаталогПротоколовОшибок + "\" + ИмяФайлаПротокола);
			Иначе
				ПереместитьФайл(ПолноеИмяФайла, КаталогАрхива + "\" + ИмяФайлаОбмена);
			КонецЕсли;
			
			//ВремяПоследнегоДействия = ТекущаяДата();
		Исключение
			ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
			//ВремяПоследнегоДействия = ТекущаяДата();
			Ошибки.Добавить(СокрЛП(ПолноеИмяФайла));
			Ошибки.Добавить(ТекстОшибки);
			Ошибки.Добавить(" ");
			Продолжить;
		КонецПопытки;
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибок = СтрСоединить(Ошибки, Символы.ПС);
		
		ЗаголовокФайлаОшибок = КаталогОшибок + "\Описание ошибок-" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm-ss")+".txt";
		
		ЗаписьТекста = Новый ЗаписьТекста(ЗаголовокФайлаОшибок, "windows-1251");
		ЗаписьТекста.Записать(ТекстОшибок);
		ЗаписьТекста.Закрыть();
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьФайлыОбменовСТК8(КаталогОбмена, КаталогОбработки)
	
	ФайлыОбменов = Новый Массив;
	
	ФайлыКаталога   = НайтиФайлы(КаталогОбмена, "*.*");
	//ФайлыКаталога   = НайтиФайлы(КаталогОбмена, "*.xml");
	//ФайлыВОбработке = НайтиФайлы(КаталогОбработки, "*.xml");
	ФайлыВОбработке = Новый Массив;
	Если ФайлыКаталога.Количество() = 0 И ФайлыВОбработке.Количество() = 0 Тогда
		Возврат ФайлыОбменов;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТаблицаФайлов = Новый ТаблицаЗначений;
	ТаблицаФайлов.Колонки.Добавить("ПолноеИмя",    Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(900)));
	ТаблицаФайлов.Колонки.Добавить("ДатаСоздания", Новый ОписаниеТипов("Дата",,,,,Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя)));
	
	Для Каждого ФайлКаталога Из ФайлыКаталога Цикл
		
		Файл = Новый Файл(ФайлКаталога.ПолноеИмя);
		Если НЕ Файл.Существует() Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаФайлов.Добавить();
		НоваяСтрока.ПолноеИмя    = ФайлКаталога.ПолноеИмя;
		НоваяСтрока.ДатаСоздания = Файл.ПолучитьВремяИзменения();
		
	КонецЦикла;
	
	Для Каждого ФайлКаталога Из ФайлыВОбработке Цикл
		
		Файл = Новый Файл(ФайлКаталога.ПолноеИмя);
		Если НЕ Файл.Существует() Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаФайлов.Добавить();
		НоваяСтрока.ПолноеИмя    = ФайлКаталога.ПолноеИмя;
		НоваяСтрока.ДатаСоздания = Файл.ПолучитьВремяИзменения();
		
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаФайлов", ТаблицаФайлов);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаФайлов.ПолноеИмя КАК ПолноеИмя,
	|	ТаблицаФайлов.ДатаСоздания КАК ДатаСоздания
	|ПОМЕСТИТЬ
	|	ТаблицаФайлов
	|ИЗ
	|	&ТаблицаФайлов КАК ТаблицаФайлов
	|;
	|
	|ВЫБРАТЬ ПЕРВЫЕ 50
	|	ТаблицаФайлов.ПолноеИмя КАК ПолноеИмя,
	|	ТаблицаФайлов.ДатаСоздания КАК ДатаСоздания
	//|ПОМЕСТИТЬ
	//|	ТаблицаНеЗарегистрированныхФайлов
	|ИЗ
	|	ТаблицаФайлов КАК ТаблицаФайлов
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ПакетыМногопоточныхЗаданий КАК ПакетыМногопоточныхЗаданий
	|ПО
	|	ПакетыМногопоточныхЗаданий.ВидЗадания = ЗНАЧЕНИЕ(Справочник.МногопоточныеЗадания.ОбменСТорговыйКомплекс8) И 
	|	ТаблицаФайлов.ПолноеИмя = ВЫРАЗИТЬ(ПакетыМногопоточныхЗаданий.Объект КАК Строка(900)) И 
	|	ПакетыМногопоточныхЗаданий.ЕстьОшибка = ЛОЖЬ
	|ГДЕ
	|	ПакетыМногопоточныхЗаданий.Объект ЕСТЬ NULL
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания
	|";
	
	ФайлыОбменов = Запрос.Выполнить().Выгрузить();
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат ФайлыОбменов;
	
КонецФункции

Процедура ЗапуститьПотокОбменаСБазойТК8(Знач ПараметрыЗадания) Экспорт
	
	ИнФТекущегоСеанса = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ИнФТекущегоСеанса.ПолучитьФоновоеЗадание();
	Если ФоновоеЗадание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИдентификаторФоновогоЗадания = ФоновоеЗадание.УникальныйИдентификатор;
	
	УстановитьПривилегированныйРежим(Истина);
	
	ВремяЗапуска = ТекущаяДата();
	
	Если ТипЗнч(ПараметрыЗадания) <> Тип("Структура") Тогда
		ПараметрыЗадания = Новый Структура;
	КонецЕсли;
	
	ИдентификаторМенеджераПотоков = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗадания, "ИдентификаторМенеджераПотоков");
	ИдентификаторПотока           = ПолучитьЗначениеПараметраСтруктуры(ПараметрыЗадания, "ИдентификаторПотока");
	
	ВидЗадания = Справочники.МногопоточныеЗадания.ОбменСТорговыйКомплекс8;
	
	НастройкиЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидЗадания, "ВремяБездействияПотока, КоличествоОшибокВПотоке");
	ВремяБездействияПотока  = НастройкиЗадания.ВремяБездействияПотока;
	КоличествоОшибокВПотоке = НастройкиЗадания.КоличествоОшибокВПотоке;
	
	ВремяБездействияПотока  = ?(ВремяБездействияПотока = 0, 300, ВремяБездействияПотока);
	КоличествоОшибокВПотоке = ?(КоличествоОшибокВПотоке = 0, 3,  КоличествоОшибокВПотоке);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПотока", ИдентификаторПотока);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Пакеты.Объект КАК ПолноеИмя,
	|	Пакеты.ПараметрыПакета КАК ПараметрыПакета,
	|	Пакеты.НомерПакета КАК НомерПакета
	|ИЗ
	|	РегистрСведений.ПакетыМногопоточныхЗаданий КАК Пакеты
	|ГДЕ
	|	Пакеты.ИдентификаторПотока = &ИдентификаторПотока И 
	|	Пакеты.ВидЗадания = ЗНАЧЕНИЕ(Справочник.МногопоточныеЗадания.ОбменСТорговыйКомплекс8) И 
	|	Пакеты.ЕстьОшибка = Ложь
	|УПОРЯДОЧИТЬ ПО
	|	Пакеты.СчетчикОшибок
	|";
	
	УниверсальныйОбменДаннымиXML = Обработки.УниверсальныйОбменДаннымиXML.Создать();
	//УниверсальныйОбменДаннымиXML.ДописыватьДанныеВПротоколОбмена = Истина;
	Ошибки = Новый Массив;
	ВремяПоследнегоДействия = ТекущаяДата();
	Пока ИСТИНА Цикл
		ОписаниеОшибки = "";
		Выборка = Запрос.Выполнить().Выбрать();
		Пока Выборка.Следующий() Цикл
			
			МенеджерЗаписи = РегистрыСведений.ПакетыМногопоточныхЗаданий.СоздатьМенеджерЗаписи();
			Попытка
				
				ИмяФайлаОбмена   = Неопределено;
				ПолноеИмяФайла   = Неопределено;
				КаталогОбмена    = Неопределено;
				КаталогАрхива    = "";
				КаталогОбработки = "";
				КаталогОшибок    = "";
				КаталогПротоколовОшибок = "";
				ФайлКаталогИсходныхФайлов = "";
				ПараметрыПакета = Выборка.ПараметрыПакета.Получить();
				Если ТипЗнч(ПараметрыПакета) = Тип("Структура") Тогда
					ИмяФайлаОбмена        = ПолучитьЗначениеПараметраСтруктуры(ПараметрыПакета, "ИмяФайла", Неопределено);
					ПолноеИмяФайла        = ПолучитьЗначениеПараметраСтруктуры(ПараметрыПакета, "ПолноеИмяФайла", Неопределено);
					КаталогОбмена         = ПолучитьЗначениеПараметраСтруктуры(ПараметрыПакета, "КаталогОбмена", "");
					КаталогПротоколовОшибок = КаталогОбмена + "\Протоколы загрузки ошибки";
					КаталогОшибок     = КаталогОбмена + "\Ошибки загрузки";
					КаталогАрхива     = КаталогОбмена + "\Архив загрузки";
					КаталогОбработки  = КаталогОбмена + "\Обработка загрузки";
					КаталогПротоколов = КаталогОбмена + "\Протоколы загрузки";
					КаталогИсходныхФайлов = КаталогОбмена + "\Файлы к загрузке";
					
					//ЗаголовокФайлаПротокола = ОбщегоНазначенияКлиентСервер.ПолучитьПолноеИмяФайла(КаталогОбработки, "Протокол загрузки-" + ИдентификаторПотока +"-"+ Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm-ss")+".txt");
					//ЗаписьТекста = Новый ЗаписьТекста(ЗаголовокФайлаПротокола, "windows-1251");
					//	ЗаписьТекста.Закрыть();
					
				КонецЕсли;
				
				Если ИмяФайлаОбмена = Неопределено Тогда
					ТекстОшибки = СтрШаблон(НСтр("ru='Не найдено имя файла обмена. Имя файла %1'"), СокрЛП(Выборка.ПолноеИмя));
					ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, Выборка.НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки);
					ВремяПоследнегоДействия = ТекущаяДата();
					Ошибки.Добавить(СокрЛП(Выборка.ПолноеИмя));
					Ошибки.Добавить(ТекстОшибки);
					Ошибки.Добавить(" ");
					Продолжить;
				КонецЕсли;
				
				Файл = Новый Файл(ПолноеИмяФайла);
				Если НЕ Файл.Существует() Тогда
					ТекстОшибки = СтрШаблон(НСтр("ru='Не найден файл. Имя файла %1'"), СокрЛП(ПолноеИмяФайла));
					ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, Выборка.НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки);
					ВремяПоследнегоДействия = ТекущаяДата();
					Ошибки.Добавить(СокрЛП(Выборка.ПолноеИмя));
					Ошибки.Добавить(ТекстОшибки);
					Ошибки.Добавить(" ");
					Продолжить;
				КонецЕсли;
				
				ВставкаПротокола = "_" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm-ss")+".txt";
				ИмяФайлаПротокола = СтрЗаменить(Файл.Имя, ".xml", ВставкаПротокола);
				ЗаголовокФайлаПротокола = КаталогПротоколов + "\" + ИмяФайлаПротокола;
				
				УниверсальныйОбменДаннымиXML.ФлагОшибки      = Ложь;
				УниверсальныйОбменДаннымиXML.ИмяФайлаПротоколаОбмена = ЗаголовокФайлаПротокола;
				УниверсальныйОбменДаннымиXML.ИмяФайлаОбмена  = ПолноеИмяФайла;
				УниверсальныйОбменДаннымиXML.БезопасныйРежим = Истина;
				УниверсальныйОбменДаннымиXML.КодировкаФайлаПротоколаОбмена = "КодировкаТекста.UTF8";
				УниверсальныйОбменДаннымиXML.РежимОбмена = "Загрузка";
				УниверсальныйОбменДаннымиXML.ВыполнитьЗагрузку();
				
			Исключение
				ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, Выборка.НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки);
				ВремяПоследнегоДействия = ТекущаяДата();
				Ошибки.Добавить(СокрЛП(Выборка.ПолноеИмя));
				Ошибки.Добавить(ТекстОшибки);
				Ошибки.Добавить(" ");
				Продолжить;
			КонецПопытки;
			
			Файл = Новый Файл(ПолноеИмяФайла);
			Если Файл.Существует() Тогда
				Если УниверсальныйОбменДаннымиXML.ФлагОшибки Тогда
					ПереместитьФайл(ПолноеИмяФайла, КаталогОшибок + "\" + ИмяФайлаОбмена);
					КопироватьФайл(ЗаголовокФайлаПротокола, КаталогПротоколовОшибок + "\" + ИмяФайлаПротокола);
				Иначе
					ПереместитьФайл(ПолноеИмяФайла, КаталогАрхива + "\" + ИмяФайлаОбмена);
				КонецЕсли;
			КонецЕсли;
			
			НачатьТранзакцию();
			
			Блокировка = Новый БлокировкаДанных;
			ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПакетыМногопоточныхЗаданий");
			ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
			ЭлементБлокировки.УстановитьЗначение("НомерПакета", Выборка.НомерПакета);
			ЭлементБлокировки.УстановитьЗначение("ВидЗадания",  ВидЗадания);
			
			Попытка
				Блокировка.Заблокировать();
				МенеджерЗаписи.ВидЗадания  = ВидЗадания;
				МенеджерЗаписи.НомерПакета = Выборка.НомерПакета;
				МенеджерЗаписи.Удалить();
			Исключение
				ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
				ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, Выборка.НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки);
				ВремяПоследнегоДействия = ТекущаяДата();
				ОтменитьТранзакцию();
				Ошибки.Добавить(СокрЛП(Выборка.ПолноеИмя));
				Ошибки.Добавить(ТекстОшибки);
				Ошибки.Добавить(" ");
				Продолжить;
			КонецПопытки;
			
			ВремяПоследнегоДействия = ТекущаяДата();
			
			ЗафиксироватьТранзакцию();
			
		КонецЦикла;
		
		РегламентноеЗадание = Метаданные.РегламентныеЗадания.ОбменСТК8;
		
		Отбор = Новый Структура;
		Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
		Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
		
		ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
		Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() = 0 ИЛИ (ТекущаяДата()-ВремяПоследнегоДействия)>ВремяБездействияПотока ИЛИ ТекущаяДата() - ВремяЗапуска>1800 Тогда
			УбратьЗависшиеПакеты(ВидЗадания, ИдентификаторПотока);
			Если Ошибки.Количество() > 0 Тогда
				ТекстОшибок = СтрСоединить(Ошибки, Символы.ПС);
				
				ЗаголовокФайлаОшибок = КаталогОшибок + "\Описание ошибок-Поток_"+ИдентификаторПотока+"_" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm-ss")+".txt";
				
				ЗаписьТекста = Новый ЗаписьТекста(ЗаголовокФайлаОшибок, "windows-1251");
				ЗаписьТекста.Записать(ТекстОшибок);
				ЗаписьТекста.Закрыть();
		
				ВызватьИсключение ТекстОшибок;
			КонецЕсли;
			Возврат;
		КонецЕсли;
		
	КонецЦикла;
	
	Если Ошибки.Количество() > 0 Тогда
		ТекстОшибок = СтрСоединить(Ошибки, Символы.ПС);
		
		ЗаголовокФайлаОшибок = КаталогОшибок + "\Описание ошибок-Поток_"+ИдентификаторПотока+"_" + Формат(ТекущаяДата(), "ДФ=yyyy-MM-dd_HH-mm-ss")+".txt";
		
		ЗаписьТекста = Новый ЗаписьТекста(ЗаголовокФайлаОшибок, "windows-1251");
		ЗаписьТекста.Записать(ТекстОшибок);
		ЗаписьТекста.Закрыть();
		
		ВызватьИсключение ТекстОшибок;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция ПолучитьТекущуюТаблицуПотоков(Пакеты, ВидЗадания, МенеджерПотоков, ВремяЖизниПотока) Экспорт
	
	//УникальныйИдентификатор = ФоновоеЗадание.УникальныйИдентификатор;
	ТаблицаПотоков = Новый ТаблицаЗначений;
	ТаблицаПотоков.Колонки.Добавить("ДатаНачала");
	ТаблицаПотоков.Колонки.Добавить("Идентификатор");
	ТаблицаПотоков.Колонки.Добавить("ИдентификаторПотока", Новый ОписаниеТипов("Строка",,,,Новый КвалификаторыСтроки(36)));
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидЗадания", ВидЗадания);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ПакетыМногопоточныхЗаданий.НомерПакета КАК НомерПакета,
	|	ПакетыМногопоточныхЗаданий.ИдентификаторПотока КАК ИдентификаторПотока,
	|	ПакетыМногопоточныхЗаданий.ДатаНачалаОбработки КАК ДатаНачалаОбработки,
	|	ПакетыМногопоточныхЗаданий.ФоновоеЗадание КАК ФоновоеЗадание
	|ИЗ
	|	РегистрСведений.ПакетыМногопоточныхЗаданий КАК ПакетыМногопоточныхЗаданий
	|ГДЕ
	|	ПакетыМногопоточныхЗаданий.ЕстьОшибка = ЛОЖЬ И 
	|	ПакетыМногопоточныхЗаданий.ВидЗадания = &ВидЗадания
	|УПОРЯДОЧИТЬ ПО
	|	ПакетыМногопоточныхЗаданий.ДатаСоздания
	|";
	
	ПорогДляПерегрузки = ТекущаяДатаСеанса()-ВремяЖизниПотока;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		МенеджерЗаписи = РегистрыСведений.ПакетыМногопоточныхЗаданий.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВидЗадания  = ВидЗадания;
		МенеджерЗаписи.НомерПакета = Выборка.НомерПакета;
		МенеджерЗаписи.Прочитать();
		МенеджерЗаписи.ВидЗадания      = ВидЗадания;
		МенеджерЗаписи.НомерПакета     = Выборка.НомерПакета;
		МенеджерЗаписи.МенеджерПотоков = МенеджерПотоков;
		
		Если Не ЗначениеЗаполнено(Выборка.ФоновоеЗадание) Тогда
			МенеджерЗаписи.Записать();
			Пакеты.Добавить(Выборка.НомерПакета);
			Продолжить;
		КонецЕсли;
		
		ФоновоеЗаданиеПотока = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(Новый УникальныйИдентификатор(Выборка.ФоновоеЗадание));
		Если ФоновоеЗаданиеПотока = Неопределено ИЛИ 
			(НЕ ФоновоеЗаданиеПотока.Состояние = СостояниеФоновогоЗадания.Активно) Тогда
			МенеджерЗаписи.КОбработке          = Истина;
			МенеджерЗаписи.ДатаНачалаОбработки = Дата(1, 1, 1);
			МенеджерЗаписи.ФоновоеЗадание      = "";
			МенеджерЗаписи.ИдентификаторПотока = "";
			МенеджерЗаписи.Записать();
			Пакеты.Добавить(Выборка.НомерПакета);
			Продолжить;
		КонецЕсли;
		
		Если Выборка.ДатаНачалаОбработки < ПорогДляПерегрузки Тогда
			ФоновоеЗаданиеПотока.Отменить();
			МенеджерЗаписи.КОбработке          = Истина;
			МенеджерЗаписи.ДатаНачалаОбработки = Дата(1, 1, 1);
			МенеджерЗаписи.ФоновоеЗадание      = "";
			МенеджерЗаписи.ИдентификаторПотока = "";
			МенеджерЗаписи.Записать();
			Пакеты.Добавить(Выборка.НомерПакета);
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаПотоков.Добавить();
		НоваяСтрока.Идентификатор       = ФоновоеЗаданиеПотока.УникальныйИдентификатор;
		НоваяСтрока.ДатаНачала          = Выборка.ДатаНачалаОбработки;
		НоваяСтрока.ИдентификаторПотока = Выборка.ИдентификаторПотока;
		
		МенеджерЗаписи.Записать();
		
	КонецЦикла;
	
	Возврат ТаблицаПотоков;
	
КонецФункции

Функция ПолучитьЗапросДоступныхПотоков(ВидЗадания, ПакетовВПотоке) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПакетовВПотоке", ПакетовВПотоке);
	Запрос.УстановитьПараметр("ВидЗадания",     ВидЗадания);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ИдентификаторыПотоков.ИдентификаторПотока КАК ИдентификаторПотока
	|ПОМЕСТИТЬ
	|	ИдентификаторыПотоков
	|ИЗ
	|	&ИдентификаторыПотоков КАК ИдентификаторыПотоков
	|;
	|
	|ВЫБРАТЬ
	|	ИдентификаторыПотоков.ИдентификаторПотока КАК ИдентификаторПотока,
	|	&ПакетовВПотоке - ЕСТЬNULL(КОЛИЧЕСТВО(Пакеты.НомерПакета), 0) КАК ДобавитьВПоток
	|ИЗ
	|	ИдентификаторыПотоков КАК ИдентификаторыПотоков
	|ЛЕВОЕ СОЕДИНЕНИЕ
	|	РегистрСведений.ПакетыМногопоточныхЗаданий КАК Пакеты
	|ПО
	|	Пакеты.ВидЗадания = &ВидЗадания И 
	|	ИдентификаторыПотоков.ИдентификаторПотока = Пакеты.ИдентификаторПотока И 
	|	Пакеты.КОбработке = ЛОЖЬ И 
	|	Пакеты.ЕстьОшибка = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	ИдентификаторыПотоков.ИдентификаторПотока
	|ИМЕЮЩИЕ
	|	&ПакетовВПотоке > ЕСТЬNULL(КОЛИЧЕСТВО(Пакеты.НомерПакета), 0)
	|УПОРЯДОЧИТЬ ПО
	|	ДобавитьВПоток
	|";
	
	Возврат Запрос;
	
КонецФункции

Процедура УбратьЗависшиеПакеты(ВидЗадания, ИдентификаторПотока) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ИдентификаторПотока", ИдентификаторПотока);
	Запрос.УстановитьПараметр("ВидЗадания",          ВидЗадания);
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	Пакеты.Объект КАК Документ,
	|	Пакеты.НомерПакета КАК НомерПакета
	|ИЗ
	|	РегистрСведений.ПакетыМногопоточныхЗаданий КАК Пакеты
	|ГДЕ
	|	Пакеты.ВидЗадания = &ВидЗадания И 
	|	Пакеты.ИдентификаторПотока = &ИдентификаторПотока И 
	|	Пакеты.ЕстьОшибка = Ложь
	|";
	
	ТаблицаПакетов = Запрос.Выполнить().Выгрузить();
	
	НачатьТранзакцию();
	
	// Наложим блокировку на считываемые данные
	СтруктураПараметровБлокировки = Новый Структура("ТипТаблицы, ИмяТаблицы", "РегистрСведений", "ПакетыМногопоточныхЗаданий");
	ЗначенияБлокировки = Новый Соответствие;
	ЗначенияБлокировки.Вставить("ВидЗадания", ВидЗадания);
	
	СтруктураПараметровБлокировки.Вставить("ИсточникДанных", ТаблицаПакетов);
	ОписаниеИсточника = Новый Соответствие;
	ОписаниеИсточника.Вставить("НомерПакета", "НомерПакета");
	ОбработкаСобытийДокументаСервер.УстановитьУправляемуюБлокировку(СтруктураПараметровБлокировки, ЗначенияБлокировки, ОписаниеИсточника);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		МенеджерЗаписи = РегистрыСведений.ПакетыМногопоточныхЗаданий.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ВидЗадания  = ВидЗадания;
		МенеджерЗаписи.НомерПакета = Выборка.НомерПакета;
		МенеджерЗаписи.Удалить();
	КонецЦикла;
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

Процедура ВыполнитьПакетыЗаданий(Пакеты, ВидЗадания, ИдентификаторМенеджераПотоков, Параметры, ПараметрыФонового, ТаблицаПотоков) Экспорт
	
	ИмяМетода          = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ИмяМетода");
	РеквизитыЗадания   = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидЗадания, "КоличествоПакетовВПотоке, КоличествоПотоков, Наименование");
	ПакетовВПотоке     = РеквизитыЗадания.КоличествоПакетовВПотоке;
	ПакетовВПотоке     = ?(ПакетовВПотоке = 0, 1, ПакетовВПотоке);
	НаименованиеПотока = "Поток: " + РеквизитыЗадания.Наименование;
	
	ЗапросДоступныхПотоков = ПолучитьЗапросДоступныхПотоков(ВидЗадания, ПакетовВПотоке);
	
	КоличествоПакетов = Пакеты.Количество();
	Пока КоличествоПакетов > 0 Цикл
		
		РеквизитыЗадания = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ВидЗадания, "КоличествоПакетовВПотоке, КоличествоПотоков");
		
		ПределПотоков = РеквизитыЗадания.КоличествоПотоков;
		ПределПотоков = ?(ПределПотоков = 0, 5, ПределПотоков);
		
		КоличествоПотоков = ТаблицаПотоков.Количество()-1;
		Пока КоличествоПотоков>= 0 Цикл
			ТекущийПоток = ТаблицаПотоков[КоличествоПотоков];
			
			ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(ТекущийПоток.Идентификатор);
			Если ФоновоеЗадание = Неопределено ИЛИ (НЕ ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно) Тогда
				УбратьЗависшиеПакеты(ВидЗадания, ТекущийПоток.ИдентификаторПотока);
				ТаблицаПотоков.Удалить(ТекущийПоток);
			Иначе
				ФоновоеЗаданиеОжидания = ФоновоеЗадание;
			КонецЕсли;
			
			КоличествоПотоков = КоличествоПотоков - 1;
		КонецЦикла;
		
		КоличествоПотоков = Пакеты.Количество();
		
		КоличествоПотоков = Мин(ПределПотоков, КоличествоПотоков);
		НеХватаетПотоков  = КоличествоПотоков - ТаблицаПотоков.Количество();
		
		Пока НеХватаетПотоков>0 Цикл
			
			ИдентификаторПотока = Строка(Новый УникальныйИдентификатор);
			
			ПараметрыЗадания = ОбщегоНазначения.СкопироватьРекурсивно(ПараметрыФонового);
			ПараметрыЗадания.Вставить("ИдентификаторПотока",           ИдентификаторПотока);
			ПараметрыЗадания.Вставить("ИдентификаторМенеджераПотоков", ИдентификаторМенеджераПотоков);
			
			ПорядокПараметров = Новый Массив;
			ПорядокПараметров.Добавить(ПараметрыЗадания);
			
			ФоновоеЗадание = ФоновыеЗадания.Выполнить(ИмяМетода, ПорядокПараметров, ИдентификаторПотока, НаименованиеПотока);
			
			НоваяСтрока = ТаблицаПотоков.Добавить();
			НоваяСтрока.Идентификатор       = ФоновоеЗадание.УникальныйИдентификатор;
			НоваяСтрока.ДатаНачала          = ФоновоеЗадание.Начало;
			НоваяСтрока.ИдентификаторПотока = ИдентификаторПотока;
			
			ФоновоеЗаданиеОжидания = ФоновоеЗадание;
			
			НеХватаетПотоков = НеХватаетПотоков - 1;
			
		КонецЦикла;
		
		ЗапросДоступныхПотоков.УстановитьПараметр("ИдентификаторыПотоков", ТаблицаПотоков);
		ТаблицаДоступныхПотоков = ЗапросДоступныхПотоков.Выполнить().Выгрузить();
		
		РазмерБуфера = ПакетовВПотоке;
		Пока РазмерБуфера>=0 И КоличествоПакетов>0 Цикл
			ИндексПотоков = ТаблицаДоступныхПотоков.Количество()-1;
			Пока ИндексПотоков>=0 И КоличествоПакетов>0 Цикл
				СтрокаПотока = ТаблицаДоступныхПотоков[ИндексПотоков];
				Если ПустаяСтрока(СтрокаПотока.ИдентификаторПотока) Тогда
					ТаблицаДоступныхПотоков.Удалить(СтрокаПотока);
					ИндексПотоков = ИндексПотоков - 1;
					Продолжить;
				КонецЕсли;
				
				Если СтрокаПотока.ДобавитьВПоток = 0 Тогда
					ТаблицаДоступныхПотоков.Удалить(СтрокаПотока);
					ИндексПотоков = ИндексПотоков - 1;
					Продолжить;
				ИначеЕсли СтрокаПотока.ДобавитьВПоток = 1 Тогда
					ИдентификаторПотока = СтрокаПотока.ИдентификаторПотока;
					ТаблицаДоступныхПотоков.Удалить(СтрокаПотока);
				Иначе
					СтрокаПотока.ДобавитьВПоток = СтрокаПотока.ДобавитьВПоток - 1;
					ИдентификаторПотока = СтрокаПотока.ИдентификаторПотока;
				КонецЕсли;
				
				СтрокаПотока = ТаблицаПотоков.Найти(ИдентификаторПотока, "ИдентификаторПотока");
				
				НомерПакета = Пакеты[0];
				
				НачатьТранзакцию();
				
				Блокировка = Новый БлокировкаДанных;
				ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПакетыМногопоточныхЗаданий");
				ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
				ЭлементБлокировки.УстановитьЗначение("НомерПакета", НомерПакета);
				ЭлементБлокировки.УстановитьЗначение("ВидЗадания",  ВидЗадания);
				Блокировка.Заблокировать();
				
				МенеджерЗаписи = РегистрыСведений.ПакетыМногопоточныхЗаданий.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.НомерПакета         = НомерПакета;
				МенеджерЗаписи.ВидЗадания          = ВидЗадания;
				МенеджерЗаписи.Прочитать();
				МенеджерЗаписи.НомерПакета         = НомерПакета;
				МенеджерЗаписи.ВидЗадания          = ВидЗадания;
				МенеджерЗаписи.КОбработке          = Ложь;
				МенеджерЗаписи.ИдентификаторПотока = ИдентификаторПотока;
				МенеджерЗаписи.ДатаНачалаОбработки = ТекущаяДатаСеанса();
				Если НЕ СтрокаПотока = Неопределено Тогда
					МенеджерЗаписи.ФоновоеЗадание  = СтрокаПотока.Идентификатор;
				КонецЕсли;
				МенеджерЗаписи.Записать();
				
				ЗафиксироватьТранзакцию();
				
				Пакеты.Удалить(0);
				
				КоличествоПакетов = КоличествоПакетов - 1;
				ИндексПотоков = ИндексПотоков - 1;
				
			КонецЦикла;
			РазмерБуфера = РазмерБуфера - 1;
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ЗаписатьОшибкуПотока(МенеджерЗаписи, ВидЗадания, НомерПакета, КоличествоОшибокВПотоке, ТекстОшибки) Экспорт
	
	НачатьТранзакцию();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрСведений.ПакетыМногопоточныхЗаданий");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("НомерПакета",     НомерПакета);
	ЭлементБлокировки.УстановитьЗначение("ВидЗадания",      ВидЗадания);
	Блокировка.Заблокировать();
	
	МенеджерЗаписи.НомерПакета = НомерПакета;
	МенеджерЗаписи.ВидЗадания  = ВидЗадания;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.НомерПакета = НомерПакета;
	МенеджерЗаписи.ВидЗадания  = ВидЗадания;
	
	Если МенеджерЗаписи.СчетчикОшибок>=КоличествоОшибокВПотоке Тогда
		МенеджерЗаписи.ЕстьОшибка  = Истина;
		МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
	Иначе
		МенеджерЗаписи.СчетчикОшибок = МенеджерЗаписи.СчетчикОшибок + 1;
		МенеджерЗаписи.ТекстОшибки = ТекстОшибки;
	КонецЕсли;
	МенеджерЗаписи.Записать();
	
	ЗафиксироватьТранзакцию();
	
КонецПроцедуры

#КонецОбласти