
&НаКлиенте
Процедура Загрузить(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура Выйти(Команда)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура плвВведенноеЗначениеПриИзменении(Элемент)
	
	ВведенноеЗначение = СокрЛП(ВведенноеЗначение);
	
	Если ПустаяСтрока(ВведенноеЗначение) Тогда
	ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);		
		Возврат;
	КонецЕсли;
	
	Статус = УстановитьОператора(ВведенноеЗначение);
	
	ПодключитьОбработчикОжидания("УстановитьПозициюНаШтрихкод", 0.01, Истина);		

	Если Статус = 0 Тогда Возврат; КОнецЕсли;
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", Объект.Режим);
	ПараметрыОткрытияФормы.Вставить("Оператор", Объект.Оператор);
	
	ОткрытьФорму("Обработка.устПриемкаТСДНовая.Форма.Начало1",ПараметрыОткрытияФормы);
	ЗакрытьФорму = Истина;
	Закрыть("ОК");
	
КонецПроцедуры

&НаСервере
Функция УстановитьОператора(ВведенноеЗначение)
	
	Карточка = ВернутьКарточкуОператора(ВведенноеЗначение);
	
	Если Карточка.Пустая() Тогда
		Сообщить("Оператор не идентифицирован - " + ВведенноеЗначение);
		ВведенноеЗначение = "";
		Возврат 0;	
	КонецЕсли;	
	
	ТекОбъект = РеквизитФормыВЗначение("Объект");
	
	ТекОбъект.Оператор = Карточка.Объект;
	
	ЗначениеВРеквизитФормы(ТекОбъект,"Объект");

	Возврат 1;
КонецФункции

&НаКлиенте
Процедура УстановитьПозициюНаШтрихкод()
	
	ЭтотОбъект.ТекущийЭлемент = Элементы.ВведенноеЗначение;
	
КонецПроцедуры

&НаСервере
Функция ВернутьКарточкуОператора(ШК)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Штрихкоды.Объект КАК Объект
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &Штрихкод
	|	И Штрихкоды.Объект ССЫЛКА Справочник.Карточки");
	Запрос.УстановитьПараметр("Штрихкод",ШК);
	ВыборкаКарточек = Запрос.Выполнить().Выбрать();
	Если ВыборкаКарточек.Следующий() Тогда
		Возврат ВыборкаКарточек.Объект;
	Иначе
		Возврат Справочники.Карточки.ПустаяСсылка();
	КонецЕсли;	
КонецФункции	

&НаКлиенте       
Процедура ВыйтиНажатие(Элемент)
	
	ЗакрытьФорму = Истина;
	Закрыть("ОК");
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения()
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Ложь И (НЕ ЗакрытьФорму) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры
