////////////////////////////////////////////////////////////////////////////////////////
// СопоставлениеНоменклатурыКонтрагентовСлужебныйКлиентСервер:
// механизм сопоставления номенклатуры контрагентов с номенклатурой информационной базы.
//
///////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает признак разных данных между упаковкой и базовой единицей измерения.
//
// Параметры:
//  СвойстваУпаковки - см. СопоставлениеНоменклатурыКонтрагентовКлиентСервер.НовыеСвойстваУпаковки.
//
// Возвращаемое значение:
//  Булево - признак обозначает, что упаковка отлична от базовой единицы измерения.
//
Функция УпаковкаИБазоваяЕдиницаИзмеренияРазличны(СвойстваУпаковки) Экспорт
	
	Возврат Не ((СвойстваУпаковки.КоличествоУпаковок = 1 И СвойстваУпаковки.КоличествоБазовойЕдиницыИзмерения = 1
		Или СвойстваУпаковки.КоличествоУпаковок = 0 И СвойстваУпаковки.КоличествоБазовойЕдиницыИзмерения = 0)
		И СвойстваУпаковки.НаименованиеУпаковки = СвойстваУпаковки.НаименованиеБазовойЕдиницыИзмерения);
		
КонецФункции

#Область ПравилаПоискаПоЧастиНаименования

// Метод-конструктор, возвращает экземпляр правила поиска по части наименования, соответствует записи регистра сведений
//  ПравилаПоискаПоЧастиНаименованияБЭД.
// 
// Возвращаемое значение:
//  Структура:
//   * Владелец - Неопределено,ОпределяемыйТип.ВладелецНоменклатурыБЭД
//   * ХешПоисковойСтроки - Строка
//   * Номенклатура - Неопределено,ОпределяемыйТип.НоменклатураБЭД
//   * Характеристика - Неопределено,ОпределяемыйТип.ХарактеристикаНоменклатурыБЭД
//   * Упаковка - Неопределено,ОпределяемыйТип.УпаковкаНоменклатурыБЭД
//   * ПоисковаяСтрока - Строка
//   * ИсходныйКлючЗаписи - РегистрСведенийКлючЗаписи.ПравилаПоискаПоЧастиНаименованияБЭД
//
Функция НовоеПравилоПоискаПоЧастиНаименования() Экспорт
	
	Результат = Новый Структура;
	Результат.Вставить("Владелец", Неопределено);
	Результат.Вставить("ХешПоисковойСтроки", "");
	Результат.Вставить("Номенклатура", Неопределено);
	Результат.Вставить("Характеристика", Неопределено);
	Результат.Вставить("Упаковка", Неопределено);
	Результат.Вставить("ПоисковаяСтрока", "");
	Результат.Вставить("ИсходныйКлючЗаписи", Новый("РегистрСведенийКлючЗаписи.ПравилаПоискаПоЧастиНаименованияБЭД"));
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецОбласти

