
Процедура ОбработкаПроведения(Отказ, Режим)
	
	//Запись движений
	ГруппыГАК = ПолучитьГруппыГАК();
	
	Движения.итУдельныеРозничныеЦены.Записывать = Истина;
	Для Каждого ТекСтрокаДанныеДокумента Из ДанныеДокумента Цикл
		
		Для Каждого стрГруппа Из ГруппыГАК Цикл
			
			УдельнаяЦена =  ТекСтрокаДанныеДокумента["УдельнаяЦена_Группа" + Строка(стрГруппа.НомерГруппыГАК)];
			Если УдельнаяЦена > 0 Тогда
				Движение 			  = Движения.итУдельныеРозничныеЦены.Добавить();
				Движение.Период 	  = Дата;
				Движение.Крепость 	  = ТекСтрокаДанныеДокумента.Крепость;
				Движение.УдельнаяЦена = УдельнаяЦена;
				Движение.Группа 	  = стрГруппа.Группа;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;

	//Регистрация движений для кассы
	ОбновитьТоварыВОборудовании(Движения.итУдельныеРозничныеЦены.Выгрузить(), Отказ);	
	
КонецПроцедуры

Функция ПолучитьГруппыГАК()
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВидыАлкогольнойПродукции.итНомерГруппыГАК КАК НомерГруппыГАК,
	|	ВидыАлкогольнойПродукции.Ссылка КАК Группа
	|ИЗ
	|	Справочник.ВидыАлкогольнойПродукции КАК ВидыАлкогольнойПродукции
	|ГДЕ
	|	ВидыАлкогольнойПродукции.ЭтоГруппа = ИСТИНА
	|	И ВидыАлкогольнойПродукции.ПометкаУдаления = ЛОЖЬ
	|	И ВидыАлкогольнойПродукции.итНомерГруппыГАК МЕЖДУ 1 И 5";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблицаГрупп	= РезультатЗапроса.Выгрузить();		
	
	Возврат ТаблицаГрупп;
	
КонецФункции

Процедура ОбновитьТоварыВОборудовании(ТаблицаНовыхУдельныхЦен, Отказ)
				
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ТаблицаНовыхУдельныхЦен.Группа КАК Группа,
	|	ТаблицаНовыхУдельныхЦен.Крепость КАК Крепость,
	|	ТаблицаНовыхУдельныхЦен.УдельнаяЦена КАК УдельнаяЦена
	|ПОМЕСТИТЬ втНовыеУдельныеЦены
	|ИЗ
	|	&ТаблицаНовыхУдельныхЦен КАК ТаблицаНовыхУдельныхЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	итУдельныеРозничныеЦеныСрезПоследних.Группа КАК Группа,
	|	итУдельныеРозничныеЦеныСрезПоследних.Крепость КАК Крепость,
	|	итУдельныеРозничныеЦеныСрезПоследних.УдельнаяЦена КАК УдельнаяЦена
	|ПОМЕСТИТЬ втТекущиеУдельныеЦены
	|ИЗ
	|	РегистрСведений.итУдельныеРозничныеЦены.СрезПоследних(&Период, ) КАК итУдельныеРозничныеЦеныСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНовыеУдельныеЦены.Группа КАК Группа,
	|	втТекущиеУдельныеЦены.Группа КАК ГруппаТекущая
	|ПОМЕСТИТЬ втГруппыДляРегистрации
	|ИЗ
	|	втНовыеУдельныеЦены КАК втНовыеУдельныеЦены
	|		ЛЕВОЕ СОЕДИНЕНИЕ втТекущиеУдельныеЦены КАК втТекущиеУдельныеЦены
	|		ПО втНовыеУдельныеЦены.Группа = втТекущиеУдельныеЦены.Группа
	|			И втНовыеУдельныеЦены.Крепость = втТекущиеУдельныеЦены.Крепость
	|			И втНовыеУдельныеЦены.УдельнаяЦена = втТекущиеУдельныеЦены.УдельнаяЦена
	|ГДЕ
	|	втТекущиеУдельныеЦены.Группа ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ВидАлкогольнойПродукции В ИЕРАРХИИ
	|			(ВЫБРАТЬ
	|				втГруппыДляРегистрации.Группа КАК Группа
	|			ИЗ
	|				втГруппыДляРегистрации КАК втГруппыДляРегистрации)";
	
	Запрос.УстановитьПараметр("Ссылка",                		Ссылка);
	Запрос.УстановитьПараметр("ТипРарус",                	Перечисления.ТипыПодключаемогоОборудования.Рарус);
	Запрос.УстановитьПараметр("Период",                		Новый Граница(Дата, ВидГраницы.Исключая));	
	Запрос.УстановитьПараметр("ТаблицаНовыхУдельныхЦен",    ТаблицаНовыхУдельныхЦен);
	МастерКлючГруппыРабПодразделения = "000003458";
	Запрос.УстановитьПараметр("РабочиеПодразделения",       Справочники.ПодразделенияКомпании.НайтиПоРеквизиту("ЕРПМастерКлюч", МастерКлючГруппыРабПодразделения));	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка 		 = РезультатЗапроса.Выбрать();
	МассивНоменалатур= Новый Массив;
	
	
	Пока Выборка.Следующий() Цикл
		МассивНоменалатур.Добавить(Выборка.Номенклатура);	
	КонецЦикла;	
	
	Если МассивНоменалатур.Количество() Тогда
		ОбменДаннымиСобытия.ЗарегистрироватьИзмененияРегистраТоварыВОборудовании(МассивНоменалатур);
	КонецЕсли;
	
КонецПроцедуры
