// Модуль менеджера справочника "НоменклатураПоставщиков"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Функция получения номенклатуры поставщика по контрагенту и номенклатуре.
//
// Параметры:
//	Номенклатура - Ссылка - Номенклатура для поиска.
//  Контрагент   - Ссылка - Поставщик для поиска.
//
// Возвращаемое значение:
//  Результат - Таблица с найденными элементами номенклатуры поставщика.
//
Функция ВыполнитьПоискНоменклатурыПоставщиков(Контрагент, Номенклатура, ХарактеристикаНоменклатуры = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	               	|	НоменклатураПоставщиков.Ссылка КАК Ссылка
	               	|ИЗ
	               	|	Справочник.НоменклатураПоставщиков КАК НоменклатураПоставщиков
	               	|ГДЕ
	               	|	НоменклатураПоставщиков.Номенклатура = &Номенклатура
	               	|	И НоменклатураПоставщиков.Владелец = &Владелец
	               	|	И НоменклатураПоставщиков.ХарактеристикаНоменклатуры = &ХарактеристикаНоменклатуры";
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Запрос.УстановитьПараметр("Владелец",Контрагент);
	Запрос.УстановитьПараметр("ХарактеристикаНоменклатуры",?(ХарактеристикаНоменклатуры = Неопределено, Справочники.ХарактеристикиНоменклатуры.ПустаяСсылка(), ХарактеристикаНоменклатуры));
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции //ВыполнитьПоискНоменклатурыПоставщиков()

// Заполняет номенклатуру, характеристику, упаковку в номенклатуре поставщика с пустой номенклатурой.
//
// Параметры:
//  Товары - ТаблицаЗначений - таблица, содержащая данные для связывания номенклатуры с номенклатурой поставщика.
//  Отказ - Булево - Истина, если не удалось связать номенклатуру с номенклатурой поставщика.
//
Процедура СвязатьНоменклатуруСНоменклатуройПоставщика(Товары, Отказ) Экспорт
		
		Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	Товары.НоменклатураПоставщика КАК НоменклатураПоставщика,
			|	Товары.Номенклатура           КАК Номенклатура,
			|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
			|ПОМЕСТИТЬ
			|	Товары
			|ИЗ
			|	&Товары КАК Товары
			|ГДЕ
			|	Товары.НоменклатураПоставщика <> ЗНАЧЕНИЕ(Справочник.НоменклатураПоставщиков.ПустаяСсылка)
			|	И Товары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|;
			|ВЫБРАТЬ
			|	Товары.НоменклатураПоставщика КАК НоменклатураПоставщика,
			|	Товары.Номенклатура           КАК Номенклатура,
			|	Товары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры
			|ПОМЕСТИТЬ
			|	СгруппированныеТовары
			|ИЗ
			|	Товары КАК Товары
			|ГДЕ
			|	Товары.НоменклатураПоставщика.Номенклатура = ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
			|СГРУППИРОВАТЬ ПО
			|	Товары.НоменклатураПоставщика,
			|	Товары.Номенклатура,
			|	Товары.ХарактеристикаНоменклатуры
			|;
			|ВЫБРАТЬ
			|	СгруппированныеТовары.НоменклатураПоставщика КАК НоменклатураПоставщика,
			|	СгруппированныеТовары.Номенклатура           КАК Номенклатура,
			|	СгруппированныеТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	КОЛИЧЕСТВО(*)                                КАК Количество
			|ИЗ
			|	СгруппированныеТовары КАК СгруппированныеТовары
			|СГРУППИРОВАТЬ ПО
			|	СгруппированныеТовары.НоменклатураПоставщика,
			|	СгруппированныеТовары.Номенклатура,
			|	СгруппированныеТовары.ХарактеристикаНоменклатуры
			|");
			
		Запрос.УстановитьПараметр("Товары", Товары.Выгрузить(,"НомерСтроки,НоменклатураПоставщика,Номенклатура,ХарактеристикаНоменклатуры"));
		
		РезультатЗапроса = Запрос.ВыполнитьПакет();
		
		Если Не РезультатЗапроса[2].Пустой() Тогда
			
			Выборка = РезультатЗапроса[2].Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				Попытка
					
					ЗаблокироватьДанныеДляРедактирования(Выборка.НоменклатураПоставщика);
					НоменклатураПоставщикаОбъект = Выборка.НоменклатураПоставщика.ПолучитьОбъект();
					ЗаполнитьЗначенияСвойств(НоменклатураПоставщикаОбъект, Выборка);
					НоменклатураПоставщикаОбъект.Записать();
					
				Исключение
					
					ТекстОшибки = НСтр("ru='Не удалось заблокировать %Элемент%. %ОписаниеОшибки%'");
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%Элемент%",        Выборка.НоменклатураПоставщика);
					ТекстОшибки = СтрЗаменить(ТекстОшибки, "%ОписаниеОшибки%", КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
					
					Отказ = Истина;
					ВызватьИсключение ТекстОшибки;
						
				КонецПопытки;
				
			КонецЦикла;
			
		КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("Владелец");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты =  Новый Структура();
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Процедура формирует наименование объекта.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнении операции.
//
Функция СформироватьНаименованиеПоУмолчанию(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Формируем наименование в зависимости от заполненных реквизитов.
	Наименование = "";
	// Артикул
	Если НЕ ПустаяСтрока(СокрЛП(Объект.Артикул)) Тогда
		Наименование = Наименование + " " + СокрЛП(Объект.Артикул);
	КонецЕсли;
	
	// Номенклатура
	Если ЗначениеЗаполнено(Объект.Номенклатура) Тогда
		Наименование = Наименование + " " + СокрЛП(Объект.Номенклатура);
	КонецЕсли;
	
	// Доп.пробел перед прочими св-вами
	Если НЕ ПустаяСтрока(Объект.Наименование) Тогда
		Наименование = Наименование + " ";
	КонецЕсли;
	
	// Свойства
	Если НЕ ПараметрыДействия=Неопределено Тогда
		Если ПараметрыДействия.Форма.ПолучитьФункциональнуюОпциюФормы("ИспользоватьДополнительныеРеквизитыИСведения")
			И ЕстьРеквизит(ПараметрыДействия.Форма, "Свойства_ОписаниеДополнительныхРеквизитов") Тогда
			НомерСвойства = 0;
			Для Каждого ДополнительноеСвойство Из ПараметрыДействия.Форма.Свойства_ОписаниеДополнительныхРеквизитов Цикл
				ЗначениеСвойства = ПараметрыДействия.Форма[ДополнительноеСвойство.ИмяРеквизитаЗначение];
				Если ЗначениеЗаполнено(ДополнительноеСвойство.ИмяРеквизитаЗначение) Тогда
					НаименованиеСвойства = ПараметрыДействия.Форма[ДополнительноеСвойство.ИмяРеквизитаЗначение];
				Иначе
					НаименованиеСвойства = Строка(ДополнительноеСвойство.Свойство);
				КонецЕсли;
			
				Если ЗначениеЗаполнено(ЗначениеСвойства) Тогда
					НомерСвойства = НомерСвойства + 1;
					Наименование = Наименование + ?(НомерСвойства = 1,"", ", ") + НаименованиеСвойства +": "+ ЗначениеСвойства;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
	// Обрежем лишние пробелы
	Наименование = СокрЛП(Наименование);
	
	// Проверим что получилось
	Если ПустаяСтрока(Наименование) Тогда
		Наименование = "<" + НСтр("ru = 'не заполнены реквизиты'") + ">";
	КонецЕсли;
	
	Возврат Наименование;
	
КонецФункции // СформироватьНаименованиеПоУмолчанию()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли