
#Область ОбработкаСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	// Обработчик механизма "ВерсионированиеОбъектов"
	ВерсионированиеОбъектов.ПриСозданииНаСервере(ЭтаФорма);
	
	// Обработчик подсистемы "Дополнительные отчеты и обработки"
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	
	ОбновитьПраваДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(Объект.ПериодПлана) Тогда 
		ОбновитьОтображениеДней();
	Иначе
		СкрытьДни();
	КонецЕсли;	
	
	ОбновитьОтображениеПолейФормы();
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПланаПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПериодПлана) Тогда 
		Объект.ПериодПлана = НачалоМесяца(Объект.ПериодПлана);		
		ОбновитьОтображениеДней();
	Иначе
		СкрытьДни();
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПродажПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.ПериодПлана) Тогда 
		ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма);
	КонецЕсли;	
		
КонецПроцедуры

&НаКлиенте
Процедура ПоказыватьПериодыРаботыТорговыхТочекПриИзменении(Элемент)
	
	ОбновитьОтображениеПолейФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка	= Ложь;
	ДанныеВыбора			= Новый СписокЗначений();	
	
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИТ_СтатусыПлановПродаж.НаПодготовке"));
	ДанныеВыбора.Добавить(ПредопределенноеЗначение("Перечисление.ИТ_СтатусыПлановПродаж.НаСогласовании"));
	
КонецПроцедуры

&НаКлиенте
Процедура ПланПродажСуммаРаспределеноПриИзменении(Элемент)
	
	ТорговаяТочка		= ОпределитьРеквизитВыделеннойСтроки("ТорговаяТочка");	
	СуммаКРаспределению	= ОпределитьРеквизитВыделеннойСтроки("СуммаРаспределено");
	
	Если СуммаКРаспределению <> Неопределено Тогда 
		РаспределитьСуммыПланаСервер(ТорговаяТочка, СуммаКРаспределению);
		ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ПланПродаж_ОбновитьПраваДоступа" Тогда 
		ОбновитьПраваДоступа();
		ОбновитьОтображениеПолейФормы();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьПраваДоступа();
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОбновитьОтображениеПолейФормы();
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура ЗаполнитьТорговыеТочки(Команда)
	
	ЗаполнитьТорговыеТочкиСервер();	
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыПлана(Команда)
	
	ЗаполнитьСуммыПланаСервер();	
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСуммыПлана(Команда)
	
	РаспределитьСуммыПланаСервер();	
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСуммыПлана_ТекущаяСтрока(Команда)
	
	ТорговаяТочка = ОпределитьРеквизитВыделеннойСтроки("ТорговаяТочка");
	ЗаполнитьСуммыПланаСервер(ТорговаяТочка);	
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РаспределитьСуммыПлана_ТекущаяСтрока(Команда)
	
	ТорговаяТочка = ОпределитьРеквизитВыделеннойСтроки("ТорговаяТочка");	
	РаспределитьСуммыПланаСервер(ТорговаяТочка);
	ИТ_ПланыПродаж_КлиентСервер.ПересчитатьСуммыПоДням(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПраваДоступа()
	
	ПраваДоступа				= ИТ_ПланыПродаж.ПолучитьПраваДоступа("ЛинейныйМенеджер", Объект.Статус);
	РедактированиеДоступно		= ПраваДоступа.Редактирование;	
	СлужебныеРеквизитыДоступны	= ПраваДоступа.СлужебныеРеквизиты;	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьОтображениеПолейФормы()
	
	Элементы.ПланПродажГруппаПериодыРаботыТорговыхТочек.Видимость = ПоказыватьПериодыРаботыТорговыхТочек;
	
	ЭтаФорма.ТолькоПросмотр = Не(РедактированиеДоступно);
	
	Элементы.ПланПродаж_ОбработкаПланаПродаж.Доступность				= РедактированиеДоступно;
	Элементы.ПланПродажЗаполнитьТорговыеТочки.Доступность				= РедактированиеДоступно;
	Элементы.ПланПродажЗаполнитьСуммыПлана.Доступность					= РедактированиеДоступно;
	Элементы.ПланПродажРаспределитьСуммыПлана.Доступность				= РедактированиеДоступно;
	
	Элементы.ПланПродаж_ОбработкаСтрокиПланаПродаж.Доступность			= РедактированиеДоступно;
	Элементы.ПланПродажЗаполнитьСуммыПлана_ТекущаяСтрока.Доступность	= РедактированиеДоступно;
	Элементы.ПланПродажРаспределитьСуммыПлана_ТекущаяСтрока.Доступность	= РедактированиеДоступно;
	
КонецПроцедуры	

&НаКлиенте
Процедура ОбновитьОтображениеДней()
	
	ПоследнийДень	= День(КонецМесяца(Объект.ПериодПлана));
	МесяцПлана		= Месяц(Объект.ПериодПлана);
	ГодПлана		= Год(Объект.ПериодПлана);
	
	Для НомерДня = 1 По 31 Цикл 
		Если НомерДня <= ПоследнийДень Тогда 
			ДатаДня				= Дата(ГодПлана, МесяцПлана, НомерДня);
			АктивностьДня		= Истина;
			ЗаголовокЭлемента	= Формат(ДатаДня, "ДФ='ддд"" / ""дд.ММ'");
		Иначе
			ДатаДня				= Дата(1, 1, 1);
			АктивностьДня		= Ложь;
			ЗаголовокЭлемента	= "Неактивен";	
		КонецЕсли;	
		
		ИмяЭлемента = "ПланПродажСуммаДень_" + Формат(НомерДня, "ЧДЦ=0; ЧН=0; ЧГ=0");
		Элементы[ИмяЭлемента].Видимость = АктивностьДня;		
		Элементы[ИмяЭлемента].Заголовок = ЗаголовокЭлемента;
	КонецЦикла;	
	
КонецПроцедуры

&НаКлиенте
Процедура СкрытьДни()
	
	Для НомерДня = 1 По 31 Цикл 
		ИмяЭлемента = "ПланПродажСуммаДень_" + Формат(НомерДня, "ЧДЦ=0; ЧН=0; ЧГ=0");
		Элементы[ИмяЭлемента].Видимость = Ложь;		
	КонецЦикла;
	
КонецПроцедуры	

&НаКлиенте
Функция ОпределитьРеквизитВыделеннойСтроки(ИмяРеквизита)
	
	ТекущиеДанные = Элементы.ПланПродаж.ТекущиеДанные;
	ЗначениеРеквизита = Неопределено;
	
	Если ТекущиеДанные = Неопределено Тогда 
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выделена строка.",, "Объект.ПланПродаж");
	Иначе
		ЗначениеРеквизита = ТекущиеДанные[ИмяРеквизита];
		
		Если Не(ЗначениеЗаполнено(ЗначениеРеквизита)) Тогда 
			ТекстСообщения = СтрШаблон("Не заполнен реквизит %1.", ИмяРеквизита);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,, "Объект.ПланПродаж");
		КонецЕсли;	
	КонецЕсли;
	
	Возврат ЗначениеРеквизита;
	
КонецФункции	

&НаСервере
Процедура ЗаполнитьТорговыеТочкиСервер()
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьТорговыеТочки();
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСуммыПланаСервер(ТорговыеТочки = Неопределено)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ЗаполнитьСуммыПланаПродаж(ТорговыеТочки);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	
КонецПроцедуры

&НаСервере
Процедура РаспределитьСуммыПланаСервер(ТорговыеТочки = Неопределено, СуммаКРаспределению = 0)
	
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.РаспределитьСуммыПланаПродаж(ТорговыеТочки, СуммаКРаспределению);
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");	
	
КонецПроцедуры

#КонецОбласти





	




