
// Обработчик события нажатия кнопки "Наличие на складах".
//
// Параметры:
//  ПараметрКоманды - Произвольный - В параметр передается значение от источника, в котором реализована команда
//  ПараметрыВыполненияКоманды - ПараметрыВыполненияКоманды - В обработчике команды можно изменить значение свойств
//                                                            параметра Окно и Уникальность.
//
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено ИЛИ ПараметрКоманды.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("Номенклатура", ПолучитьСписокТоваров(ПараметрКоманды));
	
	ОткрытьФорму("Отчет.ОстаткиИОборотыТоваров.Форма", Новый Структура("Отбор,КлючВарианта,СформироватьПриОткрытии", ОтчетОтбор, "Остатки", Истина), ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность);
	
КонецПроцедуры

// Функция возвращает список номенклатуры табличной части "Товары"
//
&НаСервере
Функция ПолучитьСписокТоваров(Документ)
	
	// !!! в основной форме отчета нужно реализовать возможность отбора "ВСписке", как в "Альфе-6".
	
	//СписокТоваров = Новый СписокЗначений;
	Если Документ.Товары.Количество() <> 0 Тогда
		Для Каждого Товар Из Документ.Товары Цикл
			Возврат Товар.Номенклатура;
			//СписокТоваров.Добавить(Товар.Номенклатура);
		КонецЦикла;
	КонецЕсли;
	//Возврат СписокТоваров;
	
КонецФункции
