
&НаСервере
Функция ЗапроситьНаСервере()
	
	ВидОперации = Перечисления.ВидыОперацийВЕТИС.ЗапросНаАннулированиеВСД;
	
	ДанныеДляВыгрузки = ИнтеграцияВЕТИСКлиентСервер.СтруктураДанныхДляВыгрузки();
	ДанныеДляВыгрузки.ХозяйствующийСубъект = Отправитель;
	ДанныеДляВыгрузки.Предприятие          = ПредприятиеОтправитель;
	ДанныеДляВыгрузки.ВидОперации          = ВидОперации;
	
	ДанныеДляВыгрузки.Вставить("Объект",               ВСД);
	ДанныеДляВыгрузки.Вставить("ВСД",                  ВСД);
	ДанныеДляВыгрузки.Вставить("ПричинаАннулирования", ПричинаАннулирования);
	ДанныеДляВыгрузки.Вставить("ДатаАннулирования",    ДатаАннулирования);
	ДанныеДляВыгрузки.Вставить("Ответственный",        Ответственный);
	
	РезультатОбмена = ИнтеграцияВЕТИСВызовСервера.ПодготовитьЗапрос(Отправитель, ПредприятиеОтправитель, ВидОперации, ДанныеДляВыгрузки, УникальныйИдентификаторВладельца);
	
	Возврат РезультатОбмена;
	
КонецФункции

&НаКлиенте
Процедура НачатьВыполнениеЗапроса()
	
	РезультатОбмена = ЗапроситьНаСервере();
	
	Закрыть(РезультатОбмена);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВСД                       = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ВСД", Неопределено);
	УникальныйИдентификаторВладельца = ПолучитьЗначениеПараметраСтруктуры(Параметры, "УникальныйИдентификатор", УникальныйИдентификатор);
	Отправитель               = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Отправитель", Неопределено);
	ПредприятиеОтправитель    = ПолучитьЗначениеПараметраСтруктуры(Параметры, "ПредприятиеОтправитель", Неопределено);
	
	ДатаАннулирования = ТекущаяДатаСеанса();
	Ответственный     = Пользователи.ТекущийПользователь();
	
	Если Не ЗначениеЗаполнено(ВСД) Тогда
		ВывестиСообщение(НСтр("ru = 'Не указано ВСД!'"));
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отправитель) Тогда
		ВывестиСообщение(НСтр("ru = 'Не указан Отправитель!'"));
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ПредприятиеОтправитель) Тогда
		ВывестиСообщение(НСтр("ru = 'Не указано Предприятие отправитель!'"));
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыпонить(Команда)
	
	Если Не ЗначениеЗаполнено(ПричинаАннулирования) Тогда
		ПоказатьПредупреждение(, "Не задана причина аннулирования!");
		Возврат;
	КонецЕсли;
	
	НачатьВыполнениеЗапроса();
	
КонецПроцедуры
