&НаСервере
Функция ПолучитьДанныеДляВозвратаПоставщику(ПеремещениеТовара)
	
	Запрос = Новый Запрос;
	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Тип("ДокументСсылка.ПоступлениеТоваров"));
	МассивТипов.Добавить(Тип("ДокументСсылка.АвансовыйОтчет"));
	Запрос.УстановитьПараметр("МассивТипов", 	МассивТипов);
	Запрос.УстановитьПараметр("Ссылка", 	 	ПеремещениеТовара);
	Запрос.УстановитьПараметр("Дата", 	ТекущаяДата());
	Запрос.Текст= 
	"ВЫБРАТЬ
	|	ПеремещениеТоваровТовары.Ссылка.ДокументОснование КАК Партия,
	|	ПеремещениеТоваровТовары.Количество КАК Количество,
	|	ПеремещениеТоваровТовары.СуммаВсего КАК СуммаВсего,
	|	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	|	ПеремещениеТоваровТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПеремещениеТоваровТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ПеремещениеТоваровТовары.Коэффициент КАК Коэффициент
	|ПОМЕСТИТЬ ВТ_Перемещение
	|ИЗ
	|	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	|ГДЕ
	|	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	|	И ТИПЗНАЧЕНИЯ(ПеремещениеТоваровТовары.Ссылка.ДокументОснование) В (&МассивТипов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Перемещение.Партия КАК Партия,
	|	ВТ_Перемещение.Количество КАК Количество,
	|	ВТ_Перемещение.Номенклатура КАК Номенклатура,
	|	ВТ_Перемещение.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	|	ПартииТоваровКомпанииОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ПартииТоваровКомпанииОстатки.СуммаОстаток КАК СуммаОстаток,
	|	ВТ_Перемещение.СуммаВсего КАК СуммаВсего,
	|	ВТ_Перемещение.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	ВТ_Перемещение.Коэффициент КАК Коэффициент
	|ИЗ
	|	ВТ_Перемещение КАК ВТ_Перемещение
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании.Остатки(&Дата, ) КАК ПартииТоваровКомпанииОстатки
	|		ПО ВТ_Перемещение.Партия = ПартииТоваровКомпанииОстатки.Партия";
	
	ДокументОснования = Новый Массив;
	
	Выборка = Запрос.Выполнить();
	ВыборкаПартий = Выборка.Выбрать(ОбходРезультатаЗапроса.Прямой);
	Пока ВыборкаПартий.Следующий() Цикл
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Партия",  					ВыборкаПартий.Партия);
		НоваяСтрока.Вставить("ХарактеристикаНоменклатуры",	ВыборкаПартий.ХарактеристикаНоменклатуры);
		НоваяСтрока.Вставить("Количество",      			?(ВыборкаПартий.Количество > ВыборкаПартий.КоличествоОстаток, ВыборкаПартий.КоличествоОстаток, ВыборкаПартий.Количество));
		НоваяСтрока.Вставить("Номенклатура",      			ВыборкаПартий.Номенклатура);
		НоваяСтрока.Вставить("Контрагент",      			ВыборкаПартий.Партия.Контрагент);
		ДокументОснования.Добавить(НоваяСтрока);
	КонецЦикла;
	
	Возврат ДокументОснования;
	
КонецФункции

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ПеремещениеТовара = ПараметрКоманды;
	ДокументОснования = ПолучитьДанныеДляВозвратаПоставщику(ПеремещениеТовара);
	СтруктураЗаполнения = Новый Структура();
	СтруктураЗаполнения.Вставить("ДокументЗаполнения",	  ПеремещениеТовара);
	СтруктураЗаполнения.Вставить("ДанныеЗаполнения", ДокументОснования);
	ПараметрыФормы = Новый Структура("Основание", СтруктураЗаполнения);
	
	ОткрытьФорму("Документ.ВозвратПоставщику.ФормаОбъекта", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, Новый УникальныйИдентификатор);
	
КонецПроцедуры
