
#Область ПрограммныйИнтерфейс

// Получение текущего ключа сессии для организации
//
// Параметры:
//  Организация				 - СправочникСсылка.Организации	 - Организация, для которой необходимо выполнить получение ключа
//  КлючСессииСУЗ			 - Булево						 - Признак того, что получаем ключ для СУЗ
//  ИдентификаторСоединения	 - Строка						 - Идентификатор соединения для получения токена СУЗ.
// 
// Возвращаемое значение:
//  Структура - Признак получения ключа и текст ошибки
//
Функция КлючСессии(Организация = Неопределено, КлючСессииСУЗ = Ложь, ИдентификаторСоединения = "") Экспорт
	
	Результат = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
	
	// Без организации не получим все данные для входа
	Если Организация = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если КлючСессииСУЗ И ПустаяСтрока(ИдентификаторСоединения) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Получим параметры запроса для формирования
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(Организация);
	
	// Для получения ключа необходимо получить данные из Честного знака и подписать их
	ПараметрыАвторизации = ПараметрыАвторизации(ПараметрыЗапроса);
	Если НЕ ПустаяСтрока(ПараметрыАвторизации.ТекстОшибки) Тогда
		Результат.ТекстОшибки = ПараметрыАвторизации.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	// Получим сертификат
	Если НЕ ЗначениеЗаполнено(ПараметрыЗапроса.Сертификат) Тогда
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Для организации %1 не указан сертификат для входа в личный кабинет Честного знака'"),
			Организация);
		Возврат Результат;
	КонецЕсли;
	
	ДвоичныеДанныеСтроки = ПолучитьДвоичныеДанныеИзСтроки(ПараметрыАвторизации.Данные);
	ДанныеВBase64 = Base64Строка(ДвоичныеДанныеСтроки);
	
	// Подпишем полученные данные
	Попытка
		Подпись = ПодписатьДанные(
			ДанныеВBase64,
			ПараметрыЗапроса.Сертификат,
			Ложь);
	Исключение
		Результат.ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка подписания данных сертификатом'"),
			УровеньЖурналаРегистрации.Ошибка, , ,
			НСтр("ru = 'Ошибка при подписании сертификатом данных для отправки:'")
			+ Символы.ПС + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Результат;
	КонецПопытки;
	
	УстановитьПолученныйКлючСессии(
		Организация,
		Результат,
		ПараметрыЗапроса,
		ПараметрыАвторизации,
		Подпись,
		ИдентификаторСоединения);
	
	Возврат Результат;
	
КонецФункции

// Подпись передаваемых данных
// 
// Параметры:
//  Данные - Строка - Подписываемые данные
//	Сертификат - СправочникСсылка.СертификатыКлючейЭлектроннойПодписиИШифрования - Сертификат подписи
//  Открепленная - Булево - Открепленная
// 
// Возвращаемое значение:
//  Строка - Текст сообщения
// 
Функция ПодписатьДанные(Данные, Сертификат, Открепленная = Истина) Экспорт
	
	Отпечаток = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Сертификат, "Отпечаток");
	
	СертификатКриптографии = ЭлектроннаяПодписьСлужебный.ПолучитьСертификатПоОтпечатку(Отпечаток, Ложь, Ложь);
	
	ОбъектПодписи = Новый COMОбъект("CAdESCOM.CPSigner");
	ОбъектПодписи.Certificate = ПолучитьСертификатПоОтпечатку(
		ПолучитьHexСтрокуИзДвоичныхДанных(СертификатКриптографии.Отпечаток));
	ОбъектПодписи.Options = 1;
	
	АтрибутыВремени = Новый COMОбъект("CAdESCOM.CPAttribute");
	АтрибутыВремени.Name = 0; // Атрибут штампа времени
	АтрибутыВремени.Value = ТекущаяДатаСеанса();
	ОбъектПодписи.AuthenticatedAttributes2.Add(АтрибутыВремени);
	
	УстановитьПривилегированныйРежим(Истина);
	ПарольСертификата = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(Сертификат, "ПарольСертификата");
	Если НЕ ПарольСертификата = Неопределено Тогда
		ОбъектПодписи.KeyPin = ПарольСертификата;
	КонецЕсли;
	//Если ЗначениеЗаполнено(ПарольСертификата) Тогда
	//	ОбъектПодписи.KeyPin = ПарольСертификата;
	//КонецЕсли;
	УстановитьПривилегированныйРежим(Ложь);
	
	ТекстДляПодписи = СокрЛП(Данные);
	oSignedData = Новый COMОбъект("CAdESCOM.CadesSignedData");
	//oSignedData.ContentEncoding = 1;
	oSignedData.Content = ТекстДляПодписи;
	
	ТипКодировки = 0;
	sSignedMessage = oSignedData.SignCades(ОбъектПодписи, 1, Открепленная, ТипКодировки);
	
	Возврат sSignedMessage;
	
КонецФункции // ПодписатьДанные()

// Формирование из структуры текста JSON
// 
// Параметры:
//  Структура - Структура - Структура данных
//	БезПробеловИПереносов	- Булево - Результат без пробелов
// 
// Возвращаемое значение:
//  Строка - Текст JSON
// 
Функция ДанныеВТекстJSON(Структура, БезПробеловИПереносов = Ложь) Экспорт 
	
	Если БезПробеловИПереносов Тогда
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет, "");
	Иначе
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON();
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
	
	ЗаписатьJSON(ЗаписьJSON, Структура);
	
	ТекстJSON = ЗаписьJSON.Закрыть();
	
	Возврат ТекстJSON;
	
КонецФункции

// Формирование из текста JSON структуру.
// 
// Параметры:
//  ТекстJSON - Строка - Текст JSON
//	ПрочитатьВСоответствие - Булево - Чтение объекта JSON в соответствие или структуру.
// 
// Возвращаемое значение:
//  Структура - Текст JSON
// 
Функция ТекстJSONВОбъект(ТекстJSON, ПрочитатьВСоответствие = Ложь) Экспорт 
	
	Чтение = Новый ЧтениеJSON;
	Чтение.УстановитьСтроку(ТекстJSON);
	Попытка
		РезультатРазбора = ПрочитатьJSON(Чтение, ПрочитатьВСоответствие);
	Исключение
		РезультатРазбора = Неопределено;
	КонецПопытки;
	Возврат РезультатРазбора;
	
КонецФункции

#Область ОбменПоAPI

// Выполняет команду обработки и возвращает результат ее выполнения.
//
// Параметры:
//   ПараметрыКоманды - Структура - Параметры, с которыми выполняется команда.
//   АдресРезультата - Строка - Адрес временного хранилища.
//
// Возвращаемое значение:
//   * Структура - Результат выполнения, который далее передается на клиент.
//   * Неопределено - Если был передан АдресРезультата.
//
Процедура СформироватьЗапрос(ПараметрыКоманды, АдресРезультата) Экспорт
	
	Результат = Новый Структура();
	
	СертификатыОрганизации = СертификатыОрганизации(ПараметрыКоманды.Организация);
	Результат.Вставить("ОтборСертификатов", СертификатыОрганизации);
	
	// Проверим необходимость подписания данных и аунтификацию
	ТекстОшибкиКлюча = "";
	Если НЕ ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "НеТребуетсяКлючСессии", Ложь) Тогда
		
		// Получим идентификатор соединения
		КлючСессииСУЗ = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "КлючСессииСУЗ", Ложь);
		ИдентификаторСоединения = "";
		Если КлючСессииСУЗ Тогда
			ПолучитьКлючСессииСУЗ(ПараметрыКоманды, Результат, ИдентификаторСоединения, ТекстОшибкиКлюча);
		КонецЕсли;
		
		Если ПустаяСтрока(ТекстОшибкиКлюча)
			И НЕ ПолучитьЗначениеПараметраСтруктуры(Результат, "ПолученКлючСессии", Ложь) Тогда
			ПолученияКлючаСессии(ПараметрыКоманды, Результат, КлючСессииСУЗ, ИдентификаторСоединения);
			Если Результат.Свойство("ТекстОшибки") Тогда
				Если ПустаяСтрока(Результат.ТекстОшибки) Тогда
					ТекстОшибкиКлюча = НСтр("ru = 'Не удалось получить данные авторизации'");
				Иначе
					ТекстОшибкиКлюча = Результат.ТекстОшибки;
				КонецЕсли;
				Результат.ТекстОшибки = "";
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	// Получить сообщение JSON из документа
	Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПараметрыКоманды.Документ);
	
	Попытка
		ПричинаОтказа = "";
		СтруктураСообщения = Менеджер.ЗапросДокумента(ПараметрыКоманды.Документ, ПараметрыКоманды, ПричинаОтказа);
		
		Если СтруктураСообщения = Неопределено Тогда
			Результат.Вставить("ТекстОшибки", ПричинаОтказа);
		Иначе
			СообщениеJSON = ДанныеВТекстJSON(СтруктураСообщения, Истина);
			Результат.Вставить("СообщениеJSON", СообщениеJSON);
		КонецЕсли;
		
	Исключение
		Результат.Вставить("ТекстОшибки", СтрШаблон(
			НСтр("ru = 'Ошибка при формировании запроса: %1'"),
			ОписаниеОшибки()));
	КонецПопытки;
	
	Если Результат.Свойство("ТекстОшибки") И ПустаяСтрока(Результат.ТекстОшибки) Тогда
		Результат.ТекстОшибки = ТекстОшибкиКлюча;
	КонецЕсли;
	
	// Помещаем результат во временное хранилище
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры // СформироватьЗапрос()

// Выполняет отправку команды и ее возвращение.
//
// Параметры:
//   ПараметрыКоманды - Структура - Параметры, с которыми выполняется команда.
//   АдресРезультата - Строка - Адрес временного хранилища.
//
// Возвращаемое значение:
//   * Структура - Результат выполнения, который далее передается на клиент.
//   * Неопределено - Если был передан АдресРезультата.
//
Процедура ОтправитьЗапрос(ПараметрыКоманды, АдресРезультата) Экспорт
	
	ОтветЗапроса = Новый Структура("Успешно,Сообщение,ТекстОшибки", Ложь, "", "");
	
	// Получим параметры запроса для формирования
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	// Получим ключ сессии
	КлючСессии = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "КлючСессии", "");
	ТребуетсяКлючСессии = НЕ ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "НеТребуетсяКлючСессии", Ложь);
	
	НовыйКлюч = Ложь;
	
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии Тогда
		
		ПодписьДанныхАутентификации = ПолучитьЗначениеПараметраСтруктуры(
			ПараметрыКоманды, "ПодписьДанныхАутентификации", "");
		Если ЗначениеЗаполнено(ПодписьДанныхАутентификации) Тогда
			ПолучениеКлюча = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
			УстановитьПолученныйКлючСессии(
				ПараметрыКоманды.Организация,
				ПолучениеКлюча,
				ПараметрыЗапроса,
				ПараметрыКоманды,
				ПодписьДанныхАутентификации,
				ПараметрыКоманды.ИдентификаторСоединения);
			Если НЕ ПустаяСтрока(ПолучениеКлюча.ТекстОшибки) Тогда
				ОтветЗапроса.Вставить("ТекстОшибки", ПолучениеКлюча.ТекстОшибки);
				ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураКлюча = ПолучитьСформироватьКлючСессии(
			ПараметрыКоманды.Организация,,
			ПараметрыКоманды.КлючСессииСУЗ,
			ПараметрыКоманды.ИдентификаторСоединения);
		
		Если НЕ ПустаяСтрока(СтруктураКлюча.ТекстОшибки) Тогда
			ОтветЗапроса.Вставить("ТекстОшибки", СтруктураКлюча.ТекстОшибки);
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
		
		НовыйКлюч = Истина;
		
	КонецЕсли;
	
	// Если ключ не получен, то дальнейшая отправка смысла не имеет
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии Тогда
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат;
	ИначеЕсли НовыйКлюч Тогда
		ОтветЗапроса.Вставить("КлючСессии", СтруктураКлюча);
	КонецЕсли;
	
	// Получить сообщение JSON из документа
	Если ТипЗнч(ПараметрыКоманды.Документ) = Тип("ДокументСсылка.ЗаказКодовМаркировки") Тогда
		ОтправкаЗапросаЗаказаМаркировки(ПараметрыКоманды, ПараметрыЗапроса, КлючСессии, ОтветЗапроса);
	Иначе
		ОтправкаЗапросаСозданияДокумента(ПараметрыКоманды, ПараметрыЗапроса, КлючСессии, ОтветЗапроса);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
	
КонецПроцедуры // ОтправитьЗапрос()

// Получить ключ сесии.
//
// Параметры:
//   ПараметрыКоманды - Структура - Параметры, с которыми выполняется команда.
//   АдресРезультата - Строка - Адрес временного хранилища.
//
// Возвращаемое значение:
//   * Структура - Результат выполнения, который далее передается на клиент.
//   * Неопределено - Если был передан АдресРезультата.
//
Процедура ПроверитьКлючСессии(ПараметрыКоманды, АдресРезультата) Экспорт
	
	Результат = Новый Структура;
	
	СертификатыОрганизации = СертификатыОрганизации(ПараметрыКоманды.Организация);
	Результат.Вставить("ОтборСертификатов", СертификатыОрганизации);
	
	ПолученияКлючаСессии(ПараметрыКоманды, Результат);
	
	// Помещаем результат во временное хранилище
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры // ПолучениеКодыТоваровОстатков()

// Получить коды остатков товаров.
//
// Параметры:
//   ПараметрыКоманды - Структура - Параметры, с которыми выполняется команда.
//   АдресРезультата - Строка - Адрес временного хранилища.
//
// Возвращаемое значение:
//   * Структура - Результат выполнения, который далее передается на клиент.
//   * Неопределено - Если был передан АдресРезультата.
//
Процедура ПолучениеКодыТоваровОстатков(ПараметрыКоманды, АдресРезультата) Экспорт
	
	Результат = Новый Структура("УспешныйПоиск,ТекстОшибки", Ложь, "");
	
	КлючСессии = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "КлючСессии", "");
	Если ПустаяСтрока(КлючСессии) Тогда
		ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
		ПодписьДанныхАутентификации = ПолучитьЗначениеПараметраСтруктуры(
			ПараметрыКоманды, "ПодписаниеДанных", "");
		Если ЗначениеЗаполнено(ПодписьДанныхАутентификации) Тогда
			ПолучениеКлюча = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
			УстановитьПолученныйКлючСессии(
				ПараметрыКоманды.Организация,
				ПолучениеКлюча,
				ПараметрыЗапроса,
				ПараметрыКоманды,
				ПодписьДанныхАутентификации);
		КонецЕсли;
		
		СтруктураКлюча = ПолучитьСформироватьКлючСессии(ПараметрыКоманды.Организация);
		
		Если НЕ ПустаяСтрока(СтруктураКлюча.ТекстОшибки) Тогда
			Результат.Вставить("ТекстОшибки", СтруктураКлюча.ТекстОшибки);
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
		
		НовыйКлюч = Истина;
		
	КонецЕсли;
	
	// Если ключ не получен, то дальнейшая отправка смысла не имеет
	Если ПустаяСтрока(КлючСессии) Тогда
		ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	// Получим объект документа
	ДокументЗаказа = ПараметрыКоманды.Документ.ПолучитьОбъект();
	
	// Получим товары документа
	НайденныеСтрокиБезGTIN = ДокументЗаказа.Товары.НайтиСтроки(Новый Структура("GTIN", ""));
	
	КоличествоСтрокБезГТИН = НайденныеСтрокиБезGTIN.Количество();
	
	// Параметры запроса
	НомерСтраницы = 0;
	ИННОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ПараметрыКоманды.Организация, "ИНН");
	
	Пока КоличествоСтрокБезГТИН > 0 Цикл
		
		СчитанныеДанные =
			НайтиТоварыПоИНН(ПараметрыКоманды.Организация, ИННОрганизации, НомерСтраницы, КлючСессии);
		НомерСтраницы = НомерСтраницы + 1;
		
		Если НЕ ПустаяСтрока(СчитанныеДанные.ТекстОшибки) Тогда
			Результат.ТекстОшибки = СчитанныеДанные.ТекстОшибки;
			Прервать;
		КонецЕсли;
		
		Если СчитанныеДанные.Данные.Количество() = 0 Тогда
			// Обошли весь каталог
			Прервать;
		КонецЕсли;
		
		// Проверяем и устанавливаем GTIN
		Для Каждого ТекущаяСтрока Из СчитанныеДанные.Данные Цикл
			СтруктураПоиска = СтруктураПоискаПоОстаткам(ДокументЗаказа, ТекущаяСтрока);
			НайденныеСтроки = ДокументЗаказа.Товары.НайтиСтроки(СтруктураПоиска);
			
			// Заполним Строки без GTIN
			Для Каждого СтрокаТовара Из НайденныеСтроки Цикл
				Если НЕ ПустаяСтрока(СтрокаТовара.GTIN) Тогда
					Продолжить;
				КонецЕсли;
				СтрокаТовара.GTIN = ТекущаяСтрока.Ключ;
				КоличествоСтрокБезГТИН = КоличествоСтрокБезГТИН - 1;
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
	// Зафиксируем изменения
	ДокументЗаказа.ОписаниеОшибки = Результат.ТекстОшибки;
	
	Если ЗначениеЗаполнено(ДокументЗаказа.ОписаниеОшибки) Тогда
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Получение GTIN из Честного знака.'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,
			ДокументЗаказа.Ссылка,
			СтрШаблон(
			НСтр("ru = 'При получении GTIN возникла ошибка: %1'"),
				ДокументЗаказа.ОписаниеОшибки));
	КонецЕсли;
	
	// Статус заказа
	СтруктураПоиска = Новый Структура();
	СтруктураПоиска.Вставить("GTIN", "");
	
	НайденныеСтроки = ДокументЗаказа.Товары.НайтиСтроки(СтруктураПоиска);
	КоличествоТоваров = ДокументЗаказа.Товары.Количество();
	
	Если НайденныеСтроки.Количество() <> ДокументЗаказа.Товары.Количество() 
		И КоличествоТоваров <> 0 Тогда
		Если НайденныеСтроки.Количество() = 0 Тогда
			ДокументЗаказа.Статус = Перечисления.СтатусыДокументовМаркировки.ПолностьюЗаполненGTIN;
		Иначе
			ДокументЗаказа.Статус = Перечисления.СтатусыДокументовМаркировки.ЧастичноЗаполненGTIN;
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		ДокументЗаказа.Записать();
		Результат.УспешныйПоиск = Истина;
	Исключение
		Результат.ТекстОшибки = 
			СтрШаблон(
			НСтр("ru = 'При записи GTIN в документ возникла ошибка: %1'"),
			ОписаниеОшибки());
	КонецПопытки;
	
	// Помещаем результат во временное хранилище
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры // ПолучениеКодыТоваровОстатков()

// Запрос загрузки кодов маркировки.
//
// Параметры:
//   ПараметрыКоманды - Структура - Параметры, с которыми выполняется команда.
//   АдресРезультата - Строка - Адрес временного хранилища.
//
// Возвращаемое значение:
//   * Структура - Результат выполнения, который далее передается на клиент.
//   * Неопределено - Если был передан АдресРезультата.
//
Процедура ЗапросЗагрузкиКодовМаркировки(ПараметрыКоманды, АдресРезультата) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ОтветЗапроса = Новый Структура("Успешно,Сообщение", Ложь, "");
	
	СертификатыОрганизации = СертификатыОрганизации(ПараметрыКоманды.Организация);
	ОтветЗапроса.Вставить("ОтборСертификатов", СертификатыОрганизации);
	
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	// Получим ключ сессии
	КлючСессии = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "КлючСессии", "");
	
	Если НЕ ПолученКлючСессииСУЗ(КлючСессии, ПараметрыКоманды, ПараметрыЗапроса, ОтветЗапроса, АдресРезультата) Тогда
		Возврат;
	КонецЕсли;
	
	ОтветЗапроса.Вставить("ТекстОшибки", "");
	
	// Таблица полученных кодов маркировки
	ТаблицаКодовМаркировки = Новый ТаблицаЗначений();
	ТаблицаКодовМаркировки.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТаблицаКодовМаркировки.Колонки.Добавить(
		"ХарактеристикаНоменклатуры", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТаблицаКодовМаркировки.Колонки.Добавить("КодМаркировки", Новый ОписаниеТипов("Строка"));
	
	НаборКодовМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	НаборКодовМаркировки.Отбор.ДокументОснование.Установить(ПараметрыКоманды.Документ);
	НаборКодовМаркировки.Прочитать();
	
	// Получим ранее считанные коды маркировки
	ТекущиеКодыМаркировки = НаборКодовМаркировки.Выгрузить();
	
	ДокументОбъект = ПараметрыКоманды.Документ.ПолучитьОбъект();
	
	ДатаЗаписи = ТекущаяДатаСеанса();
	
	ПараметрыЗапроса.Вставить("Токен", КлючСессии);
	
	// Для каждой строки товара получим коды маркировки из ЧЗ
	СтруктураПоиска = Новый Структура("GTIN");
	ПолученыВсеКоды = Истина;
	Для Каждого ТекущаяСтрока Из ДокументОбъект.Товары Цикл
		
		// Если уже есть в регистре коды маркировки, то получать не будем
		ЗаполнитьЗначенияСвойств(СтруктураПоиска, ТекущаяСтрока);
		НайденныеСтроки = ТекущиеКодыМаркировки.НайтиСтроки(СтруктураПоиска);
		
		СчитанноеКоличество = НайденныеСтроки.Количество();
		
		Если СчитанноеКоличество >= ТекущаяСтрока.Количество Тогда
			Продолжить;
		КонецЕсли;
		
		КоличествоЗаказа = ТекущаяСтрока.Количество - СчитанноеКоличество;
		
		ПолученныеКоды = КодыМаркировкиПоGTIN(
			ДокументОбъект.ИдентификаторЗаказа,
			ТекущаяСтрока.GTIN,
			КоличествоЗаказа,
			СчитанноеКоличество,
			ПараметрыЗапроса,
			ПараметрыКоманды);
			
		Если НЕ ПустаяСтрока(ПолученныеКоды.ТекстОшибки) Тогда
			
			ПолученыВсеКоды = Ложь;
			ОтветЗапроса.ТекстОшибки = ?(ПустаяСтрока(ПолученныеКоды.ТекстОшибки),
				НСтр("ru = 'Ошибка при получении кодов маркировки'"),
				ПолученныеКоды.ТекстОшибки);
			Прервать;
			
		КонецЕсли;
		
		Если ПолученныеКоды.Данные = Неопределено Тогда
			ПолученыВсеКоды = Ложь;
			Продолжить;
		КонецЕсли;
		
		// Дополним коды маркировки
		Для Каждого КодМаркировки Из ПолученныеКоды.Данные.КодыМаркировки Цикл
			
			КодМаркировкиПолный = СтрЗаменить(
				КодМаркировки, 
				МенеджерОборудованияМаркировкаКлиентСервер.РазделительGS1(),
				МенеджерОборудованияМаркировкаКлиентСервер.ЭкранированныйСимволGS1());
			
			НоваяСтрока = ТекущиеКодыМаркировки.Добавить();
			НоваяСтрока.ДокументОснование   = ПараметрыКоманды.Документ;
			НоваяСтрока.Организация         = ПараметрыКоманды.Организация;
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.Состояние           = Перечисления.СостоянияКодовМаркировки.Эмитирован;
			НоваяСтрока.КодМаркировкиПолный = КодМаркировкиПолный;
			НоваяСтрока.КодМаркировки       = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(КодМаркировкиПолный, "", Ложь);
			НоваяСтрока.ЕстьКриптохвост     = Истина;
			НоваяСтрока.Количество          = 1;
			НоваяСтрока.ЕдиницаИзмерения    = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.Номенклатура, "ОсновнаяЕдиницаИзмерения");
			
			// Разложим код маркировки на составляющие
			СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер
					.РазобратьШтриховойКодТовара(КодМаркировки);
			НоваяСтрока.СерийныйНомер = СтруктураМаркировки.СерийныйНомер;
			
			НоваяСтрока = ТаблицаКодовМаркировки.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ТекущаяСтрока);
			НоваяСтрока.КодМаркировки = КодМаркировкиПолный;
		КонецЦикла;
		
	КонецЦикла;
	
	// Запишим полученные коды
	НаборКодовМаркировки.Загрузить(ТекущиеКодыМаркировки);
	НаборКодовМаркировки.Записать();
	
	// Заполним регистр для печати кодов маркировки
	Если ТаблицаКодовМаркировки.Количество() > 0 Тогда
		МаркировкаТоваровСервер.ДобавитьЗаписиВРегистр(ПараметрыКоманды.Документ, ТаблицаКодовМаркировки);
	КонецЕсли;
	
	// Если коды все получены, то поменем статус документа на Выполнен
	Если ПолученыВсеКоды Тогда
		
		ДокументОбъект.Статус = Перечисления.СтатусыДокументовМаркировки.Выполнен;
		ДокументОбъект.ОписаниеОшибки = "";
		
		ОтветЗапроса.Успешно = Истина;
		ОтветЗапроса.Сообщение = НСтр("ru = 'Успешно получены коды маркировки'");
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Получение кодов маркировки из Честного знака.'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация,,
			ДокументОбъект.Ссылка,
			НСтр("ru = 'Получены коды маркировки по заказу'"));
		
	ИначеЕсли ЗначениеЗаполнено(ОтветЗапроса.ТекстОшибки) Тогда
		
		ДокументОбъект.ОписаниеОшибки = ОтветЗапроса.ТекстОшибки;
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Получение кодов маркировки из Честного знака.'",
			ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,
			ДокументОбъект.Ссылка,
			СтрШаблон(
			НСтр("ru = 'При получении кодов маркировки возникла ошибка: %1'"),
				ДокументОбъект.ОписаниеОшибки));
		
	КонецЕсли;
	
	ДокументОбъект.ОбменДанными.Загрузка = Истина;
	ДокументОбъект.Записать();
	
	ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
	
КонецПроцедуры // ЗапросЗагрузкиКодовМаркировки()

// Запрос загрузки кодов маркировки.
//
// Параметры:
//   ПараметрыКоманды - Структура - Параметры, с которыми выполняется команда.
//   АдресРезультата - Строка - Адрес временного хранилища.
//
// Возвращаемое значение:
//   * Структура - Результат выполнения, который далее передается на клиент.
//   * Неопределено - Если был передан АдресРезультата.
//
Процедура ЗапросСтатусовКодовМаркировки(ПараметрыКоманды, АдресРезультата) Экспорт
	
	ОтветЗапроса = Новый Структура("Успешно,Сообщение,Данные", Ложь, "", Неопределено);
	
	СертификатыОрганизации = СертификатыОрганизации(ПараметрыКоманды.Организация);
	ОтветЗапроса.Вставить("ОтборСертификатов", СертификатыОрганизации);
	
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	// Получим ключ сессии
	КлючСессии = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "КлючСессии", "");
	ТребуетсяКлючСессии = НЕ ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "НеТребуетсяКлючСессии", Ложь);
	
	ОбновлятьСостоянияКодовМаркировки = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "ОбновлятьСостоянияКодовМаркировки",Ложь);
	
	НовыйКлюч = Ложь;
	Если НЕ ЗначениеЗаполнено(КлючСессии) Тогда
		СтруктураКлюча = ТекущийКодСессииОрганизации(ПараметрыКоманды.Организация);
		Если СтруктураКлюча = Неопределено Тогда
			ПолученияКлючаСессии(ПараметрыКоманды, ОтветЗапроса);
			Если ОтветЗапроса.Свойство("КлючСессии") Тогда
				КлючСессии = ОтветЗапроса.КлючСессии;
				ОтветЗапроса.Удалить("КлючСессии");
			КонецЕсли;
			СтруктураКлюча = ТекущийКодСессииОрганизации(ПараметрыКоманды.Организация);
			Если СтруктураКлюча <> Неопределено Тогда
				НовыйКлюч = Истина;
			КонецЕсли;
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
	КонецЕсли;
	
	Если ОтветЗапроса.Свойство("ТекстОшибки") Тогда
		Если ПустаяСтрока(ОтветЗапроса.ТекстОшибки) Тогда
			ОтветЗапроса.ТекстОшибки = НСтр("ru = 'Не удалось получить данные авторизации'");
		КонецЕсли;
		// вываливаемся
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии И ПараметрыКоманды.Свойство("ПодписьДанныхАутентификации") Тогда
		
		ПодписьДанныхАутентификации = ПолучитьЗначениеПараметраСтруктуры(
			ПараметрыКоманды, "ПодписьДанныхАутентификации", "");
		Если ЗначениеЗаполнено(ПодписьДанныхАутентификации) Тогда
			ПолучениеКлюча = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
			УстановитьПолученныйКлючСессии(
				ПараметрыКоманды.Организация,
				ПолучениеКлюча,
				ПараметрыЗапроса,
				ПараметрыКоманды,
				ПодписьДанныхАутентификации);
			Если НЕ ПустаяСтрока(ПолучениеКлюча.ТекстОшибки) Тогда
				ОтветЗапроса.Вставить("ТекстОшибки", ПолучениеКлюча.ТекстОшибки);
				ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураКлюча = ПолучитьСформироватьКлючСессии(ПараметрыКоманды.Организация);
		
		Если НЕ ПустаяСтрока(СтруктураКлюча.ТекстОшибки) Тогда
			ОтветЗапроса.Вставить("ТекстОшибки", СтруктураКлюча.ТекстОшибки);
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
		
		НовыйКлюч = Истина;
		
	КонецЕсли;
	
	// Если ключ не получен, то дальнейшая отправка смысла не имеет
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии Тогда
		ОтветЗапроса.Удалить("ТекстОшибки");
		ОтветЗапроса.Успешно = Истина;
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат;
	ИначеЕсли НовыйКлюч Тогда
		ОтветЗапроса.Вставить("КлючСессии", СтруктураКлюча);
	КонецЕсли;
	
	КодыМаркировки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ПараметрыКоманды.КодыМаркировки);
	
	ТоварнаяГруппа = "";
	Если ПараметрыКоманды.Свойство("ТоварнаяГруппа") Тогда
		ТоварнаяГруппа = ПараметрыКоманды.ТоварнаяГруппа;
	КонецЕсли;	
		
	// Подготовим данные для выполнения запроса
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	////Удалить
	ПараметрыЗапроса.АдресКонтура = "markirovka.crpt.ru";
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json; charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept-Charset", "utf-8");	
	ЗаголовокHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
	
	Для Индекс = 0 По КодыМаркировки.Количество() - 1 Цикл
		КодыМаркировки[Индекс] = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(КодыМаркировки[Индекс], , Ложь);
	КонецЦикла;
	
	//URLЗапроса = "api/v3/facade/cis/cis_list";
	
	URLЗапроса = СтрШаблон(
			"api/v3/true-api/cises/info%1",
			"?pg=" + ТоварнаяГруппа);	
	
	//ДанныеЗапроса = Новый Структура();
	//ДанныеЗапроса.Вставить("cis", КодыМаркировки);
	
	Запись_JSON = Новый ЗаписьJSON;
	Запись_JSON.УстановитьСтроку();
	ЗаписатьJSON(Запись_JSON,КодыМаркировки);
	ДанныеЗапроса = Запись_JSON.Закрыть();
	
	РезультатЗапроса = ОтправитьЗапросВСервис(
		URLЗапроса,
		ДанныеЗапроса,
		ПараметрыЗапроса,
		"POST",
		Неопределено,
		ЗаголовокHTTP
	);
	
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.КодСостояния = 200 или РезультатОтправки.КодСостояния = 404 Тогда
		
		ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета, Истина);
		
		Если ДанныеОбработки = Неопределено Тогда
			
			ОтветЗапроса.Вставить("ТекстОшибки", 
				СтрШаблон(НСтр("ru = 'Ошибка в результате отправки запроса состояния кодов маркировки: %1'"),
				РезультатОтправки.СообщениеОтвета)
			);
			
		Иначе
			
			СтруктураВозврата = Новый Соответствие;
			Для каждого стрДанныеОбработки из ДанныеОбработки Цикл
				СтруктураКИ = Новый Соответствие;
				
				Для каждого эл из стрДанныеОбработки Цикл
					СтруктураКИ.Вставить(Эл.Ключ,Эл.Значение);
				КонецЦикла;	
				
				Для каждого эл из стрДанныеОбработки.Получить("cisInfo") Цикл
					СтруктураКИ.Вставить(Эл.Ключ,Эл.Значение);
				КонецЦикла;	
				
				СтруктураВозврата.Вставить(стрДанныеОбработки.Получить("cisInfo").Получить("requestedCis"),СтруктураКИ);
			КонецЦикла;
			
			Если ОбновлятьСостоянияКодовМаркировки Тогда
				ОбновитьСостоянияКодовМаркировки(СтруктураВозврата,ПараметрыКоманды);
			Иначе
				Данные = Новый Структура;
				Данные.Вставить("КодыМаркировки", ПодготовитьКодыМаркировки(СтруктураВозврата, ПараметрыКоманды));
			КонецЕсли;
			
			ОтветЗапроса.Данные = Данные;
			ОтветЗапроса.Успешно = Истина;
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()
			),
			УровеньЖурналаРегистрации.Ошибка,
			, ,
			НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки:'")
				+ Символы.ПС
				+ ?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)
		);
		
		ОтветЗапроса.Вставить("ТекстОшибки",
			НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки: подробности в Журнале регистрации'")
		);
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
	
КонецПроцедуры // ЗапросСтатусовКодовМаркировки()

Функция ЗапросСозданияДокумента(ПараметрыКоманды, ПараметрыЗапроса, КлючСессии, Документ, ВидДокумента = "")
	
	// Определим вид документа
	Если ПустаяСтрока(ВидДокумента) Тогда
		ВидДокумента = ВидДокумента(Документ, ПараметрыКоманды);
	КонецЕсли;
	
	Результат = Новый Структура("ТекстОшибки,Результат", "", Неопределено);
	
	СтрокаДокумента = ДанныеДокументаВСтроку(ПараметрыКоманды.СообщениеJSON);
	
	ТелоЗапроса = Новый Структура;
	ТелоЗапроса.Вставить("product_document", СтрокаДокумента);
	ТелоЗапроса.Вставить("document_format",  "MANUAL");
	ТелоЗапроса.Вставить("signature",        ДвоичныеДанныеBase64(ПараметрыКоманды.ПодписьДанныхЗапроса));
	ТелоЗапроса.Вставить("type",             ВидДокумента);
	
	ПараметрыЗапросаОбмена = Новый Массив;
		ПараметрыЗапросаОбмена.Добавить(
			СтрШаблон(
				"pg=%1",
				ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ОсобенностьУчета.ТоварнаяГруппа")));
		
	URLЗапроса = СтрШаблон(
		"api/%1/lk/documents/create?%2",
		ПараметрыЗапроса.ВерсияФорматаОбмена,
		СтрСоединить(ПараметрыЗапросаОбмена, "&"));
	
	РезультатЗапроса = ОтправитьЗапросВСервис(
		URLЗапроса,
		ТелоЗапроса,
		ПараметрыЗапроса,
		"POST",
		КлючСессии);
	
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.Свойство("ОтветПолучен")
		ИЛИ РезультатОтправки.Свойство("СообщениеОтвета") Тогда
		
		Если РезультатОтправки.КодСостояния = 200
			ИЛИ РезультатОтправки.КодСостояния = 201 Тогда
			
			РезультатОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета);
			Если РезультатОбработки = Неопределено Тогда
				Результат.Результат = РезультатОтправки.СообщениеОтвета;
			Иначе
				Результат.Результат = РезультатОбработки;
			КонецЕсли;
			
			Возврат Результат;
			
		Иначе
			
			Результат.ТекстОшибки = РезультатОтправки.ТекстОшибки;
			//Мальцев А.Ю.+++
			Если РезультатОтправки.Свойство("СообщениеОтвета") Тогда
				Результат.ТекстОшибки = Результат.ТекстОшибки + ": " + РезультатОтправки.СообщениеОтвета;
			КонецЕсли;
			//Мальцев А.Ю.---
		КонецЕсли;
		
	Иначе
		
		Результат.ТекстОшибки = РезультатОтправки.ТекстОшибки;
		//Мальцев А.Ю.+++
		Если РезультатОтправки.Свойство("СообщениеОтвета") Тогда
			Результат.ТекстОшибки = Результат.ТекстОшибки + ": " + РезультатОтправки.СообщениеОтвета;
		КонецЕсли;
		//Мальцев А.Ю.---
		
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Запрос загрузки кодов маркировки.
//
// Параметры:
//   ПараметрыКоманды - Структура - Параметры, с которыми выполняется команда.
//   АдресРезультата - Строка - Адрес временного хранилища.
//
// Возвращаемое значение:
//   * Структура - Результат выполнения, который далее передается на клиент.
//   * Неопределено - Если был передан АдресРезультата.
//
Процедура ЗапросСверкиКодовМаркировки(ПараметрыКоманды, АдресРезультата) Экспорт
	
	ОтветЗапроса = Новый Структура("Успешно,Сообщение,Данные", Ложь, "", Неопределено);
	
	СертификатыОрганизации = СертификатыОрганизации(ПараметрыКоманды.Организация);
	ОтветЗапроса.Вставить("ОтборСертификатов", СертификатыОрганизации);
	
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	// Получим ключ сессии
	КлючСессии = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "КлючСессии", "");
	ТребуетсяКлючСессии = НЕ ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "НеТребуетсяКлючСессии", Ложь);
	
	НовыйКлюч = Ложь;
	Если НЕ ЗначениеЗаполнено(КлючСессии) Тогда
		СтруктураКлюча = ТекущийКодСессииОрганизации(ПараметрыКоманды.Организация);
		Если СтруктураКлюча = Неопределено Тогда
			ПолученияКлючаСессии(ПараметрыКоманды, ОтветЗапроса);
			Если ОтветЗапроса.Свойство("КлючСессии") Тогда
				КлючСессии = ОтветЗапроса.КлючСессии;
				ОтветЗапроса.Удалить("КлючСессии");
			КонецЕсли;
			СтруктураКлюча = ТекущийКодСессииОрганизации(ПараметрыКоманды.Организация);
			Если СтруктураКлюча <> Неопределено Тогда
				НовыйКлюч = Истина;
			КонецЕсли;
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
	КонецЕсли;
	
	Если ОтветЗапроса.Свойство("ТекстОшибки") Тогда
		Если ПустаяСтрока(ОтветЗапроса.ТекстОшибки) Тогда
			ОтветЗапроса.ТекстОшибки = НСтр("ru = 'Не удалось получить данные авторизации'");
		КонецЕсли;
		// вываливаемся
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии И ПараметрыКоманды.Свойство("ПодписьДанныхАутентификации") Тогда
		
		ПодписьДанныхАутентификации = ПолучитьЗначениеПараметраСтруктуры(
			ПараметрыКоманды, "ПодписьДанныхАутентификации", "");
		Если ЗначениеЗаполнено(ПодписьДанныхАутентификации) Тогда
			ПолучениеКлюча = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
			УстановитьПолученныйКлючСессии(
				ПараметрыКоманды.Организация,
				ПолучениеКлюча,
				ПараметрыЗапроса,
				ПараметрыКоманды,
				ПодписьДанныхАутентификации);
			Если НЕ ПустаяСтрока(ПолучениеКлюча.ТекстОшибки) Тогда
				ОтветЗапроса.Вставить("ТекстОшибки", ПолучениеКлюча.ТекстОшибки);
				ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураКлюча = ПолучитьСформироватьКлючСессии(ПараметрыКоманды.Организация);
		
		Если НЕ ПустаяСтрока(СтруктураКлюча.ТекстОшибки) Тогда
			ОтветЗапроса.Вставить("ТекстОшибки", СтруктураКлюча.ТекстОшибки);
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
		
		НовыйКлюч = Истина;
		
	КонецЕсли;
	
	// Если ключ не получен, то дальнейшая отправка смысла не имеет
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии Тогда
		ОтветЗапроса.Удалить("ТекстОшибки");
		ОтветЗапроса.Успешно = Истина;
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат;
	ИначеЕсли НовыйКлюч Тогда
		ОтветЗапроса.Вставить("КлючСессии", СтруктураКлюча);
	КонецЕсли;
	
	// Подготовим данные для выполнения запроса
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
	
	ПараметрыСтрокиЗапроса = Новый Массив;
	ПараметрыОтбора = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "ПараметрыОтбора", Неопределено);
	
	ЕстьОтборНачалоПериода = Ложь;
	
	Если ПараметрыОтбора <> Неопределено Тогда
		
		Если ПараметрыОтбора.Свойство("GTIN") Тогда
			ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("gtin=%1", ПараметрыОтбора.GTIN));
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("КодТНВЭД") Тогда
			ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("tnVed10=%1", ПараметрыОтбора.КодТНВЭД));
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("Статус") Тогда
			Для Каждого Значение Из ПараметрыОтбора.Статус Цикл
				ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("cisStatus=%1", Значение.Значение));
			КонецЦикла;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("ТипЭмиссии") Тогда
			Для Каждого Значение Из ПараметрыОтбора.ТипЭмиссии Цикл
				ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("emissionType=%1", СпособВыпускаВОборот(Значение)));
			КонецЦикла;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("НачалоПериода") Тогда
			ЕстьОтборНачалоПериода = Истина;
			ПараметрыСтрокиЗапроса.Добавить(
				СтрШаблон("emissionDateFrom=%1", ДатаСЧасовымПоясом(ПараметрыОтбора.НачалоПериода))
			);
		КонецЕсли;
		Если ПараметрыОтбора.Свойство("КонецПериода") Тогда
			ПараметрыСтрокиЗапроса.Добавить(
				СтрШаблон("emissionDateTo=%1", ДатаСЧасовымПоясом(ПараметрыОтбора.КонецПериода))
			);
		КонецЕсли;
		
	КонецЕсли;
	
	НомерСтраницы = 1;
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"page=%1",
			Формат(НомерСтраницы, "ЧН=0; ЧГ=0")));
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"limit=%1",
			"1000"));
	
	ШаблонURLЗапроса = "api/v3/facade/identifytools/listV2";
	
	ПоследняяЗапись = Новый Структура("UIT, emissionDate");
	Данные = Новый Массив;
	
	Пока Истина Цикл
		
		
		URLЗапроса = ШаблонURLЗапроса + "?" + СтрСоединить(ПараметрыСтрокиЗапроса, "&");
		
		РезультатЗапроса = ОтправитьЗапросВСервис(
			URLЗапроса,
			"",
			ПараметрыЗапроса,
			"GET",
			Неопределено,
			ЗаголовокHTTP
		);
		
		РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
		
		Если РезультатОтправки.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета, Истина);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ОтветЗапроса.Вставить("ТекстОшибки", 
					СтрШаблон(НСтр("ru = 'Ошибка в результате отправки запроса состояния кодов маркировки: %1'"),
					РезультатОтправки.СообщениеОтвета)
				);
				Прервать;
				
			Иначе
				
				Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("uit=%1", ПоследняяЗапись.UIT));
				Если НЕ Индекс = Неопределено Тогда 
					ПараметрыСтрокиЗапроса.Удалить(Индекс);
				КонецЕсли;
				
				Если ЕстьОтборНачалоПериода Тогда
					ДатаЭмОт = ДатаСЧасовымПоясом(ПараметрыОтбора.НачалоПериода);
				Иначе
					ДатаЭмОт = ПоследняяЗапись.emissionDate;
				КонецЕсли;
				ЕстьОтборНачалоПериода = Ложь;
				
				Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("emissionDateFrom=%1", ДатаЭмОт));
				Если НЕ Индекс = Неопределено Тогда
					ПараметрыСтрокиЗапроса.Удалить(Индекс);
				КонецЕсли;
				
				КоличествоДоДобавления = Данные.Количество();
				ДополнитьМассив(
					Данные,
					ПодготовитьДанныеСверки(ДанныеОбработки, ПоследняяЗапись),
					Истина
				);
				
				Если Данные.Количество() = КоличествоДоДобавления Тогда
					// по какой-то причине мы зациклились..
					Прервать;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПоследняяЗапись.UIT) Тогда
					ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("uit=%1", ПоследняяЗапись.UIT));
					ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("emissionDateFrom=%1", ПоследняяЗапись.emissionDate));
				Иначе
					Прервать;
				КонецЕсли;
				
				ОтветЗапроса.Данные = Данные;
				ОтветЗапроса.Успешно = Истина;
				
			КонецЕсли;
			
		Иначе
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()
				),
				УровеньЖурналаРегистрации.Ошибка,
				, ,
				НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки:'")
					+ Символы.ПС
					+ ?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)
			);
			
			ОтветЗапроса.Вставить("ТекстОшибки",
				НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки: подробности в Журнале регистрации'")
			);
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
	
КонецПроцедуры // ЗапросСверкиКодовМаркировки()

// Дополняет массив МассивПриемник значениями из массива МассивИсточник.
//
// Параметры:
//  МассивПриемник - Массив - массив, в который необходимо добавить значения.
//  МассивИсточник - Массив - массив значений для заполнения,
//	ТолькоУникальныеЗначения - булево, необязательный, если истина, 
//		то в массив будут включены только те значения, которых в нем еще нет, причем единожды.
// 
Процедура ДополнитьМассив(МассивПриемник, МассивИсточник, ТолькоУникальныеЗначения = Ложь)
	
	Если ТолькоУникальныеЗначения Тогда
		
		УникальныеЗначения = Новый Соответствие;
		
		Для Каждого Значение Из МассивПриемник Цикл
			УникальныеЗначения.Вставить(Значение.КодМаркировки, Истина);
		КонецЦикла;
		
		Для Каждого Значение Из МассивИсточник Цикл
			Если УникальныеЗначения[Значение.КодМаркировки] = Неопределено Тогда
				МассивПриемник.Добавить(Значение);
				УникальныеЗначения.Вставить(Значение.КодМаркировки, Истина);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		
		Для Каждого Значение Из МассивИсточник Цикл
			МассивПриемник.Добавить(Значение);
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Запрос загрузки кодов маркировки.
//
// Параметры:
//   ПараметрыКоманды - Структура - Параметры, с которыми выполняется команда.
//   АдресРезультата - Строка - Адрес временного хранилища.
//
// Возвращаемое значение:
//   * Структура - Результат выполнения, который далее передается на клиент.
//   * Неопределено - Если был передан АдресРезультата.
//
Процедура ЗапросВложенныхКодовМаркировки(ПараметрыКоманды, АдресРезультата) Экспорт
	
	ОтветЗапроса = Новый Структура("Успешно,Сообщение,Данные", Ложь, "", Неопределено);
	
	СертификатыОрганизации = СертификатыОрганизации(ПараметрыКоманды.Организация);
	ОтветЗапроса.Вставить("ОтборСертификатов", СертификатыОрганизации);
	
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	// Получим ключ сессии
	КлючСессии = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "КлючСессии", "");
	ТребуетсяКлючСессии = НЕ ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "НеТребуетсяКлючСессии", Ложь);
	
	НовыйКлюч = Ложь;
	Если НЕ ЗначениеЗаполнено(КлючСессии) Тогда
		СтруктураКлюча = ТекущийКодСессииОрганизации(ПараметрыКоманды.Организация);
		Если СтруктураКлюча = Неопределено Тогда
			ПолученияКлючаСессии(ПараметрыКоманды, ОтветЗапроса);
			Если ОтветЗапроса.Свойство("КлючСессии") Тогда
				КлючСессии = ОтветЗапроса.КлючСессии;
				ОтветЗапроса.Удалить("КлючСессии");
			КонецЕсли;
			СтруктураКлюча = ТекущийКодСессииОрганизации(ПараметрыКоманды.Организация);
			Если СтруктураКлюча <> Неопределено Тогда
				НовыйКлюч = Истина;
			КонецЕсли;
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
	КонецЕсли;
	
	Если ОтветЗапроса.Свойство("ТекстОшибки") Тогда
		Если ПустаяСтрока(ОтветЗапроса.ТекстОшибки) Тогда
			ОтветЗапроса.ТекстОшибки = НСтр("ru = 'Не удалось получить данные авторизации'");
		КонецЕсли;
		// вываливаемся
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии И ПараметрыКоманды.Свойство("ПодписьДанныхАутентификации") Тогда
		
		ПодписьДанныхАутентификации = ПолучитьЗначениеПараметраСтруктуры(
			ПараметрыКоманды, "ПодписьДанныхАутентификации", "");
		Если ЗначениеЗаполнено(ПодписьДанныхАутентификации) Тогда
			ПолучениеКлюча = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
			УстановитьПолученныйКлючСессии(
				ПараметрыКоманды.Организация,
				ПолучениеКлюча,
				ПараметрыЗапроса,
				ПараметрыКоманды,
				ПодписьДанныхАутентификации);
			Если НЕ ПустаяСтрока(ПолучениеКлюча.ТекстОшибки) Тогда
				ОтветЗапроса.Вставить("ТекстОшибки", ПолучениеКлюча.ТекстОшибки);
				ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураКлюча = ПолучитьСформироватьКлючСессии(ПараметрыКоманды.Организация);
		
		Если НЕ ПустаяСтрока(СтруктураКлюча.ТекстОшибки) Тогда
			ОтветЗапроса.Вставить("ТекстОшибки", СтруктураКлюча.ТекстОшибки);
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
		
		НовыйКлюч = Истина;
		
	КонецЕсли;
	
	// Если ключ не получен, то дальнейшая отправка смысла не имеет
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии Тогда
		ОтветЗапроса.Удалить("ТекстОшибки");
		ОтветЗапроса.Успешно = Истина;
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат;
	ИначеЕсли НовыйКлюч Тогда
		ОтветЗапроса.Вставить("КлючСессии", СтруктураКлюча);
	КонецЕсли;
	
	КодыМаркировки = ОбщегоНазначенияКлиентСервер.СкопироватьМассив(ПараметрыКоманды.КодыМаркировки);
	
	// Подготовим данные для выполнения запроса
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
	
	Для Индекс = 0 По КодыМаркировки.Количество() - 1 Цикл
		КодыМаркировки[Индекс] = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(КодыМаркировки[Индекс], , Ложь);
	КонецЦикла;
	
	URLЗапроса = "api/v3/facade/cis/cis_list";
	
	ДанныеЗапроса = Новый Структура();
	ДанныеЗапроса.Вставить("cises", КодыМаркировки);
	
	РезультатЗапроса = ОтправитьЗапросВСервис(
		URLЗапроса,
		ДанныеЗапроса,
		ПараметрыЗапроса,
		"POST",
		Неопределено,
		ЗаголовокHTTP
	);
	
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.КодСостояния = 200 Тогда
		
		ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета, Истина);
		
		Если ДанныеОбработки = Неопределено Тогда
			
			ОтветЗапроса.Вставить("ТекстОшибки", 
				СтрШаблон(НСтр("ru = 'Ошибка в результате отправки запроса состояния кодов маркировки: %1'"),
				РезультатОтправки.СообщениеОтвета)
			);
			
		Иначе
			
			Данные = Новый Соответствие;
			Для Каждого ДанныеКодаМаркировки Из ДанныеОбработки Цикл
				ВложенныеКодыМаркировки = Новый Массив;
				ДанныеВложенныхКодов = ДанныеКодаМаркировки.Значение.Получить("children");
				Если Не ДанныеВложенныхКодов = Неопределено Тогда
					Для Каждого ТекущийКодМаркировки Из ДанныеВложенныхКодов Цикл
						ВложенныеКодыМаркировки.Добавить(ТекущийКодМаркировки);
					КонецЦикла;
				КонецЕсли;
				Данные.Вставить(ДанныеКодаМаркировки.Ключ, ВложенныеКодыМаркировки);
			КонецЦикла;
			
			ОтветЗапроса.Данные = Данные;
			ОтветЗапроса.Успешно = Истина;
			
		КонецЕсли;
		
	Иначе
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()
			),
			УровеньЖурналаРегистрации.Ошибка,
			, ,
			НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки:'")
				+ Символы.ПС
				+ ?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)
		);
		
		ОтветЗапроса.Вставить("ТекстОшибки",
			НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки: подробности в Журнале регистрации'")
		);
		
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
	
КонецПроцедуры // ЗапросВложенныхКодовМаркировки()

// Запрос загрузки кодов маркировки.
//
// Параметры:
//   ПараметрыКоманды - Структура - Параметры, с которыми выполняется команда.
//   АдресРезультата - Строка - Адрес временного хранилища.
//
// Возвращаемое значение:
//   * Структура - Результат выполнения, который далее передается на клиент.
//   * Неопределено - Если был передан АдресРезультата.
//
Процедура ЗапросНаПолучениеКодовМаркировкиОрганизации(ПараметрыКоманды, АдресРезультата) Экспорт
	
	ОтветЗапроса = Новый Структура("Успешно,Сообщение,Данные", Ложь, "", Неопределено);
	
	СертификатыОрганизации = СертификатыОрганизации(ПараметрыКоманды.Организация);
	ОтветЗапроса.Вставить("ОтборСертификатов", СертификатыОрганизации);
	
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	// Получим ключ сессии
	КлючСессии = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "КлючСессии", "");
	ТребуетсяКлючСессии = НЕ ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "НеТребуетсяКлючСессии", Ложь);
	
	НовыйКлюч = Ложь;
	Если НЕ ЗначениеЗаполнено(КлючСессии) Тогда
		СтруктураКлюча = ТекущийКодСессииОрганизации(ПараметрыКоманды.Организация);
		Если СтруктураКлюча = Неопределено Тогда
			ПолученияКлючаСессии(ПараметрыКоманды, ОтветЗапроса);
			Если ОтветЗапроса.Свойство("КлючСессии") Тогда
				КлючСессии = ОтветЗапроса.КлючСессии;
				ОтветЗапроса.Удалить("КлючСессии");
			КонецЕсли;
			СтруктураКлюча = ТекущийКодСессииОрганизации(ПараметрыКоманды.Организация);
			Если СтруктураКлюча <> Неопределено Тогда
				НовыйКлюч = Истина;
			КонецЕсли;
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
	КонецЕсли;
	
	Если ОтветЗапроса.Свойство("ТекстОшибки") Тогда
		Если ПустаяСтрока(ОтветЗапроса.ТекстОшибки) Тогда
			ОтветЗапроса.ТекстОшибки = НСтр("ru = 'Не удалось получить данные авторизации'");
		КонецЕсли;
		// вываливаемся
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии И ПараметрыКоманды.Свойство("ПодписьДанныхАутентификации") Тогда
		
		ПодписьДанныхАутентификации = ПолучитьЗначениеПараметраСтруктуры(
			ПараметрыКоманды, "ПодписьДанныхАутентификации", "");
		Если ЗначениеЗаполнено(ПодписьДанныхАутентификации) Тогда
			ПолучениеКлюча = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
			УстановитьПолученныйКлючСессии(
				ПараметрыКоманды.Организация,
				ПолучениеКлюча,
				ПараметрыЗапроса,
				ПараметрыКоманды,
				ПодписьДанныхАутентификации);
			Если НЕ ПустаяСтрока(ПолучениеКлюча.ТекстОшибки) Тогда
				ОтветЗапроса.Вставить("ТекстОшибки", ПолучениеКлюча.ТекстОшибки);
				ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
				Возврат;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураКлюча = ПолучитьСформироватьКлючСессии(ПараметрыКоманды.Организация);
		
		Если НЕ ПустаяСтрока(СтруктураКлюча.ТекстОшибки) Тогда
			ОтветЗапроса.Вставить("ТекстОшибки", СтруктураКлюча.ТекстОшибки);
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
		
		НовыйКлюч = Истина;
		
	КонецЕсли;
	
	// Если ключ не получен, то дальнейшая отправка смысла не имеет
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии Тогда
		ОтветЗапроса.Удалить("ТекстОшибки");
		ОтветЗапроса.Успешно = Истина;
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат;
	ИначеЕсли НовыйКлюч Тогда
		ОтветЗапроса.Вставить("КлючСессии", СтруктураКлюча);
	КонецЕсли;
	
	// Подготовим данные для выполнения запроса
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json");
	ЗаголовокHTTP.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
	
	ПараметрыСтрокиЗапроса = Новый Массив;
	ПараметрыОтбора = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "ПараметрыОтбора", Неопределено);
	
	ЕстьОтборНачалоПериода = Ложь;
	
	Если ПараметрыОтбора <> Неопределено Тогда
		
		Если ПараметрыОтбора.Свойство("GTIN") Тогда
			ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("gtin=%1", ПараметрыОтбора.GTIN));
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("КодТНВЭД") Тогда
			ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("tnVed10=%1", ПараметрыОтбора.КодТНВЭД));
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("Статус") Тогда
			Для Каждого Значение Из ПараметрыОтбора.Статус Цикл
				ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("cisStatus=%1", Значение.Значение));
			КонецЦикла;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("ТипЭмиссии") Тогда
			Для Каждого Значение Из ПараметрыОтбора.ТипЭмиссии Цикл
				ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("emissionType=%1", СпособВыпускаВОборот(Значение)));
			КонецЦикла;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("НачалоПериода") Тогда
			ЕстьОтборНачалоПериода = Истина;
			ПараметрыСтрокиЗапроса.Добавить(
				СтрШаблон("emissionDateFrom=%1", ДатаСЧасовымПоясом(ПараметрыОтбора.НачалоПериода))
			);
		КонецЕсли;
		Если ПараметрыОтбора.Свойство("КонецПериода") Тогда
			ПараметрыСтрокиЗапроса.Добавить(
				СтрШаблон("emissionDateTo=%1", ДатаСЧасовымПоясом(ПараметрыОтбора.КонецПериода))
			);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"limit=%1",
			"15"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"order=%1",
			"ASC"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"orderColumn=%1",
			"emd"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"childrenPaging=%1",
			"false"));
	//ПараметрыСтрокиЗапроса.Добавить(
	//	СтрШаблон(
	//		"childrenPaging=%1",
	//		"true"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"packs=%1",
			"UNIT"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"cisStatus=%1",
			"INTRODUCED"));
	
	//ПараметрыСтрокиЗапроса.Добавить(
	//	СтрШаблон(
	//		"childrenLimit=%1",
	//		"1"));
	//
	//ПараметрыСтрокиЗапроса.Добавить(
	//	СтрШаблон(
	//		"childrenPage=%1",
	//		"1"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"pg=%1",
			"lp"));
	
	ШаблонURLЗапроса = "api/v4/facade/identifytools/listV2";
	
	ПоследняяЗапись = Новый Структура("UIT, emissionDate");
	Данные = Новый Массив;
	
	СоответствиеНоменклатуры = Новый Соответствие;
	ЛогистическаяУпаковка    = Перечисления.ВидыУпаковокМаркировки.Логистическая;
	ГрупповаяУпаковка        = Перечисления.ВидыУпаковокМаркировки.Групповая;
	ПотребительскаяУпаковка  = Перечисления.ВидыУпаковокМаркировки.Потребительская;
	НаборКодовМаркировки     = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	НаборИерархииУпаковок    = РегистрыСведений.СтруктураИерархииУпаковокИСМП.СоздатьНаборЗаписей();
	ВведенВОборот            = Перечисления.СостоянияКодовМаркировки.ВведенВОборот;
	
	Пока Истина Цикл
		
		URLЗапроса = ШаблонURLЗапроса + "?" + СтрСоединить(ПараметрыСтрокиЗапроса, "&");
		
		РезультатЗапроса = ОтправитьЗапросВСервис(
			URLЗапроса,
			"",
			ПараметрыЗапроса,
			"GET",
			Неопределено,
			ЗаголовокHTTP
		);
		
		РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
		
		Если РезультатОтправки.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета, Истина);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ОтветЗапроса.Вставить("ТекстОшибки", 
					СтрШаблон(НСтр("ru = 'Ошибка в результате отправки запроса состояния кодов маркировки: %1'"),
					РезультатОтправки.СообщениеОтвета)
				);
				Прервать;
				
			Иначе
				
				Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("uit=%1", ПоследняяЗапись.UIT));
				Если НЕ Индекс = Неопределено Тогда 
					ПараметрыСтрокиЗапроса.Удалить(Индекс);
				КонецЕсли;
				
				//Если ЕстьОтборНачалоПериода Тогда
				//	ДатаЭмОт = ДатаСЧасовымПоясом(ПараметрыОтбора.НачалоПериода);
				//Иначе
				//	ДатаЭмОт = ПоследняяЗапись.emissionDate;
				//КонецЕсли;
				//ЕстьОтборНачалоПериода = Ложь;
				
				//Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("emissionDateFrom=%1", ДатаЭмОт));
				//Если НЕ Индекс = Неопределено Тогда
				//	ПараметрыСтрокиЗапроса.Удалить(Индекс);
				//КонецЕсли;
				
				Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("orderedColumnValue=%1", ПоследняяЗапись.emissionDate));
				Если НЕ Индекс = Неопределено Тогда
					ПараметрыСтрокиЗапроса.Удалить(Индекс);
				КонецЕсли;
				
				Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("pageDir=%1", "NEXT"));
				Если НЕ Индекс = Неопределено Тогда
					ПараметрыСтрокиЗапроса.Удалить(Индекс);
				КонецЕсли;
				
				Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("cache=%1", "false"));
				Если НЕ Индекс = Неопределено Тогда
					ПараметрыСтрокиЗапроса.Удалить(Индекс);
				КонецЕсли;
				
				КоличествоДоДобавления = Данные.Количество();
				
				СоответствиеКодов = ДанныеОбработки.Получить("results");
				Для Каждого КлючЗначение Из СоответствиеКодов Цикл
					//СтрокаРезультата = Новый Структура("GTIN, Наименование, Производитель, Владелец, КодМаркировки, АктуальныйСтатус"); 
					
					ДатаЭмиссии        = КлючЗначение.Получить("emissionDate");
					АктуальныйСтатус   = КлючЗначение.Получить("status");
					ТипУпаковки        = КлючЗначение.Получить("packType");
					НаименованиюГруппы = КлючЗначение.Получить("productGroup");
					
					КодМаркировкиПолный   = КлючЗначение.Получить("uit");
					КодМаркировки         = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(КодМаркировкиПолный, "", Ложь);
					
					Если Данные.Найти(КодМаркировки) = Неопределено Тогда
						Данные.Добавить(КодМаркировки);
					КонецЕсли;
				
					НаборКодовМаркировки.Отбор.КодМаркировки.Установить(КодМаркировки);
					НаборКодовМаркировки.Прочитать();
					Если НаборКодовМаркировки.Количество() = 0 Тогда
						
						КодМаркировкиУпаковки = КлючЗначение.Получить("parent");
						Если ЗначениеЗаполнено(КодМаркировкиУпаковки) Тогда
							КодМаркировкиУпаковки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(КодМаркировкиУпаковки, "", Ложь);
						КонецЕсли;
						
						//Если ТипУпаковки = "UNIT" ИЛИ 
						//	ТипУпаковки = "BUNDLE" Тогда
						//	ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Потребительская;
						//ИначеЕсли ТипУпаковки = "GROUP" ИЛИ 
						//	ТипУпаковки = "SET" ИЛИ 
						//	ТипУпаковки = "АТК" Тогда
						//	ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Групповая;
						//Иначе
						//	ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Логистическая;
						//КонецЕсли;
						ЛогистическаяУпаковка    = Перечисления.ВидыУпаковокМаркировки.Логистическая;
						ГрупповаяУпаковка        = Перечисления.ВидыУпаковокМаркировки.Групповая;
						
						ВидПродукции = Перечисления.ВидыМаркируемойПродукции.ПолучитьВидПродукцииПоНаименованиюГруппы(НаименованиюГруппы);
						
						ДанныеРазбора = ШтрихкодированиеМПВызовСервера.РазобратьКодМаркировки(КодМаркировки, ВидПродукции);
						
						НоваяСтрока = НаборКодовМаркировки.Добавить();
						НоваяСтрока.ВидУпаковки           = ДанныеРазбора.ВидУпаковки;
						НоваяСтрока.КодМаркировки         = КодМаркировки;
						НоваяСтрока.КодМаркировкиУпаковки = КодМаркировкиУпаковки;
						НоваяСтрока.КодМаркировкиПолный   = КодМаркировкиПолный;
						НоваяСтрока.GTIN                  = ДанныеРазбора.СоставКодаМаркировки.GTIN;
						НоваяСтрока.СерийныйНомер         = ДанныеРазбора.СоставКодаМаркировки.СерийныйНомер;
						НоваяСтрока.Организация           = ПараметрыКоманды.Организация;
						НоваяСтрока.Состояние             = ВведенВОборот;
						
						EAN = ДанныеРазбора.СоставКодаМаркировки.EAN;
						
						СтруктураНоменклатуры = СоответствиеНоменклатуры.Получить(EAN);
						Если СтруктураНоменклатуры = Неопределено Тогда
							НайденныеОбъекты = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(EAN);
							Если НайденныеОбъекты.Количество()>0 Тогда
								Номенклатура               = НайденныеОбъекты[0].Объект;
								ХарактеристикаНоменклатуры = НайденныеОбъекты[0].ХарактеристикаНоменклатуры;
							Иначе
								Номенклатура               = Неопределено;
								ХарактеристикаНоменклатуры = Неопределено;
							КонецЕсли;
							СтруктураНоменклатуры = Новый Структура;
							СтруктураНоменклатуры.Вставить("Номенклатура", Номенклатура);
							СтруктураНоменклатуры.Вставить("ХарактеристикаНоменклатуры", ХарактеристикаНоменклатуры);
							СоответствиеНоменклатуры.Вставить(EAN, СтруктураНоменклатуры);
						Иначе
							Номенклатура               = СтруктураНоменклатуры.Номенклатура;
							ХарактеристикаНоменклатуры = СтруктураНоменклатуры.ХарактеристикаНоменклатуры;
						КонецЕсли;
						
						НоваяСтрока.Номенклатура               = Номенклатура;
						НоваяСтрока.ХарактеристикаНоменклатуры = ХарактеристикаНоменклатуры;
						НоваяСтрока.ЕстьКриптохвост            = Истина;
						НоваяСтрока.ЕдиницаИзмерения           = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(НоваяСтрока.Номенклатура, "ОсновнаяЕдиницаИзмерения");
						
						НаборКодовМаркировки.Записать();
					КонецЕсли;
					
					ПоследняяЗапись.UIT          = КодМаркировкиПолный;
					ПоследняяЗапись.emissionDate = ДатаЭмиссии;
					
				КонецЦикла;
				
				Если Данные.Количество() = КоличествоДоДобавления Тогда
					// по какой-то причине мы зациклились..
					Прервать;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПоследняяЗапись.UIT) Тогда
					ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("uit=%1",                ПоследняяЗапись.UIT));
					//ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("emissionDateFrom=%1",   ПоследняяЗапись.emissionDate));
					ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("orderedColumnValue=%1", ПоследняяЗапись.emissionDate));
					ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("pageDir=%1",            "NEXT"));
					ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("cache=%1",              "false"));
				Иначе
					Прервать;
				КонецЕсли;
				
				ОтветЗапроса.Данные = Данные;
				ОтветЗапроса.Успешно = Истина;
				
				Если Не ДанныеОбработки.Получить("nextPage") = Истина Тогда
					ОтветЗапроса.Данные = Данные;
					ОтветЗапроса.Успешно = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()
				),
				УровеньЖурналаРегистрации.Ошибка,
				, ,
				НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки:'")
					+ Символы.ПС
					+ ?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)
			);
			
			ОтветЗапроса.Вставить("ТекстОшибки",
				НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки: подробности в Журнале регистрации'")
			);
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	ПараметрыСтрокиЗапроса = Новый Массив;
	ПараметрыОтбора = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "ПараметрыОтбора", Неопределено);
	
	Если ПараметрыОтбора <> Неопределено Тогда
		
		Если ПараметрыОтбора.Свойство("GTIN") Тогда
			ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("gtin=%1", ПараметрыОтбора.GTIN));
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("КодТНВЭД") Тогда
			ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("tnVed10=%1", ПараметрыОтбора.КодТНВЭД));
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("Статус") Тогда
			Для Каждого Значение Из ПараметрыОтбора.Статус Цикл
				ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("cisStatus=%1", Значение.Значение));
			КонецЦикла;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("ТипЭмиссии") Тогда
			Для Каждого Значение Из ПараметрыОтбора.ТипЭмиссии Цикл
				ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("emissionType=%1", СпособВыпускаВОборот(Значение)));
			КонецЦикла;
		КонецЕсли;
		
		Если ПараметрыОтбора.Свойство("НачалоПериода") Тогда
			ПараметрыСтрокиЗапроса.Добавить(
				СтрШаблон("emissionDateFrom=%1", ДатаСЧасовымПоясом(ПараметрыОтбора.НачалоПериода))
			);
		КонецЕсли;
		Если ПараметрыОтбора.Свойство("КонецПериода") Тогда
			ПараметрыСтрокиЗапроса.Добавить(
				СтрШаблон("emissionDateTo=%1", ДатаСЧасовымПоясом(ПараметрыОтбора.КонецПериода))
			);
		КонецЕсли;
		
	КонецЕсли;
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"limit=%1",
			"15"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"order=%1",
			"ASC"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"orderColumn=%1",
			"emd"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"childrenPaging=%1",
			"false"));
	//ПараметрыСтрокиЗапроса.Добавить(
	//	СтрШаблон(
	//		"childrenPaging=%1",
	//		"true"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"packs=%1",
			"PACK"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"cisStatus=%1",
			"INTRODUCED"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"childrenLimit=%1",
			"1"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"childrenPage=%1",
			"1"));
	
	ПараметрыСтрокиЗапроса.Добавить(
		СтрШаблон(
			"pg=%1",
			"lp"));
	
	ШаблонURLЗапроса = "api/v4/facade/identifytools/listV2";
	
	ПоследняяЗапись = Новый Структура("UIT, emissionDate");
	Данные = Новый Массив;
	
	СоответствиеНоменклатуры = Новый Соответствие;
	ЛогистическаяУпаковка    = Перечисления.ВидыУпаковокМаркировки.Логистическая;
	ГрупповаяУпаковка        = Перечисления.ВидыУпаковокМаркировки.Групповая;
	ПотребительскаяУпаковка  = Перечисления.ВидыУпаковокМаркировки.Потребительская;
	НаборКодовМаркировки     = РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
	НаборИерархииУпаковок    = РегистрыСведений.СтруктураИерархииУпаковокИСМП.СоздатьНаборЗаписей();
	ВведенВОборот            = Перечисления.СостоянияКодовМаркировки.ВведенВОборот;
	
	Пока Истина Цикл
		
		URLЗапроса = ШаблонURLЗапроса + "?" + СтрСоединить(ПараметрыСтрокиЗапроса, "&");
		
		РезультатЗапроса = ОтправитьЗапросВСервис(
			URLЗапроса,
			"",
			ПараметрыЗапроса,
			"GET",
			Неопределено,
			ЗаголовокHTTP
		);
		
		РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
		
		Если РезультатОтправки.КодСостояния = 200 Тогда
			
			ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета, Истина);
			
			Если ДанныеОбработки = Неопределено Тогда
				
				ОтветЗапроса.Вставить("ТекстОшибки", 
					СтрШаблон(НСтр("ru = 'Ошибка в результате отправки запроса состояния кодов маркировки: %1'"),
					РезультатОтправки.СообщениеОтвета)
				);
				Прервать;
				
			Иначе
				
				Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("uit=%1", ПоследняяЗапись.UIT));
				Если НЕ Индекс = Неопределено Тогда 
					ПараметрыСтрокиЗапроса.Удалить(Индекс);
				КонецЕсли;
				
				//Если ЕстьОтборНачалоПериода Тогда
				//	ДатаЭмОт = ДатаСЧасовымПоясом(ПараметрыОтбора.НачалоПериода);
				//Иначе
				//	ДатаЭмОт = ПоследняяЗапись.emissionDate;
				//КонецЕсли;
				//ЕстьОтборНачалоПериода = Ложь;
				
				//Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("emissionDateFrom=%1", ДатаЭмОт));
				//Если НЕ Индекс = Неопределено Тогда
				//	ПараметрыСтрокиЗапроса.Удалить(Индекс);
				//КонецЕсли;
				
				Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("orderedColumnValue=%1", ПоследняяЗапись.emissionDate));
				Если НЕ Индекс = Неопределено Тогда
					ПараметрыСтрокиЗапроса.Удалить(Индекс);
				КонецЕсли;
				
				Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("pageDir=%1", "NEXT"));
				Если НЕ Индекс = Неопределено Тогда
					ПараметрыСтрокиЗапроса.Удалить(Индекс);
				КонецЕсли;
				
				Индекс = ПараметрыСтрокиЗапроса.Найти(СтрШаблон("cache=%1", "false"));
				Если НЕ Индекс = Неопределено Тогда
					ПараметрыСтрокиЗапроса.Удалить(Индекс);
				КонецЕсли;
				
				КоличествоДоДобавления = Данные.Количество();
				
				СоответствиеКодов = ДанныеОбработки.Получить("results");
				Для Каждого КлючЗначение Из СоответствиеКодов Цикл
					//СтрокаРезультата = Новый Структура("GTIN, Наименование, Производитель, Владелец, КодМаркировки, АктуальныйСтатус"); 
					
					ДатаЭмиссии        = КлючЗначение.Получить("emissionDate");
					АктуальныйСтатус   = КлючЗначение.Получить("status");
					ТипУпаковки        = КлючЗначение.Получить("packType");
					НаименованиюГруппы = КлючЗначение.Получить("productGroup");
					
					КодМаркировкиПолный   = КлючЗначение.Получить("cis");
					КодМаркировки         = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(КодМаркировкиПолный, "", Ложь);
					
					Если Данные.Найти(КодМаркировки) = Неопределено Тогда
						Данные.Добавить(КодМаркировки);
					КонецЕсли;
				
					НаборКодовМаркировки.Отбор.КодМаркировки.Установить(КодМаркировки);
					НаборКодовМаркировки.Прочитать();
					Если НаборКодовМаркировки.Количество() = 0 Тогда
						
						КодМаркировкиУпаковки = КлючЗначение.Получить("parent");
						Если ЗначениеЗаполнено(КодМаркировкиУпаковки) Тогда
							КодМаркировкиУпаковки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(КодМаркировкиУпаковки, "", Ложь);
						КонецЕсли;
						
						//Если ТипУпаковки = "UNIT" ИЛИ 
						//	ТипУпаковки = "BUNDLE" Тогда
						//	ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Потребительская;
						//ИначеЕсли ТипУпаковки = "GROUP" ИЛИ 
						//	ТипУпаковки = "SET" ИЛИ 
						//	ТипУпаковки = "АТК" Тогда
						//	ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Групповая;
						//Иначе
						//	ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Логистическая;
						//КонецЕсли;
						ЛогистическаяУпаковка    = Перечисления.ВидыУпаковокМаркировки.Логистическая;
						ГрупповаяУпаковка        = Перечисления.ВидыУпаковокМаркировки.Групповая;
						
						ВидПродукции = Перечисления.ВидыМаркируемойПродукции.ПолучитьВидПродукцииПоНаименованиюГруппы(НаименованиюГруппы);
						
						ДанныеРазбора = ШтрихкодированиеМПВызовСервера.РазобратьКодМаркировки(КодМаркировки, ВидПродукции);
						
						НоваяСтрока = НаборКодовМаркировки.Добавить();
						НоваяСтрока.ВидУпаковки           = ДанныеРазбора.ВидУпаковки;
						НоваяСтрока.КодМаркировки         = КодМаркировки;
						НоваяСтрока.КодМаркировкиУпаковки = КодМаркировкиУпаковки;
						НоваяСтрока.КодМаркировкиПолный   = КодМаркировкиПолный;
						НоваяСтрока.Организация           = ПараметрыКоманды.Организация;
						НоваяСтрока.Состояние             = ВведенВОборот;
						
						НаборКодовМаркировки.Записать();
					КонецЕсли;
					
					ПоследняяЗапись.UIT          = КодМаркировкиПолный;
					ПоследняяЗапись.emissionDate = ДатаЭмиссии;
					
				КонецЦикла;
				
				Если Данные.Количество() = КоличествоДоДобавления Тогда
					// по какой-то причине мы зациклились..
					Прервать;
				КонецЕсли;
				Если ЗначениеЗаполнено(ПоследняяЗапись.UIT) Тогда
					ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("uit=%1",                ПоследняяЗапись.UIT));
					//ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("emissionDateFrom=%1",   ПоследняяЗапись.emissionDate));
					ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("orderedColumnValue=%1", ПоследняяЗапись.emissionDate));
					ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("pageDir=%1",            "NEXT"));
					ПараметрыСтрокиЗапроса.Добавить(СтрШаблон("cache=%1",              "false"));
				Иначе
					Прервать;
				КонецЕсли;
				
				ОтветЗапроса.Данные = Данные;
				ОтветЗапроса.Успешно = Истина;
				
				Если Не ДанныеОбработки.Получить("nextPage") = Истина Тогда
					ОтветЗапроса.Данные = Данные;
					ОтветЗапроса.Успешно = Истина;
					Прервать;
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()
				),
				УровеньЖурналаРегистрации.Ошибка,
				, ,
				НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки:'")
					+ Символы.ПС
					+ ?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)
			);
			
			ОтветЗапроса.Вставить("ТекстОшибки",
				НСтр("ru = 'Ошибка в результате получения состояния кодов маркировки: подробности в Журнале регистрации'")
			);
			Прервать;
			
		КонецЕсли;
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
	
КонецПроцедуры // ЗапросСтатусовКодовМаркировки()

#КонецОбласти

#Область ПреобразованиеДанных

// Получение значения способа выпуска в оборот для передачи запроса
//
// Параметры:
//  СпособВыпуска	 - Перечисление.СпособыВыпускаВОборот - Значение, по которому ищем способ
// 
// Возвращаемое значение:
//  Строка - Значениеспособа выпуска в оборот
//
Функция СпособВыпускаВОборот(СпособВыпуска) Экспорт
	
	Если СпособВыпуска = Перечисления.СпособыВыпускаВОборот.ПроизводствоРФ Тогда
		Возврат "PRODUCTION";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.МаркировкаОстатков Тогда
		Возврат "REMAINS";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.ТрансграничнаяТорговля Тогда
		Возврат "CROSSBORDER";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.ИмпортВРФ Тогда
		Возврат "IMPORT";
	ИначеЕсли СпособВыпуска = Перечисления.СпособыВыпускаВОборот.Перемаркировка Тогда
		Возврат "REMARK";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Получение способа заполнения серийных номеров в формате формирования запроса
//
// Параметры:
//  ЗначениеСпособаЗаполнения - Перечисление.СпособыЗаполненияСерийногоНомера - Значение поиска значения
// 
// Возвращаемое значение:
//  Строка - Результат значения
//
Функция СпособЗаполненияСерийныхНомеров(ЗначениеСпособаЗаполнения) Экспорт 
	
	Если ЗначениеСпособаЗаполнения = Перечисления.СпособыЗаполненияСерийногоНомера.Автоматически Тогда
		Возврат "OPERATOR";
	ИначеЕсли ЗначениеСпособаЗаполнения = Перечисления.СпособыЗаполненияСерийногоНомера.Ручной Тогда
		Возврат "SELF_MADE";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Возвращиет значение вида документа соответствия для отправки запроса
//
// Параметры:
//  ВидДокумента - Перечисление.ВидыДокументовСоответствия - Искомое значение, по которому идет поиск
// 
// Возвращаемое значение:
//  Строка - Результат в формате запроса
//
Функция ВидДокументаСоответствия(ВидДокумента) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыДокументовСоответствия.ДекларацияОСоответствии Тогда
		Возврат "CONFORMITY_DECLARATION";
	ИначеЕсли ВидДокумента = Перечисления.ВидыДокументовСоответствия.СертификатСоответствия Тогда
		Возврат "CONFORMITY_CERTIFICATE";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Получение вида первичного документа для отправки запроса
//
// Параметры:
//  ВидДокумента - Перечисление.ВидыПервичныхДокументов - Вид документа для запроса
// 
// Возвращаемое значение:
//  Строка - Формат вида документа по значению в документе
//
Функция ВидПервичногоДокумента(ВидДокумента) Экспорт
	
	Если ВидДокумента = Перечисления.ВидыПервичныхДокументов.КассовыйЧек Тогда
		Возврат "RECEIPT";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТоварныйЧек Тогда
		Возврат "SALES_RECEIPT";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТаможеннаяДекларация Тогда
		Возврат "CUSTOMS_DECLARATION";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.УПД Тогда
		Возврат "UTD";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.ТоварнаяНакладная Тогда
		Возврат "CONSIGNMENT_NOTE";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.АктУничтожения Тогда
		Возврат "DESTRUCTION_ACT";
	ИначеЕсли ВидДокумента = Перечисления.ВидыПервичныхДокументов.Прочее Тогда
		Возврат "OTHER";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Получение причины вывода из оборота для отправки запроса
//
// Параметры:
//  Причина - Перечисление.ПричиныВыводаИзОборота - Причина вывода из оборота
// 
// Возвращаемое значение:
//  Строка - Формат вида документа по значению в документе
//
Функция ПричинаВыводаИзОборота(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныВыводаИзОборота.РозничнаяПродажа Тогда
		Возврат "RETAIL";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ЭкспортЕАЭС Тогда
		Возврат "EEC_EXPORT";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Экспорт Тогда
		Возврат "BEYOND_EEC_EXPORT";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Возврат Тогда
		Возврат "RETURN";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ДистанционнаяПродажа Тогда
		Возврат "REMOTE_SALE";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.УтратаПовреждение Тогда
		Возврат "DAMAGE_LOSS";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Уничтожение Тогда
		Возврат "DESTRUCTION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Конфискация Тогда
		Возврат "CONFISCATION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.Ликвидация Тогда
		Возврат "LIQUIDATION";
	ИначеЕсли Причина = Перечисления.ПричиныВыводаИзОборота.ДляСобственныхНужд Тогда
		Возврат "ENTERPRISE_USE";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Получение причины перемаркировки документа для отправки запроса
//
// Параметры:
//  Причина	 - Перечисление.ПричиныПеремаркировки - Вид документа для запроса
// 
// Возвращаемое значение:
//  Строка - Формат вида документа по значению в документе
//
Функция ПричинаПеремаркировки(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныПеремаркировки.ИспорченаМаркировка Тогда
		Возврат "KM_SPOILED";
	ИначеЕсли Причина = Перечисления.ПричиныПеремаркировки.ОшибкаВОписании Тогда
		Возврат "DESCRIPTION_ERRORS";
	ИначеЕсли Причина = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиДистанционнаяПродажа Тогда
		Возврат "REMOTE_SALE_RETURN";
	ИначеЕсли Причина = Перечисления.ПричиныПеремаркировки.ВозвратБезМаркировкиРозничнаяПродажа Тогда
		Возврат "RETAIL_RETURN";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПричинаПеремаркировки()

// Получение причины списания кода маркировки для отправки запроса
//
// Параметры:
//  Причина	 - Перечисление.ПричиныСписанияКодовМаркировки - Причина для запроса
// 
// Возвращаемое значение:
//  Строка - Формат вида документа по значению в документе
//
Функция ПричинаСписанияКодаМаркировки(Причина) Экспорт
	
	Если Причина = Перечисления.ПричиныСписанияКодовМаркировки.Испорчен Тогда
		Возврат "KM_SPOILED";
	ИначеЕсли Причина = Перечисления.ПричиныСписанияКодовМаркировки.Уничтожен Тогда
		Возврат "KM_DESTROYED";
	ИначеЕсли Причина = Перечисления.ПричиныСписанияКодовМаркировки.Утерян Тогда
		Возврат "KM_LOST";
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПричинаСписанияКодаМаркировки()

// Получение причины возврата в оборот маркировки для отправки запроса
//
// Параметры:
//  ВидВозврата	 - Перечисление.ВидыВозвратов - Причина для запроса
// 
// Возвращаемое значение:
//  Строка - Формат вида документа по значению в документе
//
Функция ВидВозвратаВОборот(ВидВозврата) Экспорт
	
	Если ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриРозничнойРеализации Тогда
		Возврат "RETAIL_RETURN";
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ВозвратПриДистанционномСпособе Тогда
		Возврат "REMOTE_SALE_RETURN";
	ИначеЕсли ВидВозврата = Перечисления.ВидыВозвратов.ЧекВозврата Тогда
		Возврат "RECEIPT_RETURN";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Получение вид отгрузки товаров для отправки запроса
//
// Параметры:
//  ВидОтгрузкиТоваров - Перечисление.ВидыОтгрузкиТоваров - Вид отгрузки товаров
// 
// Возвращаемое значение:
//  Строка - Формат вида документа по значению в документе
//
Функция ВидТоварооборота(ВидОтгрузкиТоваров) Экспорт
	
	Если ВидОтгрузкиТоваров = Перечисления.ВидыОтгрузкиТоваров.Продажа Тогда
		Возврат "SELLING";
	ИначеЕсли ВидОтгрузкиТоваров = Перечисления.ВидыОтгрузкиТоваров.Комиссия Тогда
		Возврат "COMMISSION";
	ИначеЕсли ВидОтгрузкиТоваров = Перечисления.ВидыОтгрузкиТоваров.Агент Тогда
		Возврат "AGENT";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

// Получение причины отгрузки товара при продаже для отправки запроса
//
// Параметры:
//  ПричинаВыводаИзОборота - Перечисление.ПричиныОтгрузкиТоваров - Причина, по которой отгружен товар
// 
// Возвращаемое значение:
//  Строка - Формат вида документа по значению в документе
//
Функция ПричинаОтгрузкиТовара(ПричинаВыводаИзОборота) Экспорт
	
	Если ПричинаВыводаИзОборота = Перечисления.ПричиныОтгрузкиТоваров.БезВозмезднаяПередача Тогда
		Возврат "DONATION";
	ИначеЕсли ПричинаВыводаИзОборота =
			Перечисления.ПричиныОтгрузкиТоваров.ПриобретениеГосПредприятием Тогда
		Возврат "STATE_ENTERPRISE";
	ИначеЕсли ПричинаВыводаИзОборота =
			Перечисления.ПричиныОтгрузкиТоваров.ИспользованиеДляСобственныхНуждПокупателем Тогда
		Возврат "NO_RETAIL_USE";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

#КонецОбласти

#Область УстановкаПараметровСеанса

// Возвращает соответствие имен параметров сеанса и обработчиков для их инициализации.
//
// Параметры:
//  Обработчики - Соответствие - Список обработчиков
//
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("НомерСессииМаркировки", "ОбменССистемойМаркировкиСервер.УстановкаПараметровСеанса");
	
КонецПроцедуры // ПриДобавленииОбработчиковУстановкиПараметровСеанса()

// Установка параметров сеанса
//
// Параметры:
//  ИмяПараметра			 - Строка - Имя установки параметра.
//  УстановленныеПараметры	 - Массив - Список установленных параметров.
//
Процедура УстановкаПараметровСеанса(Знач ИмяПараметра, УстановленныеПараметры) Экспорт
	
	КоличествоСессий = 0;
	Попытка
		КоличествоСессий = ПараметрыСеанса.НомерСессииМаркировки.Количество();
	Исключение
	КонецПопытки;
	
	Если УстановленныеПараметры.Найти("НомерСессииМаркировки") = Неопределено
		И КоличествоСессий = 0 Тогда
		ПараметрыСеанса.НомерСессииМаркировки = Новый ФиксированноеСоответствие(Новый Соответствие);
	КонецЕсли;
	
	УстановленныеПараметры.Добавить("НомерСессииМаркировки");
	
КонецПроцедуры // УстановкаПараметровСеанса()

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОтправкаЗапросаЗаказаМаркировки(ПараметрыКоманды, ПараметрыЗапроса, КлючСессии, РезультатЗапроса)
	
	Если ПараметрыКоманды.Действие = "ОтправкаЗапросаНаПолучениеКодовМаркировки" Тогда
		ОтветЗапроса = ОтправкаЗапросаНаПолучениеКодовМаркировки(ПараметрыКоманды, ПараметрыЗапроса, КлючСессии);
		ДокументЗаказа = ПараметрыКоманды.Документ.ПолучитьОбъект();
		Если ОтветЗапроса.Результат <> Неопределено Тогда
			// Запишем регистрационные данные из ЧЗ
			ДокументЗаказа.ИдентификаторЗаказа = ОтветЗапроса.Результат.ИдентификаторЗаявки;
			ДокументЗаказа.ИдентификаторУстройства = ОтветЗапроса.Результат.ИдентификаторУстройства;
			ДокументЗаказа.Статус = Перечисления.СтатусыДокументовМаркировки.Отправлен;
			ДокументЗаказа.ОписаниеОшибки = "";
			РезультатЗапроса.Успешно = Истина;
			ДокументЗаказа.Записать();
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Заказ кодов маркировки. Отправка заказа.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Информация,,
				ДокументЗаказа.Ссылка,
				СтрШаблон(
				НСтр("ru = 'Сформирован заказ кодов маркировки. Идентификатор заказа: %1'"),
					ОтветЗапроса.Результат.ИдентификаторЗаявки));
			Если ОтветЗапроса.Результат.Свойство("ПроверятьПосле") И ОтветЗапроса.Результат.ПроверятьПосле > 0 Тогда
				РезультатЗапроса.Сообщение = СтрШаблон(НСтр("ru = 'Запрос на заказ кодов маркировки отправлен.
					|Коды будут готовы для загрузки через %1 минут.'"), ОтветЗапроса.Результат.ПроверятьПосле);
			КонецЕсли;
		Иначе
			РезультатЗапроса.ТекстОшибки = ОтветЗапроса.ТекстОшибки;
			ДокументЗаказа.ОписаниеОшибки = ОтветЗапроса.ТекстОшибки;
			ДокументЗаказа.ОбменДанными.Загрузка = Истина;
			ДокументЗаказа.Записать();
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Заказ кодов маркировки. Отправка заказа.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,
				ДокументЗаказа.Ссылка,
				СтрШаблон(
				НСтр("ru = 'Ошибка при отправки заказа кода маркировки: %1'"),
					ОтветЗапроса.ТекстОшибки));
		КонецЕсли;
	ИначеЕсли ПараметрыКоманды.Действие = "ОтправкаЗапросаПолученияОстатков" Тогда
		ОтветЗапроса = ЗапросСозданияДокумента(
			ПараметрыКоманды,
			ПараметрыЗапроса,
			КлючСессии,
			ПараметрыКоманды.Документ,
			"OST_DESCRIPTION");
		ДокументЗаказа = ПараметрыКоманды.Документ.ПолучитьОбъект();
		Если ОтветЗапроса.Результат <> Неопределено Тогда
			// Получим по отбору КМ
			РезультатЗапроса.Успешно = Истина;
			ДокументЗаказа.Статус = Перечисления.СтатусыДокументовМаркировки.ОтправленЗапросGTIN;
			ДокументЗаказа.ОписаниеОшибки = "";
			РезультатЗапроса.Сообщение = НСтр("ru = 'Запрос на описание остатков выполнен.
				|Для заполнения GTIN необходимо нажать на соответствующую кнопку.'");
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Заказ кодов маркировки. Отправка описания остатков.'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Информация,,
				ДокументЗаказа.Ссылка,
				НСтр("ru = 'Сформировано описание остатков в системе Честного знака.'"));
		Иначе
			РезультатЗапроса.ТекстОшибки = ОтветЗапроса.ТекстОшибки;
			ДокументЗаказа.ОписаниеОшибки = ОтветЗапроса.ТекстОшибки;
			ДокументЗаказа.ОбменДанными.Загрузка = Истина;
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Заказ кодов маркировки. Отправка описания остатков.'",
					ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,
				ДокументЗаказа.Ссылка,
				СтрШаблон(
				НСтр("ru = 'Ошибка при отправке описания остатков: %1'"),
					ОтветЗапроса.ТекстОшибки));
		КонецЕсли;
		ДокументЗаказа.Записать();
	КонецЕсли;
	
КонецПроцедуры

Функция ОтправкаЗапросаНаПолучениеКодовМаркировки(ПараметрыКоманды, ПараметрыЗапроса, КлючСессии)
	
	Результат = Новый Структура("ТекстОшибки,Результат", "", Неопределено);
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗапроса.omsId) Тогда
		Результат.ТекстОшибки =
			НСтр("ru = 'В настройках обмена с системой маркировки не указано устройство СУЗ. Операция отменена.'");
		Возврат Результат;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json;charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept", "application/json");
	ЗаголовокHTTP.Вставить("clientToken", КлючСессии);
	ЗаголовокHTTP.Вставить("X-Signature", ДвоичныеДанныеBase64(ПараметрыКоманды.ПодписьДанныхЗапроса));
		
	ПараметрыЗапроса.ЗащищенноеСоединение = Истина;
	
	ТоварнаяГруппа = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ПараметрыКоманды.Документ, "ОсобенностьУчета.ТоварнаяГруппаСУЗ");
	СтрокаЗапроса = СтрШаблон("api/v2/%1/orders?omsId=%2",
		ТоварнаяГруппа,
		ПараметрыЗапроса.omsId);
	
	// Сопоставим настройки для СУЗ
	ПараметрыЗапросаСУЗ = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыЗапроса);
	ПараметрыЗапросаСУЗ.АдресКонтура = ПараметрыЗапроса.АдресСУЗ;
	ПараметрыЗапросаСУЗ.Порт = ПараметрыЗапроса.ПортСУЗ;
	
	РезультатЗапроса = ОтправитьЗапросВСервис(
		СтрокаЗапроса,
		ПараметрыКоманды.СообщениеJSON,
		ПараметрыЗапросаСУЗ,
		"POST",
		Неопределено,
		ЗаголовокHTTP);
	
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.КодСостояния = 200 Тогда
		
		РезультатОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета);
		Если РезультатОбработки = Неопределено Тогда
			
			Результат.Вставить("ТекстОшибки", 
				СтрШаблон(НСтр("ru = 'Ошибка в результате отправки запроса поиска по каталогу: %1'"),
				РезультатОтправки.СообщениеОтвета));
			
		Иначе
			
			Если РезультатОбработки.Свойство("expectedCompleteTimestamp") Тогда
				ДатаПолучениеКодов = РезультатОбработки.expectedCompleteTimestamp;
			ИначеЕсли РезультатОбработки.Свойство("expectedCompletionTime") Тогда
				ДатаПолучениеКодов = РезультатОбработки.expectedCompletionTime;
			Иначе
				ДатаПолучениеКодов = 10000;
			КонецЕсли;
			
			КоэффициентМинут = 60000;
			
			ДанныеЗаказа = Новый Структура;
			ДанныеЗаказа.Вставить("ИдентификаторЗаявки", РезультатОбработки.orderId);
			ДанныеЗаказа.Вставить("ИдентификаторУстройства", РезультатОбработки.omsId);
			ДанныеЗаказа.Вставить("ПроверятьПосле",
				Окр(ДатаПолучениеКодов / КоэффициентМинут, 0, РежимОкругления.Окр15как20));
			
			Результат.Результат = ДанныеЗаказа;
			
		КонецЕсли;
		
		Возврат Результат;
		
	Иначе
		
		Результат.Вставить("ТекстОшибки", 
			СтрШаблон(НСтр("ru = 'Ошибка в результате получения кодов маркировки: %1'"),
			?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСформироватьКлючСессии(
		Организация,
		ПолучитьНовыйКлюч = Истина,
		КлючСессииСУЗ = Ложь,
		ИдентификаторСоединения = "")
	
	Результат = Новый Структура("КлючСессии,СрокДействия,ТекстОшибки", "", "");
	
	Если КлючСессииСУЗ Тогда
		ТекущийКодСессии = ТекущийКодСессииСУЗ(Организация, ИдентификаторСоединения);
	Иначе
		ТекущийКодСессии = ТекущийКодСессииОрганизации(Организация);
	КонецЕсли;
	
	Если ТекущийКодСессии = Неопределено 
		И ПолучитьНовыйКлюч 
		И (ОбщегоНазначения.ИнформационнаяБазаФайловая()
			ИЛИ ЭлектроннаяПодписьКлиентСервер.ОбщиеНастройки().СоздаватьЭлектронныеПодписиНаСервере) Тогда
			
		// Запрашиваем новый ключ сессии
		СозданКлюч = КлючСессии(Организация, КлючСессииСУЗ, ИдентификаторСоединения);
		Если НЕ СозданКлюч.КлючСессииПолучен Тогда
			Результат.ТекстОшибки = СозданКлюч.ТекстОшибки;
			Возврат Результат;
		КонецЕсли;
		Если КлючСессииСУЗ Тогда
			ТекущийКодСессии = ТекущийКодСессииСУЗ(Организация, ИдентификаторСоединения);
		Иначе
			ТекущийКодСессии = ТекущийКодСессииОрганизации(Организация);
		КонецЕсли;
	КонецЕсли;
	
	Если ТекущийКодСессии <> Неопределено Тогда
		ЗаполнитьЗначенияСвойств(Результат, ТекущийКодСессии);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТекущийКодСессииОрганизации(Организация)
	
	Возврат ОбменССистемойМаркировкиВызовСервера.КлючСессииОрганизации(Организация);
	
КонецФункции

Процедура ЗаписатьКлючСессии(Организация, КлючСессии, СрокДействия)
	
	НомераСессииМаркировки = ПараметрыСеанса.НомерСессииМаркировки;
	
	Если НомераСессииМаркировки = Неопределено Тогда
		НомерСессииМаркировки = Новый Соответствие;
	Иначе
		НомерСессииМаркировки = Новый Соответствие(НомераСессииМаркировки);
	КонецЕсли;
	
	НомерСессииМаркировки.Вставить(Организация,
		Новый ФиксированнаяСтруктура("КлючСессии, СрокДействия", КлючСессии, СрокДействия));
		
	УстановитьПривилегированныйРежим(Истина);
	
	ПараметрыСеанса.НомерСессииМаркировки = Новый ФиксированноеСоответствие(НомерСессииМаркировки);
	ПараметрыСеанса.Организация = Организация;
	
КонецПроцедуры

Функция ТекущийКодСессииСУЗ(Организация, ИдентификаторСоединения)
	
	Возврат ОбменССистемойМаркировкиВызовСервера.КлючСессииОрганизацииСУЗ(Организация, ИдентификаторСоединения);
	
КонецФункции

Процедура ЗаписатьКлючСессииСУЗ(Организация, ИдентификаторСоединения, КлючСессии, СрокДействия)
	
	УстановитьПривилегированныйРежим(Истина);
	
	НоваяЗапись = РегистрыСведений.КлиентскиеТокеныСУЗ.СоздатьМенеджерЗаписи();
	НоваяЗапись.Организация = Организация;
	НоваяЗапись.ИдентификаторСоединения = ИдентификаторСоединения;
	НоваяЗапись.Токен = КлючСессии;
	НоваяЗапись.СрокДействия = УниверсальноеВремя(СрокДействия);
	
	НоваяЗапись.Записать(Истина);
	
КонецПроцедуры

// Отпечаток - строка HEX
Функция ПолучитьСертификатПоОтпечатку(Отпечаток)
	
	Рез = Неопределено; // Найденный сертификат (Com-объект)
	ХранилищеСертификатов = Новый COMОбъект("CAdESCOM.Store"); // Объект описывает хранилище
	
	ХранилищеСертификатов.Open(2, "My", 0); // Открыть хранилище сертификатов личное
	Сертификаты = ХранилищеСертификатов.Certificates.Find(0, Отпечаток);
	Рез = Сертификаты.Item(1);
	
	// На сервере иногда падает
	Попытка
		ХранилищеСертификатов.Close(); // Закрыть хранилище сертификатов и освободить объект 61
	Исключение
	КонецПопытки;
	
	Возврат Рез;
	
КонецФункции

Функция ПараметрыАвторизации(ПараметрыЗапроса)
	
	Результат = Новый Структура("УИД,Данные,ТекстОшибки", "", "", "");
	
	АдресСервера = СтрШаблон("api/%1/auth/cert/key", ПараметрыЗапроса.ВерсияФорматаОбмена);
	
	// Отправка http запроса
	РезультатЗапроса = ЗапросВСервис(АдресСервера, ПараметрыЗапроса, Неопределено);
	
	// Выведим ошибку
	Если ЗначениеЗаполнено(РезультатЗапроса.ТекстОшибки) Тогда
		Результат.ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;
	
	РезультатЗапроса.Вставить("ПараметрыЗапроса", ПараметрыЗапроса);
	
	// Преобразуем ответ запроса в json
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.СообщениеОтвета <> Неопределено Тогда
		
		Если РезультатОтправки.КодСостояния = 200 Тогда
			
			ЧтениеОтвета = Новый ЧтениеJSON;
			ЧтениеОтвета.УстановитьСтроку(РезультатОтправки.СообщениеОтвета);
			
			Попытка
				ОтветАвторизации = ПрочитатьJSON(ЧтениеОтвета, Ложь);
			Исключение
				ОтветАвторизации = Неопределено;
			КонецПопытки;
			
			Если ОтветАвторизации = Неопределено Тогда
				Результат.ТекстОшибки = РезультатОтправки.ТекстОшибки;
				Возврат Результат;
			Иначе
				Результат.УИД = ОтветАвторизации.uuid;
				Результат.Данные = ОтветАвторизации.data;
			КонецЕсли;
			
		Иначе
			Результат.ТекстОшибки = РезультатОтправки.ТекстОшибки;
		КонецЕсли;
		
	Иначе
		Результат.ТекстОшибки = РезультатОтправки.ТекстОшибки;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура УстановитьПолученныйКлючСессии(
		Организация,
		Результат,
		ПараметрыЗапроса,
		ПараметрыАвторизации,
		Подпись,
		ИдентификаторСоединения = "")
	
	ПолучитьКлючСессии(Результат, ПараметрыЗапроса, ПараметрыАвторизации, Подпись, ИдентификаторСоединения);
	
	Если Результат.Свойство("КлючСессии") Тогда
		
		Результат.КлючСессииПолучен = Истина;
		
		Если ЗначениеЗаполнено(ИдентификаторСоединения) Тогда
			
			ЗаписатьКлючСессииСУЗ(
				Организация,
				ИдентификаторСоединения,
				Результат.КлючСессии.Ключ,
				Результат.КлючСессии.СрокДействия);
			
		Иначе
			
			ЗаписатьКлючСессии(Организация, Результат.КлючСессии.Ключ, Результат.КлючСессии.СрокДействия);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПолучитьКлючСессии(Результат, ПараметрыЗапроса, ПараметрыАвторизации, Подпись, ИдентификаторСоединения)
	
	ДанныеЗапроса = Новый Структура;
	ДанныеЗапроса.Вставить("uuid", ПараметрыАвторизации.УИД);
	ДанныеЗапроса.Вставить("data", ДвоичныеДанныеBase64(Подпись));
	
	АдресСервера = СтрШаблон("api/%1/auth/cert/%2", ПараметрыЗапроса.ВерсияФорматаОбмена, ИдентификаторСоединения);
	
	РезультатЗапроса = ОтправитьЗапросВСервис(
		АдресСервера,
		ДанныеЗапроса,
		ПараметрыЗапроса,
		"POST",
		Неопределено);
	
	// Преобразуем ответ запроса в json
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.СообщениеОтвета <> Неопределено Тогда
		
		Если РезультатОтправки.КодСостояния = 200 Тогда
			ЧтениеОтвета = Новый ЧтениеJSON;
			ЧтениеОтвета.УстановитьСтроку(РезультатОтправки.СообщениеОтвета);
			
			Попытка
				ОтветТокен = ПрочитатьJSON(ЧтениеОтвета, Ложь);
			Исключение
				ОтветТокен = Неопределено;
			КонецПопытки;
			
			Если ОтветТокен = Неопределено Тогда
				Результат.ТекстОшибки = РезультатОтправки.ТекстОшибки;
				Возврат;
			Иначе
				
				ТекстОписания = ПолучитьЗначениеПараметраСтруктуры(ОтветТокен, "description", "");
				Если ПолучитьЗначениеПараметраСтруктуры(ОтветТокен, "token", "") = "" Тогда
					Результат.ТекстОшибки =
						СтрШаблон(
							НСтр("ru = 'Не удалось получить токен. Проверьте настройки подключения к личному кабинету организации. %1'"),
							ТекстОписания);
					Возврат;
				КонецЕсли;
				
				ДобавитьВосемьЧасов = 30000;
				СрокДействия = ТекущаяДатаСеанса() + ДобавитьВосемьЧасов;
				РазборТокена = РазобратьТокен(ОтветТокен.token);
				
				Если РазборТокена <> Неопределено И РазборТокена.Свойство("exp") Тогда
					СрокДействия = МестноеВремя(Дата(1970, 1, 1) + РазборТокена.exp);
				КонецЕсли;
				
				СтруктураКлючаСессии = Новый Структура;
				СтруктураКлючаСессии.Вставить("Ключ", ОтветТокен.token);
				СтруктураКлючаСессии.Вставить("СрокДействия", СрокДействия);
				
				Результат.Вставить("КлючСессии", СтруктураКлючаСессии);
				
			КонецЕсли;
			
		Иначе
			Результат.ТекстОшибки = РезультатОтправки.СообщениеОтвета;
		КонецЕсли;
		
	Иначе
		Результат.ТекстОшибки = РезультатОтправки.ТекстОшибки;
	КонецЕсли;
	
КонецПроцедуры

Функция ЗапросВСервис(АдресСервера, ПараметрыЗапроса, КлючСессии)
	
	Результат = Новый Структура("Ответ,ТекстОшибки", Неопределено, "");
	
	Если ПараметрыЗапроса.ЗащищенноеСоединение Тогда
		ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("HTTPS");
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение(
			Неопределено,
			Новый СертификатыУдостоверяющихЦентровОС());
	Иначе
		ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("HTTP");
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Заголовок = Новый Соответствие();
	Заголовок.Вставить("Content-Type",   "application/json; charset=utf-8");
	Заголовок.Вставить("Accept-Charset", "utf-8");
	Заголовок.Вставить("Cache-Control",  "no-cache");
	Если КлючСессии <> Неопределено Тогда
		Заголовок.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
	КонецЕсли;
	
	Запрос = Новый HTTPЗапрос(АдресСервера, Заголовок);
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
			ПараметрыЗапроса.АдресКонтура,
			ПараметрыЗапроса.Порт,,,
			ИнтернетПрокси,
			ПараметрыЗапроса.ВремяОжидания,
			ЗащищенноеСоединение);
		
		Результат.Ответ = Соединение.Получить(Запрос);
		
	Исключение
		
		Результат.ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Ошибка запроса в Честный знак'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			СтрШаблон(
				НСтр("ru = 'Ошибка при исполнении запроса GET %1 на сервер %2: '"),
				АдресСервера,
				ПараметрыЗапроса.АдресКонтура) + Символы.ПС
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ОтправитьЗапросВСервис(
		АдресСервера,
		ДанныеЗапроса,
		ПараметрыЗапроса,
		МетодЗапроса,
		КлючСессии,
		Заголовок = Неопределено)
	
	Результат = Новый Структура("Ответ,ТекстОшибки", Неопределено, "");
	
	Если ТипЗнч(ДанныеЗапроса) = Тип("Строка") или ТипЗнч(ДанныеЗапроса) = Тип("Записьjson") Тогда
		ТелоЗапроса = ДанныеЗапроса;
	ИначеЕсли ДанныеЗапроса <> Неопределено Тогда
		ТелоЗапроса = ДанныеВТекстJSON(ДанныеЗапроса, Истина);
	КонецЕсли;
	
	Если ПараметрыЗапроса.ЗащищенноеСоединение Тогда
		ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("HTTPS");
		ЗащищенноеСоединение = ОбщегоНазначенияКлиентСервер.НовоеЗащищенноеСоединение(
			Неопределено,
			Новый СертификатыУдостоверяющихЦентровОС());
	Иначе
		ИнтернетПрокси = ПолучениеФайловИзИнтернетаКлиентСервер.ПолучитьПрокси("HTTP");
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;
	
	Если Заголовок = Неопределено Тогда
		Заголовок = Новый Соответствие();
		Заголовок.Вставить("Content-Type",   "application/json; charset=utf-8");
		Заголовок.Вставить("Accept-Charset", "utf-8");
		Если КлючСессии <> Неопределено Тогда
			Заголовок.Вставить("Authorization", СтрШаблон("Bearer %1", КлючСессии));
		КонецЕсли;
	КонецЕсли;
	
	Запрос  = Новый HTTPЗапрос(АдресСервера, Заголовок);
	Если ДанныеЗапроса <> Неопределено Тогда
		Запрос.УстановитьТелоИзСтроки(ТелоЗапроса, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	КонецЕсли;
	
	Попытка
		
		Соединение = Новый HTTPСоединение(
			ПараметрыЗапроса.АдресКонтура,
			ПараметрыЗапроса.Порт,,,
			ИнтернетПрокси,
			ПараметрыЗапроса.ВремяОжидания,
			ЗащищенноеСоединение);
		
		Если МетодЗапроса = "POST" Тогда
			Результат.Ответ = Соединение.ОтправитьДляОбработки(Запрос);
		Иначе
			Результат.Ответ = Соединение.ВызватьHTTPМетод(МетодЗапроса, Запрос);
		КонецЕсли;
		
	Исключение
		
		Результат.ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Обмен с личным кабинетом Честного знака'",
				ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,,,
			СтрШаблон(
				НСтр("ru = 'Ошибка исполнения POST запроса %1: '"),
				АдресСервера) + Символы.ПС
				+ ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПреобразованиеОтправкаJSON(ПараметрыЗапроса)
	
	Результат = Новый Структура("СообщениеОтвета,КодСостояния,ТекстОшибки", Неопределено, 0, "");
	
	Если ПараметрыЗапроса <> Неопределено
		И ПараметрыЗапроса.Ответ <> Неопределено Тогда
		
		КодСостояния = ПараметрыЗапроса.Ответ.КодСостояния;
		ОтветТекст = ПараметрыЗапроса.Ответ.ПолучитьТелоКакСтроку();
		
		Если ЗначениеЗаполнено(ОтветТекст) Тогда
			
			ЧтениеОтвета = Новый ЧтениеJSON;
			ЧтениеОтвета.УстановитьСтроку(ОтветТекст);
			
			Попытка
				Объект = ПрочитатьJSON(ЧтениеОтвета, Ложь);
			Исключение
				Попытка
					Объект = ПрочитатьJSON(ЧтениеОтвета, Истина);
				Исключение
					Объект = Неопределено;
				КонецПопытки;
			КонецПопытки;
			
			Если Объект = Неопределено Тогда
				Результат.СообщениеОтвета = ОтветТекст;
			Иначе
				ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Авто, "  ");
				ЗаписьJSON = Новый ЗаписьJSON();
				ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);
				ЗаписатьJSON(ЗаписьJSON, Объект);
				Результат.СообщениеОтвета = ЗаписьJSON.Закрыть();
			КонецЕсли;
			
			Результат.КодСостояния  = КодСостояния;
			
		ИначеЕсли ЗначениеЗаполнено(КодСостояния) Тогда
			Результат.ТекстОшибки = СтрШаблон(НСтр("ru = 'Код состояния запроса HTTP: %1'"), КодСостояния);
		Иначе
			Результат.ТекстОшибки = НСтр("ru = 'Не отправлен запрос HTTP'");
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция РазобратьТокен(Токен)
	
	Результат = Новый Структура;
	Результат.Вставить("Расшифровка", Неопределено);
	Результат.Вставить("ТекстОшибки", "");
	
	МассивТокена = СтрРазделить(Токен, ".");
	Если МассивТокена.Count() <> 3 Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Токен не соответствует формату'");
		Возврат Результат;
	КонецЕсли;
	
	ДанныеТокена = МассивТокена[1];
	
	ДанныеРазбора = ТекстJSONВОбъект(
		ПолучитьСтрокуИзДвоичныхДанных(
			ДвоичныеДанныеТокена(ДанныеТокена)));

	Возврат ДанныеРазбора;
	
КонецФункции

Функция ДвоичныеДанныеТокена(Знач Значение)
	
	Значение = СтрЗаменить(Значение, "-", "+");
	Значение = СтрЗаменить(Значение, "_", "/");
	
	Остаток = СтрДлина(Значение) % 4;

	Если Остаток = 1 Тогда
		Возврат Неопределено;
	ИначеЕсли Остаток = 2 Тогда
		Значение = Значение + "==";
	ИначеЕсли Остаток = 3 Тогда
		Значение = Значение + "=";
	КонецЕсли;
	
	Возврат Base64Значение(Значение);
	
КонецФункции

Функция СертификатыОрганизации(Организация)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СертификатыКлючейЭлектроннойПодписиИШифрования.Ссылка КАК Сертификат
	               |ИЗ
	               |	Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК СертификатыКлючейЭлектроннойПодписиИШифрования
	               |ГДЕ
	               |	СертификатыКлючейЭлектроннойПодписиИШифрования.Пользователь = &Пользователь
	               |	И НЕ СертификатыКлючейЭлектроннойПодписиИШифрования.ПометкаУдаления
	               |	И СертификатыКлючейЭлектроннойПодписиИШифрования.Организация = &Организация
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	СертификатыКлючейЭлектроннойПодписиИШифрования.Ссылка
	               |ИЗ
	               |	Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК СертификатыКлючейЭлектроннойПодписиИШифрования
	               |ГДЕ
	               |	СертификатыКлючейЭлектроннойПодписиИШифрования.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	               |	И НЕ СертификатыКлючейЭлектроннойПодписиИШифрования.ПометкаУдаления
	               |	И СертификатыКлючейЭлектроннойПодписиИШифрования.Организация = &Организация";
	Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сертификат");
	
КонецФункции

Функция ДанныеДокументаВСтроку(ДанныеДокумента)
	
	ДвоичныеДанные = ПолучитьДвоичныеДанныеИзСтроки(ДанныеДокумента);
	
	Возврат ДвоичныеДанныеВСтроку(ДвоичныеДанные);
	
КонецФункции

Функция ДвоичныеДанныеВСтроку(ДвоичныеДанные)
	
	Результат = Base64Строка(ДвоичныеДанные);
	Результат = СтрЗаменить(Результат, Символы.ПС, "");
	Результат = СтрЗаменить(Результат, Символы.ВК, "");
	
	Возврат Результат;
	
КонецФункции

Процедура ПолучитьКлючСессииСУЗ(ПараметрыКоманды, Результат, ИдентификаторСоединения, ТекстОшибкиКлюча)
	
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
	
	ИдентификаторСоединения = ПолучитьУстройствоСУЗ(ПараметрыКоманды.Документ, ПараметрыЗапроса.СписокУстройств);
	Если НЕ ЗначениеЗаполнено(ИдентификаторСоединения) Тогда
		ТекстОшибкиКлюча =
		НСтр("ru = 'Необходимо указать идентификатор соединения в настройке обмена с личным кабинетом'");
		Результат.Вставить("ТекстОшибки");
	КонецЕсли;
	
	Результат.Вставить("ИдентификаторСоединения", ИдентификаторСоединения);
	
КонецПроцедуры

Функция ПолученКлючСессииСУЗ(КлючСессии, ПараметрыКоманды, ПараметрыЗапроса, ОтветЗапроса, АдресРезультата)
	
	ТребуетсяКлючСессии = НЕ ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "НеТребуетсяКлючСессии", Ложь);
	ИдентификаторСоединения = "";
	
	НовыйКлюч = Ложь;
	Если НЕ ЗначениеЗаполнено(КлючСессии) Тогда
		
		// Получим идентификатор соединения
		ИдентификаторСоединения = ПолучитьУстройствоСУЗ(ПараметрыКоманды.Документ, ПараметрыЗапроса.СписокУстройств);
		Если НЕ ЗначениеЗаполнено(ИдентификаторСоединения) Тогда
			ТекстОшибкиКлюча =
			НСтр("ru = 'Необходимо указать идентификатор соединения в настройке обмена с личным кабинетом'");
			ОтветЗапроса.Вставить("ТекстОшибки", ТекстОшибкиКлюча);
			ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
			Возврат Ложь;
		КонецЕсли;
		ОтветЗапроса.Вставить("ИдентификаторСоединения", ИдентификаторСоединения);
		
		СтруктураКлюча = ТекущийКодСессииСУЗ(ПараметрыКоманды.Организация, ИдентификаторСоединения);
		Если СтруктураКлюча = Неопределено Тогда
			ПолученияКлючаСессии(ПараметрыКоманды, ОтветЗапроса, Истина, ИдентификаторСоединения);
			Если ОтветЗапроса.Свойство("КлючСессии") Тогда
				КлючСессии = ОтветЗапроса.КлючСессии;
				ОтветЗапроса.Удалить("КлючСессии");
			КонецЕсли;
			СтруктураКлюча = ТекущийКодСессииСУЗ(ПараметрыКоманды.Организация, ИдентификаторСоединения);
			Если СтруктураКлюча <> Неопределено Тогда
				НовыйКлюч = Истина;
			КонецЕсли;
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
	КонецЕсли;
	
	Если ОтветЗапроса.Свойство("ТекстОшибки") Тогда
		Если ПустаяСтрока(ОтветЗапроса.ТекстОшибки) Тогда
			ОтветЗапроса.ТекстОшибки = НСтр("ru = 'Не удалось получить данные авторизации'");
		КонецЕсли;
		// вываливаемся
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат Ложь;
	КонецЕсли;
	
	ОтветЗапроса.Вставить("ТекстОшибки", "");
	
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии И ПараметрыКоманды.Свойство("ПодписьДанныхАутентификации") Тогда
		
		ПодписьДанныхАутентификации = ПолучитьЗначениеПараметраСтруктуры(
			ПараметрыКоманды, "ПодписьДанныхАутентификации", "");
		Если ЗначениеЗаполнено(ПодписьДанныхАутентификации) Тогда
			ПолучениеКлюча = Новый Структура("КлючСессииПолучен,ТекстОшибки", Ложь, "");
			УстановитьПолученныйКлючСессии(
				ПараметрыКоманды.Организация,
				ПолучениеКлюча,
				ПараметрыЗапроса,
				ПараметрыКоманды,
				ПодписьДанныхАутентификации,
				ИдентификаторСоединения);
			Если НЕ ПустаяСтрока(ПолучениеКлюча.ТекстОшибки) Тогда
				ОтветЗапроса.Вставить("ТекстОшибки", ПолучениеКлюча.ТекстОшибки);
				ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
		
		СтруктураКлюча = ПолучитьСформироватьКлючСессии(ПараметрыКоманды.Организация,, Истина, ИдентификаторСоединения);
		
		Если НЕ ПустаяСтрока(СтруктураКлюча.ТекстОшибки) Тогда
			ОтветЗапроса.Вставить("ТекстОшибки", СтруктураКлюча.ТекстОшибки);
		Иначе
			КлючСессии = СтруктураКлюча.КлючСессии;
		КонецЕсли;
		
		НовыйКлюч = Истина;
		
	КонецЕсли;
	
	// Если ключ не получен, то дальнейшая отправка смысла не имеет
	Если ПустаяСтрока(КлючСессии) И ТребуетсяКлючСессии Тогда
		ОтветЗапроса.Удалить("ТекстОшибки");
		ОтветЗапроса.Успешно = Истина;
		ПоместитьВоВременноеХранилище(ОтветЗапроса, АдресРезультата);
		Возврат Ложь;
	ИначеЕсли НовыйКлюч Тогда
		ОтветЗапроса.Вставить("КлючСессии", СтруктураКлюча);
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьУстройствоСУЗ(Документ, СписокУстройств, ИмяИдентификатора = "ИдентификаторСоединения")
	
	СтруктураОтбора = Новый Структура("ПодразделениеКомпании");
	
	Если ЕстьРеквизит(Документ, "ПодразделениеКомпании") Тогда
		Подразделение = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ПодразделениеКомпании");
		СтруктураОтбора.ПодразделениеКомпании = Подразделение;
		НайденныеСтроки = СписокУстройств.НайтиСтроки(СтруктураОтбора);
		Если НайденныеСтроки.Количество() > 0 Тогда
			Возврат НайденныеСтроки[0][ИмяИдентификатора];
		КонецЕсли;
	КонецЕсли;
	
	Подразделение = Справочники.ПодразделенияКомпании.ПустаяСсылка();
	СтруктураОтбора.ПодразделениеКомпании = Подразделение;
	НайденныеСтроки = СписокУстройств.НайтиСтроки(СтруктураОтбора);
	Если НайденныеСтроки.Количество() > 0 Тогда
		Возврат НайденныеСтроки[0][ИмяИдентификатора];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ВидДокумента(Документ, ПараметрыКоманды)
	
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ВводВОборотКодовМаркировки") Тогда
		
		СпособВвода = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "СпособВводаВОборот");
		
		Если СпособВвода = Перечисления.СпособыВводаВОборот.МаркировкаОстатков Тогда
			Возврат "LP_INTRODUCE_OST";
		ИначеЕсли СпособВвода = Перечисления.СпособыВводаВОборот.ПроизводствоРФ Тогда
			Возврат "LP_INTRODUCE_GOODS";
		ИначеЕсли СпособВвода = Перечисления.СпособыВводаВОборот.ПроизводствоВнеЕАЭС Тогда
			Возврат "LP_GOODS_IMPORT";
		ИначеЕсли СпособВвода = Перечисления.СпособыВводаВОборот.КонтактноеПроизводствоРФ Тогда
			Возврат "LK_CONTRACT_COMMISSIONING";
		ИначеЕсли СпособВвода = Перечисления.СпособыВводаВОборот.ПолучениеОтФизическихЛиц Тогда
			Возврат "LK_INDI_COMMISSIONING";
		ИначеЕсли СпособВвода = Перечисления.СпособыВводаВОборот.ТрансграничнаяТорговля Тогда
			Возврат "CROSSBORDER";
		ИначеЕсли СпособВвода = Перечисления.СпособыВводаВОборот.ИмпортФТС Тогда
			Возврат "LP_FTS_INTRODUCE";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ВыводИзОборотаКодовМаркировки") Тогда
		
		Возврат "LK_RECEIPT";
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.Перемаркировка") Тогда
		
		Возврат "LK_REMARK";
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.СписаниеКодовМаркировки") Тогда
		
		ХозОперация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ХозОперация");
		
		Если ХозОперация = Справочники.ХозОперации.СписаниеНанесенныхКодовМаркировки Тогда
			Возврат "LK_APPLIED_KM_CANCELLATION";
		Иначе
			Возврат "LK_KM_CANCELLATION";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ВозвратВОборотКодовМаркировки") Тогда
		
		Возврат "LP_RETURN";
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ОтгрузкаТоваровКодовМаркировки") Тогда
		
		ИмяДействия = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "Действие", "");
		
		Если ИмяДействия = "АннулироватьОтгрузкуТоваров" Тогда
			Возврат "LP_CANCEL_SHIPMENT";
		КонецЕсли;
		
		ДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "ВидТоварооборота,ДатаВыводаИзОборота");
		
		Если ДанныеДокумента.ВидТоварооборота = Перечисления.ВидыОтгрузкиТоваров.Продажа
			И ЗначениеЗаполнено(ДанныеДокумента.ДатаВыводаИзОборота) Тогда
			Возврат "LP_SHIP_RECEIPT";
		Иначе
			Возврат "LP_SHIP_GOODS";
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументСсылка.ФормированиеГрупповойТарыИСМП") Тогда
		
		ИмяДействия = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды, "Действие", "");
		
		Если ИмяДействия = "ОтправкаЗапросаАгрегацииКодовМаркировки" Тогда
			Возврат "AGGREGATION_DOCUMENT";
		ИначеЕсли ИмяДействия = "ОтправкаЗапросаРазАгрегацииКодовМаркировки" Тогда
			Возврат "DISAGGREGATION_DOCUMENT";
		Иначе
			Возврат "REAGGREGATION_DOCUMENT";
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Процедура ПолученияКлючаСессии(ПараметрыКоманды, Результат, КлючСессииСУЗ = Ложь, ИдентификаторСоединения = "")
	
	СтруктураСессии = ПолучитьСформироватьКлючСессии(
		ПараметрыКоманды.Организация,,
		КлючСессииСУЗ,
		ИдентификаторСоединения);
	
	// Ключ сессии не удалось получить - подпишем на клиенте
	Если ЗначениеЗаполнено(СтруктураСессии.КлючСессии) Тогда
		Результат.Вставить("КлючСессии", СтруктураСессии.КлючСессии);
	Иначе
		ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(ПараметрыКоманды.Организация);
		ПараметрыАвторизации = ПараметрыАвторизации(ПараметрыЗапроса);
		Если ЗначениеЗаполнено(ПараметрыАвторизации.Данные) Тогда
			Результат.Вставить("ДанныеАвторизации", ПараметрыАвторизации.Данные);
			Результат.Вставить("УИД", ПараметрыАвторизации.УИД);
		Иначе
			Результат.Вставить("ТекстОшибки", ПараметрыАвторизации.ТекстОшибки);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ПолученияКлючаСессии()

// Получение списка товаров, которые доступны по указанному ИНН.
// 
// Параметры:
// 	ИНН           - Строка - ИНН производителя.
// 	НомерСтраницы - Число - Номер страницы.
// 	КлючСессии - Строка - Текущий номер сессии.
// 
// Возвращаемое значение:
// 	Структура - Структура результата запроса
Функция НайтиТоварыПоИНН(Организация, ИНН, НомерСтраницы = 0, КлючСессии = Неопределено)
	
	ПараметрыЗапроса = ОбменССистемойМаркировкиПовтИсп.ПараметрыЗапроса(Организация);
	
	Результат = Новый Структура;
	Результат.Вставить("Данные", Неопределено);
	Результат.Вставить("ТекстОшибки", "");
	
	Если КлючСессии = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПараметрыURL = Новый Массив;
	ПараметрыURL.Добавить(
		СтрШаблон(
			"inn=%1",
			КодироватьСтроку(ИНН, СпособКодированияСтроки.КодировкаURL)));
	ПараметрыURL.Добавить(
		СтрШаблон(
			"page=%1",
			Формат(НомерСтраницы, "ЧН=0; ЧГ=0")));
	ПараметрыURL.Добавить(
		СтрШаблон(
			"limit=%1",
			200));

	URLЗапроса = СтрШаблон(
		"api/v3/product/search?%1",
		СтрСоединить(ПараметрыURL, "&"));
	РезультатЗапроса = ЗапросВСервис(
		URLЗапроса,
		ПараметрыЗапроса,
		КлючСессии);
	
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.КодСостояния = 200 Тогда
		
		ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета);
		
		Если ДанныеОбработки = Неопределено Тогда
			
			Результат.Вставить("ТекстОшибки", 
				СтрШаблон(НСтр("ru = 'Ошибка в результате отправки запроса поиска по каталогу: %1'"),
				РезультатОтправки.СообщениеОтвета));
			
		Иначе
			
			Данные = Новый Соответствие;
			Для Каждого ЭлементДанных Из ДанныеОбработки.results Цикл
				
				СтруктураДанных = Новый Структура("GTIN,ТорговаяМарка,Модель,КодТНВЭД,Наименование");
				СтруктураДанных.GTIN = ЭлементДанных["gtin"];
				СтруктураДанных.ТорговаяМарка = ЭлементДанных["brand"];
				СтруктураДанных.Модель = ПолучитьЗначениеПараметраСтруктуры(ЭлементДанных, "model", "");
				СтруктураДанных.КодТНВЭД = ПолучитьЗначениеПараметраСтруктуры(ЭлементДанных, "tnVedCode", "");
				СтруктураДанных.Наименование = ПолучитьЗначениеПараметраСтруктуры(ЭлементДанных, "name", "");
				
				Данные.Вставить(СтруктураДанных.GTIN, СтруктураДанных);
				
			КонецЦикла;
			
			Результат.Данные = Данные;
			
		КонецЕсли;
		
	Иначе
		
		Результат.Вставить("ТекстОшибки", 
			СтрШаблон(НСтр("ru = 'Ошибка в результате отправки запроса поиска по каталогу: %1'"),
			?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)));
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция КодыМаркировкиПоGTIN(
			ИдентификаторЗаказа,
			GTIN,
			Количество,
			НачальнаяПозиция,
			ПараметрыЗапроса,
			ПараметрыКоманды)
	
	Результат = Новый Структура;
	Результат.Вставить("Данные", Неопределено);
	Результат.Вставить("ТекстОшибки", "");
	
	Если НЕ ЗначениеЗаполнено(ПараметрыЗапроса.omsId) Тогда
		Результат.ТекстОшибки =
			НСтр("ru = 'В настройках обмена с системой маркировки не указано устройство СУЗ. Операция отменена.'");
		Возврат Результат;
	КонецЕсли;
	
	ЗаголовокHTTP = Новый Соответствие();
	ЗаголовокHTTP.Вставить("Content-Type", "application/json;charset=utf-8");
	ЗаголовокHTTP.Вставить("Accept", "application/json");
	ЗаголовокHTTP.Вставить("clientToken", ПараметрыЗапроса.Токен);
	
	ПараметрыURL = Новый Массив;
	ПараметрыURL.Добавить(
		СтрШаблон(
			"omsId=%1",
			ПараметрыЗапроса.omsId));
	ПараметрыURL.Добавить(
		СтрШаблон(
			"orderId=%1",
			ИдентификаторЗаказа));
	ПараметрыURL.Добавить(
		СтрШаблон(
			"gtin=%1",
			GTIN));
	ПараметрыURL.Добавить(
		СтрШаблон(
			"quantity=%1",
			Количество));
	ПараметрыURL.Добавить(
		СтрШаблон(
			"lastBlockId=%1",
			НачальнаяПозиция));
	
	ГруппаТоваров = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
		ПараметрыКоманды.Документ, "ОсобенностьУчета.ТоварнаяГруппаСУЗ");
	
	// Шины
	URLЗапроса = СтрШаблон(
		"api/v2/%1/codes?%2",
		ГруппаТоваров,
		СтрСоединить(ПараметрыURL, "&"));
	
	// Сопоставим настройки для СУЗ
	ПараметрыЗапросаСУЗ = ОбщегоНазначенияКлиентСервер.СкопироватьСтруктуру(ПараметрыЗапроса);
	ПараметрыЗапросаСУЗ.АдресКонтура = ПараметрыЗапроса.АдресСУЗ;
	ПараметрыЗапросаСУЗ.Порт = ПараметрыЗапроса.ПортСУЗ;
	
	РезультатЗапроса = ОтправитьЗапросВСервис(
		URLЗапроса,
		Неопределено,
		ПараметрыЗапросаСУЗ,
		"GET",
		Неопределено,
		ЗаголовокHTTP);
	
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	
	Если РезультатОтправки.КодСостояния = 200 Тогда
		
		ДанныеОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета);
		Если ДанныеОбработки = Неопределено Тогда
			
			Результат.Вставить("ТекстОшибки", 
				СтрШаблон(НСтр("ru = 'Ошибка в результате отправки запроса поиска по каталогу: %1'"),
				РезультатОтправки.СообщениеОтвета));
			
		Иначе
			
			Данные = Новый Структура;
			Данные.Вставить("КодыМаркировки", ДанныеОбработки.codes);
			Данные.Вставить("ИдентификаторПоследнегоБлокаКодов", ДанныеОбработки.blockId);
			
			Результат.Данные = Данные;
			
		КонецЕсли;
		
	Иначе
		
		Если СтрНайти(РезультатОтправки.ТекстОшибки, "Billing response didn't received in time. Close request sent") Тогда
			Результат.Вставить("ТекстОшибки", НСтр("ru = 'Заказ кодов маркировки обрабатывается'"));
		Иначе
			Результат.Вставить("ТекстОшибки", 
				СтрШаблон(НСтр("ru = 'Ошибка в результате получения кодов маркировки: %1'"),
				?(РезультатОтправки.ТекстОшибки = "", РезультатОтправки.СообщениеОтвета, РезультатОтправки.ТекстОшибки)));
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Процедура ОтправкаЗапросаСозданияДокумента(ПараметрыКоманды, ПараметрыЗапроса, КлючСессии, ОтветЗапроса)
	
	РезультатЗапроса = ЗапросСозданияДокумента(
		ПараметрыКоманды,
		ПараметрыЗапроса,
		КлючСессии,
		ПараметрыКоманды.Документ);
	ДокументЗапроса = ПараметрыКоманды.Документ.ПолучитьОбъект();
	Если РезультатЗапроса.Результат <> Неопределено Тогда
		ДанныеДокумента = ЗапросПолученияСодержимогоДокумента(
			ПараметрыКоманды,
			ПараметрыЗапроса,
			КлючСессии,
			РезультатЗапроса.Результат);
		ДанныеОбработаны = ДанныеДокумента.Обработан;
		// Установим статус выполения запроса
		Если ДанныеОбработаны И ЕстьРеквизит(ПараметрыКоманды.Документ, "Статус") Тогда
			СтатусДокумента = ПолучитьЗначениеПараметраСтруктуры(ПараметрыКоманды,
				"СтатусДокумента");
			ДокументЗапроса.Статус = ?(ЗначениеЗаполнено(СтатусДокумента), СтатусДокумента,
				Перечисления.СтатусыДокументовМаркировки.Выполнен);
		КонецЕсли;
		Если ДанныеОбработаны И ЕстьРеквизит(ПараметрыКоманды.Документ, "ИдентификаторДокумента") Тогда
			ДокументЗапроса.ИдентификаторДокумента = РезультатЗапроса.Результат;
		КонецЕсли;
		ОтветЗапроса.Успешно = Истина;
		Если ДанныеОбработаны Тогда
			ДокументЗапроса.ОписаниеОшибки = "";
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Отправка запроса в Честный знак.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Информация,,
				ДокументЗапроса.Ссылка,
				СтрШаблон(
				НСтр("ru = 'Сформирован документ в Честном знаке. Номер документа %1'"),
					РезультатЗапроса.Результат));
		Иначе
			ОтветЗапроса.Сообщение = ДанныеДокумента.ТекстОшибки;
			ДокументЗапроса.ОписаниеОшибки = ДанныеДокумента.ТекстОшибки;
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'Отправка запроса в Честный знак.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,,
				ДокументЗапроса.Ссылка,
				СтрШаблон(
				НСтр("ru = 'При формировании документа возникла ошибка: %1'"),
					ДанныеДокумента.ТекстОшибки));
		КонецЕсли;
	Иначе
		//Мальцев А.Ю.+++
		ДанныеОбработаны = Ложь;
		//Мальцев А.Ю.---

		ОтветЗапроса.ТекстОшибки = РезультатЗапроса.ТекстОшибки;
		ДокументЗапроса.ОписаниеОшибки = РезультатЗапроса.ТекстОшибки;
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'Отправка запроса в Честный знак.'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			,
			ДокументЗапроса.Ссылка,
			СтрШаблон(НСтр("ru = 'При формировании документа возникла ошибка: %1'"), ОтветЗапроса.ТекстОшибки)
		);
	КонецЕсли;
	ДокументЗапроса.Записать(РежимЗаписиДокумента.Проведение);
	
	Если ДанныеОбработаны Тогда
		Менеджер = ОбщегоНазначения.МенеджерОбъектаПоСсылке(ПараметрыКоманды.Документ);
		
		Попытка
			Менеджер.ОбработатьРезультатОтвета(ПараметрыКоманды.Документ, ПараметрыКоманды);
		Исключение
			//Результат.Вставить("ТекстОшибки", СтрШаблон(
			//НСтр("ru = 'Ошибка при формировании запроса: %1'"),
			//ОписаниеОшибки()));
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры // ОтправкаЗапросаСозданияДокумента()

Функция ЗапросПолученияСодержимогоДокумента(
		ПараметрыКоманды,
		ПараметрыЗапроса,
		КлючСессии,
		УИДДокумента,
		ДатаПовторногоЗапроса = Неопределено)
	
	Результат = Новый Структура("ТекстОшибки,Обработан", "", Истина);
	
	// Нет данных для поиска документа
	Если НЕ ЗначениеЗаполнено(УИДДокумента) Тогда
		Возврат Результат;
	КонецЕсли;
	
	URLЗапроса = СтрШаблон(
		"api/%1/facade/doc/%2/body",
		ПараметрыЗапроса.ВерсияФорматаОбмена,
		УИДДокумента);
	
	РезультатЗапроса = ОтправитьЗапросВСервис(
		URLЗапроса,
		Неопределено,
		ПараметрыЗапроса,
		"GET",
		КлючСессии);
	
	РезультатОтправки = ПреобразованиеОтправкаJSON(РезультатЗапроса);
	ОшибкаСтраницы = 404;
	
	Если РезультатОтправки.Свойство("ОтветПолучен")
		ИЛИ РезультатОтправки.Свойство("СообщениеОтвета") Тогда
		
		Если РезультатОтправки.КодСостояния = 200
			ИЛИ РезультатОтправки.КодСостояния = 201 Тогда
			
			РезультатОбработки = ТекстJSONВОбъект(РезультатОтправки.СообщениеОтвета);
			Если РезультатОбработки = Неопределено Тогда
				Возврат Результат;
			Иначе
				
				Если РезультатОбработки.Свойство("downloadStatus") Тогда
					
					УспешныеСтатусы = Новый Массив;
					УспешныеСтатусы.Добавить("CHECKED_OK");
					УспешныеСтатусы.Добавить("WAIT_ACCEPTANCE");
					УспешныеСтатусы.Добавить("WAIT_PARTICIPANT_REGISTRATION");
					
					Результат.Обработан = (УспешныеСтатусы.Найти(РезультатОбработки.downloadStatus) <> Неопределено);
				КонецЕсли;
				Если РезультатОбработки.Свойство("downloadStatus") Тогда
					Результат.ТекстОшибки = РезультатОбработки.downloadDesc;
				КонецЕсли;
				
			КонецЕсли;
			
			Возврат Результат;
			
		ИначеЕсли РезультатОтправки.КодСостояния = ОшибкаСтраницы И РезультатОтправки.Свойство("СообщениеОтвета") Тогда
				
				Результат.ТекстОшибки = РезультатОтправки.СообщениеОтвета;
				
		Иначе
			
			Результат.ТекстОшибки = РезультатОтправки.ТекстОшибки;
			
		КонецЕсли;
		
	Иначе
		
		Результат.ТекстОшибки = РезультатОтправки.ТекстОшибки;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьКодыМаркировки(ДанныеЗапроса, ДополнительныеПараметры)
	
	ИННОрганизации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДополнительныеПараметры.Организация, "ИНН");
	СостоянияКодовМаркировкиИБ = ПолучитьСостоянияКодовМаркировки(ДополнительныеПараметры.КодыМаркировки);
	Результат = Новый Массив;
	ПредставлениеСостояния = МаркировкаТоваровКлиентСервер.ПредставлениеСостояния();
	РазрешенныеСостояния = ПолучитьЗначениеПараметраСтруктуры(
		ДополнительныеПараметры, "РазрешенныеСостояния", Неопределено
	);
	Для Каждого КодМаркировки Из ДополнительныеПараметры.КодыМаркировки Цикл
		РезультатСтроки = Новый Структура(
			"КодМаркировки,СостояниеКодаМаркировкиИБ,СостояниеКодаМаркировкиСМТ,Примечание,Соответствует"
		);
		РезультатСтроки.КодМаркировки = КодМаркировки;
		РезультатСтроки.Соответствует = Ложь;
		Ответ = ДанныеЗапроса.Получить(МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(КодМаркировки, , Ложь));
		
		ПараметрыОтбора = Новый Структура("КодМаркировки", КодМаркировки);
		НайденныеСтроки = СостоянияКодовМаркировкиИБ.НайтиСтроки(ПараметрыОтбора);
		КодаНетВИБ = НайденныеСтроки.Количество() = 0;
		Если КодаНетВИБ Тогда
			Примечание = НСтр("ru = 'нашей базе'");
			РезультатСтроки.СостояниеКодаМаркировкиИБ = Перечисления.СостоянияКодовМаркировки.Неопределен;
		Иначе
			РезультатСтроки.СостояниеКодаМаркировкиИБ = НайденныеСтроки[0].Состояние;
		КонецЕсли;
		
		КодаНетВСМТ = Ответ = Неопределено;
		
		Если КодаНетВСМТ Тогда
			 КодаНетВСМТ = НЕ Ответ.Получить("errorCode") = Неопределено;
		 КонецЕсли;	
		 
		Если КодаНетВСМТ Тогда
			Если КодаНетВИБ Тогда
				Примечание = НСтр("ru = 'нашей базе и системе ""Честного знака""'");
			Иначе
				Примечание = НСтр("ru = 'системе ""Честного знака""'");
			КонецЕсли;
			РезультатСтроки.СостояниеКодаМаркировкиСМТ = НСтр("ru = 'Неопределен'");
		Иначе
			СостояниеКодаМаркировкиСМТ = Ответ.Получить("status");
			РезультатСтроки.СостояниеКодаМаркировкиСМТ = ПредставлениеСостояния.Получить(СостояниеКодаМаркировкиСМТ);
		КонецЕсли;
		
		Если КодаНетВИБ ИЛИ КодаНетВСМТ Тогда 
			РезультатСтроки.Примечание = СтрШаблон(
				НСтр("ru = 'Код маркировки отсутствует в %1.'"),
				Примечание);
			Результат.Добавить(РезультатСтроки);
			Продолжить;
		КонецЕсли;
		
		Если Ответ["ownerInn"] <> ИННОрганизации Тогда
			РезультатСтроки.Примечание = СтрШаблон(
				НСтр("ru = 'Код маркировки не принадлежит организации <%1>'"),
				ДополнительныеПараметры.Организация
			);
			Результат.Добавить(РезультатСтроки);
			Продолжить;
		КонецЕсли;
		
		РезультатСтроки.Соответствует = МаркировкаТоваровКлиентСервер.СопоставитьСостоянияКодовМаркировкиСЧестнымЗнаком(
			РезультатСтроки.СостояниеКодаМаркировкиИБ,
			СостояниеКодаМаркировкиСМТ,
			РазрешенныеСостояния,
			РезультатСтроки.Примечание
		);
		
		Результат.Добавить(РезультатСтроки);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОбновитьСостоянияКодовМаркировки(ДанныеЗапроса, ДополнительныеПараметры)
	СостоянияКодовМаркировкиИБ = ПолучитьСостоянияКодовМаркировки(ДополнительныеПараметры.КодыМаркировки);
	Результат = Новый Массив;
	
	Для Каждого КодМаркировки Из ДополнительныеПараметры.КодыМаркировки Цикл
		
		Ответ = ДанныеЗапроса.Получить(МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(КодМаркировки, , Ложь));
		
		ПараметрыОтбора = Новый Структура("КодМаркировки", КодМаркировки);
		НайденныеСтроки = СостоянияКодовМаркировкиИБ.НайтиСтроки(ПараметрыОтбора);
		
		Если НайденныеСтроки.Количество() = 0 Тогда
			Продолжить;
		Иначе
			Для каждого стрНайденныеСтроки из НайденныеСтроки Цикл
				НайденноеСостояние = стрНайденныеСтроки;
				ДокументОснование = стрНайденныеСтроки.ДокументОснование;
				
				Если Ответ.Получить("errorCode") = Неопределено Тогда
					ЗаписьСостоянияКодовМаркировки =  РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
					ЗаписьСостоянияКодовМаркировки.Отбор.КодМаркировки.Установить(КодМаркировки);
					ЗаписьСостоянияКодовМаркировки.Отбор.ДокументОснование.Установить(ДокументОснование);
					ЗаписьСостоянияКодовМаркировки.Прочитать();
					Если ЗаписьСостоянияКодовМаркировки.Количество() > 0 Тогда
						стрНаборСостоянияКодовМаркировки = ЗаписьСостоянияКодовМаркировки.Получить(0);
						стрНаборСостоянияКодовМаркировки.GTIN = Ответ.Получить("gtin");
						стрНаборСостоянияКодовМаркировки.КодМаркировкиПолный = КодМаркировки;
						
						СтруктураМаркировки = МенеджерОборудованияМаркировкаКлиентСервер
						.РазобратьШтриховойКодТовара(КодМаркировки);
						стрНаборСостоянияКодовМаркировки.СерийныйНомер = СтруктураМаркировки.СерийныйНомер;
						стрНаборСостоянияКодовМаркировки.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.ВНаличии;
						стрНаборСостоянияКодовМаркировки.Количество = Ответ.Получить("productWeightGr");
						стрНаборСостоянияКодовМаркировки.ДатаВыработки = ПрочитатьДатуJSON(СтрЗаменить(?(Ответ.Получить("producedDate") = Неопределено,Ответ.Получить("emissionDate"),Ответ.Получить("producedDate")),"Z",""), ФорматДатыJSON.ISO);
						стрНаборСостоянияКодовМаркировки.ДатаОкончанияСрокаГодности = стрНаборСостоянияКодовМаркировки.ДатаВыработки + стрНаборСостоянияКодовМаркировки.Номенклатура.СрокХраненияТовара*24*3600;
						стрНаборСостоянияКодовМаркировки.Производитель = Ответ.Получить("producerName");
						стрНаборСостоянияКодовМаркировки.РезультатПроверки = Новый ХранилищеЗначения(Ответ, Новый СжатиеДанных(9));
						стрНаборСостоянияКодовМаркировки.ДатаПроверки = ТекущаяДата();
						стрНаборСостоянияКодовМаркировки.ЕдиницаИзмерения = стрНаборСостоянияКодовМаркировки.Номенклатура.ОсновнаяЕдиницаИзмерения;
						стрНаборСостоянияКодовМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Неопределен;
						
						ДочерниеКодыМаркировки = Ответ.Получить("child");
						
						Если ТипЗнч(ДочерниеКодыМаркировки) = Тип("Массив") и ДочерниеКодыМаркировки.Количество() > 0 Тогда
							стрНаборСостоянияКодовМаркировки.ВидУпаковки = Перечисления.ВидыУпаковокМаркировки.Групповая;
							Для каждого стрДочерниеКодыМаркировки из ДочерниеКодыМаркировки Цикл
								ДочернийКодМаркировки = РегистрыСведений.СостоянияКодовМаркировки.СоздатьМенеджерЗаписи();
								ДочернийКодМаркировки.ДокументОснование = ДокументОснование;
								ДочернийКодМаркировки.Номенклатура = стрНаборСостоянияКодовМаркировки.Номенклатура;
								ДочернийКодМаркировки.GTIN = стрДочерниеКодыМаркировки;
								ДочернийКодМаркировки.КодМаркировкиУпаковки = стрНаборСостоянияКодовМаркировки.КодМаркировки;
								ДочернийКодМаркировки.Состояние = Перечисления.СостоянияКодовМаркировки.Неопределен;
								ДочернийКодМаркировки.ДатаПроверки = "";
								ДочернийКодМаркировки.КодМаркировкиПолный = стрДочерниеКодыМаркировки;
								ДочернийКодМаркировки.КодМаркировки = стрДочерниеКодыМаркировки;
								ДочернийКодМаркировки.Записать();
								
							КонецЦикла;	
						КонецЕсли;					
						
						СостояниеСМТ = Ответ.Получить("status");
						
						СостоянияВыпущен       = ДайСостоянияВыпущен();
						СостоянияПолучен       = ДайСостоянияПолучен();
						СостоянияВОбороте      = ДайСостоянияВОбороте();
						СостоянияСписан        = ДайСостоянияСписан();
						СостоянияВыбыл         = ДайСостоянияВыбыл();
						СостоянияРасформирован = ДайСостоянияРасформирован();
						
						Состояние = Новый Массив;
						Если СостояниеСМТ = "EMITTED" Тогда
							// выпущен
							Состояние = СостоянияВыпущен;
						ИначеЕсли СостояниеСМТ = "APPLIED" Тогда
							// получен
							Состояние = СостоянияПолучен;
						ИначеЕсли СостояниеСМТ = "INTRODUCED" Тогда
							// в обороте
							Состояние = СостоянияВОбороте;
						ИначеЕсли СостояниеСМТ = "WRITTEN_OFF" Тогда
							// списан
							Состояние = СостоянияСписан;
						ИначеЕсли СостояниеСМТ = "RETIRED" Тогда
							// выбыл
							Состояние = СостоянияВыбыл;
						ИначеЕсли СостояниеСМТ = "DISAGGREGATION" Тогда
							// расформирован
							Состояние = СостоянияРасформирован;
						КонецЕсли;
						
						Если Состояние.Количество() > 0 Тогда
							стрНаборСостоянияКодовМаркировки.Состояние = Состояние[0];	 
						КонецЕсли;
						
						ЗаписьСостоянияКодовМаркировки.Записать();
					КонецЕсли;	 				 
				Иначе 
					ЗаписьСостоянияКодовМаркировки =  РегистрыСведений.СостоянияКодовМаркировки.СоздатьНаборЗаписей();
					ЗаписьСостоянияКодовМаркировки.Отбор.КодМаркировки.Установить(КодМаркировки);
					ЗаписьСостоянияКодовМаркировки.Отбор.ДокументОснование.Установить(ДокументОснование);
					ЗаписьСостоянияКодовМаркировки.Прочитать();
					Если ЗаписьСостоянияКодовМаркировки.Количество() > 0 Тогда
						стрНаборСостоянияКодовМаркировки = ЗаписьСостоянияКодовМаркировки.Получить(0);
						стрНаборСостоянияКодовМаркировки.СтатусПроверки = Перечисления.СтатусыПроверкиМаркированнойПродукции.Отсутствует;
						стрНаборСостоянияКодовМаркировки.Состояние = Перечисления.СостоянияКодовМаркировки.НеИспользован;
						стрНаборСостоянияКодовМаркировки.Производитель = Ответ.Получить("errorMessage");
						стрНаборСостоянияКодовМаркировки.ДатаПроверки = ТекущаяДата();
						ЗаписьСостоянияКодовМаркировки.Записать();	 
					КонецЕсли;
				КонецЕсли;	
			КонецЦикла;
			
		КонецЕсли;
	КонецЦикла;
	
КонецФункции

Функция ПолучитьСостоянияКодовМаркировки(КодыМаркировки)
	
	// Разберем код маркировки и на основании этих данных будем искать
	ТаблицаКодовМаркировки = Новый ТаблицаЗначений;
	Строка50 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(50));
	Строка200 = Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(200));
	ТаблицаКодовМаркировки.Колонки.Добавить("КодМаркировкиКраткий", Строка200);
	ТаблицаКодовМаркировки.Колонки.Добавить("КодМаркировки", Строка200);
	ТаблицаКодовМаркировки.Колонки.Добавить("GTIN", Строка50);
	ТаблицаКодовМаркировки.Колонки.Добавить("СерийныйНомер", Строка50);
	
	Для Каждого ТекущийКодМаркировки Из КодыМаркировки Цикл
		
		КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущийКодМаркировки, "", Ложь);
		
		Если Не ЗначениеЗаполнено(КодМаркировки) Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = ТаблицаКодовМаркировки.Добавить();
		НоваяСтрока.КодМаркировки        = ТекущийКодМаркировки;
		НоваяСтрока.КодМаркировкиКраткий = КодМаркировки;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТаблицаКодовМаркировки.КодМаркировки КАК КодМаркировки,
	               |	ТаблицаКодовМаркировки.КодМаркировкиКраткий КАК КодМаркировкиКраткий
	               |ПОМЕСТИТЬ ТаблицаКодовМаркировки
	               |ИЗ
	               |	&ТаблицаКодовМаркировки КАК ТаблицаКодовМаркировки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ТаблицаКодовМаркировки.КодМаркировки КАК КодМаркировки,
	               |	СостоянияКодовМаркировки.Состояние КАК Состояние,
	               |	СостоянияКодовМаркировки.ДокументОснование КАК ДокументОснование
	               |ИЗ
	               |	ТаблицаКодовМаркировки КАК ТаблицаКодовМаркировки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СостоянияКодовМаркировки КАК СостоянияКодовМаркировки
	               |		ПО ТаблицаКодовМаркировки.КодМаркировкиКраткий = СостоянияКодовМаркировки.КодМаркировки";
	
	Запрос.УстановитьПараметр("ТаблицаКодовМаркировки", ТаблицаКодовМаркировки);
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат;
	
КонецФункции

Функция ДвоичныеДанныеBase64(Данные)
	
	Если ТипЗнч(Данные) = Тип("ДвоичныеДанные") Тогда
		Результат = Base64Строка(Данные);
	Иначе
		Результат = Данные;
	КонецЕсли;
		
	Результат = СтрЗаменить(Результат, Символы.ПС, "");
	Результат = СтрЗаменить(Результат, Символы.ВК, "");
	
	Возврат Результат;
	
КонецФункции

Функция ПодготовитьДанныеСверки(ДанныеОбработки, ПоследняяЗапись)
	
	Результат = Новый Массив;
	СоответствиеКодов = ДанныеОбработки.Получить("results");
	ПоследняяЗапись = Новый Структура("UIT, emissionDate");
	
	Для Каждого КлючЗначение Из СоответствиеКодов Цикл
		СтрокаРезультата = Новый Структура("GTIN, Наименование, Производитель, Владелец, ПричинаВыводаИзОборота,
		| КодМаркировки, ДатаЭмиссии, АктуальныйСтатус"); 
		СтрокаРезультата.GTIN = КлючЗначение.Получить("gtin");
		
		СтрокаРезультата.Наименование = КлючЗначение.Получить("productName");
		СтрокаРезультата.Производитель = КлючЗначение.Получить("producerName");
		СтрокаРезультата.Владелец = КлючЗначение.Получить("ownerName");
		СтрокаРезультата.ПричинаВыводаИзОборота = КлючЗначение.Получить("withdrawReason");
		СтрокаРезультата.КодМаркировки = КлючЗначение.Получить("uit");
		СтрокаРезультата.ДатаЭмиссии = КлючЗначение.Получить("emissionDate");
		СтрокаРезультата.АктуальныйСтатус = КлючЗначение.Получить("status");
		ПоследняяЗапись.UIT = СтрокаРезультата.КодМаркировки;
		ПоследняяЗапись.emissionDate = СтрокаРезультата.ДатаЭмиссии;
		Результат.Добавить(СтрокаРезультата);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ДатаСЧасовымПоясом(Дата, Знач ЧасовойПояс = Неопределено) Экспорт
	
	Если ЧасовойПояс = Неопределено Тогда
		ЧасовойПояс = ЧасовойПоясСеанса();
	КонецЕсли;
	
	Смещение = (Дата - УниверсальноеВремя(Дата, ЧасовойПояс)) / 3600;
	Если Смещение > 0 Тогда
		Результат = Формат(Дата, "ДФ=yyyy-MM-ddTHH:mm:ss.000Z");
		// TODO: не забыть про смещение
	Иначе
		Результат = Формат(Дата, "ДФ=yyyy-MM-ddTЧЧ:мм:сс") + "-" + Формат(-Смещение, "ЧЦ=2; ЧН=; ЧВН=") + ":00";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СтруктураПоискаПоОстаткам(Документ, ДанныеЗапроса)
	
	ТорговаяМарка =
		?(ДанныеЗапроса.Значение.ТорговаяМарка = НСтр("ru = 'Без товарного знака'"), "",
			ДанныеЗапроса.Значение.ТорговаяМарка);
	
	Результат = Новый Структура();
	Результат.Вставить("ТоварныйЗнак", ТорговаяМарка);
	
	Если Документ.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.Шины Тогда
		
		Результат.Вставить("Модель", ДанныеЗапроса.Значение.Модель);
		
	ИначеЕсли Документ.ОсобенностьУчета = Справочники.ОсобенностиУчетаНоменклатуры.ЛегкаяПромышленность Тогда
		
		ПараметрыНоменклатуры = СтрРазделить(ДанныеЗапроса.Значение.Наименование, ".");
		Индекс = ПараметрыНоменклатуры.Количество() - 1;
		
		// Способ вывода из оборота
		Если СтрНайти(ПараметрыНоменклатуры[Индекс], "Ввезен в РФ") > 0 Тогда
			Результат.Вставить("СпособВыпускаТоваровВОборот", Перечисления.СпособыВыпускаВОборот.ИмпортВРФ);
		ИначеЕсли СтрНайти(ПараметрыНоменклатуры[Индекс], "Произведен в РФ") > 0 Тогда
			Результат.Вставить("СпособВыпускаТоваровВОборот", Перечисления.СпособыВыпускаВОборот.ПроизводствоРФ);
		КонецЕсли;
		
		// Дополнительные характеристики
		Индекс = Индекс - 1;
		
		Если Индекс = -1 Тогда
			Возврат Результат;
		КонецЕсли;
		
		Если СтрНачинаетсяС(ДанныеЗапроса.Значение.КодТНВЭД, "63") Тогда
			
			Если СтрНайти(ПараметрыНоменклатуры[Индекс], "Детское") > 0 Тогда
				Результат.Вставить("ВозрастнаяКатегория", Перечисления.ВозврастныеКатегории.Детское);
			ИначеЕсли СтрНайти(ПараметрыНоменклатуры[Индекс], "Взрослое") > 0 Тогда
				Результат.Вставить("ВозрастнаяКатегория", Перечисления.ВозврастныеКатегории.Взрослое);
			ИначеЕсли СтрНайти(ПараметрыНоменклатуры[Индекс], "Без возраста") > 0 Тогда
				Результат.Вставить("ВозрастнаяКатегория", Перечисления.ВозврастныеКатегории.БезВозрастнойКатегории);
			КонецЕсли;
			
		ИначеЕсли СтрНачинаетсяС(ДанныеЗапроса.Значение.КодТНВЭД, "42")
			ИЛИ СтрНачинаетсяС(ДанныеЗапроса.Значение.КодТНВЭД, "61")
			ИЛИ СтрНачинаетсяС(ДанныеЗапроса.Значение.КодТНВЭД, "62")
			ИЛИ СтрНачинаетсяС(ДанныеЗапроса.Значение.КодТНВЭД, "64") Тогда
			
			Если СтрНайти(ПараметрыНоменклатуры[Индекс], "Мужская") > 0 Тогда
				Результат.Вставить("ЦелевойПол", Перечисления.ЦелевойПол.Мужской);
			ИначеЕсли СтрНайти(ПараметрыНоменклатуры[Индекс], "Женская") > 0 Тогда
				Результат.Вставить("ЦелевойПол", Перечисления.ЦелевойПол.Женский);
			ИначеЕсли СтрНайти(ПараметрыНоменклатуры[Индекс], "Детская") > 0 Тогда
				Результат.Вставить("ЦелевойПол", Перечисления.ЦелевойПол.Детский);
			ИначеЕсли СтрНайти(ПараметрыНоменклатуры[Индекс], "Унисекс") > 0 Тогда
				Результат.Вставить("ЦелевойПол", Перечисления.ЦелевойПол.Унисекс);
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияВыпущен()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Эмитирован"));
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияПолучен()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Эмитирован"));
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияВОбороте()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВведенВОборот"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВведенВОборотПриВозврате")
	);
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияСписан()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Списан"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.НеИспользован"));
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияВыбыл()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборота"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаРозничнаяПродажа"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаЭкспортированВСтраныЕАЭС"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаЭкспортированЗаПределыСтранЕАЭС"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаВозвращенФизическомуЛицу"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаПриУтратеИлиПовреждении"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаПриУничтожении"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаКонфискация"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаЛиквидацияПредприятия"));
	Результат.Добавить(ПредопределенноеЗначение(
		"Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаИспользованДляСобственныхНуждПредприятия")
	);
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаПоДоговоруРассрочки"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаПриПеремаркировке"));
	Результат.Добавить(
		ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ВыведенИзОборотаВРезультатеСписания"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.ПередачаДругомуСобственнику"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Экспортирован"));
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Утилизирован"));
	
	Возврат Результат;
	
КонецФункции

Функция ДайСостоянияРасформирован()
	
	Результат = Новый Массив;
	
	Результат.Добавить(ПредопределенноеЗначение("Перечисление.СостоянияКодовМаркировки.Разагрегирован"));
	
	Возврат Результат;
	
КонецФункции


#КонецОбласти
