#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Функция ПолучитьКлассификаторЕдиницыИзмерения(Код, Наименование, ПолноеНаименование)
	
	КлассификаторЕдиницы = Справочники.КлассификаторЕдиницИзмерения.НайтиПоКоду(Код);
	
	Если НЕ ЗначениеЗаполнено(КлассификаторЕдиницы) Тогда
		
		Объект = Справочники.КлассификаторЕдиницИзмерения.СоздатьЭлемент();
		Объект.НаименованиеПолное = ПолноеНаименование;
		Объект.Код                = Код;
		Объект.Наименование       = Наименование;
		Объект.Записать();
		
		КлассификаторЕдиницы = Объект.Ссылка;
		
	КонецЕсли;
	
	Возврат КлассификаторЕдиницы;
	
КонецФункции // ПолучитьКлассификаторЕдиницыИзмерения()

Процедура ВыполнитьНачальноеЗаполнениеПараметрыУчета() Экспорт
	
	// Номер релиза конфигурации используется для определения факта перехода с прошлой редакции решения на новую.
	Если НЕ Метаданные.Константы.Найти("НомерРелизаКонфигурации")=Неопределено Тогда
		Константы["НомерРелизаКонфигурации"].Установить("");
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Константы.ИспользованиеОперативногоПроведенияДокументов.Получить()) Тогда
		Константы.ИспользованиеОперативногоПроведенияДокументов.Установить(Перечисления.ИспользованиеОперативногоПроведенияДокументов.РазрешеноОперативноеПроведение);
	КонецЕсли;
	
	ВалютаРегламентированногоУчета = Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить();
	
	// Параметры валютного учета
	Если НЕ ЗначениеЗаполнено(ВалютаРегламентированногоУчета) Тогда
		
		ВалютаРегламентированногоУчета = Справочники.Валюты.НайтиПоКоду("643");
		
		Если НЕ ЗначениеЗаполнено(ВалютаРегламентированногоУчета) Тогда
			
			Объект = Справочники.Валюты.СоздатьЭлемент();
			Объект.НаименованиеПолное        = НСтр("ru = 'Российский рубль'");
			Объект.Код                       = "643";
			Объект.Наименование              = "RUB";
			Объект.ЗагружаетсяИзИнтернета    = ЛОЖЬ;
			Объект.СпособУстановкиКурса      = Перечисления.СпособыУстановкиКурсаВалюты.РучнойВвод;
			Объект.ПараметрыПрописиНаРусском = НСтр("ru = 'рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2 знака'");
			Объект.Записать();
			
			ВалютаРегламентированногоУчета = Объект.Ссылка;
			
			Запись = РегистрыСведений.КурсыВалют.СоздатьМенеджерЗаписи();
			Запись.Валюта    = ВалютаРегламентированногоУчета;
			Запись.Период    = '19800101';
			Запись.Курс      = 1;
			Запись.Кратность = 1;
			Запись.Записать();
			
		КонецЕсли;
		
		Константы.ВалютаРегламентированногоУчетаОрганизаций.Установить(ВалютаРегламентированногоУчета);
		
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.ВалютаУправленческогоУчетаКомпании.Получить()) Тогда
		Константы.ВалютаУправленческогоУчетаКомпании.Установить(ВалютаРегламентированногоУчета);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Константы.ЧекиПослеСвертки.Получить()) Тогда
		Константы.ЧекиПослеСвертки.Установить(Перечисления.ВариантыОтветов.Спрашивать);
	КонецЕсли;
	
	// Параметры основных единиц учета
	Если НЕ ЗначениеЗаполнено(Константы.ОсновнаяЕдиницаИзмеренияКоличества.Получить()) Тогда
		ЕдиницаКоличества = ПолучитьКлассификаторЕдиницыИзмерения("796", "шт", "Штука");
		Константы.ОсновнаяЕдиницаИзмеренияКоличества.Установить(ЕдиницаКоличества);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.ОсновнаяЕдиницаИзмеренияМассы.Получить()) Тогда
		ЕдиницаВеса = ПолучитьКлассификаторЕдиницыИзмерения("166", "кг", "Килограмм");
		Константы.ОсновнаяЕдиницаИзмеренияМассы.Установить(ЕдиницаВеса);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.ОсновнаяЕдиницаРазмерности.Получить()) Тогда
		ЕдиницаРазмерности = ПолучитьКлассификаторЕдиницыИзмерения("006", "м", "Метр");
		Константы.ОсновнаяЕдиницаРазмерности.Установить(ЕдиницаРазмерности);
	КонецЕсли;
	
	// Параметры штрихкодирования
	Если НЕ ЗначениеЗаполнено(Константы.ПрефиксШтучногоШК.Получить()) Тогда
		Константы.ПрефиксШтучногоШК.Установить(20);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.ПрефиксВесовогоШК.Получить()) Тогда
		Константы.ПрефиксВесовогоШК.Установить(22);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Константы.ПартияТоваровОтрицательныхОстатков.Получить()) Тогда
		
		// Найдем существующий документ партии отрицательных остатков
		ТекстЗапроса = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПоступлениеТоваров.Ссылка,
		|	ПоступлениеТоваров.Дата
		|ИЗ
		|	Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
		|ГДЕ
		|	ПоступлениеТоваров.ХозОперация = ЗНАЧЕНИЕ(Справочник.ХозОперации.ПоступлениеТоваровСреднееОтрицательное)";
		Запрос = Новый Запрос(ТекстЗапроса);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			Константы.ПартияТоваровОтрицательныхОстатков.Установить(Выборка.Ссылка);
		Иначе
			
			// Определим дату первого документа поступления товаров
			Выборка = Документы.ПоступлениеТоваров.Выбрать(,,, "Дата");
			Если Выборка.Следующий() Тогда
				Дата = Мин(Выборка.Дата-1, НачалоГода(ТекущаяДатаСеанса())-1);
			Иначе
				Дата = НачалоГода(ТекущаяДатаСеанса())-1;
			КонецЕсли;
			
			// Создадим и заполним новый документ
			Объект = Документы.ПоступлениеТоваров.СоздатьДокумент();
			Объект.ХозОперация           = Справочники.ХозОперации.ПоступлениеТоваровСреднееОтрицательное;
			Объект.Дата                  = Дата;
			Объект.ВалютаДокумента       = ВалютаРегламентированногоУчета;
			Объект.Контрагент            = Справочники.Контрагенты.ОсновнойПоставщик;
			Объект.Организация           = Справочники.Организации.ОсновнаяОрганизация;
			Объект.ПодразделениеКомпании = Справочники.ПодразделенияКомпании.ОсновноеПодразделение;
			Объект.СкладКомпании         = Справочники.СкладыКомпании.ОсновнойСкладКомпании;
			Документы.ПоступлениеТоваров.КонтрагентПриИзменении(Объект);
			Объект.Заполнить(Неопределено);
			Объект.УстановитьНовыйНомер();
			
			// Производим запись нового документа
			Объект.ОбменДанными.Загрузка = ИСТИНА;
			Объект.Записать(РежимЗаписиДокумента.Запись);
			
			// Устанавливаем значение константы
			Константы.ПартияТоваровОтрицательныхОстатков.Установить(Объект.Ссылка);
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().РежимПроведенияПоПартиям) Тогда
		ПланОбменаОбъект = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().ПолучитьОбъект();
		ПланОбменаОбъект.РежимПроведенияПоПартиям = Перечисления.РежимыПроведенияПартий.ПервичнымиДокументамиДопроведение;
		ПланОбменаОбъект.Записать();
	КонецЕсли;
	
	// Параметры подсистемы скидок
	Если НЕ ЗначениеЗаполнено(Константы.ВалютаНакопительныхСумм.Получить()) Тогда
		Константы.ВалютаНакопительныхСумм.Установить(ВалютаРегламентированногоУчета);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.ПериодНакопительныхСкидок.Получить()) Тогда
		Константы.ПериодНакопительныхСкидок.Установить(Перечисления.ПериодичностьАнализаНакопительныхСкидок.НеИспользуется);
	КонецЕсли;
	
	// Форматы вывода числовых показателей
	Если НЕ ЗначениеЗаполнено(Константы.ФорматВыводаКоличества.Получить()) Тогда
		Константы.ФорматВыводаКоличества.Установить("ЧН=0");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.ФорматВыводаСуммы.Получить()) Тогда
		Константы.ФорматВыводаСуммы.Установить("ЧДЦ=2; ЧН=0,00");
	КонецЕсли;
	Константы.ПолныйНомерДокументаВПечатныхФормах.Установить(ИСТИНА);
	
	// Обработка жалоб клиента
	Если НЕ ЗначениеЗаполнено(Константы.ВремяРазбораЖалобы.Получить()) Тогда
		Константы.ВремяРазбораЖалобы.Установить(6);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.ВремяРеакцииНаЖалобу.Получить()) Тогда
		Константы.ВремяРеакцииНаЖалобу.Установить(24);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнениеРазделыУчета()

Процедура ВыполнитьНачальноеЗаполнениеРазделыУчета() Экспорт
	
	Константы.ИспользоватьОрдерныйСклад.       Установить(ИСТИНА);
	Константы.ИспользоватьКомиссионнаяТорговля.Установить(ИСТИНА);
	Константы.ИспользоватьЗаказы.              Установить(ИСТИНА);
	Константы.ИспользоватьРозничнаяТорговля.   Установить(ИСТИНА);
	Константы.ИспользоватьПланирование.        Установить(ИСТИНА);
	Константы.ИспользоватьБюджетирование.      Установить(ИСТИНА);
	Константы.ИспользоватьРасчетыПоЗарплате.   Установить(ИСТИНА);
	Константы.ИспользоватьЦенныеБумаги.        Установить(ИСТИНА);
	Константы.ИспользоватьРозничнаяТорговля.   Установить(ИСТИНА);
	Константы.ИспользоватьВнеоборотныеАктивы.  Установить(ИСТИНА);
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнениеРазделыУчета()

Процедура ВыполнитьНачальноеЗаполнениеАналитикиУчета() Экспорт
	
	Константы.ИспользоватьМногофирменныйУчет.Установить(ИСТИНА);
	Константы.ИспользоватьМноговалютныйУчет.Установить(ИСТИНА);
	Константы.ИспользоватьПроекты.Установить(ИСТИНА);
	Константы.ИспользоватьПризнакРегламентированногоУчета.Установить(ИСТИНА);
	Если НЕ ЗначениеЗаполнено(Константы.ИспользоватьАртикул.Получить()) Тогда
		Константы.ИспользоватьАртикул.Установить(Перечисления.РежимыВыводаКодаВДокументах.Код);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.ИспользоватьХарактеристики.Получить()) Тогда
		Константы.ИспользоватьХарактеристики.Установить(ИСТИНА);
	КонецЕсли;
	Константы.ИспользоватьЕдиницыИзмерения.Установить(ИСТИНА);
	Константы.ИспользоватьКоэффициентЕдиницИзмерения.Установить(ИСТИНА);
	Если ЗначениеЗаполнено(Константы.ИспользоватьБазовоеКоличество.Получить()) Тогда
		Константы.ИспользоватьБазовоеКоличество.Установить(ЛОЖЬ);
	КонецЕсли;
	Константы.ИспользоватьГТД.Установить(ИСТИНА);
	Константы.ИспользоватьЯчейкиХранения.Установить(ИСТИНА);
	Если НЕ ЗначениеЗаполнено(Константы.ИспользоватьИндикациюОстатковТовара.Получить()) Тогда
		Константы.ИспользоватьИндикациюОстатковТовара.Установить(ИСТИНА);
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Константы.ИспользоватьИндикациюСуммыСписания.Получить()) Тогда
		Константы.ИспользоватьИндикациюСуммыСписания.Установить(ИСТИНА);
	КонецЕсли;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнениеАналитикиУчета()

Процедура ВыполнитьНачальноеЗаполнениеСлужебныеПодсистемы() Экспорт
	
	Константы.ИспользоватьПодключаемоеОборудование.Установить(ИСТИНА);
	Константы.ИспользоватьДополнительныеРеквизитыИСведения.Установить(ИСТИНА);
	Константы.ИспользоватьОбщиеДополнительныеЗначения.Установить(ИСТИНА);
	Константы.ИспользоватьОбщиеДополнительныеРеквизитыИСведения.Установить(ИСТИНА);
		
КонецПроцедуры // ВыполнитьНачальноеЗаполнениеСлужебныеПодсистемы()

#КонецЕсли