// Модуль менеджера документа "Акт свертки взаиморасчетов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит расчет значений итоговых показателей по операции в целом.
//
// Параметры:
//  Объект      - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  Расширенные - Булево               - Признак получения расширенных сведений об итогах операции.
//
Функция РассчитатьИтогиОперации(Объект, Расширенные=ЛОЖЬ) Экспорт
	
	// Формируем перечень основной информации об итогах операции
	ИтогиОперации = Новый Структура();
	ИтогиОперации.Вставить("СуммаДокумента", Объект.ПоДаннымОрганизации.Итог("УвеличениеДолга")-Объект.ПоДаннымОрганизации.Итог("УменьшениеДолга"));
	
	Объект.СуммаДокументаПриход = 0;
	Объект.СуммаДокументаРасход = 0;
	ИспользоватьДоговорТЧ = НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов);
	Для Каждого ТекСтрока Из Объект.ПоДаннымОрганизации Цикл
		ТекВалюта = ?(ИспользоватьДоговорТЧ, ТекСтрока.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов);
		Объект.СуммаДокументаПриход = Объект.СуммаДокументаПриход + РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.УвеличениеДолга, ТекВалюта, Объект.Дата, Объект.ВалютаДокумента, Объект.КурсДокумента);
		Объект.СуммаДокументаРасход = Объект.СуммаДокументаРасход + РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.УменьшениеДолга, ТекВалюта, Объект.Дата, Объект.ВалютаДокумента, Объект.КурсДокумента);
	КонецЦикла;
	
	Объект.СуммаДокументаПриходК = 0;
	Объект.СуммаДокументаРасходК = 0;
	Для Каждого ТекСтрока Из Объект.ПоДаннымКонтрагента Цикл
		ТекВалюта = ?(ИспользоватьДоговорТЧ, ТекСтрока.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов, Объект.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов);
		Объект.СуммаДокументаПриходК = Объект.СуммаДокументаПриходК + РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.УвеличениеДолга, ТекВалюта, Объект.Дата, Объект.ВалютаДокумента, Объект.КурсДокумента);
		Объект.СуммаДокументаРасходК = Объект.СуммаДокументаРасходК + РаботаСКурсамиВалютПлатформа.ПересчетПоВалюте(ТекСтрока.УменьшениеДолга, ТекВалюта, Объект.Дата, Объект.ВалютаДокумента, Объект.КурсДокумента);
	КонецЦикла;
	
	ОстатокНаКонец = Объект.СуммаДокументаПриход - Объект.СуммаДокументаРасход + Объект.ОстатокНаНачало;;
	ОстатокНаКонецКонтрагент = Объект.СуммаДокументаПриходК - Объект.СуммаДокументаРасходК - Объект.ОстатокНаНачало;
	Расхождение = ОстатокНаКонец + ОстатокНаКонецКонтрагент;

	
	// Формируем перечень расширенной информации об итогах операции
	ИтогиОперации.Вставить("ОстатокНаКонец",    ОстатокНаКонец);
	ИтогиОперации.Вставить("ОстатокНаКонецКонтрагент",    ОстатокНаКонецКонтрагент);
	ИтогиОперации.Вставить("Расхождение", Расхождение);
		
	// Возвращаем сведения об итогах операции
	Возврат ИтогиОперации;
	
КонецФункции // РассчитатьИтогиОперации()

// обработчик изменения документа в таблице
Процедура ОбработатьИзменениеДокумента(Объект, Строка)
	// пропишем приват
	Если НЕ  ЗначениеЗаполнено(Строка.Документ) Тогда
		Строка.Представление = "";
		Строка.Дата = Дата('00010101');
	Иначе		
		Если ЕстьРеквизит(Строка.Документ, "ВхДокНомер") И ЗначениеЗаполнено(Строка.Документ.ВхДокНомер) Тогда
			НомерДокумента = Строка.Документ.ВхДокНомер;
		Иначе
			НомерДокумента = Строка.Документ.Номер;
		КонецЕсли;
		
		Если ЕстьРеквизит(Строка.Документ, "ВхДокДата") И ЗначениеЗаполнено(Строка.Документ.ВхДокДата) Тогда
			ДатаДокумента = Строка.Документ.ВхДокДата;
		Иначе
			ДатаДокумента = Строка.Документ.Дата;
		КонецЕсли;
		
		Строка.Представление = Строка.Документ.Метаданные().Синоним + " № " + НомерДокумента + " от " + Формат(ДатаДокумента, "ДЛФ=ДД");
		Строка.Дата          = Строка.Документ.Дата;
		
		Если НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) И НЕ ЗначениеЗаполнено(Строка.ДоговорВзаиморасчетов) И ЕстьРеквизит(Строка.Документ, "ДоговорВзаиморасчетов") Тогда
			Строка.ДоговорВзаиморасчетов = Строка.Документ.ДоговорВзаиморасчетов;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты документа
	ОбязательныеРеквизиты=Новый Массив();
	ОбязательныеРеквизиты.Добавить("Организация");
	ОбязательныеРеквизиты.Добавить("ПодразделениеКомпании");
	ОбязательныеРеквизиты.Добавить("Автор");
	ОбязательныеРеквизиты.Добавить("ВалютаДокумента");
	ОбязательныеРеквизиты.Добавить("КурсДокумента");
	ОбязательныеРеквизиты.Добавить("Контрагент");
	ОбязательныеРеквизиты.Добавить("ДатаОкончания");
	ОбязательныеРеквизиты.Добавить("ХозОперация");
	
	ОбязательныеРеквизиты.Добавить("ПоДаннымОрганизации.Дата");
	ОбязательныеРеквизиты.Добавить("ПоДаннымОрганизации.Документ");
	Если НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) Тогда
		ОбязательныеРеквизиты.Добавить("ПоДаннымОрганизации.ДоговорВзаиморасчетов");
	КонецЕсли;
	
	ОбязательныеРеквизиты.Добавить("ПоДаннымКонтрагента.Дата");
	ОбязательныеРеквизиты.Добавить("ПоДаннымКонтрагента.Документ");
	Если НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов) Тогда
		ОбязательныеРеквизиты.Добавить("ПоДаннымКонтрагента.ДоговорВзаиморасчетов");
	КонецЕсли;
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт

	Уникальные = Новый Массив;
	Уникальные.Добавить("Дата");
	Уникальные.Добавить("Документ");
	Уникальные.Добавить("Представление");
	Уникальные.Добавить("Сделка");
	Уникальные.Добавить("ДоговорВзаиморасчетов");
	
	// Структура уникальных реквизитов табличных частей
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("ПоДаннымОрганизации", Уникальные);
	УникальныеРеквизиты.Вставить("ПоДаннымКонтрагента", Уникальные);
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьУникальныеРеквизиты()

// Производит формирование перечня реквизитов для проверки соответствия Организации и Подразделению.
//
// Параметры:
//  Объект                  - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//  КонтрольПоПодразделению - Булево               - Признак необходимости выполнить контроль по подразделению.
//
// Возвращаемое значение:
//  Структура - Содержит перечень проверяемых реквизитов.
//
Функция ПолучитьРеквизитыКонтроляПоОрганизации(Объект, КонтрольПоПодразделению) Экспорт
	
	// Структура параметров проверки реквизитов объекта
	КонтролируемыеРеквизиты = Новый Структура();
	КонтролируемыеРеквизиты.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
		
	КонтролируемыеРеквизитыТЧ = Новый Структура();
	КонтролируемыеРеквизитыТЧ.Вставить("ДоговорВзаиморасчетов", КонтрольПоПодразделению);
	
	КонтролируемыеРеквизиты.Вставить("ПоДаннымОрганизации", КонтролируемыеРеквизитыТЧ);
	КонтролируемыеРеквизиты.Вставить("ПоДаннымКонтрагента", КонтролируемыеРеквизитыТЧ);
	
	// Возвращаем сформированные параметры проверки
	Возврат КонтролируемыеРеквизиты;
	
КонецФункции // ПолучитьРеквизитыКонтроляПоОрганизации()


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ИЗМЕНЕНИЯ ДАННЫХ ОБЪЕКТА

// Возвращает предопределенную структуру действий
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Функция ПолучитьПараметрыДействия(Объект, ПараметрыДействия = Неопределено) Экспорт
	
	Если ПараметрыДействия = Неопределено Тогда
		ПараметрыДействия = Новый Структура;
	КонецЕсли;
	
	Возврат ПараметрыДействия;
	
КонецФункции // ПолучитьПараметрыДействия()

// Обработчик события пересчета зависимых показателей объекта при изменении значений ведущих реквизитов.
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик действия
	ОбработкаРеквизитовДокументаСервер.ОбработкаПересчетаПоказателейОбъекта(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаПересчетаПоказателейОбъекта()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ ШАПКИ

// Обработчик события возникающего при изменении данных реквизита "Дата".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДатаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДатаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Документ основание".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДокументОснованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДокументОснованиеПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего при изменении данных реквизита "Подразделение компании".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПодразделениеКомпанииПриИзменении(Объект, ПараметрыДействия);
		
КонецПроцедуры // ПодразделениеКомпанииПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Организация".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОрганизацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ОрганизацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Автор".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура АвторПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.АвторПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // АвторПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Проект".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ПроектПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ПроектПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ПроектПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ХозОперацияПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Тип цен".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ТипЦенПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ТипЦенПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ТипЦенПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Валюта".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ВалютаДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ВалютаДокументаПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ВалютаДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс документа".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КурсДокументаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КурсДокументаПриИзменении(Объект, ПараметрыДействия);
	
	// выполним пересчет доп сумм
	ЗаполнитьЗначенияСвойств(Объект, РассчитатьИтогиОперации(Объект, Истина));
	
КонецПроцедуры // КурсДокументаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КонтрагентПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	
	Объект.ПоДаннымКонтрагента.Очистить();
	Объект.ПоДаннымОрганизации.Очистить();

КонецПроцедуры // КонтрагентПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Договор взаиморасчетов".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // ДоговорВзаиморасчетовПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс валюты взаиморасчетов".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КурсВалютыВзаиморасчетовПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Вызываем общий обработчик события
	ОбработкаРеквизитовДокументаСервер.КурсВалютыВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
	
КонецПроцедуры // КурсВалютыВзаиморасчетовПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс валюты взаиморасчетов".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура ОстатокНаНачалоПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);

КонецПроцедуры // ОстатокНаНачалоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Курс валюты взаиморасчетов".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура СверкаСогласованаПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);

КонецПроцедуры //СверкаСогласованаПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ПО ДАННЫМ ОРГАНИЗАЦИИ"

// Обработчик события возникающего при изменении данных реквизита "Документ" в таблице "По данным организации".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ПоДаннымОрганизацииДокументПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ОбработатьИзменениеДокумента(Объект, Строка);
	
КонецПроцедуры // ПоДаннымОрганизацииДокументПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ ТАБЛИЦЫ "ПО ДАННЫМ КОНТРАГЕНТА"

// Обработчик события возникающего при изменении данных реквизита "Документ" в таблице "По данным контрагента".
//
// Параметры:
//  Объект - ДанныеФормыСтруктура   - Объект, для которого выполняется обработка события.
//  Строка - Строка табличной части - Строка, при изменении поля которой возникло событие.
//
Процедура ПоДаннымКонтрагентаДокументПриИзменении(Объект, Строка, ПараметрыДействия=Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ОбработатьИзменениеДокумента(Объект, Строка);

КонецПроцедуры // ПоДаннымКонтрагентаДокументПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	СсылкаНаДокумент = ПолучитьСсылку();
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.АктСверкиВзаиморасчетов",
		"ПФ_MXL_АктСверки",
		НСтр("ru = 'Акт сверки'"),
		СсылкаНаДокумент);
	УправлениеПечатьюПлатформа.ДобавитьКоманду(КомандыПечати,
		"Документ.АктСверкиВзаиморасчетов",
		"ПФ_MXL_АктСверки_По_Договорам",
		НСтр("ru = 'Акт сверки (по договорам)'"),
		СсылкаНаДокумент);
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик печати документа
//
// Параметры:
//  МассивОбъектов         - Массив           - массив объектов для формирования печатных форм
//  ПараметрыПечати        - Структура        - дополнительные параметры печати
//  КоллекцияПечатныхФорм  - Таблица значений - таблица с идентификаторами печатных форм и макетами печати
//  ОбъектыПечати          - Структура        - список областей печатной формы в разрезе документов
//  ПараметрыВывода        - Структура        - дополнительные параметры вывода формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктСверки") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_АктСверки",
															"АктСверки",
															ПечатьАктСверки(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_АктСверки_По_Договорам") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм,
															"ПФ_MXL_АктСверки_По_Договорам",
															"АктСверки",
															ПечатьАктСверкиПоДоговорам(МассивОбъектов, ОбъектыПечати));
	КонецЕсли;
КонецПроцедуры // Печать()

// Формирует печатную форму "АктСверки"
//
Функция ПечатьАктСверки(МассивОбъектов, ОбъектыПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктСверкиВзаиморасчетов_АктСверки";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктСверкиВзаиморасчетов.ПФ_MXL_АктСверки");

		// Установим ориентацию страницы для нормального разбиения на страницы
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// Настроим макет
		ОтобразитьСделку=Истина;
		ОтобразитьСделкуКонтрагента=Истина;
		МассивПустыхСсылок= Новый Массив;
		МассивПустыхСсылок.Добавить(ПланыВидовХарактеристик.ТипыСделок.ПустаяСсылка());
		МассивПустыхСсылок.Добавить(Неопределено);
		Для Каждого Документ1 Из Документы Цикл
			МассивПустыхСсылок.Добавить(Документ1.ПустаяСсылка());	
		КонецЦикла;	
			
		// Определяем есть ли сделки по организации
		ЗапросПоСделке= Новый Запрос;
		ЗапросПоСделке.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                     |	ЕСТЬNULL(АктСверкиВзаиморасчетовПоДаннымОрганизации.Сделка, 0) КАК Поле1
		                     |ИЗ
		                     |	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
		                     |ГДЕ
		                     |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &ДокументСсылка
		                     |	И (НЕ АктСверкиВзаиморасчетовПоДаннымОрганизации.Сделка В (&МассивПустыхСсылок))";
		
							 
		ЗапросПоСделке.УстановитьПараметр("ДокументСсылка",Документ.Ссылка);
		ЗапросПоСделке.УстановитьПараметр("МассивПустыхСсылок",МассивПустыхСсылок);
		РезультатЗапроса=ЗапросПоСделке.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ОбластьСделка = Макет.Область("СделкаПоОрганизации");
			ОбластьСтрокаТЧ=Макет.Область("Строка");
			ОтобразитьСделку=Ложь;
			Макет.УдалитьОбласть(ОбластьСделка,ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		// Определяем есть ли сделки по контрагенту
		ЗапросПоСделке.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                     |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Сделка
		                     |ИЗ
		                     |	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК АктСверкиВзаиморасчетовПоДаннымКонтрагента
		                     |ГДЕ
		                     |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Ссылка = &ДокументСсылка
		                     |	И (НЕ АктСверкиВзаиморасчетовПоДаннымКонтрагента.Сделка В (&МассивПустыхСсылок))";
							 
		ЗапросПоСделке.УстановитьПараметр("ДокументСсылка",Документ.Ссылка);
		ЗапросПоСделке.УстановитьПараметр("МассивПустыхСсылок",МассивПустыхСсылок);

		РезультатЗапроса=ЗапросПоСделке.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ОбластьСделка = Макет.Область("СделкаПоКонтрагенту");
			ОбластьСтрокаТЧ=Макет.Область("Строка");
			ОтобразитьСделкуКонтрагента=Ложь;
			Макет.УдалитьОбласть(ОбластьСделка,ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		// форматы вывода
		ОбластьЗаголовок    	= Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьНачОстатки	   	= Макет.ПолучитьОбласть("НачОстатки");
		ОбластьИтогоПоСтранице	= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьСтрока	      	= Макет.ПолучитьОбласть("Строка");
		ОбластьОборотыИтог  	= Макет.ПолучитьОбласть("ОборотыИтог");
		ОбластьКонОстатки   	= Макет.ПолучитьОбласть("КонОстатки");
		ОбластьПодвал       	= Макет.ПолучитьОбласть("Подвал");
		
		// дата документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// Заголовок
		НазваниеОрганизации = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
		НаименованиеКонтрагента = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Контрагент,,,,ДатаДокумента);
		
		ПредставительОрганизации = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"ПредставительОрганизации");
		ПредставительКонтрагента = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ, "ПредставительКонтрагента");
		
		Если НЕ ЗначениеЗаполнено(ПредставительОрганизации.ПредставительОрганизации) Тогда
			ДолжностьПредставителяОрганизации = "";
			ИмяПредставителяОрганизации = "";
		Иначе
			ДолжностьПредставителяОрганизации = ПредставительОрганизации.ПредставительОрганизацииДолжность;
			ИмяПредставителяОрганизации = ПредставительОрганизации.ПредставительОрганизацииПредставление;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПредставительКонтрагента.ПредставительКонтрагента) Тогда
			ДолжностьПредставителяКонтрагента = "";
			ИмяПредставителяКонтрагента = "";
		Иначе
			ДолжностьПредставителяКонтрагента = ПредставительКонтрагента.ПредставительКонтрагентаДолжность;
			ИмяПредставителяКонтрагента = ПредставительКонтрагента.ПредставительКонтрагентаПредставление;
		КонецЕсли;
		
		ДатаНачалаПериода = ?(НЕ ЗначениеЗаполнено(Документ.ДатаНачала) И Документ.ПоДаннымОрганизации.Количество()>0, Документ.ПоДаннымКонтрагента[0].Дата, Документ.ДатаНачала);
		ТекстЗаголовка = НСтр("ru = 'взаимных расчетов за период с'") + Символы.НПП + Формат(ДатаНачалаПериода, "ДЛФ=D") + " по " + Формат(Документ.ДатаОкончания, "ДЛФ=D") +  " между " + НазваниеОрганизации + " и " + НаименованиеКонтрагента;
		Если ЗначениеЗаполнено(Документ.ДоговорВзаиморасчетов) Тогда
			ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + Символы.НПП +НСтр("ru ='по договору'") + Символы.НПП + СокрЛП(Документ.ДоговорВзаиморасчетов.Наименование);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		
		СтрЗаголовокТаблица = "Мы, нижеподписавшиеся, "
		+ ?(ДолжностьПредставителяОрганизации<>"",ДолжностьПредставителяОрганизации,"_______________________")+" "
		+ НазваниеОрганизации 
		+ " " + ?(ИмяПредставителяОрганизации<>"",ИмяПредставителяОрганизации,"__________________________________________") + НСтр("ru = ', с одной стороны,'") + Символы.НПП
		+ "и " + ?(ДолжностьПредставителяКонтрагента<>"",ДолжностьПредставителяКонтрагента,"___________________________") 
		+ " " + НаименованиеКонтрагента + " " 
		+ ?(НЕ ЗначениеЗаполнено(ИмяПредставителяКонтрагента),"_____________________________________________",ИмяПредставителяКонтрагента) + НСтр("ru = ', с другой стороны,'") + Символы.НПП
		+ НСтр("ru = 'составили настоящий акт сверки в том, что состояние взаимных расчетов по данным учета следующее:'");
		
		ОбластьЗаголовок.Параметры.СтрЗаголовокТаблица = СтрЗаголовокТаблица;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		// сразу два, т.к. выводим на второй странице только
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		
		// теперь выводим шапку
		НаименованиеПолноеОрганизации = СокрЛП(ОбщегоНазначения.ПолучитьНаименованияНаДату(Документ.Организация, ДатаДокумента, "НаименованиеДляПечатныхФорм"));
		НаименованиеПолноеКонтрагента = СокрЛП(ОбщегоНазначения.ПолучитьНаименованияНаДату(Документ.Контрагент, ДатаДокумента, "НаименованиеДляПечатныхФорм"));
		
		ОбластьШапкаТаблицы.Параметры.НазваниеОрганизации = НаименованиеПолноеОрганизации;
		ОбластьШапкаТаблицы.Параметры.НаименованиеКонтрагента = НаименованиеПолноеКонтрагента;
		ОбластьШапкаТаблицы.Параметры.ВалютаДокумента = Документ.ВалютаДокумента;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ОбластьНачОстатки.Параметры.СуммаНачальныйОстатокДт = ?(Документ.ОстатокНаНачало > 0, Документ.ОстатокНаНачало, 0);
		ОбластьНачОстатки.Параметры.СуммаНачальныйОстатокКт = ?(Документ.ОстатокНаНачало < 0, -Документ.ОстатокНаНачало, 0);
		ОбластьНачОстатки.Параметры.ВалютаДокумента = Документ.ВалютаДокумента;
		
		ТабличныйДокумент.Вывести(ОбластьНачОстатки);
		
		// заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
		
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ТаблицаДанныхОрганизации.Дата КАК Дата,
		               |	ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,
		               |	ТаблицаДанныхОрганизации.Документ КАК Документ,
		               |	ТаблицаДанныхОрганизации.Представление КАК ДокументПредставление,
		               |	ТаблицаДанныхОрганизации.Сделка КАК Сделка,
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхОрганизации.Ссылка.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхОрганизации.Ссылка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |	КОНЕЦ КАК Валюта,
		               |	ТаблицаДанныхОрганизации.УвеличениеДолга КАК СуммаОборотДт,
		               |	ТаблицаДанныхОрганизации.УменьшениеДолга КАК СуммаОборотКт,
		               |	ТаблицаДанныхОрганизации.НомерСтроки КАК НомерСтроки,
		               |	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаКонтр,
		               |	"""" КАК ДоговорВзаиморасчетовКонтр,
		               |	"""" КАК ДокументКонтр,
		               |	"""" КАК ДокументПредставлениеКонтр,
		               |	"""" КАК СделкаКонтр,
		               |	"""" КАК ВалютаКонтр,
		               |	0 КАК СуммаОборотДтКонтр,
		               |	0 КАК СуммаОборотКтКонтр
		               |ИЗ
		               |	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК ТаблицаДанныхОрганизации
		               |ГДЕ
		               |	ТаблицаДанныхОрганизации.Ссылка = &Ссылка
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	ДАТАВРЕМЯ(1, 1, 1),
		               |	"""",
		               |	"""",
		               |	"""",
		               |	"""",
		               |	"""",
		               |	0,
		               |	0,
		               |	ТаблицаДанныхКонтрагента.НомерСтроки,
		               |	ТаблицаДанныхКонтрагента.Дата,
		               |	ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов,
		               |	ТаблицаДанныхКонтрагента.Документ,
		               |	ТаблицаДанныхКонтрагента.Представление,
		               |	ТаблицаДанныхКонтрагента.Сделка,
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхКонтрагента.Ссылка.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхКонтрагента.Ссылка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |	КОНЕЦ,
		               |	ТаблицаДанныхКонтрагента.УвеличениеДолга,
		               |	ТаблицаДанныхКонтрагента.УменьшениеДолга
		               |ИЗ
		               |	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК ТаблицаДанныхКонтрагента
		               |ГДЕ
		               |	ТаблицаДанныхКонтрагента.Ссылка = &Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	НомерСтроки
		               |ИТОГИ
		               |	МАКСИМУМ(Дата),
		               |	МАКСИМУМ(ДоговорВзаиморасчетов),
		               |	МАКСИМУМ(Документ),
		               |	МАКСИМУМ(ДокументПредставление),
		               |	МАКСИМУМ(Сделка),
		               |	МАКСИМУМ(Валюта),
		               |	СУММА(СуммаОборотДт),
		               |	СУММА(СуммаОборотКт),
		               |	МАКСИМУМ(ДатаКонтр),
		               |	МАКСИМУМ(ДоговорВзаиморасчетовКонтр),
		               |	МАКСИМУМ(ДокументКонтр),
		               |	МАКСИМУМ(ДокументПредставлениеКонтр),
		               |	МАКСИМУМ(СделкаКонтр),
		               |	МАКСИМУМ(ВалютаКонтр),
		               |	СУММА(СуммаОборотДтКонтр),
		               |	СУММА(СуммаОборотКтКонтр)
		               |ПО
		               |	НомерСтроки";
		
		// доп. области
		мсвДопОбластиПодвала = Новый Массив;
		мсвДопОбластиПодвала.Добавить(ОбластьОборотыИтог);
		мсвДопОбластиПодвала.Добавить(ОбластьКонОстатки);
		мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
		
		СтруктураИтоговПоСтранице = Новый Структура("СуммаОборотДт, СуммаОборотКт, СуммаОборотДтКонтр, СуммаОборотКтКонтр");
		СтруктураИтоговПоСтранице.СуммаОборотДт      = 0;
		СтруктураИтоговПоСтранице.СуммаОборотКт      = 0;
		СтруктураИтоговПоСтранице.СуммаОборотДтКонтр = 0;
		СтруктураИтоговПоСтранице.СуммаОборотКтКонтр = 0;
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		КоличествоСтрок = Выборка.Количество();
		НомерСтроки = 1;
		
		Пока Выборка.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			Если ОтобразитьСделку И ЗначениеЗаполнено(ОбластьСтрока.Параметры.Сделка) Тогда ОбластьСтрока.Параметры.Сделка="№"+Выборка.Сделка.Номер+Символы.ПС+"от "+Формат(Выборка.Сделка.Дата, "ДЛФ=D"); КонецЕсли;
			Если ОтобразитьСделкуКонтрагента И ЗначениеЗаполнено(ОбластьСтрока.Параметры.СделкаКонтр) Тогда ОбластьСтрока.Параметры.СделкаКонтр="№"+Выборка.СделкаКонтр.Номер+Символы.ПС+"от "+Формат(Выборка.СделкаКонтр.Дата, "ДЛФ=D"); КонецЕсли;
			Если НЕ ПустаяСтрока(ОбластьСтрока.Параметры.ДокументПредставление) Тогда
				ОбластьСтрока.Параметры.ДокументПредставление = Лев(ОбластьСтрока.Параметры.ДокументПредставление, СтрДлина(ОбластьСтрока.Параметры.ДокументПредставление)-14);
			КонецЕсли;
			Если НЕ ПустаяСтрока(ОбластьСтрока.Параметры.ДокументПредставлениеКонтр) Тогда
				ОбластьСтрока.Параметры.ДокументПредставлениеКонтр = Лев(ОбластьСтрока.Параметры.ДокументПредставлениеКонтр, СтрДлина(ОбластьСтрока.Параметры.ДокументПредставлениеКонтр)-14);
			КонецЕсли;
			ОбластьСтрока.Параметры.СуммаОборотДт = Формат(Выборка.СуммаОборотДТ,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаОборотДтКонтр = Формат(Выборка.СуммаОборотДТКонтр,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаОборотКТ = Формат(Выборка.СуммаОборотКТ,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаОборотКтКонтр = Формат(Выборка.СуммаОборотКТКонтр,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.Дата=Формат(Выборка.Дата, "ДЛФ=D");
			ОбластьСтрока.Параметры.ДатаКонтр=Формат(Выборка.ДатаКонтр, "ДЛФ=D");
			
			// выводим строку, делая проверку попадания на лист
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице,
																					НомерСтраницы, СтруктураИтоговПоСтранице, Документ, 
																					?(НомерСтроки = КоличествоСтрок, мсвДопОбластиПодвала, Неопределено));
			
			// увеличим итоги по странице
			СтруктураСтрокиИтогов = Новый Структура("СуммаОборотДт,СуммаОборотКт,СуммаОборотДтКонтр,СуммаОборотКтКонтр");
			СтруктураСтрокиИтогов.СуммаОборотДт      = Выборка.СуммаОборотДт;
			СтруктураСтрокиИтогов.СуммаОборотКт      = Выборка.СуммаОборотКт;
			СтруктураСтрокиИтогов.СуммаОборотДтКонтр = Выборка.СуммаОборотДтКонтр;
			СтруктураСтрокиИтогов.СуммаОборотКтКонтр = Выборка.СуммаОборотКтКонтр;
			
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				НомерСтраницыПред = НомерСтраницы;
				СтруктураИтоговПоСтранице = Новый Структура("СуммаОборотДт, СуммаОборотКт, СуммаОборотДтКонтр, СуммаОборотКтКонтр");
				СтруктураИтоговПоСтранице.СуммаОборотДт      = 0;
				СтруктураИтоговПоСтранице.СуммаОборотКт      = 0;
				СтруктураИтоговПоСтранице.СуммаОборотДтКонтр = 0;
				СтруктураИтоговПоСтранице.СуммаОборотКтКонтр = 0;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			НомерСтроки = НомерСтроки+1;
			
			// добавляем итоги
			УправлениеПечатьюПлатформа.ДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
			
		КонецЦикла;
		
		// выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтогоПоСтранице,СтруктураИтоговПоСтранице,Документ);
		КонецЕсли;
		
		ОбластьОборотыИтог.Параметры.СуммаОборотДт   = Формат(Документ.СуммаДокументаПриход,ФорматВыводаСуммы);
		ОбластьОборотыИтог.Параметры.СуммаОборотКт   = Формат(Документ.СуммаДокументаРасход,ФорматВыводаСуммы);
		ОбластьОборотыИтог.Параметры.ВалютаДокумента = Документ.ВалютаДокумента;
		
		Если Документ.СверкаСогласована Тогда
			ОбластьОборотыИтог.Параметры.СуммаОборотДтКонтр   = Формат(Документ.СуммаДокументаПриходК,ФорматВыводаСуммы);
			ОбластьОборотыИтог.Параметры.СуммаОборотКтКонтр   = Формат(Документ.СуммаДокументаРасходК,ФорматВыводаСуммы);
			ОбластьОборотыИтог.Параметры.ВалютаДокументаКонтр = Документ.ВалютаДокумента;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьОборотыИтог);
		
		ОстатокНаКонец  = Документ.ОстатокНаНачало + Документ.СуммаДокументаПриход - Документ.СуммаДокументаРасход;
		ОстатокНаКонецК = Документ.СуммаДокументаПриходК - Документ.СуммаДокументаРасходК - Документ.ОстатокНаНачало;
		ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокДт = Формат(?(ОстатокНаКонец>0, ОстатокНаКонец,0),ФорматВыводаСуммы);
		ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокКт = Формат(?(ОстатокНаКонец<0,-ОстатокНаКонец,0),ФорматВыводаСуммы);
		ОбластьКонОстатки.Параметры.ВалютаДокумента		   = Документ.ВалютаДокумента;
		
		Если Документ.СверкаСогласована Тогда
			ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокДтКонтр = Формат(?(ОстатокНаКонецК>0, ОстатокНаКонецК,0),ФорматВыводаСуммы);
			ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокКтКонтр = Формат(?(ОстатокНаКонецК<0,-ОстатокНаКонецК,0),ФорматВыводаСуммы);
			ОбластьКонОстатки.Параметры.ВалютаДокументаКонтр		= Документ.ВалютаДокумента;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьКонОстатки);
		
		// Результаты сверки
		Если Документ.ПоДаннымОрганизации.Количество() = 0 И Документ.ОстатокНаНачало = 0 Тогда
			РезультатыСверки = НСтр("ru = '<сверка не проведена>'");
		ИначеЕсли НЕ ЗначениеЗаполнено(Документ.ДатаОкончания) Тогда
			РезультатыСверки = НСтр("ru = '<не указана дата сверки>'");
		ИначеЕсли НЕ ЗначениеЗаполнено(Документ.Контрагент) Тогда
			РезультатыСверки = НСтр("ru = '<не указан контрагент>'");
		Иначе
			РезультатыСверки = "на " + Формат(Документ.ДатаОкончания, "ДЛФ=D") + " задолженность ";
			
			Если ОстатокНаКонец > 0 Тогда
				РезультатыСверки = РезультатыСверки + НСтр("ru = 'в пользу'") + Символы.НПП + НаименованиеПолноеОрганизации + " " + РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОстатокНаКонец, Документ.ВалютаДокумента);
			ИначеЕсли ОстатокНаКонец < 0 Тогда
				РезультатыСверки = РезультатыСверки + НСтр("ru = 'в пользу'") + Символы.НПП + НаименованиеПолноеКонтрагента + " " + РаботаСКурсамиВалют.СформироватьСуммуПрописью(-ОстатокНаКонец, Документ.ВалютаДокумента);
			Иначе
				РезультатыСверки = РезультатыСверки + НСтр("ru = 'отсутствует.'");
			КонецЕсли;
		КонецЕсли;
		ОбластьПодвал.Параметры.РезультатыСверки = РезультатыСверки;
		
		Если Документ.СверкаСогласована Тогда
			ОбластьПодвал.Параметры.ПоДаннымКонтрагента = НСтр("ru = 'По данным'") +Символы.НПП + СокрЛП(Документ.Контрагент);
			
			Если Документ.ПоДаннымКонтрагента.Количество() = 0 И Документ.ОстатокНаНачало = 0 Тогда
				РезультатыСверки = НСтр("ru = '<сверка не проведена>'");
			ИначеЕсли НЕ ЗначениеЗаполнено(Документ.ДатаОкончания) Тогда
				РезультатыСверки = НСтр("ru = '<не указана дата сверки>'");
			ИначеЕсли НЕ ЗначениеЗаполнено(Документ.Контрагент) Тогда
				РезультатыСверки = НСтр("ru = '<не указан контрагент>'");
			Иначе
				РезультатыСверки = "на " + Формат(Документ.ДатаОкончания, "ДЛФ=D") + " задолженность ";
				Если ОстатокНаКонецК < 0 Тогда
					РезультатыСверки = РезультатыСверки + НСтр("ru = 'в пользу'") + Символы.НПП + НаименованиеПолноеОрганизации + " " + РаботаСКурсамиВалют.СформироватьСуммуПрописью(-ОстатокНаКонецК, Документ.ВалютаДокумента);
				ИначеЕсли ОстатокНаКонецК > 0 Тогда
					РезультатыСверки = РезультатыСверки + НСтр("ru = 'в пользу'") + Символы.НПП + НаименованиеПолноеКонтрагента + " " + РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОстатокНаКонецК, Документ.ВалютаДокумента);
				Иначе
					РезультатыСверки = РезультатыСверки + НСтр("ru = 'отсутствует.'");
				КонецЕсли;
			КонецЕсли;
			
			ОбластьПодвал.Параметры.РезультатыСверкиК = РезультатыСверки;
			Если ОстатокНаКонец+ОстатокНаКонецК<>0 Тогда
				ИтогСверки = НСтр("ru = 'В результате сверки выявлено расхождение информации о состоянии расчетов в размере'") + Символы.НПП + РаботаСКурсамиВалют.СформироватьСуммуПрописью(?(ОстатокНаКонец+ОстатокНаКонецК>0,1,-1)*(ОстатокНаКонец+ОстатокНаКонецК),  Документ.ВалютаДокумента);
				ОбластьПодвал.Параметры.ИтогСверки = Символы.ПС+ИтогСверки+Символы.ПС+" ";
			КонецЕсли; 
		КонецЕсли;
		
		ОбластьПодвал.Параметры.НазваниеОрганизации 	= НаименованиеПолноеОрганизации;
		ОбластьПодвал.Параметры.НаименованиеКонтрагента = НаименованиеПолноеКонтрагента;
		ОбластьПодвал.Параметры.Организация				= НаименованиеПолноеОрганизации;
		ОбластьПодвал.Параметры.Контрагент				= НаименованиеПолноеКонтрагента;
		ОбластьПодвал.Параметры.ДолжностьПредставление	= ?(НЕ ЗначениеЗаполнено(ДолжностьПредставителяОрганизации),"________________", СокрЛП(ДолжностьПредставителяОрганизации));
		ОбластьПодвал.Параметры.Должность 				= ДолжностьПредставителяОрганизации;
		ОбластьПодвал.Параметры.ДолжностьПредставлениеК = ?(НЕ ЗначениеЗаполнено(ДолжностьПредставителяКонтрагента),"________________", СокрЛП(ДолжностьПредставителяКонтрагента));
		ОбластьПодвал.Параметры.ДолжностьК				= ДолжностьПредставителяКонтрагента;
		ОбластьПодвал.Параметры.ФИОПредставителя  		= "("+?(НЕ ЗначениеЗаполнено(ИмяПредставителяОрганизации),"_______________________", ИмяПредставителяОрганизации)+")";
		ОбластьПодвал.Параметры.Представитель			= ПредставительОрганизации.ПредставительОрганизации;
		ОбластьПодвал.Параметры.ФИОПредставителяК 		= "("+?(НЕ ЗначениеЗаполнено(ИмяПредставителяКонтрагента),"_______________________", ИмяПредставителяКонтрагента)+")";
		ОбластьПодвал.Параметры.ПредставительК			= ПредставительКонтрагента.ПредставительКонтрагента;
		
		// зададим параметры макета
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// отметим конец области документа
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции //ПечатьАктСверки()

// Формирует печатную форму "АктСверки"
//
Функция ПечатьАктСверкиПоДоговорам(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	
	// Добавим установку параметров печати
	ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_АктСверкиВзаиморасчетов_АктСверкиПоДоговорам";
	УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
	ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Ландшафт;
	
	ПервыйДокумент = Истина;
	Для Каждого Документ Из МассивОбъектов Цикл
		Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.АктСверкиВзаиморасчетов.ПФ_MXL_АктСверки");

		// Установим ориентацию страницы для нормального разбиения на страницы
		ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		
		// Настроим макет
		ОтобразитьСделку=Истина;
		ОтобразитьСделкуКонтрагента=Истина;
		МассивПустыхСсылок= Новый Массив;
		МассивПустыхСсылок.Добавить(ПланыВидовХарактеристик.ТипыСделок.ПустаяСсылка());
		МассивПустыхСсылок.Добавить(Неопределено);
		Для Каждого Документ1 Из Документы Цикл
			МассивПустыхСсылок.Добавить(Документ1.ПустаяСсылка());	
		КонецЦикла;	
			
		// Определяем есть ли сделки по организации
		ЗапросПоСделке= Новый Запрос;
		ЗапросПоСделке.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                     |	ЕСТЬNULL(АктСверкиВзаиморасчетовПоДаннымОрганизации.Сделка, 0) КАК Поле1
		                     |ИЗ
		                     |	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК АктСверкиВзаиморасчетовПоДаннымОрганизации
		                     |ГДЕ
		                     |	АктСверкиВзаиморасчетовПоДаннымОрганизации.Ссылка = &ДокументСсылка
		                     |	И (НЕ АктСверкиВзаиморасчетовПоДаннымОрганизации.Сделка В (&МассивПустыхСсылок))";
		
							 
		ЗапросПоСделке.УстановитьПараметр("ДокументСсылка",Документ.Ссылка);
		ЗапросПоСделке.УстановитьПараметр("МассивПустыхСсылок",МассивПустыхСсылок);
		РезультатЗапроса=ЗапросПоСделке.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ОбластьСделка = Макет.Область("СделкаПоОрганизации");
			ОбластьСтрокаТЧ=Макет.Область("Строка");
			ОтобразитьСделку=Ложь;
			Макет.УдалитьОбласть(ОбластьСделка,ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		// Определяем есть ли сделки по контрагенту
		ЗапросПоСделке.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		                     |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Сделка
		                     |ИЗ
		                     |	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК АктСверкиВзаиморасчетовПоДаннымКонтрагента
		                     |ГДЕ
		                     |	АктСверкиВзаиморасчетовПоДаннымКонтрагента.Ссылка = &ДокументСсылка
		                     |	И (НЕ АктСверкиВзаиморасчетовПоДаннымКонтрагента.Сделка В (&МассивПустыхСсылок))";
							 
		ЗапросПоСделке.УстановитьПараметр("ДокументСсылка",Документ.Ссылка);
		ЗапросПоСделке.УстановитьПараметр("МассивПустыхСсылок",МассивПустыхСсылок);

		РезультатЗапроса=ЗапросПоСделке.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда
			ОбластьСделка = Макет.Область("СделкаПоКонтрагенту");
			ОбластьСтрокаТЧ=Макет.Область("Строка");
			ОтобразитьСделкуКонтрагента=Ложь;
			Макет.УдалитьОбласть(ОбластьСделка,ТипСмещенияТабличногоДокумента.ПоВертикали);
		КонецЕсли;
		
		// форматы вывода
		ОбластьЗаголовок    	= Макет.ПолучитьОбласть("Заголовок");
		ОбластьШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицыДоговоры");
		ОбластьНачОстатки	   	= Макет.ПолучитьОбласть("НачОстатки");
		ОбластьИтогоПоСтранице	= Макет.ПолучитьОбласть("ИтогоПоСтранице");
		ОбластьСтрока	      	= Макет.ПолучитьОбласть("СтрокаДоговор");
		ОбластьОборотыИтог  	= Макет.ПолучитьОбласть("ОборотыИтог");
		ОбластьКонОстатки   	= Макет.ПолучитьОбласть("КонОстатки");
		ОбластьПодвал       	= Макет.ПолучитьОбласть("Подвал");
		
		// получаем дату документа
		ДатаДокумента = Документ.Дата;
		ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
		
		// Заголовок
		НазваниеОрганизации = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
		НаименованиеКонтрагента = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Контрагент,,,,ДатаДокумента);
		
		ПредставительОрганизации = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"ПредставительОрганизации");
		ПредставительКонтрагента = УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ, "ПредставительКонтрагента");
		
		Если НЕ ЗначениеЗаполнено(ПредставительОрганизации.ПредставительОрганизации) Тогда
			ДолжностьПредставителяОрганизации = "";
			ИмяПредставителяОрганизации = "";
		Иначе
			ДолжностьПредставителяОрганизации = ПредставительОрганизации.ПредставительОрганизацииДолжность;
			ИмяПредставителяОрганизации = ПредставительОрганизации.ПредставительОрганизацииПредставление;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ПредставительКонтрагента.ПредставительКонтрагента) Тогда
			ДолжностьПредставителяКонтрагента = "";
			ИмяПредставителяКонтрагента = "";
		Иначе
			ДолжностьПредставителяКонтрагента = ПредставительКонтрагента.ПредставительКонтрагентаДолжность;
			ИмяПредставителяКонтрагента = ПредставительКонтрагента.ПредставительКонтрагентаПредставление;
		КонецЕсли;
		
		ДатаНачалаПериода = ?(НЕ ЗначениеЗаполнено(Документ.ДатаНачала) И Документ.ПоДаннымОрганизации.Количество()>0, Документ.ПоДаннымКонтрагента[0].Дата, Документ.ДатаНачала);
		ТекстЗаголовка =НСтр("ru = 'взаимных расчетов за период с'") + Формат(ДатаНачалаПериода, "ДЛФ=D") + " по " + Формат(Документ.ДатаОкончания, "ДЛФ=D") +  " между " + НазваниеОрганизации + " и " + НаименованиеКонтрагента;
		Если ЗначениеЗаполнено(Документ.ДоговорВзаиморасчетов) Тогда
			ТекстЗаголовка = ТекстЗаголовка + Символы.ПС + НСтр("ru = 'по договору'") + Символы.НПП + СокрЛП(Документ.ДоговорВзаиморасчетов.Наименование);
		КонецЕсли;
		ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		
		СтрЗаголовокТаблица = "Мы, нижеподписавшиеся, "
		+ ?(ДолжностьПредставителяОрганизации<>"",ДолжностьПредставителяОрганизации,"_______________________")+" "
		+ НазваниеОрганизации 
		+ " " + ?(ИмяПредставителяОрганизации<>"",ИмяПредставителяОрганизации,"__________________________________________") 
		+ НСтр("ru = ', с одной стороны,'") + Символы.НПП + "и " 
		+ ?(ДолжностьПредставителяКонтрагента<>"",ДолжностьПредставителяКонтрагента,"___________________________") 
		+ " " + НаименованиеКонтрагента + " " 
		+ ?(НЕ ЗначениеЗаполнено(ИмяПредставителяКонтрагента),"_____________________________________________",ИмяПредставителяКонтрагента)
		+ НСтр("ru = ', с другой стороны,'") + Символы.НПП+ НСтр("ru = 'составили настоящий акт сверки в том, что состояние взаимных расчетов по данным учета следующее:'");
		
		ОбластьЗаголовок.Параметры.СтрЗаголовокТаблица = СтрЗаголовокТаблица;
		ТабличныйДокумент.Вывести(ОбластьЗаголовок);
		// сразу два, т.к. выводим на второй странице только
		НомерСтраницы = 2;
		НомерСтраницыПред = НомерСтраницы;
		
		// теперь выводим шапку
		НаименованиеПолноеОрганизации = СокрЛП(ОбщегоНазначения.ПолучитьНаименованияНаДату(Документ.Организация, ДатаДокумента, "НаименованиеДляПечатныхФорм"));
		НаименованиеПолноеКонтрагента = СокрЛП(ОбщегоНазначения.ПолучитьНаименованияНаДату(Документ.Контрагент, ДатаДокумента, "НаименованиеДляПечатныхФорм"));
		
		ОбластьШапкаТаблицы.Параметры.НазваниеОрганизации = НаименованиеПолноеОрганизации;
		ОбластьШапкаТаблицы.Параметры.НаименованиеКонтрагента = НаименованиеПолноеКонтрагента;
		ОбластьШапкаТаблицы.Параметры.ВалютаДокумента = Документ.ВалютаДокумента;
		ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
		
		ОбластьНачОстатки.Параметры.СуммаНачальныйОстатокДт = ?(Документ.ОстатокНаНачало > 0, Документ.ОстатокНаНачало, 0);
		ОбластьНачОстатки.Параметры.СуммаНачальныйОстатокКт = ?(Документ.ОстатокНаНачало < 0, -Документ.ОстатокНаНачало, 0);
		ОбластьНачОстатки.Параметры.ВалютаДокумента = Документ.ВалютаДокумента;
		
		ТабличныйДокумент.Вывести(ОбластьНачОстатки);
		
		// заполним параметры шапки таблицы для следующего листа
		ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
		ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
			
		ТекстЗапроса = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхОрганизации.Ссылка.ДоговорВзаиморасчетов
		               |	КОНЕЦ КАК ДоговорВзаиморасчетов,
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхОрганизации.Ссылка.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхОрганизации.Ссылка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |	КОНЕЦ КАК Валюта,
		               |	СУММА(ТаблицаДанныхОрганизации.УвеличениеДолга) КАК СуммаОборотДт,
		               |	СУММА(ТаблицаДанныхОрганизации.УменьшениеДолга) КАК СуммаОборотКт,
		               |	"""" КАК ДоговорВзаиморасчетовКонтр,
		               |	"""" КАК ВалютаКонтр,
		               |	0 КАК СуммаОборотДтКонтр,
		               |	0 КАК СуммаОборотКтКонтр,
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхОрганизации.Ссылка.ДоговорВзаиморасчетов
		               |	КОНЕЦ КАК Договор
		               |ИЗ
		               |	Документ.АктСверкиВзаиморасчетов.ПоДаннымОрганизации КАК ТаблицаДанныхОрганизации
		               |ГДЕ
		               |	ТаблицаДанныхОрганизации.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхОрганизации.Ссылка.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхОрганизации.Ссылка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхОрганизации.Ссылка.ДоговорВзаиморасчетов
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхОрганизации.ДоговорВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхОрганизации.Ссылка.ДоговорВзаиморасчетов
		               |	КОНЕЦ
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	"""",
		               |	"""",
		               |	0,
		               |	0,
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхКонтрагента.Ссылка.ДоговорВзаиморасчетов
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхКонтрагента.Ссылка.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхКонтрагента.Ссылка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |	КОНЕЦ,
		               |	СУММА(ТаблицаДанныхКонтрагента.УвеличениеДолга),
		               |	СУММА(ТаблицаДанныхКонтрагента.УменьшениеДолга),
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхКонтрагента.Ссылка.ДоговорВзаиморасчетов
		               |	КОНЕЦ
		               |ИЗ
		               |	Документ.АктСверкиВзаиморасчетов.ПоДаннымКонтрагента КАК ТаблицаДанныхКонтрагента
		               |ГДЕ
		               |	ТаблицаДанныхКонтрагента.Ссылка = &Ссылка
		               |
		               |СГРУППИРОВАТЬ ПО
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхКонтрагента.Ссылка.ДоговорВзаиморасчетов = ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхКонтрагента.Ссылка.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхКонтрагента.Ссылка.ДоговорВзаиморасчетов
		               |	КОНЕЦ,
		               |	ВЫБОР
		               |		КОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов <> ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка)
		               |			ТОГДА ТаблицаДанныхКонтрагента.ДоговорВзаиморасчетов
		               |		ИНАЧЕ ТаблицаДанныхКонтрагента.Ссылка.ДоговорВзаиморасчетов
		               |	КОНЕЦ
		               |ИТОГИ
		               |	МАКСИМУМ(ДоговорВзаиморасчетов),
		               |	МАКСИМУМ(Валюта),
		               |	СУММА(СуммаОборотДт),
		               |	СУММА(СуммаОборотКт),
		               |	МАКСИМУМ(ДоговорВзаиморасчетовКонтр),
		               |	МАКСИМУМ(ВалютаКонтр),
		               |	СУММА(СуммаОборотДтКонтр),
		               |	СУММА(СуммаОборотКтКонтр)
		               |ПО
		               |	Договор";
		
		// доп. области
		мсвДопОбластиПодвала = Новый Массив;
		мсвДопОбластиПодвала.Добавить(ОбластьОборотыИтог);
		мсвДопОбластиПодвала.Добавить(ОбластьКонОстатки);
		мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("Ссылка", Документ.Ссылка);
		
		СтруктураИтоговПоСтранице = Новый Структура("СуммаОборотДт, СуммаОборотКт, СуммаОборотДтКонтр, СуммаОборотКтКонтр");
		СтруктураИтоговПоСтранице.СуммаОборотДт      = 0;
		СтруктураИтоговПоСтранице.СуммаОборотКт      = 0;
		СтруктураИтоговПоСтранице.СуммаОборотДтКонтр = 0;
		СтруктураИтоговПоСтранице.СуммаОборотКтКонтр = 0;
		Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		КоличествоСтрок = Выборка.Количество();
		НомерСтроки = 1;
		
		Пока Выборка.Следующий() Цикл
			ОбластьСтрока.Параметры.Заполнить(Выборка);
			ОбластьСтрока.Параметры.СуммаОборотДт = Формат(Выборка.СуммаОборотДТ,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаОборотДтКонтр = Формат(Выборка.СуммаОборотДТКонтр,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаОборотКТ = Формат(Выборка.СуммаОборотКТ,ФорматВыводаСуммы);
			ОбластьСтрока.Параметры.СуммаОборотКтКонтр = Формат(Выборка.СуммаОборотКТКонтр,ФорматВыводаСуммы);
			
			// выводим строку, делая проверку попадания на лист
			НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице,
																					НомерСтраницы, СтруктураИтоговПоСтранице, Документ, 
																					?(НомерСтроки = КоличествоСтрок, мсвДопОбластиПодвала, Неопределено));
			
			// увеличим итоги по странице
			СтруктураСтрокиИтогов = Новый Структура("СуммаОборотДт,СуммаОборотКт,СуммаОборотДтКонтр,СуммаОборотКтКонтр");
			СтруктураСтрокиИтогов.СуммаОборотДт      = Выборка.СуммаОборотДт;
			СтруктураСтрокиИтогов.СуммаОборотКт      = Выборка.СуммаОборотКт;
			СтруктураСтрокиИтогов.СуммаОборотДтКонтр = Выборка.СуммаОборотДтКонтр;
			СтруктураСтрокиИтогов.СуммаОборотКтКонтр = Выборка.СуммаОборотКтКонтр;
			
			Если НомерСтраницы <> НомерСтраницыПред Тогда
				НомерСтраницыПред = НомерСтраницы;
				СтруктураИтоговПоСтранице = Новый Структура("СуммаОборотДт, СуммаОборотКт, СуммаОборотДтКонтр, СуммаОборотКтКонтр");
				СтруктураИтоговПоСтранице.СуммаОборотДт      = 0;
				СтруктураИтоговПоСтранице.СуммаОборотКт      = 0;
				СтруктураИтоговПоСтранице.СуммаОборотДтКонтр = 0;
				СтруктураИтоговПоСтранице.СуммаОборотКтКонтр = 0;
				ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы; 
			КонецЕсли;
			НомерСтроки = НомерСтроки+1;
			
			// добавляем итоги
			УправлениеПечатьюПлатформа.ДобавитьИтогиПоСтранице(СтруктураСтрокиИтогов,СтруктураИтоговПоСтранице);
			
		КонецЦикла;
		
		// выводим последний подвал, если страниц больше единицы
		Если НомерСтраницы > 2 Тогда
			УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтогоПоСтранице,СтруктураИтоговПоСтранице,Документ);
		КонецЕсли;
		
		ОбластьОборотыИтог.Параметры.СуммаОборотДт   = Формат(Документ.СуммаДокументаПриход,ФорматВыводаСуммы);
		ОбластьОборотыИтог.Параметры.СуммаОборотКт   = Формат(Документ.СуммаДокументаРасход,ФорматВыводаСуммы);
		ОбластьОборотыИтог.Параметры.ВалютаДокумента = Документ.ВалютаДокумента;
		
		Если Документ.СверкаСогласована Тогда
			ОбластьОборотыИтог.Параметры.СуммаОборотДтКонтр   = Формат(Документ.СуммаДокументаПриходК,ФорматВыводаСуммы);
			ОбластьОборотыИтог.Параметры.СуммаОборотКтКонтр   = Формат(Документ.СуммаДокументаРасходК,ФорматВыводаСуммы);
			ОбластьОборотыИтог.Параметры.ВалютаДокументаКонтр = Документ.ВалютаДокумента;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьОборотыИтог);
		
		ОстатокНаКонец  = Документ.ОстатокНаНачало + Документ.СуммаДокументаПриход - Документ.СуммаДокументаРасход;
		ОстатокНаКонецК = Документ.СуммаДокументаПриходК - Документ.СуммаДокументаРасходК - Документ.ОстатокНаНачало;
		ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокДт = Формат(?(ОстатокНаКонец>0, ОстатокНаКонец,0),ФорматВыводаСуммы);
		ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокКт = Формат(?(ОстатокНаКонец<0,-ОстатокНаКонец,0),ФорматВыводаСуммы);
		ОбластьКонОстатки.Параметры.ВалютаДокумента		   = Документ.ВалютаДокумента;
		
		Если Документ.СверкаСогласована Тогда
			ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокДтКонтр = Формат(?(ОстатокНаКонецК>0, ОстатокНаКонецК,0),ФорматВыводаСуммы);
			ОбластьКонОстатки.Параметры.СуммаКонечныйОстатокКтКонтр = Формат(?(ОстатокНаКонецК<0,-ОстатокНаКонецК,0),ФорматВыводаСуммы);
			ОбластьКонОстатки.Параметры.ВалютаДокументаКонтр		= Документ.ВалютаДокумента;
		КонецЕсли;
		ТабличныйДокумент.Вывести(ОбластьКонОстатки);
		
		// Результаты сверки
		Если Документ.ПоДаннымОрганизации.Количество() = 0 И Документ.ОстатокНаНачало = 0 Тогда
			РезультатыСверки = НСтр("ru = '<сверка не проведена>'");
		ИначеЕсли НЕ ЗначениеЗаполнено(Документ.ДатаОкончания) Тогда
			РезультатыСверки = НСтр("ru = '<не указана дата сверки>'");
		ИначеЕсли НЕ ЗначениеЗаполнено(Документ.Контрагент) Тогда
			РезультатыСверки = НСтр("ru = '<не указан контрагент>'");
		Иначе
			РезультатыСверки = НСтр("ru = 'на'") + Символы.НПП + Формат(Документ.ДатаОкончания, "ДЛФ=D") + Символы.НПП + НСтр("ru = 'задолженность'") + Символы.НПП;
			
			Если ОстатокНаКонец > 0 Тогда
				РезультатыСверки = РезультатыСверки + НСтр("ru = 'в пользу'") + Символы.НПП + НаименованиеПолноеОрганизации + " " + РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОстатокНаКонец, Документ.ВалютаДокумента);
			ИначеЕсли ОстатокНаКонец < 0 Тогда
				РезультатыСверки = РезультатыСверки + НСтр("ru = 'в пользу'") + Символы.НПП + НаименованиеПолноеКонтрагента + " " + РаботаСКурсамиВалют.СформироватьСуммуПрописью(-ОстатокНаКонец, Документ.ВалютаДокумента);
			Иначе
				РезультатыСверки = РезультатыСверки + НСтр("ru = 'отсутствует.'");
			КонецЕсли;
		КонецЕсли;
		ОбластьПодвал.Параметры.РезультатыСверки = РезультатыСверки;
		
		Если Документ.СверкаСогласована Тогда
			ОбластьПодвал.Параметры.ПоДаннымКонтрагента = НСтр("ru = 'По данным'") + Символы.НПП + СокрЛП(Документ.Контрагент);
			
			Если Документ.ПоДаннымКонтрагента.Количество() = 0 И Документ.ОстатокНаНачало = 0 Тогда
				РезультатыСверки = НСтр("ru = '<сверка не проведена>'");
			ИначеЕсли НЕ ЗначениеЗаполнено(Документ.ДатаОкончания) Тогда
				РезультатыСверки = НСтр("ru = '<не указана дата сверки>'");
			ИначеЕсли НЕ ЗначениеЗаполнено(Документ.Контрагент) Тогда
				РезультатыСверки = НСтр("ru = '<не указан контрагент>'");
			Иначе
				РезультатыСверки = НСтр("ru = 'на'") + Символы.НПП + Формат(Документ.ДатаОкончания, "ДЛФ=D") + " задолженность ";
				Если ОстатокНаКонецК < 0 Тогда
					РезультатыСверки = РезультатыСверки + НСтр("ru = 'в пользу'") + Символы.НПП + НаименованиеПолноеОрганизации + " " + РаботаСКурсамиВалют.СформироватьСуммуПрописью(-ОстатокНаКонецК, Документ.ВалютаДокумента);
				ИначеЕсли ОстатокНаКонецК > 0 Тогда
					РезультатыСверки = РезультатыСверки + НСтр("ru = 'в пользу'") + Символы.НПП + НаименованиеПолноеКонтрагента + " " + РаботаСКурсамиВалют.СформироватьСуммуПрописью(ОстатокНаКонецК, Документ.ВалютаДокумента);
				Иначе
					РезультатыСверки = РезультатыСверки + НСтр("ru = 'отсутствует.'");
				КонецЕсли;
			КонецЕсли;
			
			ОбластьПодвал.Параметры.РезультатыСверкиК = РезультатыСверки;
			Если ОстатокНаКонец+ОстатокНаКонецК<>0 Тогда
				ИтогСверки = НСтр("ru = 'В результате сверки выявлено расхождение информации о состоянии расчетов в размере'") + Символы.НПП + РаботаСКурсамиВалют.СформироватьСуммуПрописью(?(ОстатокНаКонец+ОстатокНаКонецК>0,1,-1)*(ОстатокНаКонец+ОстатокНаКонецК),  Документ.ВалютаДокумента);
				ОбластьПодвал.Параметры.ИтогСверки = Символы.ПС+ИтогСверки+Символы.ПС+" ";
			КонецЕсли; 
		КонецЕсли;
		
		ОбластьПодвал.Параметры.НазваниеОрганизации 	= НаименованиеПолноеОрганизации;
		ОбластьПодвал.Параметры.НаименованиеКонтрагента = НаименованиеПолноеКонтрагента;
		ОбластьПодвал.Параметры.Организация				= НаименованиеПолноеОрганизации;
		ОбластьПодвал.Параметры.Контрагент				= НаименованиеПолноеКонтрагента;
		ОбластьПодвал.Параметры.ДолжностьПредставление	= ?(НЕ ЗначениеЗаполнено(ДолжностьПредставителяОрганизации),"________________", СокрЛП(ДолжностьПредставителяОрганизации));
		ОбластьПодвал.Параметры.Должность 				= ДолжностьПредставителяОрганизации;
		ОбластьПодвал.Параметры.ДолжностьПредставлениеК = ?(НЕ ЗначениеЗаполнено(ДолжностьПредставителяКонтрагента),"________________", СокрЛП(ДолжностьПредставителяКонтрагента));
		ОбластьПодвал.Параметры.ДолжностьК				= ДолжностьПредставителяКонтрагента;
		ОбластьПодвал.Параметры.ФИОПредставителя  		= "("+?(НЕ ЗначениеЗаполнено(ИмяПредставителяОрганизации),"_______________________", ИмяПредставителяОрганизации)+")";
		ОбластьПодвал.Параметры.Представитель			= ПредставительОрганизации.ПредставительОрганизации;
		ОбластьПодвал.Параметры.ФИОПредставителяК 		= "("+?(НЕ ЗначениеЗаполнено(ИмяПредставителяКонтрагента),"_______________________", ИмяПредставителяКонтрагента)+")";
		ОбластьПодвал.Параметры.ПредставительК			= ПредставительКонтрагента.ПредставительКонтрагента;
		
		// Зададим параметры макета.
		ТабличныйДокумент.ТолькоПросмотр = Истина;
		
		УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
		
		// Отметим конец области документа.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции //ПечатьАктСверкиПоДоговорам()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ СЕРВИСОВ ЗАПОЛНЕНИЯ ДОКУМЕНТА

// Процедура используется для указания доступного данному виду объектов перечня вариантов заполнения.
//
// Параметры:
//  КомандыЗаполнения - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов заполнения.
//
Процедура ДобавитьКомандыЗаполнения(КомандыЗаполнения) Экспорт
	
	ПараметрыКоманды = Новый Структура();
	МассивВидовДоговоров =  Новый ФиксированныйМассив(Справочники.ХозОперации.ПолучитьВидыДоговоров(Справочники.ХозОперации.АктСверкиВзаиморасчетов));
	Отбор = Новый Структура("Организация,ПодразделениеКомпании,ВидДоговора", "Организация", "ПодразделениеКомпании", МассивВидовДоговоров);
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды, "ДоговорВзаиморасчетов", "Справочник.ДоговорыВзаиморасчетов.ФормаСписка", Новый Структура("РежимВыбора,Отбор", Истина, Отбор));
	ПоследовательныеОперации.ДобавитьВыборСсылки(ПараметрыКоманды,  "Организация", "Справочник.Организации.ФормаСписка",,, Истина, НСтр("ru = 'Необходимо выбрать организацию.'"));
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ПоДаннымОрганизацииЗаполнитьПоВзаиморасчетам",, "ПоДаннымОрганизации", НСтр("ru = 'Заполнить по взаиморасчетам'"), ПараметрыКоманды);
	
	ЗаполнениеДокументовСервер.ДобавитьКоманду(КомандыЗаполнения, "ПоДаннымКонтрагентаЗаполнитьПоДаннымОрганизации",, "ПоДаннымКонтрагента", НСтр("ru = 'Заполнить по данным организации'"));
	
КонецПроцедуры // ДобавитьКомандыЗаполнения()

// Производит формирование структуры с доступностью и видимостью команд заполнения объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандЗаполнения(Объект) Экспорт
	
	// Команды заполнения могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	ПараметрыКоманд.Вставить("ПоДаннымОрганизацииЗаполнитьПоВзаиморасчетам.Видимость",       Истина);
	ПараметрыКоманд.Вставить("ПоДаннымОрганизацииЗаполнитьПоВзаиморасчетам.Доступность",     Истина);
	ПараметрыКоманд.Вставить("ПоДаннымКонтрагентаЗаполнитьПоДаннымОрганизации.Видимость",    Истина);
	ПараметрыКоманд.Вставить("ПоДаннымКонтрагентаЗаполнитьПоДаннымОрганизации.Доступность",  Истина);
	
	// Возвращаем сформированные параметры видимости и доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандЗаполнения()

// Заполняет табличную часть "ПоДаннымОрганизации" по взаиморасчету
//
Функция ПоДаннымОрганизацииЗаполнитьПоВзаиморасчетам(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	// Произведем корректировку значений реквизитов объекта в соответствии с параметрами заполнения.
	Если ЗначениеЗаполнено(ПараметрыЗаполнения.ДоговорВзаиморасчетов) И НЕ Объект.ДоговорВзаиморасчетов = ПараметрыЗаполнения.ДоговорВзаиморасчетов Тогда
		Если НЕ ЗначениеЗаполнено(Объект.Контрагент) Тогда
			Объект.Контрагент = ПараметрыЗаполнения.ДоговорВзаиморасчетов.Владелец;
			КонтрагентПриИзменении(Объект, ПараметрыДействия);
		КонецЕсли;
		Объект.ДоговорВзаиморасчетов = ПараметрыЗаполнения.ДоговорВзаиморасчетов;
		ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
	Если НЕ Объект.Организация = ПараметрыЗаполнения.Организация Тогда
		Объект.Организация = ПараметрыЗаполнения.Организация;
		ОрганизацияПриИзменении(Объект, ПараметрыДействия);
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		ВывестиСообщение(НСтр("ru = 'Не выбрана дата окончания периода сверки.'"));
	ИначеЕсли Объект.ДатаОкончания < Объект.ДатаНачала Тогда
		ВывестиСообщение(НСтр("ru = 'Неверно задан период сверки расчетов.'"));
	Иначе
		
		ИспользоватьДоговорТЧ = НЕ ЗначениеЗаполнено(Объект.ДоговорВзаиморасчетов);
		
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("ДатаНачала",    			Объект.ДатаНачала);
		Запрос.УстановитьПараметр("ДатаОкончания", 			КонецДня(Объект.ДатаОкончания));
		Запрос.УстановитьПараметр("Контрагент",    			Объект.Контрагент);
		Запрос.УстановитьПараметр("ДоговорВзаиморасчетов",  Объект.ДоговорВзаиморасчетов);
		Запрос.УстановитьПараметр("Организация",  			Объект.Организация);
		
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Взаиморасчеты.ЭтоОбороты КАК ЭтоОбороты,
		|	Взаиморасчеты.Период КАК Дата,
		|	Взаиморасчеты.Документ КАК Документ,
		|	"+?(ИспользоватьДоговорТЧ,"Взаиморасчеты.ДоговорВзаиморасчетов КАК ДоговорВзаиморасчетов,","")+"
		|	Взаиморасчеты.Сделка КАК Сделка,
		|	СУММА(Взаиморасчеты.УвеличениеДолга) КАК УвеличениеДолга,
		|	СУММА(Взаиморасчеты.УменьшениеДолга) КАК УменьшениеДолга,
		|	СУММА(Взаиморасчеты.ОстатокНаНачало) КАК ОстатокНаНачало
		|ИЗ
		|	(ВЫБРАТЬ
		|		ЛОЖЬ КАК ЭтоОбороты,
		|		ДАТАВРЕМЯ(1, 1, 1) КАК Период,
		|		ЗНАЧЕНИЕ(Документ.АвансовыйОтчет.ПустаяСсылка) КАК Документ,
		|		ЗНАЧЕНИЕ(Справочник.ДоговорыВзаиморасчетов.ПустаяСсылка) КАК ДоговорВзаиморасчетов,
		|		ЗНАЧЕНИЕ(ПланВидовХарактеристик.ТипыСделок.ПустаяСсылка) КАК Сделка,
		|		0 КАК УвеличениеДолга,
		|		0 КАК УменьшениеДолга,
		|		Остатки.СуммаОстаток КАК ОстатокНаНачало                 
		|	ИЗ
		|		РегистрНакопления.ВзаиморасчетыКомпании.Остатки(
		|			&ДатаНачала,
		|			ДоговорВзаиморасчетов.Организация=&Организация
		|			И Контрагент = &Контрагент"+?(ИспользоватьДоговорТЧ,""," И ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов")+") КАК Остатки
		|	
		|	ОБЪЕДИНИТЬ ВСЕ
		|	
		|	ВЫБРАТЬ
		|		ИСТИНА,
		|		Обороты.Период,
		|		Обороты.Регистратор,
		|		Обороты.ДоговорВзаиморасчетов,
		|		Обороты.Сделка,
		|		ВЫБОР
		|			КОГДА Обороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					И Обороты.Сумма > 0
		|				ТОГДА Обороты.Сумма
		|			КОГДА Обороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					И Обороты.Сумма < 0
		|				ТОГДА -Обороты.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		ВЫБОР
		|			КОГДА Обороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|					И Обороты.Сумма > 0
		|				ТОГДА Обороты.Сумма
		|			КОГДА Обороты.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|					И Обороты.Сумма < 0
		|				ТОГДА -Обороты.Сумма
		|			ИНАЧЕ 0
		|		КОНЕЦ,
		|		0
		|	ИЗ
		|		РегистрНакопления.ВзаиморасчетыКомпании КАК Обороты
		|	ГДЕ
		|		Обороты.Период МЕЖДУ &ДатаНачала И &ДатаОкончания
		|		И ДоговорВзаиморасчетов.Организация=&Организация
		|		И Обороты.Контрагент = &Контрагент"+?(ИспользоватьДоговорТЧ,""," И Обороты.ДоговорВзаиморасчетов = &ДоговорВзаиморасчетов")+") КАК Взаиморасчеты
		|
		|СГРУППИРОВАТЬ ПО
		|	Взаиморасчеты.ЭтоОбороты,
		|	Взаиморасчеты.Период,
		|	Взаиморасчеты.Документ,
		|	"+?(ИспользоватьДоговорТЧ,"Взаиморасчеты.ДоговорВзаиморасчетов,","")+"
		|	Взаиморасчеты.Сделка
		|
		|ИМЕЮЩИЕ 
		|	СУММА(Взаиморасчеты.УвеличениеДолга)<>0 ИЛИ СУММА(Взаиморасчеты.УменьшениеДолга)<>0 ИЛИ Взаиморасчеты.ЭтоОбороты = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЭтоОбороты,
		|	Дата,
		|	Документ,
		|	"+?(ИспользоватьДоговорТЧ,"ДоговорВзаиморасчетов,","")+"
		|	Сделка";
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Объект.ОстатокНаНачало = 0;
		ОстатокНаКонец  = 0;
		
		Пока Выборка.Следующий() Цикл
			Если Не Выборка.ЭтоОбороты Тогда
				Объект.ОстатокНаНачало = Выборка.ОстатокНаНачало;
				Продолжить;
			КонецЕсли;
			НоваяСтрока = Объект.ПоДаннымОрганизации.Добавить();
			НоваяСтрока.Дата					= Выборка.Дата;
			НоваяСтрока.ДоговорВзаиморасчетов	= ?(ИспользоватьДоговорТЧ,Выборка.ДоговорВзаиморасчетов,Неопределено);
			НоваяСтрока.Документ				= Выборка.Документ;
			Документы.АктСверкиВзаиморасчетов.ПоДаннымОрганизацииДокументПриИзменении(Объект, НоваяСтрока, ПараметрыДействия);
			НоваяСтрока.Сделка          		= Выборка.Сделка;
			НоваяСтрока.УвеличениеДолга			= Выборка.УвеличениеДолга;
			НоваяСтрока.УменьшениеДолга			= Выборка.УменьшениеДолга;
		КонецЦикла;
		
	КонецЕсли;
	
КонецФункции // ПоДаннымОрганизацииЗаполнитьВыданныеАвансы()

// Заполняет табличную часть "ПоДаннымКонтрагента" по неоплаченным сделкам
//
Функция ПоДаннымКонтрагентаЗаполнитьПоДаннымОрганизации(Объект, ПараметрыЗаполнения, ПараметрыДействия = Неопределено) Экспорт
	
	// Устанавливаем параметры выполнения операции
	ПараметрыДействия = ПолучитьПараметрыДействия(Объект, ПараметрыДействия);
	
	ТабЗнач = Объект.ПоДаннымОрганизации.Выгрузить();
	ТабЗнач.Колонки.УвеличениеДолга.Имя  = "УменьшениеДолгаК";
	ТабЗнач.Колонки.УменьшениеДолга.Имя  = "УвеличениеДолга";
	ТабЗнач.Колонки.УменьшениеДолгаК.Имя = "УменьшениеДолга";
	Объект.ПоДаннымКонтрагента.Загрузить(ТабЗнач);
	
КонецФункции // ПоДаннымКонтрагентаЗаполнитьПоДаннымОрганизации()

#КонецЕсли