#Область СлужебныеПроцедурыИФункции

// Определение структуры параметра Настройки процедуры ПриОпределенииНастроек отчетов и обработок,
//   включенных в состав подсистемы ПодключаемыеОтчетыИОбработки.
//
// Параметры:
//   ВидыПодключаемыхКоманд - ТаблицаЗначений - Поддерживаемые виды команд.
//       * Имя         - Строка            - Имя вида команд. Может соответствовать имени подсистемы, поставляющей
//                                            команды. Должно удовлетворять требованиям именования переменных.
//                                           Также должно быть уникальным (не совпадать с именами других видов).
//                                           Подсистемами БСП зарезервированы следующие имена:
//                                           "Печать", "Отчеты", "ЗаполнениеОбъектов".
//       * ИмяПодменю  - Строка            - Имя подменю "по умолчанию" для размещения команд этого вида.
//       * Заголовок   - Строка            - Наименование подменю.
//       * Картинка    - Картинка          - Картинка подменю.
//       * Отображение - ОтображениеКнопки - Режим отображения подменю.
//       * Порядок     - Число             - Порядок подменю в командной панели по отношению к другим подменю.
//                                           Используется при автоматическом создании подменю.
//
Процедура ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд) Экспорт
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗаполнениеОбъектов") Тогда
		МодульЗаполнениеОбъектов = ОбщегоНазначения.ОбщийМодуль("ЗаполнениеОбъектов");
		МодульЗаполнениеОбъектов.ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
		МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
		МодульВариантыОтчетов.ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки") Тогда
		МодульДополнительныеОтчетыИОбработки = ОбщегоНазначения.ОбщийМодуль("ДополнительныеОтчетыИОбработки");
		МодульДополнительныеОтчетыИОбработки.ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.НастройкаПорядкаЭлементов") Тогда
		МодульНастройкаПорядкаЭлементов = ОбщегоНазначения.ОбщийМодуль("НастройкаПорядкаЭлементов");
		МодульНастройкаПорядкаЭлементов.ПриОпределенииВидовПодключаемыхКоманд(ВидыПодключаемыхКоманд);
	КонецЕсли;
КонецПроцедуры

// Позволяет расширить состав параметра Настройки процедуры ПриОпределенииНастроек в модулях менеджеров отчетов и 
// обработок, включенных в состав подсистемы ПодключаемыеОтчетыИОбработки, с помощью чего отчеты и обработки могут 
// сообщить о себе, что они предоставляют определенные виды команд и взаимодействуют с подсистемами через их 
// программный интерфейс.
//
// При внедрении в конфигурацию подсистем "Печать", "Заполнение объектов" и "Варианты отчетов" в параметре Настройки
// процедуры ПриОпределенииНастроек модулей менеджеров отчетов и обработок, предопределен ряд стандартных свойств, 
// в которых возможно задать следующее:
//   * Размещение - Массив - перечислить объекты метаданных конфигурации (ОбъектМетаданных), к которым подключен данный
//                           отчет или обработка. 
//   * ДобавитьКомандыПечати - Булево - если указать Истина, то в модуле менеджера отчета (обработки) предусмотрена 
//                             процедура ДобавитьКомандыПечати, которую вызывает подсистема "Печать" при выводе команд
//                             печати в объектах, перечисленных в параметре Размещение. Это эквивалентно указанию 
//                             этого отчета (обработки) в процедуре 
//                             УправлениеПечатьюПереопределяемый.ПриОпределенииОбъектовСКомандамиПечати.
//   * ДобавитьКомандыЗаполнения - Булево - если указать Истина, то в модуле менеджера отчета (обработки) предусмотрена
//                             процедура ДобавитьКомандыЗаполнения, которую вызывает подсистема "Заполнение объектов" 
//                             при выводе команд заполнения в объектах, перечисленных в параметре Размещение.
//                             Это эквивалентно указанию этого отчета (обработки) в процедуре 
//                             ЗаполнениеОбъектовПереопределяемый.ПриОпределенииОбъектовСКомандамиЗаполнения.
//   * ДобавитьКомандыОтчетов - Булево - только для отчетов. Если указать Истина, то в модуле менеджера отчета 
//                             определена процедура ДобавитьКомандыОтчетов, которую вызывает подсистема 
//                             "Варианты отчетов" при формировании списка контекстных отчетов, открываемых прямо 
//                             из форм объектов, перечисленных в параметре Размещение. Это эквивалентно указанию 
//                             этого отчета в процедуре 
//                             ВариантыОтчетовПереопределяемый.ОпределитьОбъектыСКомандамиОтчетов.
//   * НастроитьВариантыОтчета - Булево - только для отчетов. Если указать Истина, то в модуле менеджера отчета 
//                             определена процедура НастроитьВариантыОтчета, которую вызывает подсистема 
//                             "Варианты отчетов" при получении списка вариантов данного отчета.
//                             Подробнее см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//   * ОпределитьНастройкиФормы - Булево - только для отчетов, подключенных к общей форме отчета ФормаОтчета. 
//                             Если указать Истина, то в модуле объекта отчета определена процедура 
//                             ОпределитьНастройкиФормы, которую вызывает подсистема "Варианты отчетов" для 
//                             переопределения стандартного вида и поведения формы отчета ФормаОтчета.
//                             Подробнее см. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов.
//
// Если в конфигурации отсутствует одна из подсистем "Печать", "Заполнение объектов" и "Варианты отчетов", то 
// соответствующие свойства в параметре Настройки также отсутствуют.
//
// Параметры:
//   НастройкиПрограммногоИнтерфейса - ТаблицаЗначений - для добавления нового свойства в параметр Настройки процедуры 
//                                                       ПриОпределенииНастроек модулей менеджеров отчетов и обработок, 
//                                                       включенных в состав подсистемы ПодключаемыеОтчетыИОбработки,
//                                                       добавить строку таблицы с колонками:
//       * Ключ              - Строка        - имя настройки, например, "ДобавитьМотиваторы".
//       * ОписаниеТипов     - ОписаниеТипов - тип настройки, например: Новый ОписаниеТипов("Булево").
//       * ВидыПодключаемыхОбъектов - Строка - имена видов объектов метаданных, для которых будет доступна эта
//				                               настройка, перечисленные через запятую. Например: "Отчет" или "Отчет, Обработка".
//
// Пример:
//  Для того чтобы в ПриОпределенииНастроек модуля обработки предусмотреть собственный признак ДобавитьМотиваторы:
//  Процедура ПриОпределенииНастроек(Настройки) Экспорт
//    Настройки.ДобавитьМотиваторы = Истина;  // вызывается процедура ДобавитьМотиваторы
//    Настройки.Размещение.Добавить(Метаданные.Документы.Анкеты);
//  КонецПроцедуры
//
//  следует реализовать следующий код:
//  Настройка = НастройкиПрограммногоИнтерфейса.Добавить();
//  Настройка.Ключ          = "ДобавитьМотиваторы";
//  Настройка.ОписаниеТипов = Новый ОписаниеТипов("Булево");
//  Настройка.ВидыПодключаемыхОбъектов = "Обработка";
//
Процедура ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса) Экспорт
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
		МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		МодульУправлениеПечатью.ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗаполнениеОбъектов") Тогда
		МодульЗаполнениеОбъектов = ОбщегоНазначения.ОбщийМодуль("ЗаполнениеОбъектов");
		МодульЗаполнениеОбъектов.ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
		МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
		МодульВариантыОтчетов.ПриОпределенииСоставаНастроекПодключаемыхОбъектов(НастройкиПрограммногоИнтерфейса);
	КонецЕсли;
КонецПроцедуры

// Заполнение списка команд, подключенных к форме.
//   Событие возникает в процессе вызова модуля повторного использования.
//
// Параметры:
//   НастройкиФормы - Структура - Сведения о форме, в которой выводятся команды. Для чтения.
//         * ИмяФормы - Строка - Полное имя формы, в которой выводятся подключаемые команды.
//   
//   Источники - ДеревоЗначений - Сведения об основных поставщиках команд этой формы. Для чтения.
//         * Метаданные - ОбъектМетаданных - Метаданные объекта.
//         * ПолноеИмя  - Строка           - Полное имя объекта. Например: "Документ.ИмяДокумента".
//         * Вид        - Строка           - Вид объекта в верхнем регистре. Например: "СПРАВОЧНИК".
//         * Менеджер   - Произвольный     - Модуль менеджера объекта.
//                      - Неопределено     - Если у объекта нет модуля менеджера или если его не удалось получить.
//         * Ссылка     - СправочникСсылка.ИдентификаторыОбъектовМетаданных - Ссылка объекта метаданных.
//         * ЭтоЖурналДокументов - Булево - Истина если объект является журналом документов.
//         * ТипСсылкиДанных     - Тип, ОписаниеТипов - Тип ссылки элемента.
//         На 2 уровне могут располагаться источники, регистрируемые автоматически при регистрации владельца.
//         Например, документы-регистраторы журналов.
//   
//   ПодключенныеОтчетыИОбработки - ТаблицаЗначений - Настройки отчетов и обработок,
//       подключенных к основным поставщикам команд. Для чтения.
//         * ПолноеИмя - Строка       - Полное имя объекта метаданных.
//         * Менеджер  - Произвольный - Модуль менеджера объекта метаданных.
//       Состав колонок определяется в процедуре ПриОпределенииНастроекПрограммногоИнтерфейсаПодключаемыхОбъектов.
//   
//   Команды - ТаблицаЗначений - Таблица команд для вывода в подменю. Для изменения.
//       * Вид - Строка - Вид команды.
//           Подробнее см. ПодключаемыеКомандыПереопределяемый.ПриОпределенииВидовПодключаемыхКоманд().
//       * Идентификатор - Строка - Идентификатор команды.
//       
//     Настройки внешнего вида:
//       * Представление - Строка   - Представление команды в форме.
//       * Важность      - Строка   - Суффикс подгруппы в меню, в которой следует вывести эту команду.
//                                    Допустимо использовать: "Важное", "Обычное" и "СмТакже".
//       * Порядок       - Число    - Порядок размещения команды в группе. Используется для настройки под конкретное
//			                          рабочее место. Допустимо задавать в диапазоне от 1 до 100. По умолчанию порядок 50.
//       * Картинка      - Картинка - Картинка команды. Необязательный.
//       * СочетаниеКлавиш - СочетаниеКлавиш - Сочетание клавиш для быстрого вызова команды. Необязательный.
//     
//     Настройки видимости и доступности:
//       * ТипПараметра - ОписаниеТипов - Типы объектов, для которых предназначена эта команда.
//       * ВидимостьВФормах    - Строка - Имена форм через запятую, в которых должна отображаться команда.
//                                        Используется когда состав команд отличается для различных форм.
//       * ФункциональныеОпции - Строка - Имена функциональных опций через запятую, определяющих видимость команды.
//       * УсловияВидимости    - Массив - Определяет видимость команды в зависимости от контекста.
//                                        Для регистрации условий следует использовать процедуру
//                                        ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды().
//                                        Условия объединяются по "И".
//       * ИзменяетВыбранныеОбъекты - Булево - Определяет доступность команды в ситуации,
//                                        когда у пользователя нет прав на изменение объекта.
//                                        Если Истина, то в описанной выше ситуации кнопка будет недоступна.
//                                        Необязательный. Значение по умолчанию: Ложь.
//     
//     Настройки процесса выполнения:
//       * МножественныйВыбор - Булево - Если Истина, то команда поддерживает множественный выбор.
//             В этом случае в параметре выполнения будет передан список ссылок.
//             Необязательный. Значение по умолчанию: Истина.
//       * РежимЗаписи - Строка - Действия, связанные с записью объекта, которые выполняются перед обработчиком команды.
//             ** "НеЗаписывать"          - Объект не записывается, а в параметрах обработчика вместо ссылок 
//                                          передается вся форма. В этом режиме рекомендуется работать напрямую
//                                          с формой, которая передается в структуре 2 параметра обработчика команды.
//             ** "ЗаписыватьТолькоНовые" - Записывать новые объекты.
//             ** "Записывать"            - Записывать новые и модифицированные объекты.
//             ** "Проводить"             - Проводить документы.
//             Перед записью и проведением у пользователя запрашивается подтверждение.
//             Необязательный. Значение по умолчанию: "Записывать".
//       * ТребуетсяРаботаСФайлами - Булево - Если Истина, то в веб-клиенте предлагается
//             установить расширение работы с файлами.
//             Необязательный. Значение по умолчанию: Ложь.
//     
//     Настройки обработчика:
//       * Менеджер - Строка - Объект, отвечающий за выполнение команды.
//       * ИмяФормы - Строка - Имя формы, которую требуется получить для выполнения команды.
//           Если Обработчик не указан, то у формы вызывается метод "Открыть".
//       * ИмяПараметраФормы - Строка - Имя параметра формы, в который следует передать ссылку или массив ссылок.
//       * ПараметрыФормы - Неопределено, Структура - Необязательный. Параметры формы, указанной в ИмяФормы.
//       * Обработчик - Строка - Описание процедуры, обрабатывающей основное действие команды.
//           Формат "<ИмяОбщегоМодуля>.<ИмяПроцедуры>" используется когда процедура размещена в общем модуле.
//           Формат "<ИмяПроцедуры>" используется в следующих случаях:
//             - Если ИмяФормы заполнено то в модуле указанной формы ожидается клиентская процедура.
//             - Если ИмяФормы не заполнено то в модуле менеджера этого объекта ожидается серверная процедура.
//       * ДополнительныеПараметры - Структура - Необязательный. Параметры обработчика, указанного в Обработчик.
//
Процедура ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды) Экспорт
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.Печать") Тогда
	//	МодульУправлениеПечатью = ОбщегоНазначения.ОбщийМодуль("УправлениеПечатью");
		//МодульУправлениеПечатью.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы,
		//	Источники,
		//	ПодключенныеОтчетыИОбработки,
		//	Команды);
	//КонецЕсли;
	//
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ЗаполнениеОбъектов") Тогда
	//	МодульЗаполнениеОбъектов = ОбщегоНазначения.ОбщийМодуль("ЗаполнениеОбъектов");
		//МодульЗаполнениеОбъектов.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы,
		//	Источники,
		//	ПодключенныеОтчетыИОбработки,
		//	Команды);
	//КонецЕсли;
	//
	//Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ВариантыОтчетов") Тогда
	//	МодульВариантыОтчетов = ОбщегоНазначения.ОбщийМодуль("ВариантыОтчетов");
		//МодульВариантыОтчетов.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы,
		//	Источники,
		//	ПодключенныеОтчетыИОбработки,
		//	Команды);
	//КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ДополнительныеОтчетыИОбработки") Тогда
		МодульДополнительныеОтчетыИОбработки = ОбщегоНазначения.ОбщийМодуль("ДополнительныеОтчетыИОбработки");
		МодульДополнительныеОтчетыИОбработки.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды);
	КонецЕсли;
	
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.НастройкаПорядкаЭлементов") Тогда
		МодульНастройкаПорядкаЭлементов = ОбщегоНазначения.ОбщийМодуль("НастройкаПорядкаЭлементов");
		МодульНастройкаПорядкаЭлементов.ПриОпределенииКомандПодключенныхКОбъекту(НастройкиФормы, Источники, ПодключенныеОтчетыИОбработки, Команды);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
