// Модуль основной формы документа "Бюджет ДДС"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Формирует структуру параметров открытия формы журнала бюджетирование
//
&НаСервереБезКонтекста
Функция ПолучитьПараметрыДляБазовогоБюджетаНаСервере(Знач Объект, ТекущаяСтрока)
	
	// заполним отбор
	ТекущиеДанные = Объект.СтатьиДДС.НайтиПоИдентификатору(ТекущаяСтрока);
	Отбор = Новый Структура();
	
	// хоз. операции
	СписокХО = Новый СписокЗначений;
	Если ТекущиеДанные.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Приход Тогда
		СписокХО.Добавить(Справочники.ХозОперации.БюджетПродажПоКатегориям);
		СписокХО.Добавить(Справочники.ХозОперации.БюджетПродажПоНоменклатуре);
	ИначеЕсли ТекущиеДанные.СтатьяДДС.ВидДвижения = Перечисления.ВидыДвижений.Расход Тогда
		СписокХО.Добавить(Справочники.ХозОперации.БюджетЗакупокПоКатегориям);
		СписокХО.Добавить(Справочники.ХозОперации.БюджетЗакупокПоНоменклатуре);
	КонецЕсли;
	Отбор.Вставить("ХозОперация", СписокХО);
	
	// подразделение
	Отбор.Вставить("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	
	// ограничим по периодичности
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СценарииПланирования.Ссылка
	|ИЗ
	|	Справочник.СценарииПланирования КАК СценарииПланирования
	|ГДЕ
	|	СценарииПланирования.ЭтоГруппа       = ЛОЖЬ
	|	И СценарииПланирования.Периодичность = &Периодичность";
	Запрос.УстановитьПараметр("Периодичность", Объект.СценарийПланирования.Периодичность);
	Результат = Новый СписокЗначений;
	Результат.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка"));
	Отбор.Вставить("СценарийПланирования", Результат);
	
	Возврат Новый Структура("РежимВыбора,Отбор", Истина, Отбор);
	
КонецФункции

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияИспользоватьРаздельныеГрафики(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	Если РезультатОповещения = КодВозвратаДиалога.Да Тогда
		
		Объект.ГрафикРаспределенияДС.Очистить();
		Элементы.ГрафикРаспределенияДС.ОтборСтрок = Неопределено;
		УправлениеДиалогомНаСервере();
		
	Иначе
		
		Объект.ИспользоватьРаздельныеГрафикиПогашения = НЕ Объект.ИспользоватьРаздельныеГрафикиПогашения;
		
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияИспользоватьРаздельныеГрафики()

// Устанавливает итоговые значения в подвал для графика распределения денежных средств.
//
&НаКлиенте
Процедура УстановитьИтогиДляГрафикРаспределенияДС()
	
	Если Объект.ИспользоватьРаздельныеГрафикиПогашения Тогда
		// получаем текущую строку
		ТекущаяСтрока = Элементы.СтатьиДДС.ТекущаяСтрока;
		
		// инициализируем
		СуммаПроцент = 0;
		СуммаУпр     = 0;
		
		Если ТекущаяСтрока <> Неопределено Тогда
			// Получим данные текущей строки табличной части
			ТекущиеДанные = Объект.СтатьиДДС.НайтиПоИдентификатору(ТекущаяСтрока);
			
			// Сделаем отбор строк по статье
			МассивГрафикРаспределенияДС = Объект.ГрафикРаспределенияДС.НайтиСтроки(Новый Структура("СтатьяДДС", ТекущиеДанные.СтатьяДДС));
			
			// Посчитаем суммы
			Для Каждого Строка Из МассивГрафикРаспределенияДС Цикл
				
				СуммаПроцент = СуммаПроцент + Строка.Процент;
				СуммаУпр = СуммаУпр + Строка.СуммаПогашенияУпр;
				
			КонецЦикла;
		КонецЕсли;
		
		// Установим значения подвала
		ГрафикРаспределенияДСПроцентТекстПодвала           = Формат(СуммаПроцент,"ЧДЦ=2");
		ГрафикРаспределенияДССуммаПогашенияУпрТекстПодвала = Формат(СуммаУпр,"ЧДЦ=2");
		
	Иначе
		
		// Установим значения подвала
		ГрафикРаспределенияДСПроцентТекстПодвала           = Объект.ГрафикРаспределенияДС.Итог("Процент");
		ГрафикРаспределенияДССуммаПогашенияУпрТекстПодвала = Объект.ГрафикРаспределенияДС.Итог("СуммаПогашенияУпр");
		
	КонецЕсли;
	
КонецПроцедуры // УстановитьИтогиДляГрафикРаспределенияДС()

// Процедура устанавливает значения в колонке "Период распределения".
//
&НаСервере
Процедура УстановитьПериодыРаспределения(Строка = Неопределено)
	
	Для Каждого График Из Объект.ГрафикРаспределенияДС Цикл
		ПараметрыПланирования = Новый Структура;
		ПараметрыПланирования.Вставить("Периодичность", Объект.СценарийПланирования.Периодичность);
		ПараметрыПланирования.Вставить("ДатаИзПериода", Объект.ДатаПланирования);
		ПараметрыПланирования.Вставить("Действие",      График.Период);
		График.ПериодРаспределения = ПланированиеСервер.ПолучитьДатыПланируемогоПериода(ПараметрыПланирования);
	КонецЦикла;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	// настроим выбор статьи ддс
	ДоступныеСтатьи = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	СтатьиДДС.Ссылка
	|ИЗ
	|	Справочник.СтатьиДДС КАК СтатьиДДС
	|ГДЕ
	|	СтатьиДДС.ЭтоГруппа = ЛОЖЬ
	|	И НЕ СтатьиДДС.Ссылка В (&СписокСсылок)";
	Запрос.УстановитьПараметр("СписокСсылок", Объект.СтатьиДДС.Выгрузить(,"СтатьяДДС"));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ДоступныеСтатьи.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
	Если Не Элементы.Найти("СтатьиДДССтатьяДДС")=Неопределено Тогда
		УправлениеДиалогомСервер.ОбновитьПараметрВыбора(Элементы.СтатьиДДССтатьяДДС.ПараметрыВыбора, "Отбор.Ссылка", ДоступныеСтатьи);
	КонецЕсли;
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Элементы.ГрафикРаспределенияДССуммаПогашенияУпр.Видимость = Объект.ИспользоватьРаздельныеГрафикиПогашения;
	
	Если НЕ ЗначениеЗаполнено(Объект.СценарийПланирования) ИЛИ НЕ ЗначениеЗаполнено(Объект.СценарийПланирования.Периодичность) Тогда
		ПериодПланирования = "<Неопределен>";
	Иначе
		ПараметрыПериода = Новый Структура;
		ПараметрыПериода.Вставить("ДатаИзПериода" , Объект.ДатаПланирования);
		ПараметрыПериода.Вставить("Периодичность" , Объект.СценарийПланирования.Периодичность);
		ПараметрыПериода.Вставить("Действие"      , 0);
		ПериодПланирования = ПланированиеСервер.ПолучитьДатыПланируемогоПериода(ПараметрыПериода);
	КонецЕсли;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Установим итоговые значения в подвал для графика распределения денежных средств
	Если Лев(ДополнительныеПараметры, 17) = "КомандаЗаполнения" Тогда
		
		УстановитьИтогиДляГрафикРаспределенияДС();
		
	КонецЕсли;
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);

	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

&НаСервере
Процедура ПериодВпередНазадНаСервере(Действие)
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("ДатаИзПериода" , Объект.ДатаПланирования);
	ПараметрыДействия.Вставить("Периодичность" , Объект.СценарийПланирования.Периодичность);
	ПараметрыДействия.Вставить("Действие"      , Действие);
	
	ПланированиеСервер.ПолучитьДатыПланируемогоПериода(ПараметрыДействия);
	
	Объект.ДатаПланирования = ПараметрыДействия.ДатаНачала;
	
	УправлениеДиалогомНаСервере();

КонецПроцедуры // ПериодВпередНазадНаСервере()

&НаКлиенте
Процедура ПериодВперед(Команда)
	
	ПериодВпередНазадНаСервере(+1);
	
КонецПроцедуры // ПериодВперед()

&НаКлиенте
Процедура ПериодНазад(Команда)
	
	ПериодВпередНазадНаСервере(-1);
	
КонецПроцедуры // ПериодНазад()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.БюджетДДС.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.БюджетДДС.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Использовать раздельные графики"".
//
// Параметры:
//  Элемент - ЭлементФормы - Элемент, в котором возникло данное событие.
//
&НаКлиенте
Процедура ИспользоватьРаздельныеГрафикиПогашенияПриИзменении(Элемент)
	
	Если НЕ Объект.ГрафикРаспределенияДС.Количество() = 0 Тогда
		
		// Формируем описание обработчика перехвата закрытия формы
		ОбработчикВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияИспользоватьРаздельныеГрафики", ЭтотОбъект);
		
		// Формируем текст вопроса
		ТекстВопроса = НСтр("ru = 'Внимание. Таблица графика(ов) погашения будет очищена. Продолжить?'");
		
		// Получаем подтверждение операции от пользователя
		ПоказатьВопрос(ОбработчикВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
		
	Иначе
		
		УправлениеДиалогомНаСервере();
		
	КонецЕсли;
	
КонецПроцедуры // ИспользоватьРаздельныеГрафикиПогашенияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сценарий планирования" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СценарийПланированияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения ИспользоватьРаздельныеГрафикиПогашенияПриИзменении объекта.
	Документы.БюджетДДС.СценарийПланированияПриИзменении(Объект, ПараметрыДействия);
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // СценарийПланированияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сценарий планирования"".
//
// Параметры:
//  Элемент - ЭлементФормы - Элемент, в котором возникло данное событие.
//
&НаКлиенте
Процедура СценарийПланированияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ПараметрыДействия = Новый Структура;
	СценарийПланированияПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // СценарийПланированияПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "СТАТЬИ ДДС"

// Обработчик события возникающего при изменении данных реквизита "Статья ДДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СтатьиДДССтатьяДДСПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.СтатьиДДС.НайтиПоИдентификатору(Элементы.СтатьиДДС.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.БюджетДДС.СтатьиДДССтатьяДДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	Если Объект.СтатьиДДС.Количество() > 0 Тогда
		Элементы.СтатьиДДСПодменюЗаполнения.ПодчиненныеЭлементы.СтатьиДДСГруппаКомандЗаполнения1.ПодчиненныеЭлементы.КомандаЗаполненияСтатьиДДСАвтозаполнение.Доступность = Истина;
	Иначе
		Элементы.СтатьиДДСПодменюЗаполнения.ПодчиненныеЭлементы.СтатьиДДСГруппаКомандЗаполнения1.ПодчиненныеЭлементы.КомандаЗаполненияСтатьиДДСАвтозаполнение.Доступность = Ложь;
	КонецЕсли;
	
КонецПроцедуры // СтатьиДДССтатьяДДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Статья ДДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СтатьиДДССтатьяДДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СтатьиДДССтатьяДДСПриИзмененииНаСервере();
	
КонецПроцедуры // СтатьиДДССтатьяДДСПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Базовая сумма" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СтатьиДДСБазоваяСуммаУпрПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.СтатьиДДС.НайтиПоИдентификатору(Элементы.СтатьиДДС.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.БюджетДДС.СтатьиДДСБазоваяСуммаУпрПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СтатьиДДСБазоваяСуммаУпрПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Базовая сумма".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СтатьиДДСБазоваяСуммаУпрПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СтатьиДДСБазоваяСуммаУпрПриИзмененииНаСервере();

КонецПроцедуры // СтатьиДДСБазоваяСуммаУпрПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Базовый бюджет" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СтатьиДДСБазовыйБюджетПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.СтатьиДДС.НайтиПоИдентификатору(Элементы.СтатьиДДС.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.БюджетДДС.СтатьиДДСБазовыйБюджетПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // СтатьиДДСБазовыйБюджетПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Базовый бюджет".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СтатьиДДСБазовыйБюджетПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СтатьиДДСБазовыйБюджетПриИзмененииНаСервере();

КонецПроцедуры // СтатьиДДСБазовыйБюджетПриИзменении()

// Обработчик события возникающего на клиенте при начале выбора данных в поле "Базовый бюджет".
//
// Параметры:
//  Элемент              - ПолеФормы       - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - Список значений - Список значений выбора.
//  СтандартнаяОбработка - Булево          - Признак стандартной обработки.
//
&НаКлиенте
Процедура СтатьиДДСБазовыйБюджетНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("ЖурналДокументов.Бюджетирование.ФормаСписка",ПолучитьПараметрыДляБазовогоБюджетаНаСервере(Объект, Элементы.СтатьиДДС.ТекущаяСтрока),Элемент,ЭтотОбъект,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "СТАТЬИ ДДС"

&НаКлиенте
Процедура СтатьиДДСПриАктивизацииСтроки(Элемент)
	
	Если Объект.ИспользоватьРаздельныеГрафикиПогашения И Элементы.СтатьиДДС.ТекущаяСтрока <> Неопределено Тогда
		
		ТекущиеДанные = Объект.СтатьиДДС.НайтиПоИдентификатору(Элементы.СтатьиДДС.ТекущаяСтрока);
		
		Элементы.ГрафикРаспределенияДС.ОтборСтрок = Новый ФиксированнаяСтруктура("СтатьяДДС",ТекущиеДанные.СтатьяДДС);
		
		// Установим итоговые значения в подвал для графика распределения денежных средств
		УстановитьИтогиДляГрафикРаспределенияДС();
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура СтатьиДДСПередУдалением(Элемент, Отказ)
	
	Если Объект.ИспользоватьРаздельныеГрафикиПогашения Тогда
		ТекущиеДанные = Объект.СтатьиДДС.НайтиПоИдентификатору(Элементы.СтатьиДДС.ТекущаяСтрока);
		СвязанныеСтроки = Объект.ГрафикРаспределенияДС.НайтиСтроки(Новый Структура("СтатьяДДС", ТекущиеДанные.СтатьяДДС));
		Для Каждого Строка Из СвязанныеСтроки Цикл
			Объект.ГрафикРаспределенияДС.Удалить(Строка);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры // СтатьиДДСПередУдалением()

&НаСервере
Процедура СтатьиДДСПриИзмененииНаСервере()
	
	// Вызываем общий обработчик события
	НастроитьПараметрыВыбораЭлементовФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатьиДДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	СтатьиДДСПриИзмененииНаСервере();
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ГРАФИК РАСПРЕДЕЛЕНИЯ ДС"

// Обработчик события возникающего при изменении данных реквизита "Процент" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ГрафикРаспределенияДСПроцентПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.ГрафикРаспределенияДС.НайтиПоИдентификатору(Элементы.ГрафикРаспределенияДС.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.БюджетДДС.ГрафикРаспределенияДСПроцентПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ГрафикРаспределенияДСПроцентПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Процент".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ГрафикРаспределенияДСПроцентПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ГрафикРаспределенияДСПроцентПриИзмененииНаСервере();

КонецПроцедуры // ГрафикРаспределенияДСПроцентПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма погашения" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ГрафикРаспределенияДССуммаПогашенияУпрПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.ГрафикРаспределенияДС.НайтиПоИдентификатору(Элементы.ГрафикРаспределенияДС.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.БюджетДДС.ГрафикРаспределенияДССуммаПогашенияУпрПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ГрафикРаспределенияДССуммаПогашенияУпрПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма погашения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ГрафикРаспределенияДССуммаПогашенияУпрПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ГрафикРаспределенияДССуммаПогашенияУпрПриИзмененииНаСервере();

КонецПроцедуры // ГрафикРаспределенияДССуммаПогашенияУпрПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ГРАФИК РАСПРЕДЕЛЕНИЯ ДС"


// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//
&НаСервереБезКонтекста
Функция ГрафикРаспределенияДСПередНачаломДобавленияНаСервере(ОбъектСценарийПланирования)
	
	Возврат ЗначениеЗаполнено(ОбъектСценарийПланирования.Периодичность);
	
КонецФункции // ГрафикРаспределенияДСПередНачаломДобавленияНаСервере()

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//
&НаКлиенте
Процедура ГрафикРаспределенияДСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
	Если НЕ ЗначениеЗаполнено(Объект.СценарийПланирования) ИЛИ НЕ ГрафикРаспределенияДСПередНачаломДобавленияНаСервере(Объект.СценарийПланирования) Тогда
		ВывестиСообщение(НСтр("ru = 'Не выбран сценарий планирования, либо у выбранного сценария не выбрана периодичность планирования'"), Объект);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Объект.ИспользоватьРаздельныеГрафикиПогашения Тогда
		Если Элементы.СтатьиДДС.ТекущаяСтрока = Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Выберите статью ДДС'"), Объект);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ГрафикРаспределенияДСПередНачаломДобавления()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ГрафикРаспределенияДСПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Объект.ГрафикРаспределенияДС.Сортировать("Период");
	
	// Установим итоговые значения в подвал для графика распределения денежных средств
	УстановитьИтогиДляГрафикРаспределенияДС();
	
КонецПроцедуры // ГрафикРаспределенияДСПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ГрафикРаспределенияДСПослеУдаления(Элемент)
	
	// Установим итоговые значения в подвал для графика распределения денежных средств
	УстановитьИтогиДляГрафикРаспределенияДС();
	
КонецПроцедуры // ГрафикРаспределенияДСПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервереБезКонтекста
Функция ГрафикРаспределенияДСПриНачалеРедактированияНаСервере(Знач Объект, Период, ПараметрыДействия = Неопределено)
	
	ПараметрыПланирования = Новый Структура;
	ПараметрыПланирования.Вставить("Периодичность", Объект.СценарийПланирования.Периодичность);
	ПараметрыПланирования.Вставить("ДатаИзПериода", Объект.ДатаПланирования);
	ПараметрыПланирования.Вставить("Действие",      Период);
	Возврат ПланированиеСервер.ПолучитьДатыПланируемогоПериода(ПараметрыПланирования);
	
КонецФункции

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ГрафикРаспределенияДСПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		СтрокаГрафика = Объект.ГрафикРаспределенияДС.НайтиПоИдентификатору(Элементы.ГрафикРаспределенияДС.ТекущаяСтрока);
		
		Если Объект.ИспользоватьРаздельныеГрафикиПогашения Тогда
			СтрокаСтатьиДДС = Объект.СтатьиДДС.НайтиПоИдентификатору(Элементы.СтатьиДДС.ТекущаяСтрока);
			ДанныеДляПоиска = Объект.ГрафикРаспределенияДС.НайтиСтроки(Новый Структура("СтатьяДДС", СтрокаСтатьиДДС.СтатьяДДС));
			
			СтрокаГрафика.СтатьяДДС = СтрокаСтатьиДДС.СтатьяДДС;
		Иначе
			ДанныеДляПоиска = Объект.ГрафикРаспределенияДС;
		КонецЕсли;
		
		МаксСмещение = -1;
		
		Если ДанныеДляПоиска.Количество() > 0 Тогда
			Для Каждого Строка Из ДанныеДляПоиска Цикл
				Если Строка = СтрокаГрафика Тогда
					Продолжить;
				КонецЕсли;
				
				МаксСмещение = Макс(МаксСмещение, Строка.Период);
			КонецЦикла;
		КонецЕсли;
		
		СтрокаГрафика.Период = МаксСмещение + 1;
		СтрокаГрафика.ПериодРаспределения = ГрафикРаспределенияДСПриНачалеРедактированияНаСервере(Объект, СтрокаГрафика.Период);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на сервере при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаСервере
Процедура ГрафикРаспределенияДСПериодПриИзмененииНаСервере()
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.ГрафикРаспределенияДС.НайтиПоИдентификатору(Элементы.ГрафикРаспределенияДС.ТекущаяСтрока);
	
	Если ТекущиеДанные <> Неопределено Тогда
		ТекущиеДанные.ПериодРаспределения = ГрафикРаспределенияДСПриНачалеРедактированияНаСервере(Объект, ТекущиеДанные.Период);
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ГрафикРаспределенияДСПериодПриИзменении(Элемент)
	
	ГрафикРаспределенияДСПериодПриИзмененииНаСервере();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	УстановитьПериодыРаспределения();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура    - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	УстановитьПериодыРаспределения();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	Документы.БюджетДДС.УстановитьПериодГрафиков(Объект);
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	УстановитьПериодыРаспределения();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ


