// Модуль формы списка справочника "Карточки"


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Обработчик события возникающего на клиенте при нажатии на кнопку "Создать серию" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ПолучитьПараметрыДляСозданииСерии(ПараметрыДействия)
	
	СтрСт = "";
	Если Элементы.Список.ТекущийРодитель = Неопределено Тогда
		ВывестиСообщение(НСтр("ru='Создании серии доступно только в группе ""Дисконтные карты"" и ""Чистые""'"));
		Возврат;
	КонецЕсли;
	Если Справочники.Карточки.ПолучитьВидКарточки(Элементы.Список.ТекущийРодитель) = Справочники.Карточки.ДисконтнаяКарта Тогда
		Стр= НСтр("ru = 'Ввод новой серии дисконтных карточек.'")+СтрСт;
	ИначеЕсли Справочники.Карточки.ПолучитьВидКарточки(Элементы.Список.ТекущийРодитель) = Справочники.Карточки.Чистая Тогда
		Стр= НСтр("ru = 'Ввод новой серии чистых карточек.'")+СтрСт;
	Иначе
		Возврат;
	КонецЕсли;
	
	// Получим данные текущей строки табличной части
	Если (Элементы.Список.ТекущаяСтрока <> Неопределено) И (НЕ Элементы.Список.ТекущаяСтрока.ЭтоГруппа) Тогда
		Выборка = РегистрыСведений.ШтрихКоды.Выбрать(Новый Структура ("Объект",Элементы.Список.ТекущаяСтрока.Ссылка));
		Если Выборка.Следующий() Тогда
			ШтрихКод = Выборка.ШтрихКод;
		Иначе
			ШтрихКод = "0000000000000000000000";
		КонецЕсли;
	Иначе
		ШтрихКод = "0000000000000000000000";
	КонецЕсли;
	
	ПараметрыДействия.Вставить("ШтрихКод",ШтрихКод);
	ПараметрыДействия.Вставить("Текст",Стр);
	
КонецПроцедуры //ПолучитьПараметрыДляСозданииСерии()

// Обработчик события возникающего на клиенте при нажатии на кнопку "Создать серию" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СоздатьСериюНаСервере(ПараметрыДействия)
	
	// Автоопределение количества цифр в окончании кода
	ШтрихКод   = СокрЛП(ПараметрыДействия.ШтрихКод);
	ТекКол = ПараметрыДействия.ТекКол;
	ЧислоЦифр  = 0;
	СтрокаЦифр = "0123456789";
	ДлинаШтрихКода = СтрДлина(ШтрихКод);
	Для сч = 1 По ДлинаШтрихКода Цикл
		ОконШтрихКода = Прав(ШтрихКод,сч);
		Симв = Лев(ОконШтрихКода,1);
		Если СтрНайти(СтрокаЦифр,Симв)=0 Тогда
			Прервать;
		Иначе ЧислоЦифр = ЧислоЦифр + 1;
		КонецЕсли;
	КонецЦикла;
	
	Если ЧислоЦифр = ДлинаШтрихКода Тогда //пропустим это и зададим числовой частью 4 символа 
	ИначеЕсли ЧислоЦифр =0 ИЛИ (ЧислоЦифр < СтрДлина(ТекКол)) ИЛИ (СтрДлина(СтрЗаменить(ТекКол + Прав(ШтрихКод,ЧислоЦифр),Символ(160),""))>ЧислоЦифр) Тогда
		ВывестиСообщение(НСтр("ru='Длины цифровой части в окончании кода не хватает для генерации %1"" карточек'"),,,,, ТекКол);
		Возврат;
	КонецЕсли;
	
	Если ЧислоЦифр = ДлинаШтрихКода Тогда
		// Считаем последние четыре символа цифрами, в них будем крутиться
		ЧислоЦифр = 4;
		Префикс = Лев(ШтрихКод,ДлинаШтрихКода-4);
	Иначе
		Префикс = Лев(ШтрихКод,ДлинаШтрихКода-ЧислоЦифр);
	КонецЕсли;
	
	НачНомер=Число(Прав(ШтрихКод,ЧислоЦифр))+1;
	СтрокаНулей = "";
	Для сч = 1 По ЧислоЦифр Цикл
		СтрокаНулей = СтрокаНулей + "0"
	КонецЦикла;
	
	// Сделаем первый проход, проверим пересечение номеров
	КолПересечений=0;
	ТекКарта = Неопределено;
	Для Сч = НачНомер По НачНомер+ТекКол-1 Цикл
		ШтрихКод=Префикс+Прав(СтрокаНулей+Формат(Сч,"ЧГ="),ЧислоЦифр);
		ТекКарта = ШтрихкодированиеВызовСервера.ПолучитьКарточкуПоКоду(ШтрихКод);
		Если ТекКарта <> Неопределено Тогда
			КолПересечений = КолПересечений+1;
			ВывестиСообщение(НСтр("ru='Код [%1]"" уже используется в карточке - %2 %3.'"),,,,, ШтрихКод, Справочники.Карточки.ПолучитьВидКарточки(ТекКарта.Родитель), ТекКарта.ПолноеНаименование);
		КонецЕсли;
	КонецЦикла;
	
	Если КолПересечений>0 Тогда
		ВывестиСообщение(НСтр("ru='При проверке номеров новой серии карточек были найдены пересечения с существующими карточками. НОВАЯ СЕРИЯ НЕ СОЗДАНА.'"));
		Возврат;
	КонецЕсли;
	
	// Формируем карточки
	НачатьТранзакцию();
	Попытка
		Для Сч = НачНомер По НачНомер + ТекКол - 1 Цикл
			ШтрихКод=Префикс+Прав(СтрокаНулей+Формат(Сч,"ЧГ="),ЧислоЦифр);
			НовыйЭлемент = Справочники.Карточки.СоздатьЭлемент();
			НовыйЭлемент.УстановитьНовыйКод();
			НовыйЭлемент.Родитель = Элементы.Список.ТекущийРодитель;
			НовыйЭлемент.Объект = Неопределено;
			НовыйЭлемент.ВидКарточки = Справочники.Карточки.ПолучитьВидКарточки(НовыйЭлемент.Родитель).ВидКарточки;
			НовыйЭлемент.ИспользоватьПовторно = Ложь;
			НовыйЭлемент.ДатаСоздания = ТекущаяДатаСеанса();
			НовыйЭлемент.Наименование = Справочники.Карточки.СформироватьНаименованиеПоУмолчанию(НовыйЭлемент, ШтрихКод);
			Справочники.Карточки.СформироватьПолноеНаименование(НовыйЭлемент);
			НовыйЭлемент.Записать();
			
			// зарегистрируем новый штрихкод
			НоваяЗапись=РегистрыСведений.ШтрихКоды.СоздатьМенеджерЗаписи();
			НоваяЗапись.ШтрихКод = ШтрихКод;
			НоваяЗапись.Объект = НовыйЭлемент.Ссылка;
			НоваяЗапись.Запрет = Ложь;
			НоваяЗапись.Записать();
		КонецЦикла;
		ВывестиСообщение(НСтр("ru='Создание новой серии завершено.'"));
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		ВывестиСообщение(НСтр("ru='Ошибка создания карточки - %1'"),,,,,ОписаниеОшибки());
	КонецПопытки;
	
КонецПроцедуры //СоздатьСериюНаСервере()

// Обработчик для проверки перетаскиваемого элемента
//
&НаСервере
Функция ПроверкаВозможностиПеретаскивания(Карточка, Строка)
	
	Объект = Карточка.ПолучитьОбъект();
	Если Объект.Предопределенный И Объект.ЭтоГруппа Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // ПолучитьВидКарточки()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура ОбработкаРезультатаОповещенияСоздатьСерию(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Проверяем статус закрытия окна параметров
	Если РезультатОповещения=Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеПараметры.Свойство("СоздатьСерию") Тогда
		
		Если РезультатОповещения = КодВозвратаДиалога.ОК Тогда
			
			// Формируем описание обработчика перехвата закрытия формы
			ОбработчикВводаСтроки = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияСоздатьСерию", ЭтотОбъект, Новый Структура ("ВводСтроки",ДополнительныеПараметры.СоздатьСерию));
			ПоказатьВводСтроки(ОбработчикВводаСтроки,ДополнительныеПараметры.СоздатьСерию.ШтрихКод, НСтр("ru = 'Введите код первой карточки'"),22);
			
		КонецЕсли;
		Возврат;
		
	ИначеЕсли ДополнительныеПараметры.Свойство("ВводСтроки") Тогда
		
		ДополнительныеПараметры.ВводСтроки.ШтрихКод = РезультатОповещения;
		ПараметрыОтветов = ДополнительныеПараметры.ВводСтроки;
		
		// Формируем описание обработчика перехвата закрытия формы
		ОбработчикВводаЧисла = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияСоздатьСерию", ЭтотОбъект, Новый Структура ("ВводЧисла",ПараметрыОтветов));
		ПоказатьВводЧисла(ОбработчикВводаЧисла,ПараметрыОтветов.ТекКол, НСтр("ru = 'Введите количество карточек'"),4,0);
		Возврат;
		
	ИначеЕсли ДополнительныеПараметры.Свойство("ВводЧисла") Тогда
		
		ДополнительныеПараметры.ВводЧисла.ТекКол = РезультатОповещения;
		ПараметрыОтветов = ДополнительныеПараметры.ВводЧисла;
		Если НЕ ПустаяСтрока(ПараметрыОтветов.ШтрихКод) ИЛИ НЕ (ПараметрыОтветов.ТекКол <= 0) ИЛИ НЕ (СтрДлина(СокрЛП(ПараметрыОтветов.ШтрихКод))<4) Тогда
		
			// Обработаем в контексте сервера
			СоздатьСериюНаСервере(ПараметрыОтветов);
			Элементы.Список.Обновить();
			
		КонецЕсли;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияОбъект()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Элементы.Список.ТекущиеДанные, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеСпискомСправочникаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
	Если ПараметрыДействия.Свойство("РезультатПоиска") Тогда
		ЭтотОбъект.Активизировать();
		СписокФормы = ЭтотОбъект.Элементы.Найти("Список");
		Если СписокФормы <> Неопределено И ТипЗнч(СписокФормы) = Тип("ТаблицаФормы") Тогда
			ЭтотОбъект.Элементы.Список.ТекущаяСтрока = ПараметрыДействия.РезультатПоиска;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события возникающего на клиенте при нажатии на кнопку "Создать серию".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура СоздатьСерию(Команда)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем в контексте сервера
	ПолучитьПараметрыДляСозданииСерии(ПараметрыДействия);
	
	Если НЕ ЗначениеЗаполнено(ПараметрыДействия) Тогда
		ВывестиСообщение(НСтр("ru='Создание серии карточек доступно для карт вида ""Дисконтная карта"" и ""Чистая"".'"));
		Возврат;
	КонецЕсли;
	
	ПараметрыДействия.Вставить("ТекКол", 100);
	
	// Формируем описание обработчика перехвата закрытия формы
	ОбработчикВопроса = Новый ОписаниеОповещения("ОбработкаРезультатаОповещенияСоздатьСерию", ЭтотОбъект, Новый Структура ("СоздатьСерию",ПараметрыДействия));
		
	// Получаем подтверждение операции от пользователя
	ПоказатьВопрос(ОбработчикВопроса, ПараметрыДействия.Текст, РежимДиалогаВопрос.ОКОтмена);
	
КонецПроцедуры //СоздатьСерию()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ДИНАМИЧЕСКОГО СПИСКА ФОРМЫ

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии Enter) в ячейке таблицы "Список".
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока      - Ссылка       - Значение выбранной строки.
//  Поле                 - ПолеФормы    - Активное поле.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокВыбор(ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры // СписокВыбор()

// Обработчик события возникающего на клиенте при активизации строки списка с задержкой в контексте сервера.
//
&НаСервере
Процедура СписокПриАктивизацииСтрокиНаСервере()
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список);
	
КонецПроцедуры // СписокПриАктивизацииСтрокиНаСервере()

// Обработчик события возникающего на клиенте при активизации строки списка выполняемый с задержкой.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_СписокПриАктивизацииСтроки()
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элементы.Список, ИСТИНА) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	СписокПриАктивизацииСтрокиНаСервере();
	
КонецПроцедуры // Подключаемый_СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииСтроки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриАктивизацииЯчейки(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриАктивизацииЯчейки(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриАктивизацииЯчейки()

// Обработчик события возникающего на клиенте перед добавления строки в таблицу "Список".
//
//  Элемент     - ПолеФормы    - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от добавления объекта.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Неопределено; СправочникСсылка.<Имя справочника>; ПланСчетовСсылка.<Имя плана счетов>
//                             - Ссылка на элемент, который будет использован при добавлении в качестве родителя. 
//  ЭтоГруппа   - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
	Если НЕ ЗначениеЗаполнено(Элемент.ТекущийРодитель) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Элемент должен принадлежать группе.'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры // СписокПередНачаломДобавления

// Обработчик события возникающего на клиенте перед началом изменения списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от действия.
//
&НаКлиенте
Процедура СписокПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // СписокПередНачаломИзменения()

// Обработчик события возникающего на клиенте после удаления строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПослеУдаления(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПослеУдаления(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПослеУдаления()

// Обработчик события возникающего на клиенте при активизации строки списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДеревоПриАктивизацииСтроки(Элемент)
	
	// Сменим родителя в основном списке
	Если Элементы.Список.Видимость Тогда
		Если Элементы.Дерево.ТекущаяСтрока=Элементы.Список.ТекущийРодитель Тогда
			// Пропустим если равны
		ИначеЕсли НЕ ЗначениеЗаполнено(Элементы.Список.ТекущийРодитель) И НЕ ЗначениеЗаполнено(Элементы.Дерево.ТекущаяСтрока) Тогда
			// Пропустим если оба пустые (могут быть Неопределено)
		Иначе
			Элементы.Список.ТекущийРодитель = Элементы.Дерево.ТекущаяСтрока;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ДеревоПриАктивизацииСтроки()

// Обработчик события возникающего на клиенте при изменении текущего родителя в режиме иерархического списка.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СписокПриСменеТекущегоРодителя(Элемент)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПриСменеТекущегоРодителя(ЭтотОбъект, Элемент);
	
КонецПроцедуры // СписокПриСменеТекущегоРодителя()

// Обработчик события возникающего при сохранении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Сохраняемые настройки. 
//
&НаСервере
Процедура СписокПриСохраненииПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриСохраненииПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриСохраненииПользовательскихНастроекНаСервере()

// Обработчик события возникающего при восстановлении пользовательских настроек в контексте сервера.
// 
// Параметры:
//  Элемент   - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Настройки - ПользовательскиеНастройкиКомпоновкиДанных - Восстанавливаемые настройки. 
//
&НаСервере
Процедура СписокПриЗагрузкеПользовательскихНастроекНаСервере(Элемент, Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриЗагрузкеПользовательскихНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // СписокПриЗагрузкеПользовательскихНастроекНаСервере()

// Обработчик события возникающего на сервере при обновлении пользовательских настроек списка.
//
// Параметры:
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриОбновленииСоставаПользовательскихНастроекНаСервере(ЭтотОбъект, СтандартнаяОбработка);
	
КонецПроцедуры // СписокПриОбновленииСоставаПользовательскихНастроекНаСервере()

// Обработчик события вызывается на сервере после получения данных динамическим списком.
//
// Параметры:
//  ИмяЭлемента - Строка - Содержит имя таблицы формы, из которой вызван обработчик события.
//  Настройки   - НастройкиКомпоновкиДанных - Содержит копию полных настроек динамического списка.
//  Строки      - СтрокиДинамическогоСписка - Данные и оформление всех строк, получаемых в списке.
//
&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки);
	
КонецПроцедуры // СписокПриПолученииДанныхНаСервере()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент                 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - Содержит перетаскиваемое значение, тип действия и возможные действия при перетаскивании.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                  - Содержит порядковый номер строки или ссылку на текущий объект.
//  Поле                    - Поле, с которым связана данная колонка таблицы, над которой находится объект.
//
&НаКлиенте
Процедура СписокПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // СписокПроверкаПеретаскивания()

// Обработчик события возникающего на клиенте при окончании перетаскивания в поле-приемнике данных.
//
// Параметры:
//  Элемент                 - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - Содержит перетаскиваемое значение, тип действия и возможные действия при перетаскивании.
//  СтандартнаяОбработка    - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                  - Содержит порядковый номер строки или ссылку на текущий объект.
//  Поле                    - Поле, с которым связана данная колонка таблицы, над которой находится объект.
//
&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	Если НЕ ЗначениеЗаполнено(Строка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нельзя переместить элемент в корень списка.'"),, НСтр("ru = 'Отмена перемещения'"));
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	// Проверим, если перемещаемый элемент является предопределенной группой, тогда отмена действия.
	Если ПараметрыПеретаскивания.Действие <> ДействиеПеретаскивания.Отмена И НЕ ПроверкаВозможностиПеретаскивания(ПараметрыПеретаскивания.Значение, Строка) Тогда
		ПоказатьПредупреждение(, НСтр("ru = 'Нельзя переместить предопределенную группу.'"),, НСтр("ru = 'Отмена перемещения'"));
		СтандартнаяОбработка = Ложь;
		Возврат;
	КонецЕсли;
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаКлиент.СписокПеретаскивание(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // СписокПеретаскивание()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
	// Получение параметров для подключаемого оборудования 
	ИспользоватьПодключаемоеОборудование = МенеджерОборудованияВызовСервераПереопределяемый.ИспользоватьПодключаемоеОборудование();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.СоздатьСерию.Видимость = (Элементы.Найти("ФормаСоздать") <> Неопределено);
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьПодключениеОборудованиеПриОткрытииФормы(Неопределено, ЭтотОбъект, "СканерШтрихкода, СчитывательМагнитныхКарт");
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
	// ПодключаемоеОборудование
	МенеджерОборудованияКлиент.НачатьОтключениеОборудованиеПриЗакрытииФормы(Неопределено, ЭтотОбъект);
	// Конец ПодключаемоеОборудование
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);

КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на клиенте при вызове метода ОповеститьОбАктивизации из формы-владельца.
//
// Параметры:
//  АктивныйОбъект - Произвольный     - Активный объект.
//  Источник       - УправляемаяФорма - Форма, источник сообщения.
//
&НаКлиенте
Процедура ОбработкаАктивизации(АктивныйОбъект, Источник)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаАктивизации(ЭтотОбъект, АктивныйОбъект, Источник) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаАктивизации()

// Обработчик события возникающего на клиенте при записи объекта в одной из подчиненных форм.
//
// Параметры:
//  НовыйОбъект          - Произвольный     - Добавленный в подчиненной форме объект.
//  Источник             - УправляемаяФорма - Форма, источник сообщения.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеСпискомСправочникаКлиент.ОбработкаЗаписиНового(ЭтотОбъект, НовыйОбъект, Источник, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаЗаписиНового()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеСпискомСправочникаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

