&НаКлиенте
Перем COMОбъектSQL;

&НаСервереБезКонтекста
Функция ПолучитьНастройкуПодключенияНаСервереБезКонтекста(НастройкаПодключенияTPI)
	СтруктураДляВозврата = Новый Структура();
	СтруктураДляВозврата.Вставить("Сервер", НастройкаПодключенияTPI.Сервер);
	СтруктураДляВозврата.Вставить("БазаДанных", НастройкаПодключенияTPI.БазаДанных);
	СтруктураДляВозврата.Вставить("Пользователь", НастройкаПодключенияTPI.Пользователь);
	СтруктураДляВозврата.Вставить("Пароль", НастройкаПодключенияTPI.Пароль);
	
	Возврат(СтруктураДляВозврата);
КонецФункции	

&НаКлиенте
Функция ПодключитьсяКTPI()
	Если НЕ Подключено Тогда
		Подключено = ИСТИНА;
		
		СтруктураПодключения = ПолучитьНастройкуПодключенияНаСервереБезКонтекста(Объект.НастройкаПодключенияTPI);
		
		COMОбъектSQL = Неопределено;
		Попытка
			COMОбъектSQL = Новый COMОбъект("ADODB.Connection");
			
			COMОбъектSQL.ConnectionTimeOut = 20; // по умолчанию
			COMОбъектSQL.CommandTimeOut = 0; 
			COMОбъектSQL.ConnectionString = "Provider=SQLOLEDB; SERVER=" +СтруктураПодключения.Сервер
				+ "; Database="+ СтруктураПодключения.БазаДанных
				+ "; UID=" + СокрЛП(СтруктураПодключения.Пользователь) 
				+ "; PWD=" + СокрЛП(СтруктураПодключения.Пароль) + ";";  
			COMОбъектSQL.Open();   
			Если COMОбъектSQL.State() = 0 Тогда 
				ТекстСообщения = НСтр("ru = 'Не удалось подключиться к SQL.'");
				Сообщить(ТекстСообщения);
				Подключено = ЛОЖЬ;
			КонецЕсли;
		Исключение
			COMОбъектSQL = Неопределено;
			ТекстСообщения = НСтр("ru = 'Не удалось подключиться к SQL.'");
			Сообщить(ТекстСообщения);
			Подключено = ЛОЖЬ;
		КонецПопытки;
	КонецЕсли;
	
	Возврат(Подключено);
КонецФункции

&НаКлиенте
Процедура ПроверитьПодключениеКТаблице(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.НастройкаПодключенияTPI) Тогда
		ТекстСообщения = НСтр("ru = 'Не указана настрока подключения TPI.'");
		Сообщить(ТекстСообщения);
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.НаименованиеТаблицыTPI) Тогда
		ТекстСообщения = НСтр("ru = 'Не указано наименование таблицы TPI.'");
		Сообщить(ТекстСообщения);
	Иначе
		СтруктураПодключения = ПолучитьНастройкуПодключенияНаСервереБезКонтекста(Объект.НастройкаПодключенияTPI);
		
		ПодключитьсяКTPI();
		
		Если Подключено Тогда
			Попытка
				ТекстЗапроса = "SELECT 1 FROM " + Объект.НаименованиеТаблицыTPI + " WHERE 1 = 0";
				COMЗапросSQL = Новый COMОбъект("ADODB.RecordSet"); 
				COMЗапросSQL.Open(ТекстЗапроса, COMОбъектSQL); 
				
				ТекстСообщения = НСтр("ru = 'Таблица " + Объект.НаименованиеТаблицыTPI + " найдена!'");
				Сообщить(ТекстСообщения);
				
			Исключение
				ТекстСообщения = НСтр("ru = 'Таблица " + Объект.НаименованиеТаблицыTPI + "не найдена!'");
				Сообщить(ТекстСообщения);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьНаименованияПолейTPI(Команда)
	Если НЕ ЗначениеЗаполнено(Объект.НастройкаПодключенияTPI) Тогда
		ТекстСообщения = НСтр("ru = 'Не указана настрока подключения TPI.'");
		Сообщить(ТекстСообщения);
	ИначеЕсли НЕ ЗначениеЗаполнено(Объект.НаименованиеТаблицыTPI) Тогда
		ТекстСообщения = НСтр("ru = 'Не указано наименование таблицы TPI.'");
		Сообщить(ТекстСообщения);
	Иначе
		СтруктураПодключения = ПолучитьНастройкуПодключенияНаСервереБезКонтекста(Объект.НастройкаПодключенияTPI);
		
		ПодключитьсяКTPI();
		
		Если Подключено Тогда
			Попытка
				ТекстЗапроса = "SELECT * FROM " + Объект.НаименованиеТаблицыTPI + " WHERE 1 = 0";
				COMЗапросSQL = Новый COMОбъект("ADODB.RecordSet"); 
				COMЗапросSQL.Open(ТекстЗапроса, COMОбъектSQL); 
				
			    сч = 0;
				Пока сч <> COMЗапросSQL.Fields.Count Цикл
					ТекущееНаименованиеПоля = COMЗапросSQL.Fields(сч).Name;
					
					ПараметрыОтбора = Новый Структура();
					ПараметрыОтбора.Вставить("НаименованиеПоляTPI", ТекущееНаименованиеПоля);
					НайденныеСтроки = Объект.Маппинг.НайтиСтроки(ПараметрыОтбора);
					Если НайденныеСтроки.Количество() = 0 Тогда
						НоваяСтрока = Объект.Маппинг.Добавить();
						НоваяСтрока.НаименованиеПоляTPI = ТекущееНаименованиеПоля;
						НоваяСтрока.ПорядокЗагрузки = 1;
						НоваяСтрока.Пометка = ИСТИНА;
					КонецЕсли;	
					
					сч = сч + 1;
				КонецЦикла;
				                                      
			Исключение
				ТекстСообщения = НСтр("ru = 'Таблица " + Объект.НаименованиеТаблицыTPI + "не найдена!'");
				Сообщить(ТекстСообщения);
			КонецПопытки;
		КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьСписокВыбораРеквизитовСправочника(Элемент)
    Элемент.СписокВыбора.Очистить();
	Для Каждого Реквизит Из Метаданные.Справочники[Объект.ТипМетаданныхСправочника].СтандартныеРеквизиты Цикл
        Элемент.СписокВыбора.Добавить(Реквизит.Имя);    
    КонецЦикла; 
	Для Каждого Реквизит Из Метаданные.Справочники[Объект.ТипМетаданныхСправочника].Реквизиты Цикл
        Элемент.СписокВыбора.Добавить(Реквизит.Имя);    
    КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура МаппингИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка,"Маппинг");       
КонецПроцедуры

&НаКлиенте
Процедура ИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка,ИмяТаблицы)
	Если ПроверитьСуществованиеСправочника(Объект.ТипМетаданныхСправочника) Тогда
		СписокВыбораЭлемента = СформироватьСписокВыбораРеквизитовСправочникаНаСервере(Объект.ТипМетаданныхСправочника);
       
		Элемент.СписокВыбора.Очистить();
		Для Каждого Знч Из СписокВыбораЭлемента Цикл
			Элемент.СписокВыбора.Добавить(Знч.Значение);
		КонецЦикла;   
       
		СтандартнаяОбработка = Ложь;
		
		ВыбранноеЗначение = Строка(ЭтаФорма.ВыбратьИзСписка(Элемент.СписокВыбора, Элемент));
		Если ВыбранноеЗначение <> "" Тогда
			Элементы[ИмяТаблицы].ТекущиеДанные.ИмяРеквизита = ВыбранноеЗначение;
		КонецЕсли;       
	Иначе
		ТекстСообщения = НСтр("ru = 'Не удалось идентифицировать справочник """ + Объект.ТипМетаданныхСправочника + """!'");
		Сообщить(ТекстСообщения);
                   
		Элемент.СписокВыбора.Очистить();
    КонецЕсли;       
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПроверитьСуществованиеСправочника(ТипМетаданныхСправочника)
      Возврат(Метаданные.НайтиПоПолномуИмени("Справочник." + ТипМетаданныхСправочника) <> Неопределено);
КонецФункции               

&НаСервереБезКонтекста
Функция СформироватьСписокВыбораРеквизитовСправочникаНаСервере(ТипМетаданныхСправочника)
	СписокВыбораЭлемента = Новый СписокЗначений();
                
	СписокВыбораЭлемента.Очистить();
	Для Каждого Реквизит Из Метаданные.Справочники[ТипМетаданныхСправочника].СтандартныеРеквизиты Цикл
		СписокВыбораЭлемента.Добавить(Реквизит.Имя);    
	КонецЦикла; 
	
	Для Каждого Реквизит Из Метаданные.Справочники[ТипМетаданныхСправочника].Реквизиты Цикл
		СписокВыбораЭлемента.Добавить(Реквизит.Имя);    
	КонецЦикла; 
                
	Возврат(СписокВыбораЭлемента);
КонецФункции


&НаКлиенте
Процедура МаппингИмяРеквизитаПриИзменении(Элемент)
	ИмяРеквизитаПриИзменении(Элемент);
КонецПроцедуры

&НаКлиенте
Процедура ИмяРеквизитаПриИзменении(Элемент)
	Элемент.СписокВыбора.Очистить();
КонецПроцедуры


&НаКлиенте
Процедура МаппингТабличнаяЧастьИмяРеквизитаПриИзменении(Элемент)
	ИмяРеквизитаПриИзменении(Элемент);
КонецПроцедуры


&НаКлиенте
Процедура МаппингТабличнаяЧастьИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ИмяРеквизитаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка,"МаппингТабличнаяЧасть");
КонецПроцедуры