
&НаСервере
Перем КэшМетаданных; // Таблица значений

&НаСервере
Процедура ЗаполнитьКэшМетаданных()
	
	КэшМетаданных = Новый ТаблицаЗначений;
	КэшМетаданных.Колонки.Добавить("Имя", Новый ОписаниеТипов("Строка",,Новый КвалификаторыСтроки(100)));
	КэшМетаданных.Колонки.Добавить("Тип");
	КэшМетаданных.Колонки.Добавить("ТипМетаданных", Новый ОписаниеТипов("ПеречислениеСсылка.НСИТипыЗначений"));

	НовСтрока = КэшМетаданных.Добавить();
	НовСтрока.Тип = Тип("Строка");
	НовСтрока.ТипМетаданных = Перечисления.НСИТипыЗначений.Простой;
	
	НовСтрока = КэшМетаданных.Добавить();
	НовСтрока.Тип = Тип("Число");
	НовСтрока.ТипМетаданных = Перечисления.НСИТипыЗначений.Простой;
	
	НовСтрока = КэшМетаданных.Добавить();
	НовСтрока.Тип = Тип("Дата");
	НовСтрока.ТипМетаданных = Перечисления.НСИТипыЗначений.Простой;
	
	НовСтрока = КэшМетаданных.Добавить();
	НовСтрока.Тип = Тип("Булево");
	НовСтрока.ТипМетаданных = Перечисления.НСИТипыЗначений.Простой;
	
	Для Каждого элемент Из Метаданные.Справочники Цикл
		НовСтрока = КэшМетаданных.Добавить();
		НовСтрока.Имя = элемент.Имя;
		НовСтрока.Тип = Тип("СправочникСсылка." + элемент.Имя);
		НовСтрока.ТипМетаданных = Перечисления.НСИТипыЗначений.Справочник;
	КонецЦикла;
	 
	Для Каждого элемент Из Метаданные.Перечисления Цикл
		НовСтрока = КэшМетаданных.Добавить();
		НовСтрока.Имя = элемент.Имя;
		НовСтрока.Тип = Тип("ПеречислениеСсылка." + элемент.Имя);
		НовСтрока.ТипМетаданных = Перечисления.НСИТипыЗначений.Перечисление;
	КонецЦикла;
	
	//     тдв	
	для Каждого элемент Из Метаданные.РегистрыСведений цикл
		НовСтрока = КэшМетаданных.Добавить();
		НовСтрока.Имя = элемент.Имя;
		НовСтрока.Тип = Тип("РегистрСведенийНаборЗаписей." + элемент.Имя);
		НовСтрока.ТипМетаданных = Перечисления.НСИТипыЗначений.РегистрыСведений;
	КонецЦикла;
	 
КонецПроцедуры

&НаСервере
Процедура ПолучитьТипМетаданных(НовСтрока, спр)
	
	стр = КэшМетаданных.НайтиСтроки(Новый Структура("Тип", спр.Тип.Типы()[0]));
	
	Если стр.Количество() = 1 Тогда
		Объект = стр[0];
		НовСтрока.ТипЗначенияРеквизита = Объект.ТипМетаданных;
		НовСтрока.ТипСсылочногоОбъекта = Справочники.НСИОбъектыДляКонтроля.НайтиПоНаименованию(Объект.Имя);
	Иначе
		НовСтрока.ТипЗначенияРеквизита = Перечисления.НСИТипыЗначений.ПустаяСсылка();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьИВыбрать()
	
	ТекСтрока = Элементы.ДеревоМетаданных.ТекущиеДанные;
	
	Если ТекСтрока = Неопределено Или ТекСтрока.Владелец = "" Или ТекСтрока.Новый = Ложь Тогда
		Возврат;
	Иначе
		Закрыть(Новый Структура("Наименование, ТипЗначенияРеквизита, ТипСсылочногоОбъекта, ТипОбъектаСведений, НаименованиеОбъектаСведений, СКП", 
			ТекСтрока.Наименование, 
			ТекСтрока.ТипЗначенияРеквизита,
			ТекСтрока.ТипСсылочногоОбъекта,
			ТекСтрока.ТипОбъектаСведений,
			?(ТекСтрока.ТипОбъектаСведений = ПредопределенноеЗначение("Перечисление.НСИТипыРеквизитовОбъектов.Простой"), "", ТекСтрока.Владелец),
			ТекСтрока.СоставКлючаПоиска
		));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере  
Функция ПолучитьСписокИсключений()
	
	// Выгрузить все добавленные правила для объектов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НСИРеквизитыОбъектов.Наименование
	               |ИЗ
	               |	Справочник.НСИРеквизитыОбъектов КАК НСИРеквизитыОбъектов
	               |ГДЕ
	               |	НСИРеквизитыОбъектов.ПометкаУдаления = ЛОЖЬ
	               |	И НСИРеквизитыОбъектов.Владелец.Наименование = &Владелец";
				   
	Запрос.УстановитьПараметр("Владелец", Владелец);
				   
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	
КонецФункции

&НаСервере  
Процедура ДобавитьВеткуРеквизитов(Дерево, ИмяМетаданных, СписокИсключений)
	
	Ветка = Дерево.Строки.Добавить();
	Ветка.Наименование = "Реквизиты";
	Ветка.Новый = Истина;
	
	Для Каждого спр Из Метаданные.Справочники[ИмяМетаданных].СтандартныеРеквизиты Цикл
		
		НовСтрока = Ветка.Строки.Добавить();
		НовСтрока.Наименование = спр.Имя;
		НовСтрока.Владелец = ИмяМетаданных;
		ПолучитьТипМетаданных(НовСтрока, спр);
		НовСтрока.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Простой;
		НовСтрока.Синоним = ?(ЗначениеЗаполнено(спр.Синоним), спр.Синоним, спр.Имя);
		НовСтрока.Новый = (СписокИсключений.Найти(спр.Имя) = Неопределено);
		
	КонецЦикла;
	
	Для Каждого спр Из Метаданные.Справочники[ИмяМетаданных].Реквизиты Цикл
		
		НовСтрока = Ветка.Строки.Добавить();
		НовСтрока.Наименование = спр.Имя;
		НовСтрока.Владелец = ИмяМетаданных;
		ПолучитьТипМетаданных(НовСтрока, спр);
		НовСтрока.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Простой;
		НовСтрока.Синоним = ?(ЗначениеЗаполнено(спр.Синоним), спр.Синоним, спр.Имя);
		НовСтрока.Новый = (СписокИсключений.Найти(спр.Имя) = Неопределено);
		
	КонецЦикла;

	
КонецПроцедуры

&НаСервере  
Процедура ДобавитьВеткуРегистров(Дерево, ИмяМетаданных, СписокИсключений)
		
	Ветка = Дерево.Строки.Добавить();
	Ветка.Наименование = "Регистры";
	Ветка.Новый = Истина;
	
	//КакойТипВладельца = ЛксПолучитьКорневойТипКонфигурации(Владелец);
	
	ТипВладельца = Тип("СправочникСсылка." + Владелец);
	
	ТЗСоставКлючаПоиска = Новый ТаблицаЗначений;
	ТЗСоставКлючаПоиска.Колонки.Добавить("ИмяПоля");
	ТЗСоставКлючаПоиска.Колонки.Добавить("ИмяПоляВКонтролере");
	ТЗСоставКлючаПоиска.Колонки.Добавить("ТипЗначенияРеквизита");
	ТЗСоставКлючаПоиска.Колонки.Добавить("ТипСсылочногоОбъекта");
	ТЗСоставКлючаПоиска.Колонки.Добавить("ОбъектДляКонтроля");
	
	Для Каждого рег Из Метаданные.РегистрыСведений Цикл
		
		Если рег.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.Независимый И рег.Имя <> "НСИСоответствиеОбъектов" Тогда
			
			РегистрПодходит = Ложь;
			Для Каждого изм Из рег.Измерения Цикл
				Если изм.Тип.СодержитТип(ТипВладельца) Тогда
					РегистрПодходит = Истина;
					Прервать;
				КонецЕсли;
			КонецЦикла;
			
			Если РегистрПодходит Тогда
				
				Регистр = Ветка.Строки.Добавить();
				Регистр.Наименование = рег.Имя;
				Регистр.Синоним = рег.Синоним;
				Регистр.Новый = Истина;
				
				ТЗСоставКлючаПоиска.Очистить();
				Для Каждого изм Из рег.Измерения Цикл
					НС = ТЗСоставКлючаПоиска.Добавить();
					НС.ИмяПоля = изм.Имя;
					НС.ИмяПоляВКонтролере = изм.Имя;
					ПолучитьТипМетаданных(НС, изм);
					НС.ОбъектДляКонтроля = изм.Тип.СодержитТип(ТипВладельца);
				КонецЦикла;
				
				СоставКлючаПоиска = ЗначениеВСтрокуВнутр(ТЗСоставКлючаПоиска);
				
				Для Каждого рес Из рег.Ресурсы Цикл
					НовСтрока = Регистр.Строки.Добавить();
					НовСтрока.Наименование = рес.Имя;
					НовСтрока.Владелец = рег.Имя;
					НовСтрока.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.Сведения;
					ПолучитьТипМетаданных(НовСтрока, рес);
					НовСтрока.Синоним = ?(ЗначениеЗаполнено(рес.Синоним), рес.Синоним, рес.Имя);
					НовСтрока.Новый = (СписокИсключений.Найти(рес.Имя) = Неопределено);
					НовСтрока.СоставКлючаПоиска = СоставКлючаПоиска;
				КонецЦикла; // Для Каждого рес Из рег.Ресурсы Цикл
				
			КонецЕсли; // Если РегистрПодходит Тогда
			
		КонецЕсли;
		
	КонецЦикла; //Для Каждого рег Из Метаданные.РегистрыСведений Цикл
	
КонецПроцедуры

&НаСервере  
Процедура ДобавитьВеткуТабЧастей(Дерево, ИмяМетаданных, СписокИсключений)
		
	Ветка = Дерево.Строки.Добавить();
	Ветка.Наименование = "Табличные части";
	Ветка.Новый = Истина;
	
	ТЗСоставКлючаПоиска = Новый ТаблицаЗначений;
	ТЗСоставКлючаПоиска.Колонки.Добавить("ИмяПоля");
	ТЗСоставКлючаПоиска.Колонки.Добавить("ИмяПоляВКонтролере");
	ТЗСоставКлючаПоиска.Колонки.Добавить("ТипЗначенияРеквизита");
	ТЗСоставКлючаПоиска.Колонки.Добавить("ТипСсылочногоОбъекта");
	ТЗСоставКлючаПоиска.Колонки.Добавить("ОбъектДляКонтроля");

	НС = ТЗСоставКлючаПоиска.Добавить();
	НС.ИмяПоля = "НомерСтроки";
	НС.ИмяПоляВКонтролере = "НомерСтроки";
	НС.ТипЗначенияРеквизита = Перечисления.НСИТипыЗначений.Простой;
	
	СоставКлючаПоиска = ЗначениеВСтрокуВнутр(ТЗСоставКлючаПоиска);	
	
	Для Каждого тч Из Метаданные.Справочники[ИмяМетаданных].ТабличныеЧасти Цикл
		
		ТабЧасть = Ветка.Строки.Добавить();
		ТабЧасть.Наименование = тч.Имя;
		ТабЧасть.Синоним = тч.Синоним;
		ТабЧасть.Новый = Истина;
		
		Для Каждого рек Из тч.Реквизиты Цикл
			НовСтрока = ТабЧасть.Строки.Добавить();
			НовСтрока.Наименование = рек.Имя;
			НовСтрока.Владелец = тч.Имя;
			НовСтрока.ТипОбъектаСведений = Перечисления.НСИТипыРеквизитовОбъектов.ТабличнаяЧасть;
			ПолучитьТипМетаданных(НовСтрока, рек);
			НовСтрока.Синоним = ?(ЗначениеЗаполнено(рек.Синоним), рек.Синоним, рек.Имя);
			НовСтрока.Новый = (СписокИсключений.Найти(рек.Имя) = Неопределено);
			НовСтрока.СоставКлючаПоиска = СоставКлючаПоиска;
		КонецЦикла;
		
	КонецЦикла;
	 	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВетки(Дерево, СписокИсключений)
	
	Если Не ЗначениеЗаполнено(Владелец) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьКэшМетаданных();
	
	ДобавитьВеткуРеквизитов(Дерево, Владелец, СписокИсключений);
	ДобавитьВеткуТабЧастей (Дерево, Владелец, СписокИсключений);
	ДобавитьВеткуРегистров (Дерево, Владелец, СписокИсключений);
	
КонецПроцедуры

&НаСервере  
Процедура ЗаполнитьДерево()
	
	СписокИсключений = ПолучитьСписокИсключений();
	
	Дерево = Новый ДеревоЗначений;
	
	Дерево.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Синоним", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("Новый", Новый ОписаниеТипов("Булево"));
	Дерево.Колонки.Добавить("Владелец", Новый ОписаниеТипов("Строка"));
	Дерево.Колонки.Добавить("ТипЗначенияРеквизита", Новый ОписаниеТипов("ПеречислениеСсылка.НСИТипыЗначений"));
	Дерево.Колонки.Добавить("ТипСсылочногоОбъекта", Новый ОписаниеТипов("СправочникСсылка.НСИОбъектыДляКонтроля"));
	Дерево.Колонки.Добавить("ТипОбъектаСведений", Новый ОписаниеТипов("ПеречислениеСсылка.НСИТипыРеквизитовОбъектов"));
	Дерево.Колонки.Добавить("СоставКлючаПоиска", Новый ОписаниеТипов("Строка"));
	
	ЗаполнитьВетки(Дерево, СписокИсключений);
	
	ЗначениеВДанныеФормы(Дерево, ДеревоМетаданных);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ЗаполнитьДерево();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Владелец = Параметры.Владелец;
КонецПроцедуры

&НаКлиенте
Процедура ДеревоМетаданныхВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ЗакрытьИВыбрать();
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	ЗакрытьИВыбрать();
КонецПроцедуры

