#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// Получим признак обработки события в упрощенном режиме, когда проверка корректности не производится.
	Если ОбработкаСобытийОбъектаСервер.РежимУпрощеннойЗагрузкиОбъекта(ЭтотОбъект) Тогда
		Отказ = ЛОЖЬ;
	КонецЕсли;
	
	// В некоторых случаях контроль корректности заполнения объекта может быть отключен.
	Если НЕ ПолучитьЗначениеПараметраСтруктуры(ЭтотОбъект.ДополнительныеСвойства, "ПроверкаЗаполнения", ИСТИНА) Тогда
		Отказ = ЛОЖЬ;
	КонецЕсли;
	
	// Прекращаем обработку если пользователь работает в "супер" режиме
	Если НЕ ПравоПользователя("ПроверкаЗаполненияСправочниковИДокументов", ЭтотОбъект) Тогда
		Отказ = ЛОЖЬ;
	КонецЕсли;
	
	// Выполняем общую проверку корректности заполнения реквизитов объекта
	ОбработкаСобытийОбъектаСервер.ПроверитьЗаполнениеРеквизитовОбъекта(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	
КонецПроцедуры

#КонецЕсли