#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	Функция СведенияОВнешнейОбработке() Экспорт
		
		ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.4.1.1");
		
		ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
		ПараметрыРегистрации.Версия = "1.2.8";
		ПараметрыРегистрации.БезопасныйРежим = Ложь;
		ПараметрыРегистрации.Назначение.Добавить();
		ПараметрыРегистрации.Наименование = "Обработка: Формирование заказов";
		
		НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
		НоваяКоманда.Представление = НСтр("ru = 'Формирование заказов'");
		НоваяКоманда.Идентификатор = "ФормированиеЗаказов";
		НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
		НоваяКоманда.ПоказыватьОповещение = Ложь;
		НоваяКоманда.Модификатор = "";
		
		НоваяКоманда = ПараметрыРегистрации.Команды.Добавить();
		НоваяКоманда.Представление = НСтр("ru = 'Автоматическое формирование заказов'");
		НоваяКоманда.Идентификатор = "СформироватьЗаказыПоГрафикам";
		НоваяКоманда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
		НоваяКоманда.ПоказыватьОповещение = Истина;
		НоваяКоманда.Модификатор = "";
		
		Возврат ПараметрыРегистрации;
		
	КонецФункции
	
	// Формирует печатную форму "ЗаказПоставщику"
	//
	Функция ПечатьЗаказПоставщику(МассивОбъектов, ОбъектыПечати) Экспорт
		ТабличныйДокумент = Новый ТабличныйДокумент;
		
		// Добавим установку параметров печати
		ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаказПоставщику_ЗаказПоставщику";
		УправлениеПечатьюПлатформа.УстановитьСтандартныеПараметрыПечати(ИмяПараметровПечати,ТабличныйДокумент);
		ТабличныйДокумент.ИмяПараметровПечати = ИмяПараметровПечати;
		
		ПервыйДокумент = Истина;
		Для Каждого Документ Из МассивОбъектов Цикл
			Если НЕ ПервыйДокумент Тогда // новый документ должен быть на отдельной странице
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			ПервыйДокумент = Ложь;
			
			ФорматВыводаСуммы = УправлениеПечатьюПлатформа.ПолучитьФорматВыводаСуммы(Документ);
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			//Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ЗаказПоставщику.ПФ_MXL_ЗаказПоставщику");
			Макет = ПолучитьМакет("ПФ_MXL_ЗаказПоставщику");
			
			ОбластьШапкаТаблицы    = УправлениеПечатьюПлатформа.ПривестиМакетПечатнойФормы(Макет, Документ);
			ОбластьЗаголовок       = Макет.ПолучитьОбласть("Заголовок");
			ОбластьСтрока          = Макет.ПолучитьОбласть("Строка");
			ОбластьИтогоПоСтранице = Макет.ПолучитьОбласть("ИтогоПоСтранице");
			ОбластьПодвал          = Макет.ПолучитьОбласть("Подвал");
			
			// дата документа
			ДатаДокумента = Документ.Дата;
			ДополнительныеПараметры = Новый Структура("ПодразделениеКомпании", Документ.ПодразделениеКомпании);
			
			// вывод заголовка документа
			ОбластьЗаголовок.Параметры.Заполнить(Документ);
			ТекстЗаголовка = УправлениеПечатьюПлатформа.ПолучитьПредставлениеДокумента(Документ, НСтр("ru = 'Заказ поставщику'"));
			ОбластьЗаголовок.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			Если ЗначениеЗаполнено(Документ.ПодразделениеКомпании) И ЗначениеЗаполнено(Документ.ПодразделениеКомпании.КПП) Тогда
				СтрокаПредставления = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
				ОбластьЗаголовок.Параметры.ПредставлениеПокупателя	= СтрЗаменить(СтрокаПредставления, ОбщегоНазначения.ПолучитьКППНаДату(Документ.Организация, ДатаДокумента), ОбщегоНазначения.ПолучитьКППНаДату(Документ.ПодразделениеКомпании, ДатаДокумента));
			Иначе	
				ОбластьЗаголовок.Параметры.ПредставлениеПокупателя	= УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Организация,,,,ДатаДокумента,ДополнительныеПараметры);
			КонецЕсли;
			ОбластьЗаголовок.Параметры.ПредставлениеПоставщика = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.Контрагент,,,,ДатаДокумента);
			ОбластьЗаголовок.Параметры.ПредставлениеПолучателя = УправлениеПечатьюПлатформа.ПолучитьПредставлениеСправочника(Документ.ПодразделениеКомпании,,,,ДатаДокумента);
			
			// выводим свойства
			УправлениеПечатьюПлатформа.ЗаполнитьСвойствамиОбъекта(ОбластьЗаголовок, Документ);
			ТабличныйДокумент.Вывести(ОбластьЗаголовок);
			ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
			
			// готовим шапку
			НомерСтраницы = 2; НомерСтраницыПред = 2;
			СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",Документ.ВалютаДокумента,0,0);
			ОбластьШапкаТаблицы.Параметры.ТекстЗаголовка = ТекстЗаголовка;
			ОбластьШапкаТаблицы.Параметры.НомерСтраницы  = "Страница: " + НомерСтраницы;
			
			// готовим области строки
			ВыборкаТабличнойЧасти = Документ.Товары;
			Для каждого СтрокаТЧ Из ВыборкаТабличнойЧасти Цикл
				ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры,УправлениеПечатьюПлатформа.ЗаполнитьПредставлениеДанныхТоварнойСтроки(СтрокаТЧ,Документ));
				
				// доп. области
				мсвДопОбластиПодвала = Неопределено;
				Если Документ.Товары.Индекс(СтрокаТЧ) = Документ.Товары.Количество()-1 Тогда
					мсвДопОбластиПодвала = Новый Массив;
					мсвДопОбластиПодвала.Добавить(ОбластьПодвал);
				КонецЕсли;
				
				НомерСтраницы = УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент, ОбластьСтрока, ОбластьШапкаТаблицы, ОбластьИтогоПоСтранице, НомерСтраницы, СтруктураИтоговПоСтранице, Документ, мсвДопОбластиПодвала);
				// инициализация итогов по странице
				Если НомерСтраницы <> НомерСтраницыПред Тогда
					СтруктураИтоговПоСтранице = Новый Структура("ВалютаДокумента,СуммаНДС,СуммаВсего",Документ.ВалютаДокумента,0,0);
					НомерСтраницыПред		  = НомерСтраницы;
					ОбластьШапкаТаблицы.Параметры.НомерСтраницы = "Страница: " + НомерСтраницы;
				КонецЕсли;
				
				// добавляем итоги
				УправлениеПечатьюПлатформа.ДобавитьИтогиПоСтранице(СтрокаТЧ,СтруктураИтоговПоСтранице);
			КонецЦикла;
			
			// выводим последний подвал, если страниц больше единицы
			Если НомерСтраницы > 2 Тогда
				УправлениеПечатьюПлатформа.ВывестиИтогиПоСтранице(ТабличныйДокумент,ОбластьИтогоПоСтранице,СтруктураИтоговПоСтранице,Документ);
			КонецЕсли;
			
			// итоги
			ОбластьПодвал.Параметры.ВалютаДокумента = Документ.ВалютаДокумента;
			СуммаВсего = ВыборкаТабличнойЧасти.Итог("СуммаВсего");
			ОбластьПодвал.Параметры.СуммаВсего = Формат(СуммаВсего,ФорматВыводаСуммы);
			НДСВсего = ВыборкаТабличнойЧасти.Итог("СуммаНДС");
			ОбластьПодвал.Параметры.НДСВсего = Формат(НДСВсего,ФорматВыводаСуммы);
			ОбластьПодвал.Параметры.СуммаПрописью = НСтр("ru = 'Всего наименований'") + Символы.НПП +ВыборкаТабличнойЧасти.Количество() + Символы.НПП + НСтр("ru = 'на сумму'") + Символы.НПП + РаботаСКурсамиВалют.СформироватьСуммуПрописью(СуммаВсего,Документ.ВалютаДокумента);
			
			// Выводим представления и расшифровки подписей
			ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"ИсполнительКонтрагент","ИсполнительКонтрагент"));
			ОбластьПодвал.Параметры.Заполнить(УправлениеПечатьюПлатформа.ДанныеОтветственногоЛица(Документ,"ЗаказчикОрганизация","ЗаказчикОрганизация"));
			
			УправлениеПечатьюПлатформа.ВывестиГоризонтальнуюОбласть(ТабличныйДокумент,ОбластьПодвал,,,НомерСтраницы,,Документ);
			
			// отметим конец области документа
			УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Документ);
		КонецЦикла;
		
		Возврат ТабличныйДокумент;
		
	КонецФункции //ПечатьЗаказПоставщику()
	
	Функция ПолучитьСтрокуПисьма(ЗаказПоставщику, ТабличныеДокументы)
		
		EmailКонтрагента = "";
		
		Контрагент = ЗаказПоставщику.Контрагент;
		
		ВидКИ = Справочники.ВидыКонтактнойИнформации.EmailКонтрагента;
		ТипКИ = Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты;
		
		Контрагенты = Новый Массив;
		Контрагенты.Добавить(Контрагент);
		
		КонтактнаяИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(Контрагенты, ТипКИ, ВидКИ);
		СтрокаКИ = КонтактнаяИнформация.Найти(ЗаказПоставщику.Контрагент, "Объект");
		Если НЕ СтрокаКИ = Неопределено Тогда
			EmailКонтрагента = СтрокаКИ.Представление;
		КонецЕсли;
		
		Тема = "Заказ № " + ЗаказПоставщику.Номер + " от " + ЗаказПоставщику.Дата;
		
		НоваяСтрока = Новый Структура;
		НоваяСтрока.Вставить("Тема",               Тема);
		НоваяСтрока.Вставить("Получатель",         Контрагент);
		НоваяСтрока.Вставить("EmailКонтрагента",   EmailКонтрагента);
		НоваяСтрока.Вставить("ТабличныеДокументы", ТабличныеДокументы);
		
		Возврат НоваяСтрока;
		
	КонецФункции
	
	Функция ПроверитьНаличиеДоговора(Док)
		
		ВидДоговора = Справочники.ХозОперации.ПолучитьВидДоговора(Док.ХозОперация);
		КонтрольКорректностиДоговораИСкладаДокумента = ПравоПользователя("КонтрольКорректностиДоговораИСкладаДокумента");
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
		|	ДоговорыВзаиморасчетов.Ссылка КАК Договор,
		|	ВЫБОР
		|		КОГДА ДоговорыВзаиморасчетов.Организация = &Организация
		|				И ДоговорыВзаиморасчетов.ПодразделениеКомпании = &Подразделение
		|			ТОГДА 0
		|		КОГДА ДоговорыВзаиморасчетов.Организация = &Организация
		|				И ДоговорыВзаиморасчетов.ПодразделениеКомпании В ИЕРАРХИИ (&Подразделение)
		|			ТОГДА 1
		|		КОГДА ДоговорыВзаиморасчетов.Организация = &Организация
		|			ТОГДА 2
		|		КОГДА ДоговорыВзаиморасчетов.ПодразделениеКомпании = &Подразделение
		|			ТОГДА 3
		|		КОГДА ДоговорыВзаиморасчетов.ПодразделениеКомпании В ИЕРАРХИИ (&Подразделение)
		|			ТОГДА 4
		|		ИНАЧЕ 5
		|	КОНЕЦ КАК ПолеДляСортировки,
		|	ДоговорыВзаиморасчетов.Основной КАК Основной,
		|	ДоговорыВзаиморасчетов.ДатаКонца КАК ДатаКонца,
		|	ДоговорыВзаиморасчетов.ДатаНачала КАК ДатаНачала
		|ИЗ
		|	Справочник.ДоговорыВзаиморасчетов КАК ДоговорыВзаиморасчетов
		|ГДЕ
		|	ДоговорыВзаиморасчетов.Владелец = &Владелец" + ?(ВидДоговора = Неопределено, "", "
		|	И ДоговорыВзаиморасчетов.ВидДоговора = &ВидДоговора") + "
		|	И (ДоговорыВзаиморасчетов.ДатаНачала <= &ДатаДоговора
		|		" + ?(ПравоПользователя("КонтрольКорректностиДатДоговоров") = Перечисления.ВидыКонтроля.Запрещать,
		"И ДоговорыВзаиморасчетов.ДатаКонца = ДАТАВРЕМЯ(1,1,1)
		|			ИЛИ &ДатаДоговора МЕЖДУ ДоговорыВзаиморасчетов.ДатаНачала И ДоговорыВзаиморасчетов.ДатаКонца)", ")") + "
		|	" + ?(ПравоПользователя("КонтролироватьСоответствиеОрганизацииПодразделения"),
		"И ДоговорыВзаиморасчетов.ПодразделениеКомпании.Организация = &Организация","") + "
		|	" + ?(КонтрольКорректностиДоговораИСкладаДокумента = Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизации,
		"И ДоговорыВзаиморасчетов.Организация = &Организация", ?(КонтрольКорректностиДоговораИСкладаДокумента = Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИПодразделению,
		"И ДоговорыВзаиморасчетов.Организация = &Организация
		|	И ДоговорыВзаиморасчетов.ПодразделениеКомпании = &Подразделение",  ?(КонтрольКорректностиДоговораИСкладаДокумента = Перечисления.СпособКонтроляКорректностиДоговораИСкладаДокумента.КонтрольПоОрганизацииИИерархииПодразделению,
		"И ДоговорыВзаиморасчетов.Организация = &Организация
		|И ДоговорыВзаиморасчетов.ПодразделениеКомпании В ИЕРАРХИИ(&Подразделение)", ""))) + " 
		|	И ДоговорыВзаиморасчетов.ПометкаУдаления = ЛОЖЬ"
		+ ?(Док.ВалютаДокумента = Неопределено, "", "
		| И ДоговорыВзаиморасчетов.ВалютаВзаиморасчетов = &ВалютаВзаиморасчетов") + "
		|УПОРЯДОЧИТЬ ПО
		|	ПолеДляСортировки ВОЗР,
		|	Основной УБЫВ,
		|	ДоговорыВзаиморасчетов.ДатаКонца,
		|	ДоговорыВзаиморасчетов.ДатаНачала УБЫВ");
		
		Запрос.УстановитьПараметр("ВидДоговора",          ВидДоговора);
		Запрос.УстановитьПараметр("Владелец",             Док.Контрагент);
		Запрос.УстановитьПараметр("Организация",          Док.Организация);
		Запрос.УстановитьПараметр("Подразделение",        Док.ПодразделениеКомпании);
		Запрос.УстановитьПараметр("ДатаДоговора",         Док.Дата);
		Запрос.УстановитьПараметр("ВалютаВзаиморасчетов", Док.ВалютаДокумента);
		Результат = Запрос.Выполнить();
		
		Если Результат.Пустой() Тогда
			Возврат Ложь;
		Иначе
			Возврат Истина;
		КонецЕсли;
		//Выборка = Результат.Выбрать(); 
		//Выборка.Следующий();
		//Возврат Выборка.Договор;	
		
	КонецФункции //ПроверитьНаличиеДоговора()
	
	Функция ПолучитьДатуПоследнегоЗаказа(Подразделение, СтрокаГрафика)
		
		Периодичность			= СтрокаГрафика.Периодичность;
		Контрагент				= СтрокаГрафика.Контрагент;
		СубПоставщик			= СтрокаГрафика.СубПоставщик;
		ОграничениеНоменклатуры = ?(ЗначениеЗаполнено(СтрокаГрафика.СегментНоменклатуры), СтрокаГрафика.СегментНоменклатуры, СтрокаГрафика.Номенклатура);
		
		ЗапросЗаказов = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Док.Ссылка КАК Заказ,
		|	НАЧАЛОПЕРИОДА(Док.Дата, ДЕНЬ) КАК Дата,
		|	Док.ПодразделениеКомпании КАК Подразделение,
		|	Док.Контрагент,
		|	Док.СубПоставщик,
		|	ВЫБОР КОГДА Док.ОграничениеНоменклатуры.Ссылка ЕСТЬ NULL ТОГДА ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка) ИНАЧЕ Док.ОграничениеНоменклатуры КОНЕЦ КАК ОграничениеНоменклатуры
		|ИЗ
		|	Документ.ЗаказПоставщику КАК Док
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.ДополнительныеРеквизиты КАК ДопРеквизитЦО
		|	ПО Док.Ссылка = ДопРеквизитЦО.Ссылка И ДопРеквизитЦО.Свойство=&СвойствоЦО
		|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.ДополнительныеРеквизиты КАК ДопРеквизитМагазин
		|	ПО Док.Ссылка = ДопРеквизитМагазин.Ссылка И ДопРеквизитМагазин.Свойство=&СвойствоМагазин
		|ГДЕ
		|	Док.Проведен
		|	И Док.Дата МЕЖДУ &ДатаНачала И &НаДату
		|	И Док.Контрагент=&Контрагент
		|	И Док.СубПоставщик=&СубПоставщик
		|	И Док.ПодразделениеКомпании=&Подразделение
		|	И Док.ОграничениеНоменклатуры=&ОграничениеНоменклатуры
		|	И ЕСТЬNULL(ДопРеквизитЦО.Значение,ЛОЖЬ)=ИСТИНА
		|	И ЕСТЬNULL(ДопРеквизитМагазин.Значение,ЛОЖЬ)=ИСТИНА
		|УПОРЯДОЧИТЬ ПО
		|	Док.Дата Убыв");
		
		ЗапросЗаказов.УстановитьПараметр("Подразделение", Подразделение);
		ЗапросЗаказов.УстановитьПараметр("Контрагент", Контрагент);
		ЗапросЗаказов.УстановитьПараметр("СубПоставщик", СубПоставщик);
		Если ЗначениеЗаполнено(ОграничениеНоменклатуры) Тогда
			ЗапросЗаказов.УстановитьПараметр("ОграничениеНоменклатуры", ОграничениеНоменклатуры);
		Иначе
			ЗапросЗаказов.Текст = СтрЗаменить(ЗапросЗаказов.Текст, "И Док.ОграничениеНоменклатуры=&ОграничениеНоменклатуры", "И Док.ОграничениеНоменклатуры.Ссылка ЕСТЬ NULL");
		КонецЕсли;
		ЗапросЗаказов.УстановитьПараметр("ДатаНачала", Дата - Периодичность * 86400);
		ЗапросЗаказов.УстановитьПараметр("НаДату", КонецДня(Дата));
		
		ДопРеквизитЦО		= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Заказ сформирован в ЦО");
		ДопРеквизитМагазин	= ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Заказ сформирован в Магазине");
		ЗапросЗаказов.УстановитьПараметр("СвойствоЦО", ДопРеквизитЦО);
		ЗапросЗаказов.УстановитьПараметр("СвойствоМагазин", ДопРеквизитМагазин);
		
		Если ВариантФормирования<>0 ИЛИ НЕ ЗначениеЗаполнено(ДопРеквизитМагазин) Тогда
			ЗапросЗаказов.Текст = СтрЗаменить(ЗапросЗаказов.Текст, "И ЕСТЬNULL(ДопРеквизитМагазин.Значение,ЛОЖЬ)=ИСТИНА", "");
		КонецЕсли;
		Если ВариантФормирования=0 ИЛИ НЕ ЗначениеЗаполнено(ДопРеквизитЦО) Тогда
			ЗапросЗаказов.Текст = СтрЗаменить(ЗапросЗаказов.Текст, "И ЕСТЬNULL(ДопРеквизитЦО.Значение,ЛОЖЬ)=ИСТИНА", "");
		КонецЕсли;
		
		Рез = ЗапросЗаказов.Выполнить();
		
		Если Рез.Пустой() И ЗначениеЗаполнено(ОграничениеНоменклатуры) Тогда
			
			ТекстЗапросаЗаказов = "
			|ВЫБРАТЬ ПЕРВЫЕ 1
			|	Док.Ссылка КАК Заказ,
			|	НАЧАЛОПЕРИОДА(Док.Ссылка.Дата, ДЕНЬ) КАК Дата,
			|	Док.Ссылка.ПодразделениеКомпании КАК Подразделение,
			|	Док.Ссылка.Контрагент,
			|	Док.Ссылка.СубПоставщик,
			|	&ОграничениеНоменклатуры КАК ОграничениеНоменклатуры
			|ИЗ
			|	Документ.ЗаказПоставщику.Товары КАК Док
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.ДополнительныеРеквизиты КАК ДопРеквизитЦО
			|	ПО Док.Ссылка = ДопРеквизитЦО.Ссылка И ДопРеквизитЦО.Свойство=&СвойствоЦО
			|	ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику.ДополнительныеРеквизиты КАК ДопРеквизитМагазин
			|	ПО Док.Ссылка = ДопРеквизитМагазин.Ссылка И ДопРеквизитМагазин.Свойство=&СвойствоМагазин
			|ГДЕ
			|	Док.Ссылка.Проведен
			|	И Док.Ссылка.Дата МЕЖДУ &ДатаНачала И &НаДату
			|	И Док.Ссылка.Контрагент=&Контрагент
			|	И Док.Ссылка.СубПоставщик=&СубПоставщик
			|	И Док.Ссылка.ПодразделениеКомпании=&Подразделение
			|	И ЕСТЬNULL(ДопРеквизитЦО.Значение,ЛОЖЬ)=ИСТИНА
			|	И ЕСТЬNULL(ДопРеквизитМагазин.Значение,ЛОЖЬ)=ИСТИНА";
			
			Если СтрокаГрафика.ОтборНоменклатуры.Количество()>0 Тогда
				ТекстЗапросаЗаказов = ТекстЗапросаЗаказов + "
				|	И Док.Номенклатура В ИЕРАРХИИ(&Номенклатура)";
				ЗапросЗаказов.УстановитьПараметр("Номенклатура", СтрокаГрафика.ОтборНоменклатуры);
			КонецЕсли;
			
			Если СтрокаГрафика.ИсключенияНоменклатуры.Количество()>0 Тогда
				ТекстЗапросаЗаказов = ТекстЗапросаЗаказов + "
				|	И Док.Номенклатура НЕ В ИЕРАРХИИ(&Исключения)";
				ЗапросЗаказов.УстановитьПараметр("Исключения", СтрокаГрафика.ИсключенияНоменклатуры);
			КонецЕсли;
			
			ТекстЗапросаЗаказов = ТекстЗапросаЗаказов + "
			|УПОРЯДОЧИТЬ ПО
			|	Док.Ссылка.Дата Убыв";
			
			Если ВариантФормирования<>0 ИЛИ НЕ ЗначениеЗаполнено(ДопРеквизитМагазин) Тогда
				ТекстЗапросаЗаказов = СтрЗаменить(ТекстЗапросаЗаказов, "И ЕСТЬNULL(ДопРеквизитМагазин.Значение,ЛОЖЬ)=ИСТИНА", "");
			КонецЕсли;
			Если ВариантФормирования=0 ИЛИ НЕ ЗначениеЗаполнено(ДопРеквизитЦО) Тогда
				ТекстЗапросаЗаказов = СтрЗаменить(ТекстЗапросаЗаказов, "И ЕСТЬNULL(ДопРеквизитЦО.Значение,ЛОЖЬ)=ИСТИНА", "");
			КонецЕсли;
			
			ЗапросЗаказов.Текст = ТекстЗапросаЗаказов;
			
			Рез = ЗапросЗаказов.Выполнить();
		КонецЕсли;
		
		Выборка = Рез.Выбрать();
		Если Выборка.Следующий() Тогда
			Если НачалоДня(Выборка.Дата)=НачалоДня(Дата) Тогда
				СтрокаГрафика.Заказ = Выборка.Заказ;
			КонецЕсли;
			
			Возврат Выборка.Дата;
		Иначе
			Возврат Дата("00010101");
		КонецЕсли;
		
	КонецФункции //ПолучитьДатуПоследнегоЗаказа()
	
	Функция ПолучитьБлижайшуюДатуОтгрузкиПоВидуЗаказа(ПодразделениеКомпании, Контрагент, ВидЗаказаСсылка, ДоговорВзаиморасчетов = Неопределено, ВидЗаявкиВНоменклатуре = Неопределено) Экспорт
		
		ДатаПоставки = КонецДня(ТекущаяДата()) + 1;
		
		Если НЕ ЗначениеЗаполнено(ПодразделениеКомпании) Тогда
			Возврат ДатаПоставки;
		КонецЕсли;	
		
		Если НЕ ЗначениеЗаполнено(Контрагент) Тогда
			Возврат ДатаПоставки;
		КонецЕсли;	
				
		Если Не ЗначениеЗаполнено(Дата) ТОгда
			Дата = ТекущаяДата();
		КонецЕсли;	
		
		Если НЕ ДоговорВзаиморасчетов = Неопределено и ЗначениеЗаполнено(ДоговорВзаиморасчетов) И ДоговорВзаиморасчетов.СрокПоставки > 0 Тогда
			СрокПоставкиДней = ДоговорВзаиморасчетов.СрокПоставки;
		Иначе
			СрокПоставкиДней = Контрагент.СрокПоставки;
		КонецЕсли;
		
		ДатаПоставки  = НачалоДня(Дата)+СрокПоставкиДней*60*60*24;
		
		СегментНоменклатуры = Справочники.СегментыНоменклатуры.ПустаяСсылка();
		Если ВидЗаказаСсылка <> Перечисления.рздВидыЗаказовЕРП.ЗаказВнешнийПоставщик Тогда 		
			ЗапросСегмента = Новый Запрос("ВЫБРАТЬ
			|	МАКСИМУМ(ит_СоответствиеВидаЗаявкиВидуНоменклатуры.СегментНоменклатуры) КАК СегментНоменклатуры
			|ПОМЕСТИТЬ втСегменты
			|ИЗ
			|	РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
			|ГДЕ
			|	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа = &ВидЗаказа
			|	И НЕ ит_СоответствиеВидаЗаявкиВидуНоменклатуры.СегментНоменклатуры = ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка)
			|	И 1=1
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	втСегменты.СегментНоменклатуры КАК СегментНоменклатуры
			|ИЗ
			|	втСегменты КАК втСегменты
			|ГДЕ
			|	НЕ втСегменты.СегментНоменклатуры ЕСТЬ NULL");
			
			ЗапросСегмента.УстановитьПараметр("ВидЗаказа", ВидЗаказаСсылка);
			Если НЕ ВидЗаявкиВНоменклатуре = Неопределено Тогда
				ЗапросСегмента.Текст = СтрЗаменить(ЗапросСегмента.Текст,"1=1", "ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура = &ВидЗаявкиВНоменклатуре"); 
				ЗапросСегмента.УстановитьПараметр("ВидЗаявкиВНоменклатуре", ВидЗаявкиВНоменклатуре);			
			КонецЕсли;
			
			ВыборкаЗапросСегмента = ЗапросСегмента.Выполнить().Выбрать();
			Если ВыборкаЗапросСегмента.Следующий() Тогда
				
				СегментНоменклатуры = ВыборкаЗапросСегмента.СегментНоменклатуры;
				
			КонецЕсли;
		КонецЕсли;
		
		мТовары = Новый Массив;
		мПодразделения = Новый Массив;
		мПодразделения.Добавить(ПодразделениеКомпании);
		
		ПараметрыГрафиков = Новый Структура("ПолучитьВесьГрафик,ГрафикиЦОИМагазинов,СтраховойЗапасВДнях,МассивПодразделений, МассивНоменклатуры", Ложь, Ложь, 1, мПодразделения, мТовары);
		
		Поставщик = Контрагент;
		
		СегментНоменклатуры = СегментНоменклатуры;
		ВариантФормирования = 1;
		тзГрафик = ПолучитьГрафики(ПараметрыГрафиков);
		Для Каждого стртзГрафик из тзГрафик Цикл
			
			ДопДень = 0;
			ВремяЗаказа = стртзГрафик.ДатаЗаказа - НачалоДня(стртзГрафик.ДатаЗаказа);
			ВремяПринятия = стртзГрафик.ВремяПринятияЗаказа - НачалоДня(стртзГрафик.ВремяПринятияЗаказа);
			Если ВремяЗаказа > ВремяПринятия Тогда
				ДопДень = 1;
			КонецЕсли;
			
			СрокПоставкиПоГрафику = НачалоДня(стртзГрафик.ДатаЗаказа) + стртзГрафик.СрокПоставки*3600*24 + ДопДень;
			Если СрокПоставкиПоГрафику > КонецДня(Дата) Тогда
				ДатаПоставки = СрокПоставкиПоГрафику;	
				Прервать;
			КонецЕсли;	 
		КонецЦикла;	
		
		Возврат ДатаПоставки;
	КонецФункции	
	
	Функция ПолучитьПоставщиковПоФильтруТоваров(МассивНоменклатуры)
		
		Если МассивНоменклатуры.Количество()=0 ИЛИ ЗначениеЗаполнено(Поставщик) ИЛИ ЗначениеЗаполнено(ПоставщикРЦ) Тогда
			Возврат Новый Массив;
		КонецЕсли;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Номенклатура КАК Номенклатура,
		|	ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	ГруппаПоставки КАК ГруппаПоставки,
		|	Контрагент КАК Контрагент,
		|	Приоритет КАК Приоритет,
		|	Период КАК ДатаНачалаДействия,
		|	СрокДействия КАК СрокДействия,
		|	Регистратор КАК Регистратор,
		|	Цена КАК СогласованнаяЦена
		|ПОМЕСТИТЬ ТаблицаСогласованныеЦены
		|ИЗ
		|	РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
		|ГДЕ
		|	(ПодразделениеКомпании = &ПодразделениеСоглЦен ИЛИ ГруппаПоставки = &ГруппаПоставки)
		|	И СрокДействия >= &НаДату
		|	И Период <= &НаДату
		|	И Номенклатура В ИЕРАРХИИ(&Номенклатура)
		|;
		|
		|///////////////////////////////////////
		|ВЫБРАТЬ
		|	СогласованныеЦены.Контрагент КАК Контрагент
		|ИЗ
		|	ТаблицаСогласованныеЦены КАК СогласованныеЦены
		|ГДЕ
		|	СогласованныеЦены.Регистратор В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ТаблицаСогласованныеЦены.Регистратор КАК Регистратор
		|			ИЗ
		|				ТаблицаСогласованныеЦены КАК ТаблицаСогласованныеЦены
		|			ГДЕ
		|				ТаблицаСогласованныеЦены.Номенклатура = СогласованныеЦены.Номенклатура
		|				И ТаблицаСогласованныеЦены.Контрагент = СогласованныеЦены.Контрагент
		|				И ТаблицаСогласованныеЦены.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
		|				И ТаблицаСогласованныеЦены.ГруппаПоставки = СогласованныеЦены.ГруппаПоставки
		|			УПОРЯДОЧИТЬ ПО
		|				ТаблицаСогласованныеЦены.Приоритет УБЫВ,
		|				ТаблицаСогласованныеЦены.ДатаНачалаДействия УБЫВ,
		|				ТаблицаСогласованныеЦены.Регистратор.Дата УБЫВ,
		|				ТаблицаСогласованныеЦены.СрокДействия)
		|	И СогласованныеЦены.СогласованнаяЦена<>0	
		|СГРУППИРОВАТЬ ПО
		|	СогласованныеЦены.Контрагент
		|");
		Запрос.УстановитьПараметр("НаДату", КонецДня(Дата));
		Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
		Запрос.УстановитьПараметр("ГруппаПоставки", ПодразделениеКомпании.ГруппаПоставки);
		Запрос.УстановитьПараметр("ПодразделениеСоглЦен", ПодразделениеКомпании);
		тзКонтрагентов = Запрос.Выполнить().Выгрузить();
		
		Возврат тзКонтрагентов.ВыгрузитьКолонку("Контрагент");
		
	КонецФункции //ПолучитьПоставщиковПоФильтруТоваров()
	
	Функция ПолучитьСогласованныеЦены(МассивНоменклатуры, БиржевыеТовары) Экспорт
		
		Если ВариантФормирования=0 Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		Если Специфика="Семья" Тогда
			СемьяОпт = Справочники.Контрагенты.НайтиПоКоду("000001843");
			Контрагент = ?(Поставщик=СемьяОпт И ЗначениеЗаполнено(ПоставщикРЦ), ПоставщикРЦ, Поставщик)
		Иначе
			Контрагент = Поставщик;
		КонецЕсли;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	Номенклатура КАК Номенклатура,
		|	ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	ГруппаПоставки КАК ГруппаПоставки,
		|	Контрагент КАК Контрагент,
		|	Приоритет КАК Приоритет,
		|	Период КАК ДатаНачалаДействия,
		|	СрокДействия КАК СрокДействия,
		|	Регистратор КАК Регистратор,
		|	Цена КАК Цена,
		|	МинимальныйЗаказ1 КАК МинимальныйЗаказ1,
		|	МинимальныйЗаказ2 КАК МинимальныйЗаказ2,
		|	КвантПоставки КАК КвантПоставки
		|ПОМЕСТИТЬ ТаблицаСогласованныеЦены
		|ИЗ
		|	РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСв
		|	ПО ДопСв.Объект=Номенклатура И ДопСв.Свойство=&свЗаказИзЦО
		|ГДЕ
		|	СрокДействия >= &НаДату
		|	И (ПодразделениеКомпании = &ПодразделениеСоглЦен ИЛИ ГруппаПоставки = &ГруппаПоставки)
		|	И Период <= &НаДату
		|	И Номенклатура В ИЕРАРХИИ(&ОтборПользователя)
		|	И ЕСТЬNULL(ДопСв.Значение, ЛОЖЬ) = &ЗаказИзЦО
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, ПодразделениеКомпании, ГруппаПоставки, Контрагент
		|;
		|
		|///////////////////////////////////////
		|ВЫБРАТЬ
		|	СогласованныеЦены.Контрагент КАК Контрагент,
		|	СогласованныеЦены.Номенклатура КАК Номенклатура,
		|	СогласованныеЦены.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	СогласованныеЦены.ГруппаПоставки КАК ГруппаПоставки,
		|	МИНИМУМ(СогласованныеЦены.МинимальныйЗаказ1) КАК МинимальныйЗаказ1,
		|	МИНИМУМ(СогласованныеЦены.МинимальныйЗаказ2) КАК МинимальныйЗаказ2,
		|	МАКСИМУМ(СогласованныеЦены.КвантПоставки) КАК КвантПоставки,
		|	МАКСИМУМ(СогласованныеЦены.Цена) КАК Цена
		|ПОМЕСТИТЬ СогласованныеЦены
		|ИЗ
		|	ТаблицаСогласованныеЦены КАК СогласованныеЦены
		|ГДЕ
		|	СогласованныеЦены.Регистратор В
		|			(ВЫБРАТЬ ПЕРВЫЕ 1
		|				ТаблицаСогласованныеЦены.Регистратор КАК Регистратор
		|			ИЗ
		|				ТаблицаСогласованныеЦены КАК ТаблицаСогласованныеЦены
		|			ГДЕ
		|				ТаблицаСогласованныеЦены.Номенклатура = СогласованныеЦены.Номенклатура
		//|				И ТаблицаСогласованныеЦены.Контрагент = СогласованныеЦены.Контрагент
		|				И (НЕ ТаблицаСогласованныеЦены.Номенклатура В(&БиржевыеТовары) ИЛИ ТаблицаСогласованныеЦены.Контрагент=&Контрагент)
		|				И ТаблицаСогласованныеЦены.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
		|				И ТаблицаСогласованныеЦены.ГруппаПоставки = СогласованныеЦены.ГруппаПоставки
		|			УПОРЯДОЧИТЬ ПО
		|				ТаблицаСогласованныеЦены.Приоритет УБЫВ,
		|				ТаблицаСогласованныеЦены.ДатаНачалаДействия УБЫВ,
		|				ТаблицаСогласованныеЦены.Регистратор.Дата УБЫВ,
		|				ТаблицаСогласованныеЦены.СрокДействия)
		|	И СогласованныеЦены.Цена<>0	
		|СГРУППИРОВАТЬ ПО
		|	СогласованныеЦены.Контрагент,
		|	СогласованныеЦены.Номенклатура,
		|	СогласованныеЦены.ПодразделениеКомпании,
		|	СогласованныеЦены.ГруппаПоставки
		|;
		|
		|///////////////////////////////////////
		|ВЫБРАТЬ
		|	СогласованныеЦены.Контрагент КАК Контрагент,
		|	СогласованныеЦены.Номенклатура КАК Номенклатура,
		|	СогласованныеЦены.ПодразделениеКомпании КАК ПодразделениеКомпании,
		|	СогласованныеЦены.ГруппаПоставки КАК ГруппаПоставки,
		|	СогласованныеЦены.МинимальныйЗаказ1 КАК МинимальныйЗаказ1,
		|	СогласованныеЦены.МинимальныйЗаказ2 КАК МинимальныйЗаказ2,
		|	СогласованныеЦены.КвантПоставки КАК КвантПоставки,
		|	СогласованныеЦены.Цена КАК Цена
		|ИЗ
		|	СогласованныеЦены КАК СогласованныеЦены
		|ГДЕ СогласованныеЦены.Контрагент=&Контрагент
		|");
		
		Запрос.УстановитьПараметр("НаДату", КонецДня(Дата));
		
		Если ВариантФормирования=3 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ГДЕ СогласованныеЦены.Контрагент=&Контрагент", "");
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "ИЛИ ТаблицаСогласованныеЦены.Контрагент=&Контрагент)", ") И ТаблицаСогласованныеЦены.Контрагент=СогласованныеЦены.Контрагент");
		Иначе
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
		КонецЕсли;
		
		//Если ВариантФормирования=2 ИЛИ ВариантФормирования=3 Тогда
		Если ВариантФормирования=2 Тогда
			Запрос.УстановитьПараметр("ГруппаПоставки", ПодразделениеКомпании.ГруппаПоставки);
			Запрос.УстановитьПараметр("ПодразделениеСоглЦен", ПодразделениеКомпании);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И (ПодразделениеКомпании = &ПодразделениеСоглЦен ИЛИ ГруппаПоставки = &ГруппаПоставки)", "");
		КонецЕсли;
		
		Если МассивНоменклатуры.Количество()>0 Тогда
			Запрос.УстановитьПараметр("ОтборПользователя", МассивНоменклатуры);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Номенклатура В ИЕРАРХИИ(&ОтборПользователя)", "");
		КонецЕсли;
		
		свЗаказИзЦО = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Заказывается из ЦО");
		Запрос.УстановитьПараметр("свЗаказИзЦО", свЗаказИзЦО);
		Если свЗаказИзЦО=Неопределено ИЛИ ФормированиеЗаказаВЦО Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЕСТЬNULL(ДопСв.Значение, ЛОЖЬ) = &ЗаказИзЦО", "");
		Иначе
			Запрос.УстановитьПараметр("ЗаказИзЦО", ФормированиеЗаказаВЦО);
		КонецЕсли;	
		
		Запрос.УстановитьПараметр("БиржевыеТовары", БиржевыеТовары);
		
		Возврат Запрос.Выполнить().Выгрузить();
		
	КонецФункции //ПолучитьСогласованныеЦены()
	
	Функция ПолучитьКвантыПоставки(Контрагент, Подразделение, Номенклатура)
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ПодразделениеКомпании,
		|	Номенклатура КАК Группа,
		|	Формат
		|ПОМЕСТИТЬ Подразделения
		|ИЗ
		|	РегистрСведений.ФорматыАссортиментаПодразделений.СрезПоследних(&КонецПериода, ПодразделениеКомпании=&Подразделение) КАК ФорматыАссортиментаПодразделенийСрезПоследних
		|СГРУППИРОВАТЬ ПО
		|	ПодразделениеКомпании,
		|	Номенклатура,
		|	Формат
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Ссылка КАК Номенклатура,
		|	Ссылка.Родитель КАК Группа
		|ПОМЕСТИТЬ Товары
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура
		|ГДЕ
		|	Ссылка В(&Номенклатура)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Товары.Номенклатура КАК Номенклатура,
		|	СтруктураИерархииНоменклатуры.Группа КАК Группа
		|ПОМЕСТИТЬ ТоварыСГруппами
		|ИЗ
		|	Товары КАК Товары
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
		|	ПО Товары.Группа = СтруктураИерархииНоменклатуры.Номенклатура
		|ОБЪЕДИНИТЬ ВСЕ
		|ВЫБРАТЬ
		|	Товары.Номенклатура,
		|	Товары.Группа
		|ИЗ
		|	Товары КАК Товары
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Подразделения.ПодразделениеКомпании КАК Подразделение,
		|	Подразделения.Формат КАК Формат,
		|	ТоварыСГруппами.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ПодразделенияИТовары
		|ИЗ
		|	Подразделения КАК Подразделения
		|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСГруппами КАК ТоварыСГруппами
		|	ПО (ТоварыСГруппами.Группа = Подразделения.Группа)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Формат,
		|	Номенклатура,
		|	Состояние
		|ПОМЕСТИТЬ АссортиментФорматов
		|ИЗ
		|	РегистрСведений.АссортиментФорматов.СрезПоследних(&КонецПериода, Номенклатура В(&Номенклатура)) КАК АссортиментФорматовСрезПоследних
		|ГДЕ
		|	Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
		|;
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодразделенияИТовары.Номенклатура КАК Номенклатура,
		|	ПодразделенияИТовары.Подразделение КАК Подразделение,
		|	ПодразделенияИТовары.Формат КАК Формат
		|ИЗ
		|	ПодразделенияИТовары КАК ПодразделенияИТовары
		|	ЛЕВОЕ СОЕДИНЕНИЕ АссортиментФорматов КАК АссортиментФорматов
		|	ПО ПодразделенияИТовары.Номенклатура = АссортиментФорматов.Номенклатура И ПодразделенияИТовары.Формат = АссортиментФорматов.Формат
		|ГДЕ
		|	НЕ ПодразделенияИТовары.Формат ЕСТЬ NULL
		|");
		Запрос.УстановитьПараметр("Подразделение", Подразделение);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("КонецПериода", Дата);
		
		МассивФорматов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Формат");
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВидУпаковки,
		|	Количество
		|ИЗ
		|	РегистрСведений.КвантыПоставки
		|ГДЕ
		|	Контрагент=&Контрагент
		|	И (ТорговаяСеть=&ТорговаяСеть ИЛИ ТорговаяСеть=ЗНАЧЕНИЕ(Справочник.ТорговыеСети.ПустаяСсылка))
		|	И (ГруппаПоставки=&ГруппаПоставки ИЛИ ГруппаПоставки=ЗНАЧЕНИЕ(Справочник.ГруппыПоставки.ПустаяСсылка))
		|	И (Формат В(&Формат) ИЛИ Формат=ЗНАЧЕНИЕ(Справочник.ФорматыКатегорий.ПустаяСсылка))
		|	И (Номенклатура=&Номенклатура ИЛИ Номенклатура=ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка))
		|УПОРЯДОЧИТЬ ПО
		|	ТорговаяСеть УБЫВ,
		|	ГруппаПоставки УБЫВ,
		|	Формат УБЫВ,
		|	Номенклатура УБЫВ
		|");
		Запрос.УстановитьПараметр("Контрагент", Контрагент);
		Запрос.УстановитьПараметр("ТорговаяСеть", Подразделение.ТорговаяСеть);
		Запрос.УстановитьПараметр("ГруппаПоставки", Подразделение.ГруппаПоставки);
		Запрос.УстановитьПараметр("Формат", МассивФорматов);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ВидУпаковки = Перечисления.ВидыУпаковокДляЗаказа.Штука;
		
		Если Выборка.Следующий() Тогда
			ВидУпаковки = Выборка.ВидУпаковки;
			
			Если ВидУпаковки=Перечисления.ВидыУпаковокДляЗаказа.Количество Тогда
				Возврат Выборка.Количество;
			КонецЕсли;
		КонецЕсли;
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	Коэффициент КАК КвантПоставки
		|ИЗ
		|	Справочник.ЕдиницыИзмерения
		|ГДЕ
		|	Владелец=&Номенклатура
		|	И ЕдиницаПоКлассификатору.ВидУпаковкиДляЗаказа=&ВидУпаковки
		|");
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("ВидУпаковки", ВидУпаковки);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			КвантПоставки = Выборка.КвантПоставки;
		Иначе
			Запрос.УстановитьПараметр("ВидУпаковки", Перечисления.ВидыУпаковокДляЗаказа.Блок);
			Выборка = Запрос.Выполнить().Выбрать();
			Если Выборка.Следующий() Тогда
				КвантПоставки = Выборка.КвантПоставки;
			Иначе
				Запрос.УстановитьПараметр("ВидУпаковки", Перечисления.ВидыУпаковокДляЗаказа.Коробка);
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда
					КвантПоставки = Выборка.КвантПоставки;
				Иначе
					Запрос.УстановитьПараметр("ВидУпаковки", Перечисления.ВидыУпаковокДляЗаказа.Паллет);
					Выборка = Запрос.Выполнить().Выбрать();
					Если Выборка.Следующий() Тогда
						КвантПоставки = Выборка.КвантПоставки;
					Иначе
						КвантПоставки = Неопределено;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		Возврат КвантПоставки;
		
	КонецФункции //ПолучитьКвантыПоставки()
	
	Функция ПолучитьАкцииНаДату(НаДату, Товар)
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Объект КАК Номенклатура,
		|	Действует КАК Действует
		|ИЗ
		|	РегистрСведений.СкидкиСтроки.СрезПоследних(&НаДату, (СрокДействия>=&НаДату ИЛИ СрокДействия=ДАТАВРЕМЯ(1,1,1)) И ПодразделениеКомпании=&Подразделение И Объект=&Номенклатура) КАК СкидкиСтроки
		|ГДЕ
		|	Действует");
		
		Запрос.УстановитьПараметр("НаДату", НаДату);
		Запрос.УстановитьПараметр("Номенклатура", Товар);
		Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Возврат Выборка.Действует;
		Иначе
			Возврат 0;
		КонецЕсли;
		
	КонецФункции //ПолучитьАкцииНаДату()
	
	Процедура РасчитатьАкции(текДатаПоставки)
		
		Запрос = Новый Запрос();
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СкидкиСтрокиСрезПоследних.Объект КАК Номенклатура,
		|	СкидкиСтрокиСрезПоследних.Период КАК НачДата,
		|	СкидкиСтрокиСрезПоследних.СрокДействия КАК КонДата
		|ИЗ
		|	РегистрСведений.СкидкиСтроки.СрезПоследних(, (СрокДействия >= &КонВремя ИЛИ СрокДействия = ДАТАВРЕМЯ(1,1,1))  И Объект В (&Номенклатура) И ПодразделениеКомпании = &ПодразделениеКомпании) КАК СкидкиСтрокиСрезПоследних
		|ГДЕ
		|	СкидкиСтрокиСрезПоследних.Действует = ИСТИНА   Упорядочить ПО НачДата
		|";
		
		Запрос.УстановитьПараметр("ПодразделениеКомпании", СкладКомпании.ПодразделениеКомпании);
		Запрос.УстановитьПараметр("КонВремя", КонецДня(Дата));
		Запрос.УстановитьПараметр("Номенклатура", Товары.Выгрузить(,"Номенклатура").ВыгрузитьКолонку("Номенклатура"));
		
		ТаблицаАкций = Запрос.Выполнить().Выгрузить();
		ТаблицаАкций.Индексы.Добавить("Номенклатура");
		
		Для Каждого Стр Из Товары Цикл
			Номенклатура = Стр.Номенклатура;
			Акц = ТаблицаАкций.НайтиСтроки(Новый Структура( "Номенклатура", Номенклатура));
			ПериодАкции = "";
			Если НЕ Акц.Количество() = 0 Тогда
				Для Каждого Рез Из Акц Цикл
					
					Если Рез.КонДата<текДатаПоставки Тогда
						Знак = "<";
					ИначеЕсли Рез.НачДата>текДатаПоставки Тогда
						Знак = ">";
					Иначе
						Знак = "=";
					КонецЕсли;	
					
					ПериодАкции = ?(ПериодАкции="","",Символы.ПС) + Знак +" " + Формат(Рез.НачДата,"ДФ=дд.ММ")+" - " + Формат(Рез.КонДата,"ДФ=дд.ММ")
				КонецЦикла;	
			КонецЕсли;
			Стр.ПериодАкции = ПериодАкции;
		КонецЦикла;
		
	КонецПроцедуры //РасчитатьАкции()
	
	Процедура ВыполнитьКоманду(ИдентификаторКоманды, ДанныеЗаполнения) Экспорт
		
		Если ИдентификаторКоманды="ФормированиеЗаказовПоставщику" Тогда
			
			Если ДанныеЗаполнения.СоздатьДокумент Тогда
				ЗаказПоставщику = Документы.ЗаказПоставщику.СоздатьДокумент();
				ЗаказПоставщику.Заполнить(Неопределено);
			Иначе
				ЗаказПоставщику = ДанныеЗаполнения.ОбъектДокумента;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(ЗаказПоставщику, ДанныеЗаполнения.Объект,, "Товары");
			
			ЗаказПоставщику.Дата = НачалоДня(ЗаказПоставщику.Дата) + (ТекущаяДата()-НачалоДня(ТекущаяДата()));
			
			Если ВариантФормирования=1 Тогда
				ЗаказПоставщику.ПодразделениеКомпании = ДанныеЗаполнения.Подразделение;
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("Организация") Тогда
				ЗаказПоставщику.Организация = ДанныеЗаполнения.Организация;
				ЗаказПоставщику.ПодразделениеКомпании = ДанныеЗаполнения.Подразделение;
			ИначеЕсли ЗначениеЗаполнено(ЗаказПоставщику.ПодразделениеКомпании.Организация) Тогда
				ЗаказПоставщику.Организация = ЗаказПоставщику.ПодразделениеКомпании.Организация;
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("Контрагент") Тогда
				ЗаказПоставщику.Контрагент = ДанныеЗаполнения.Контрагент;
				
				//проверим наличие договора
				ЕстьДоговор = ПроверитьНаличиеДоговора(ЗаказПоставщику);
				Если НЕ ЕстьДоговор Тогда
					Сообщить("Нет договора для контрагента: " + ЗаказПоставщику.Контрагент);
				КонецЕсли;
				
				Документы.ЗаказПоставщику.КонтрагентПриИзменении(ЗаказПоставщику);
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("СубПоставщик") Тогда
				ЗаказПоставщику.СубПоставщик = ДанныеЗаполнения.СубПоставщик;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ДатаПоставки") Тогда
				ЗаказПоставщику.СрокПоставки = ДанныеЗаполнения.ДатаПоставки;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ВремяПринятия") Тогда
				
				ВремяПринятияЗаказа = ДанныеЗаполнения.ВремяПринятия;
				
				Если ЗначениеЗаполнено(ВремяПринятияЗаказа) И ВремяПринятияЗаказа<>Дата("00010101235959") Тогда
					ДопРеквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Время принятия заказа");
					Если ЗначениеЗаполнено(ДопРеквизит) Тогда
						НоваяСтрокаДР = ЗаказПоставщику.ДополнительныеРеквизиты.Добавить();
						НоваяСтрокаДР.Свойство = ДопРеквизит;
						НоваяСтрокаДР.Значение = ВремяПринятияЗаказа;
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			Если ДанныеЗаполнения.Свойство("ОграничениеНоменклатуры") И ЗначениеЗаполнено(ДанныеЗаполнения.ОграничениеНоменклатуры) Тогда
				ЗаказПоставщику.ОграничениеНоменклатуры = ДанныеЗаполнения.ОграничениеНоменклатуры;
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("ВидЗаказа") И ЗначениеЗаполнено(ДанныеЗаполнения.ВидЗаказа) Тогда //Специфика="мясницкий"
				ЗаказПоставщику.ит_ВидЗаявки = ДанныеЗаполнения.ВидЗаказа;
			КонецЕсли;
			
			Если ФормированиеЗаказаВЦО Тогда
				ДопРеквизитЦО = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Заказ сформирован в ЦО");
			Иначе
				ДопРеквизитЦО = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Заказ сформирован в Магазине");
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ДопРеквизитЦО) Тогда
				НоваяСтрокаДР = ЗаказПоставщику.ДополнительныеРеквизиты.Добавить();
				НоваяСтрокаДР.Свойство = ДопРеквизитЦО;
				НоваяСтрокаДР.Значение = Истина;
			КонецЕсли;
			
			ЗаказПоставщику.Товары.Очистить();
			ЗаказПоставщику.РаспределениеЗаказа.Очистить();
			
			Если Специфика="мясницкий" Тогда
				
				ЗаказПоставщику.ПланЗаказа.Очистить();
				Для Каждого Строка Из ДанныеЗаполнения.ВыбранныеТовары Цикл
					НоваяСтрока = ЗаказПоставщику.ПланЗаказа.Добавить();
					
					НоваяСтрока.Номенклатура = Строка.Ключ;
					Документы.ЗаказПоставщику.ПланЗаказаНоменклатураПриИзменении(ЗаказПоставщику, НоваяСтрока);
					
					НоваяСтрока.Количество   = Строка.Значение;
					//Документы.ЗаказПоставщику.ПланЗаказаКоличествоПриИзменении(ЗаказПоставщику, НоваяСтрока);
				КонецЦикла;
				
			Иначе
				
				Для Каждого Строка Из ДанныеЗаполнения.ВыбранныеТовары Цикл
					НоваяСтрока = ЗаказПоставщику.Товары.Добавить();
					
					НоваяСтрока.Номенклатура = Строка.Ключ;
					Документы.ЗаказПоставщику.ТоварыНоменклатураПриИзменении(ЗаказПоставщику, НоваяСтрока);
					
					НоваяСтрока.Количество   = Строка.Значение;
					Документы.ЗаказПоставщику.ТоварыКоличествоПриИзменении(ЗаказПоставщику, НоваяСтрока);
				КонецЦикла;
				
			КонецЕсли;
			
			Документы.ЗаказПоставщику.ПерерасчетРаспределения(ЗаказПоставщику);
			Если ДанныеЗаполнения.СоздатьДокумент Тогда
				
				//Будем выполнять отдельным кодом
				Если ДанныеЗаполнения.Проводить Тогда
					Попытка
						ЗаказПоставщику.Комментарий = "Создан автоматически (" + ТекущаяДата() + ") #Проведён";
						
						Если Специфика="мясницкий" Тогда
							ЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
							
							СостоянияЗаказовНаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПоставщикам.СоздатьНаборЗаписей();
							СостоянияЗаказовНаборЗаписей.Отбор.Заказ.Установить(ЗаказПоставщику.Ссылка);
							
							НоваяЗапись = СостоянияЗаказовНаборЗаписей.Добавить();
							НоваяЗапись.Заказ     = ЗаказПоставщику.Ссылка;
							НоваяЗапись.Состояние = Перечисления.СостоянияВыполненияЗаказовПоставщикам.Согласование;
							
							СостоянияЗаказовНаборЗаписей.Записать(Истина);
						КонецЕсли;
						
						ЗаказПоставщику.Записать(РежимЗаписиДокумента.Проведение, РежимПроведенияДокумента.Неоперативный);
						ДанныеЗаполнения.Вставить("ОбъектДокумента", ЗаказПоставщику.Ссылка);
						ВывестиСообщение("Проведен документ " + ЗаказПоставщику.Ссылка,ЗаказПоставщику.Ссылка);
						
						МассивДокументов = Новый Массив;
						МассивДокументов.Добавить(ЗаказПоставщику.Ссылка);
						
						ОбъектыПечати = Новый СписокЗначений;
						ТабличныйДокумент = ПечатьЗаказПоставщику(МассивДокументов, ОбъектыПечати);
						
						ТабличныеДокументы = Новый СписокЗначений;
						ТабличныеДокументы.Добавить(ТабличныйДокумент, "Заказ поставщику");
						НоваяСтрока = ПолучитьСтрокуПисьма(ЗаказПоставщику, ТабличныеДокументы);
						
					Исключение
						
						ВывестиСообщение("Не удалось провести документ заказа поставщику");
						Ош = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
						ВывестиСообщение(Ош);
						ДанныеЗаполнения.Вставить("Ошибка", Ош);
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при проведении документа ""Заказ поставщику""'", 
						ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
						УровеньЖурналаРегистрации.Ошибка,,,Ош);
						
						Если Специфика<>"мясницкий" Тогда
							Попытка						
								ЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
							Исключение КонецПопытки;
						КонецЕсли;
					КонецПопытки;
				Иначе
					Попытка
						ЗаказПоставщику.Комментарий = "Создан автоматически (" + ТекущаяДата() + ") #Записан";
						ЗаказПоставщику.Записать(РежимЗаписиДокумента.Запись);
						
						Если Специфика="мясницкий" Тогда
							СостоянияЗаказовНаборЗаписей = РегистрыСведений.СостоянияВыполненияЗаказовПоставщикам.СоздатьНаборЗаписей();
							СостоянияЗаказовНаборЗаписей.Отбор.Заказ.Установить(ЗаказПоставщику.Ссылка);
							
							НоваяЗапись = СостоянияЗаказовНаборЗаписей.Добавить();
							НоваяЗапись.Заказ     = ЗаказПоставщику.Ссылка;
							НоваяЗапись.Состояние = Перечисления.СостоянияВыполненияЗаказовПоставщикам.Согласование;
							
							СостоянияЗаказовНаборЗаписей.Записать(Истина);
						КонецЕсли;
						
						ВывестиСообщение("Записан документ " + ЗаказПоставщику.Ссылка,ЗаказПоставщику.Ссылка);
						ДанныеЗаполнения.Вставить("ОбъектДокумента", ЗаказПоставщику.Ссылка);
						
						МассивДокументов = Новый Массив;
						МассивДокументов.Добавить(ЗаказПоставщику.Ссылка);
						
						ОбъектыПечати = Новый СписокЗначений;
						ТабличныйДокумент = ПечатьЗаказПоставщику(МассивДокументов, ОбъектыПечати);
						
						ТабличныеДокументы = Новый СписокЗначений;
						ТабличныеДокументы.Добавить(ТабличныйДокумент, "Заказ поставщику");
						НоваяСтрока = ПолучитьСтрокуПисьма(ЗаказПоставщику, ТабличныеДокументы);
						
					Исключение
						ВывестиСообщение("Не удалось записать документ заказа поставщику");
						ЗаписьЖурналаРегистрации(НСтр("ru = 'Ошибка при записи документа ""Заказ поставщику""'", 
						ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),
						УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));	
					КонецПопытки;	
				КонецЕсли;
				
			КонецЕсли;
			
		ИначеЕсли ИдентификаторКоманды="СформироватьЗаказыПоГрафикам" Тогда
			
			//определим переменные
			//ПодразделениеКомпании				= ПараметрыСеанса.ПодразделениеКомпании;
			//СкладКомпании						= Справочники.СкладыКомпании.НайтиПоНаименованию("Торговый зал");
			//Поставщик							= Справочники.Контрагенты.ОсновнойПоставщик;
			Дата								= ТекущаяДата();
			ТолькоТоварыСРекомендациями			= Истина;
			ПроводитьДокумент					= Истина;
			ДнейУчетаНезакрытыхЗаказов			= 5;
			ПериодВыбытияПоУмолчанию			= 30;
			УчетДнейПриРасчетеЗаказаПоУмолчанию	= 3; //1-когда был на остатках, 2-когда продавался, 3-все, 4,5,6-без учета остатка
			ФормированиеЗаказаВЦО				= Ложь;
			ФормированиеСводногоЗаказа			= Ложь;
			НеУчитыватьАссортимент				= Ложь;
			НеУчитыватьВремяЗаказа				= Ложь;
			НеУчитыватьАкцииПриАнализеПродаж	= Ложь;
			ОтправлятьДокументПочтой			= Ложь;
			ДатаАнализа							= Дата - 86400;
			ВариантФормирования					= 0; //0-магазин, 1-ЦО за магазины, 2-заказ РЦ, 3-ФРОВ
			Автоформирование					= Истина;
			ПроцентПикаПродаж					= 200;
			НеУчитыватьТекущиеЗаказы			= Ложь;
			
			Если Специфика="мясницкий" Тогда
				
				Запрос = Новый Запрос("
				|ВЫБРАТЬ
				|	Подр.Ссылка КАК Подразделение,
				|	Скл.Ссылка КАК Склад
				|ИЗ
				|	Справочник.ПодразделенияКомпании.ДополнительныеРеквизиты КАК Подр
				|	ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СкладыКомпании КАК Скл
				|	ПО Подр.Ссылка=Скл.ПодразделениеКомпании И Подр.Ссылка.ЕРПМастерКлючСклада=Скл.ЕРПМастерКлюч
				|ГДЕ
				|	Подр.Свойство=&Свойство
				|");
				
				ДопРеквИспользоватьВАвтозаказе = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Использовать в автозаказе (Подразделения компании)", Истина);
				Запрос.УстановитьПараметр("Свойство", ДопРеквИспользоватьВАвтозаказе);
				
			Иначе
				
				Запрос = Новый Запрос("
				|ВЫБРАТЬ РАЗЛИЧНЫЕ
				|	Подразделение
				|ПОМЕСТИТЬ Магазины
				|ИЗ
				|	Документ.УстановкаГрафикаЗаказов.Товары
				|ГДЕ
				|	Ссылка.Проведен
				|	И Ссылка.ДатаНачалаДействия<=&НаДату
				|;
				|ВЫБРАТЬ
				|	Ссылка КАК Склад,
				|	ПодразделениеКомпании КАК Подразделение
				|ИЗ
				|	Справочник.СкладыКомпании
				|ГДЕ
				|	НЕ ПометкаУдаления
				|	И Розничный
				|	И ПодразделениеКомпании В(ВЫБРАТЬ Подразделение ИЗ Магазины)
				|");
				Запрос.УстановитьПараметр("НаДату", КонецДня(Дата));
				
			КонецЕсли;
			
			Выборка = Запрос.Выполнить().Выбрать();
			
			Пока Выборка.Следующий() Цикл
				
				ПодразделениеКомпании	= Выборка.Подразделение;
				СкладКомпании			= Выборка.Склад;
				
				СформироватьЗаказыПоГрафикам();
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецПроцедуры //ВыполнитьКоманду()
	
	
	Функция СформироватьТаблицуЗаказа(ПараметрыРасчета, Свод = Ложь) Экспорт
		
		ДатаЗаказа				= ПараметрыРасчета.ДатаЗаказа;
		тКонтрагент				= ПараметрыРасчета.Контрагент;
		СубПоставщик			= ПараметрыРасчета.СубПоставщик;
		СрокПоставкиДн			= ПараметрыРасчета.СрокПоставки;
		ОграничениеНоменклатуры	= ПараметрыРасчета.Номенклатура;
		ВремяПринятия			= ПараметрыРасчета.ВремяПринятия;
		ВариантРасчета			= ПараметрыРасчета.ВариантРасчета;
		ПромежутокДней			= ПараметрыРасчета.ПромежутокДней;
		ВремяФормирования		= ПараметрыРасчета.ВремяФормирования;
		СтраховойЗапас			= ПараметрыРасчета.СтраховойЗапас;
		
		ВариантыРасчета = Новый Соответствие();
		ВариантыРасчета.Вставить(0, "Расчет по среднему выбытию");	
		ВариантыРасчета.Вставить(1, "По рассчитанному выбытию");	
		ВариантыРасчета.Вставить(2, "По рассчитанному среднему выбытию");
		
		ОписаниеВариантаРасчета = "";
		Если ВариантРасчета=0 Тогда
			ОписаниеВариантаРасчета = "Расчет выполняется по среднесуточному анализу продаж (Среднесуточные продажи * Расчетное количество дней + Минимальный остаток - Остаток - Количество в пути)";
		ИначеЕсли ВариантРасчета=1 Тогда
			ОписаниеВариантаРасчета = "Расчет выполняется по заранее рассчитанному значению (Рассчетное значение + Минимальный остаток - Остаток - Количество в пути)";
		ИначеЕсли ВариантРасчета=2 Тогда
			ОписаниеВариантаРасчета = "Расчет выполняется по заранее рассчитанному среднему значению (Рассчетное значение * Расчетное количество дней + Минимальный остаток - Остаток - Количество в пути)";
		КонецЕсли;
		
		Таб = Новый ТабличныйДокумент;
		
		Если ВариантФормирования=0 Тогда
			Макет = ПолучитьМакет("Макет");
			ОбластьВариантаРасчета = Макет.Область("ВариантРасчета");
			ОбластьВариантаРасчета.Примечание.Текст = ОписаниеВариантаРасчета;
			
		ИначеЕсли ВариантФормирования=3 И Свод Тогда
			Макет = ПолучитьМакет("МакетЦОФрОв");
			ОбластьВариантаРасчета = Макет.Область("ВариантРасчета");
			ОбластьВариантаРасчета.Примечание.Текст = ОписаниеВариантаРасчета;
			
		Иначе
			Макет = ПолучитьМакет("МакетЦО"+?(Свод,"Свод",""));
			Если Свод Тогда
				ОбластьВариантаРасчета = Макет.Область("ВариантРасчета");
				ОбластьВариантаРасчета.Примечание.Текст = ОписаниеВариантаРасчета;
			КонецЕсли;
		КонецЕсли;
		
		Если ВариантФормирования=1 И ЗначениеЗаполнено(ПоставщикРЦ) Тогда    //skud
			тКонтрагент = Поставщик;
		КонецЕсли;
		
		ПредЗаголовок = Макет.ПолучитьОбласть("ПредЗаголовок");
		Заголовок = Макет.ПолучитьОбласть("Заголовок");
		ЗаголовокТаблицы = Макет.ПолучитьОбласть("ЗаголовокТаблицы");
		Строка = Макет.ПолучитьОбласть("Строка");
		Группа = Макет.ПолучитьОбласть("Группа");
		Группа2 = Макет.ПолучитьОбласть("Группа2");
		
		ДатаПоставки	= ДатаЗаказа + (СрокПоставкиДн * 86400);
		ДатаСледПоставки = ДатаЗаказа + (ПромежутокДней * 86400);
		
		СледСрокПоставкиДн = ПромежутокДней - СрокПоставкиДн;
		
		Заголовок.Параметры.Поставщик				= тКонтрагент; //skud
		Заголовок.Параметры.СубПоставщик			= СубПоставщик;
		Заголовок.Параметры.ДатаЗаказа				= ДатаЗаказа;
		Заголовок.Параметры.ДатаПоставки			= ДатаПоставки;
		Заголовок.Параметры.ДатаСлПоставки			= ДатаСледПоставки;
		Заголовок.Параметры.ДнейРасчета				= ПромежутокДней + СтраховойЗапас;
		Заголовок.Параметры.Подразделение			= ПодразделениеКомпании;
		Заголовок.Параметры.ВремяПринятия			= ?(ВремяПринятия=Дата("00010101235959"), Дата("00010101"), ВремяПринятия);
		Заголовок.Параметры.Момент					= ТекущаяДата();
		Заголовок.Параметры.Пользователь			= ПараметрыСеанса.ТекущийПользователь;
		Заголовок.Параметры.ВремяФормирования		= Формат(ТекущаяДата() - ВремяФормирования, "ЧН=; ЧФ='Ч сек.'");
		Заголовок.Параметры.ОграничениеНоменклатуры	= ОграничениеНоменклатуры;
		Заголовок.Параметры.РасшДнейРасчета	= "Текущий срок поставки " + СрокПоставкиДн + " дней (" + Формат(ДатаПоставки, "ДФ=dd.MM.yyyy") + ")"
		+ Символы.ПС + "Следующий срок поставки, через: " + СледСрокПоставкиДн + " дней (" + Формат(ДатаСледПоставки, "ДФ=dd.MM.yyyy") + ")"
		+ ?(СтраховойЗапас=0, "", Символы.ПС + "Страховой запас: " + СтраховойЗапас + " дней.");
		
		МассивСкладов = Новый Массив;
		
		Если ВариантФормирования=0 Тогда
			
			//Заголовок.Параметры.ДатаПоставки			= ДатаПоставки;
			//Заголовок.Параметры.ДнейРасчета				= ПромежутокДней;
			//Заголовок.Параметры.ДатаСлПоставки			= ДатаСледПоставки;
			Заголовок.Параметры.ВариантРасчета			= ВариантыРасчета.Получить(ВариантРасчета);
			//Заголовок.Параметры.ВремяПринятия			= ?(ВремяПринятия=Дата("00010101235959"), Дата("00010101"), ВремяПринятия);
			
			//Заголовок.Параметры.РасшДнейРасчета	= "Текущий срок поставки " + СрокПоставкиДн + " дней (" + Формат(ДатаПоставки, "ДФ=dd.MM.yyyy") + ")"
			//+ Символы.ПС + "Следующий срок поставки, через: " + СледСрокПоставкиДн + " дней (" + Формат(ДатаСледПоставки, "ДФ=dd.MM.yyyy") + ")";
			
			МассивСкладов.Добавить(СкладКомпании);
			Заголовок.Параметры.СкладКомпании	= МассивСкладов;
			
		ИначеЕсли (ВариантФормирования=2 ИЛИ ВариантФормирования=3) И Свод Тогда
			
			//Заголовок.Параметры.ДатаПоставки			= ДатаПоставки;
			//Заголовок.Параметры.ДнейРасчета				= ПромежутокДней;
			//Заголовок.Параметры.ДатаСлПоставки			= ДатаСледПоставки;
			Заголовок.Параметры.ВариантРасчета			= ВариантыРасчета.Получить(ВариантРасчета);
			//Заголовок.Параметры.ВремяПринятия			= ?(ВремяПринятия=Дата("00010101235959"), Дата("00010101"), ВремяПринятия);
			
			//Заголовок.Параметры.РасшДнейРасчета	= "Текущий срок поставки " + СрокПоставкиДн + " дней (" + Формат(ДатаПоставки, "ДФ=dd.MM.yyyy") + ")"
			//+ Символы.ПС + "Следующий срок поставки, через: " + СледСрокПоставкиДн + " дней (" + Формат(ДатаСледПоставки, "ДФ=dd.MM.yyyy") + ")";
			
		КонецЕсли;
		
		Таб.Вывести(ПредЗаголовок,0);
		
		Таб.НачатьГруппуСтрок("Шапка", ?((ВариантФормирования=2 ИЛИ ВариантФормирования=3) И НЕ Свод, Ложь, Истина));
		Таб.Вывести(Заголовок, 1);
		Таб.ЗакончитьГруппуСтрок();
		
		Таб.Вывести(ЗаголовокТаблицы);
		
		КолонкаБлок = 0;
		Для НомКол=1 По ПредЗаголовок.ШиринаТаблицы Цикл
			ИмяКолонки = ПредЗаголовок.Область(1, НомКол).Текст;
			Если ИмяКолонки="Блок" Тогда
				КолонкаБлок = НомКол;
			КонецЕсли;
		КонецЦикла;
		
		Таб.НачатьАвтогруппировкуСтрок();
		Родитель = ""; Родитель2 = ""; ПредПодразделение = Неопределено;
		
		Если ВариантФормирования=1 Тогда
			ТаблицаТоваров = Товары.НайтиСтроки(Новый Структура("Контрагент,ВремяПринятия", ПараметрыРасчета.Контрагент, ВремяПринятия));  //skud
			//Если Свод Тогда
			//	ТаблицаТоваров = Товары.Выгрузить(ТаблицаТоваров);
			//	ТаблицаТоваров.Свернуть("Номенклатура,Код,НоменклатураНаименование,Родитель,РодительНаименование,КратностьПоставок,ТарноеМесто,РодительНаименование,Цена", 
			//				"КоличествоПродаж,СреднесуточнаяПродажа,ОстатокНаСкладе,ОстатокНаРЦ,Количество,РекомендуемоеКоличество,КоличествоСУчетомКратности,ТоварыВПути,РасчетнаяПотребность,МинимальныйЗапас");
			//КонецЕсли;	
		Иначе
			ТаблицаТоваров = Товары;
		КонецЕсли;
		
		Для Каждого Стр Из ТаблицаТоваров Цикл
			
			Если Родитель2<>Стр.Родитель.Родитель И НЕ БезГрупп Тогда
				Группа2.Параметры.НоменклатураНаименование = Стр.Родитель.Родитель.Наименование;
				Таб.Вывести(Группа2, 0);
				Родитель2 = Стр.Родитель.Родитель;
			КонецЕсли;
			
			Если Родитель<>Стр.Родитель И НЕ БезГрупп Тогда
				Группа.Параметры.НоменклатураНаименование = Стр.РодительНаименование;
				Таб.Вывести(Группа, 1);
				Родитель = Стр.Родитель;
			КонецЕсли;
			
			ЗаполнитьЗначенияСвойств(Строка.Параметры, Стр);
			
			Строка.Параметры.ТипЦен = ТипЦены;
			
			Если Свод Тогда
				
				РекомендуемоеРЦ = -Стр.ОстатокНаРЦ;
				
				Если Стр.КратностьПоставок>0 Тогда
					Если (РекомендуемоеРЦ - Окр(РекомендуемоеРЦ / Стр.КратностьПоставок - 0.25, 0) * Стр.КратностьПоставок) < (Стр.КратностьПоставок / 4) Тогда
						РекомендуемоеРЦ = Стр.КратностьПоставок * Окр(РекомендуемоеРЦ / Стр.КратностьПоставок - 0.25, 0);
					Иначе
						РекомендуемоеРЦ = Стр.КратностьПоставок * (1 + Окр(РекомендуемоеРЦ / Стр.КратностьПоставок - 0.25, 0));
					КонецЕсли;
				КонецЕсли;
				
				Строка.Параметры.РекомендованноеРЦ = РекомендуемоеРЦ;
				Строка.Параметры.РасшРекомендованноеРЦ = "Разница между колонками ""Магазины"" и ""Остаток РЦ"", округленная до кванта по коэффициенту 0.25";
			Иначе
				РасчРекКол = Окр(Стр.СреднесуточнаяПродажа * (ПромежутокДней + СтраховойЗапас) + Стр.МинимальныйЗапас + Стр.ДопЗапасНаАкцию - Стр.ТоварыВПути - ?(Стр.УчетДней<4, ?(Стр.ОстатокНаСкладе<0, 0, Стр.ОстатокНаСкладе), 0), 3);
				ТекстРасшифровкиРекКоличества = "Расчет: Ср.продажи(" + Стр.СреднесуточнаяПродажа + ") * Дней расчета(" + Число(ПромежутокДней+СтраховойЗапас) + ") + Мин.остаток(" + Стр.МинимальныйЗапас + ") + Доп.запас(" + Стр.ДопЗапасНаАкцию + ") - ВПути(" + Стр.ТоварыВПути + ")" + ?(Стр.УчетДней<4, " - Остаток(" + Стр.ОстатокНаСкладе + ")", "") + " = ИТОГО: " + Формат(РасчРекКол, "ЧДЦ=3; ЧН=");
				Если Стр.КоличествоПродаж=0 И Стр.МинимальныйЗапас=0 И Стр.ОстатокНаСкладе<=0 И Стр.ТоварыВПути=0 И Стр.ДопЗапасНаАкцию=0 Тогда
					ТекстРасшифровкиРекКоличества = ТекстРасшифровкиРекКоличества + Символы.ПС + Символы.ПС + "ЕСЛИ Продажи = 0 И Мин.Остаток = 0 И Остаток <= 0 И ВПути = 0 И Доп.запас = 0 ТОГДА Рек.количество = Квант(" + Стр.КратностьПоставок + ")";
					РасчРекКол = Стр.КратностьПоставок;
				КонецЕсли;
				Если РасчРекКол<Стр.КратностьПоставок И Стр.КратностьПоставок<Стр.МинимальныйЗаказ Тогда
					ТекстРасшифровкиРекКоличества = ТекстРасшифровкиРекКоличества + Символы.ПС + Символы.ПС + "ЕСЛИ Рек.количество(" + РасчРекКол + ") < Квант(" + Стр.КратностьПоставок + ") И Квант(" + Стр.КратностьПоставок + ") < Мин.заказ(" + Стр.МинимальныйЗаказ + ") ТОГДА Рек.количество = 0(ноль)";
					//РасчРекКол = Стр.КратностьПоставок;
					//КонецЕсли;
					//Если Стр.РекомендуемоеКоличество<>0 И РасчРекКол<Стр.МинимальныйЗаказ Тогда
				ИначеЕсли РасчРекКол<Стр.МинимальныйЗаказ Тогда
					ТекстРасшифровкиРекКоличества = ТекстРасшифровкиРекКоличества + Символы.ПС + Символы.ПС + "ЕСЛИ Рек.количество(" + РасчРекКол + ") < Мин.заказ(" + Стр.МинимальныйЗаказ + ") ТОГДА Рек.количество = Мин.заказ(" + Стр.МинимальныйЗаказ + ")";
				КонецЕсли;
				Строка.Параметры.РасшРекомендуемоеКоличество = ТекстРасшифровкиРекКоличества;
				Строка.Параметры.РасшСреднесуточнаяПродажа = "Продажа(" + Стр.КоличествоПродаж + ") / дней продаж(" + Стр.ДнейПродаж + ") = ср.продажа(" + Стр.СреднесуточнаяПродажа + ")";
				Строка.Параметры.РасшКоличествоСУчетомКратности = "Округление до кванта поставки(" + Стр.КратностьПоставок + "), по коэфф.0,25"
				+ Символы.ПС + "Рекомендуемое количество(" + Стр.РекомендуемоеКоличество + "),"
				+ Символы.ПС + " округленное значение: " + Стр.КоличествоСУчетомКратности;
			КонецЕсли;
			
			Если стр.Заблокировано Тогда
				Строка.Параметры.ДатаБлокировки = ?(ЗначениеЗаполнено(стр.ДатаБлокировки), Формат(стр.ДатаБлокировки, "ДФ=dd.MM.yyyy"), "бессрочно");
				
				Строка.Области.Строка.ЦветТекста = Новый Цвет(192, 192, 192);
				Строка.Область(1,КолонкаБлок).ЦветТекста = Новый Цвет(255, 0, 0);
			Иначе
				Строка.Области.Строка.ЦветТекста = Новый Цвет(0, 0, 0);
			КонецЕсли;
			
			Если ВариантФормирования<>0 И НЕ Свод Тогда
				
				Если стр.Подразделение<>ПредПодразделение Тогда
					ЗапросСкладов = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.СкладыКомпании ГДЕ ПодразделениеКомпании=&Подразделение");
					ЗапросСкладов.УстановитьПараметр("Подразделение", Стр.Подразделение);
					МассивСкладов = ЗапросСкладов.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
				КонецЕсли;
				
				Строка.Параметры.ДатаПоставки	= Дата + (Стр.СрокПоставки * 86400);
				Строка.Параметры.ВремяПринятия	= ?(Стр.ВремяПринятия=Дата("00010101235959"), Дата("00010101"), Стр.ВремяПринятия);
				//Строка.Параметры.ВариантРасчета = ВариантыРасчета.Получить(ВариантРасчета);
				Строка.Параметры.СкладКомпании = МассивСкладов;
				
				ПредПодразделение = стр.Подразделение;
			КонецЕсли;
			
			Если Специфика="Семья" И ВариантФормирования=2 И Свод Тогда
				Строка.Параметры.БонуснаяГруппа = СокрЛП(Стр.Номенклатура.смБонуснаяГруппа.Наименование);
			КонецЕсли;
			
			Таб.Вывести(Строка, 2);
			
		КонецЦикла;
		
		Таб.ЗакончитьАвтогруппировкуСтрок();
		
		//зависание
		//Таб.ФиксацияСверху = Заголовок.ВысотаТаблицы + ПредЗаголовок.ВысотаТаблицы + ЗаголовокТаблицы.ВысотаТаблицы;
		Таб.ФиксацияСлева = ?(ФормированиеЗаказаВЦО, 4, 3);
		Таб.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		Таб.НаправлениеПерехода = ТипНаправленияПереходаТабличногоДокумента.БезПерехода;
		
		Возврат Таб;
		
	КонецФункции //СформироватьТаблицуЗаказа()
	
	
	Функция СформироватьИсторию(История,ТипОбласти=Неопределено,тНоменклатура=Неопределено,МассивСкладов=Неопределено,тДней=Неопределено) Экспорт
		
		//История = Новый ТабличныйДокумент;
		
		
		//Если ТипОбласти="Дней. прод." Тогда
		ДатаНачалаПериода = НачалоДня(ДатаАнализа) - 86400 * (тДней-1);
		ДатаОкончанияПериода = КонецДня(ДатаАнализа);
		
		История.Очистить();
		Макет = ПолучитьМакет("МакетИстория");
		
		тзОстаткиПоДням = Новый ТаблицаЗначений;
		тзОстаткиПоДням.Колонки.Добавить("День", Новый ОписаниеТипов("Дата"));
		тзОстаткиПоДням.Колонки.Добавить("КоличествоНачало", Новый ОписаниеТипов("Число"));
		тзОстаткиПоДням.Колонки.Добавить("КоличествоКонец", Новый ОписаниеТипов("Число"));
		
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	НАЧАЛОПЕРИОДА(Период, ДЕНЬ) КАК Дата,
		|	КоличествоНачальныйОстаток КАК КоличествоНачало,
		|	КоличествоКонечныйОстаток КАК КоличествоКонец
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(&Дата1, &Дата2, День, ,Номенклатура=&Номенклатура И СкладКомпании В(&СкладКомпании)) КАК Остатки
		|");
		Запрос.УстановитьПараметр("Дата1", ДатаНачалаПериода);
		Запрос.УстановитьПараметр("Дата2", ДатаОкончанияПериода);
		Запрос.УстановитьПараметр("Номенклатура", тНоменклатура);
		Запрос.УстановитьПараметр("СкладКомпании", МассивСкладов);
		тзОстатков = Запрос.Выполнить().Выгрузить();
		
		Остаток = 0;
		Для День=0 По тДней-1 Цикл
			
			ДеньПериода = НачалоДня(ДатаОкончанияПериода) - (тДней-День-1) * 86400;
			НоваяСтрока = тзОстаткиПоДням.Добавить();
			НоваяСтрока.День = ДеньПериода;
			СтрокаОстатка = тзОстатков.Найти(ДеньПериода);
			Если СтрокаОстатка=Неопределено Тогда
				НоваяСтрока.КоличествоНачало = Остаток;//0;
				НоваяСтрока.КоличествоКонец = Остаток;//0;
			Иначе
				НоваяСтрока.КоличествоНачало = СтрокаОстатка.КоличествоНачало;
				НоваяСтрока.КоличествоКонец = СтрокаОстатка.КоличествоКонец;
				
				Остаток = СтрокаОстатка.КоличествоКонец;
			КонецЕсли;
			
		КонецЦикла;		
		
		ТекстЗапросаИстории = "
		|ВЫБРАТЬ
		|	Остатки.День КАК День,
		|	Остатки.КоличествоНачало КАК КоличествоНачало,
		|	Остатки.КоличествоКонец КАК КоличествоКонец
		|ПОМЕСТИТЬ Остатки
		|ИЗ
		|	&Остатки КАК Остатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////";
		Если Специфика="Семья" Тогда
			ТекстЗапросаИстории = ТекстЗапросаИстории + "
			|ВЫБРАТЬ
			|	День,
			|	СУММА(Продажа) КАК Продажа
			|ПОМЕСТИТЬ Продажи
			|ИЗ
			|	(ВЫБРАТЬ
			|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ) КАК День,
			|		СУММА(ПродажиОбороты.КоличествоОборот) КАК Продажа
			|	ИЗ
			|		РегистрНакопления.Продажи.Обороты(&Дата1, &Дата2, Регистратор, Номенклатура = &Номенклатура И СкладКомпании В(&СкладКомпании) И НЕ Покупатель В(&КонтрагентыИсключения)) КАК ПродажиОбороты
			|	СГРУППИРОВАТЬ ПО
			|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ)
			|
			|	ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ),
			|		-СУММА(ПродажиОбороты.КоличествоОборот)
			|	ИЗ
			|		РегистрНакопления.РСПродажиУценка.Обороты(&Дата1, &Дата2, Регистратор, Номенклатура = &Номенклатура И СкладКомпании В(&СкладКомпании)) КАК ПродажиОбороты
			|	СГРУППИРОВАТЬ ПО
			|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ)
			|	) КАК ВложенныйЗапрос
			|СГРУППИРОВАТЬ ПО
			|	День";
			
		Иначе
			ТекстЗапросаИстории = ТекстЗапросаИстории + "
			|ВЫБРАТЬ
			|	День,
			|	СУММА(Продажа) КАК Продажа
			|ПОМЕСТИТЬ Продажи
			|ИЗ
			|	(ВЫБРАТЬ
			|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ) КАК День,
			|		СУММА(ПродажиОбороты.КоличествоОборот) КАК Продажа
			|	ИЗ
			|		РегистрНакопления.Продажи.Обороты(&Дата1, &Дата2, Регистратор, Номенклатура = &Номенклатура И СкладКомпании В(&СкладКомпании)) КАК ПродажиОбороты
			|	СГРУППИРОВАТЬ ПО
			|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ)
			|
			|	ОБЪЕДИНИТЬ ВСЕ
			|
			|	ВЫБРАТЬ
			|		НАЧАЛОПЕРИОДА(Период, ДЕНЬ),
			|		СУММА(Количество)
			|	ИЗ
			|		РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
			|	ГДЕ
			|		ВидДвижения=ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
			|		И Период МЕЖДУ &Дата1 И &Дата2
			|		И СкладКомпании В(&СкладКомпании)
			|		И Номенклатура = &Номенклатура
			|		И ХозОперация=ЗНАЧЕНИЕ(Справочник.ХозОперации.ПередачаИнгредиентовВПроизводство)
			|	СГРУППИРОВАТЬ ПО
			|		Номенклатура,
			|		НАЧАЛОПЕРИОДА(Период, ДЕНЬ)
			|	) КАК ВложенныйЗапрос
			|СГРУППИРОВАТЬ ПО
			|	День";
		КонецЕсли;
		
		ТекстЗапросаИстории = ТекстЗапросаИстории + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Остатки.День КАК День,
		|	Остатки.КоличествоНачало КАК Начало,
		|	Остатки.КоличествоКонец КАК Конец,
		|	Продажи.Продажа КАК Продажа
		|ИЗ
		|	Остатки КАК Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Продажи КАК Продажи
		|		ПО (Продажи.День = Остатки.День)
		|УПОРЯДОЧИТЬ ПО
		|	День ВОЗР";
		Запрос = Новый Запрос(ТекстЗапросаИстории);
		Запрос.УстановитьПараметр("Остатки", тзОстаткиПоДням);
		Запрос.УстановитьПараметр("Дата1", ДатаНачалаПериода);
		Запрос.УстановитьПараметр("Дата2", ДатаОкончанияПериода);
		Запрос.УстановитьПараметр("Номенклатура", тНоменклатура);
		Запрос.УстановитьПараметр("СкладКомпании", МассивСкладов);
		//Запрос.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
		//Запрос.УстановитьПараметр("ХозОперация", Справочники.ХозОперации.ЗакрытиеСмены);
		
		Если Специфика="Семья" Тогда
			ДопРеквизитСобственноеЮЛ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СобственноеЮЛ");
			ЗапросКонтрагентов = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка ИЗ Справочник.Контрагенты.ДополнительныеРеквизиты ГДЕ Свойство=&Свойство");
			ЗапросКонтрагентов.УстановитьПараметр("Свойство", ДопРеквизитСобственноеЮЛ);
			тзКонтрагентовИсключения = ЗапросКонтрагентов.Выполнить().Выгрузить();
			Запрос.УстановитьПараметр("КонтрагентыИсключения", тзКонтрагентовИсключения.ВыгрузитьКолонку("Ссылка")); 
		КонецЕсли;
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
		ОбластьЗаголовок.Параметры.Заголовок = "История с "+Формат(ДатаНачалаПериода,"ДФ=dd.MM")+" по "+Формат(ДатаОкончанияПериода,"ДФ=dd.MM");
		ОбластьЗаголовок.Параметры.Товар = тНоменклатура;
		ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");
		ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
		ОбластьПодвалТаблицы = Макет.ПолучитьОбласть("ПодвалТаблицы");
		ОбластьДетальныхЗаписей = Макет.ПолучитьОбласть("Детали");
		
		История.Вывести(ОбластьЗаголовок);
		История.Вывести(ОбластьШапкаТаблицы);
		История.НачатьАвтогруппировкуСтрок();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ОбластьДетальныхЗаписей.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			История.Вывести(ОбластьДетальныхЗаписей, ВыборкаДетальныеЗаписи.Уровень());
		КонецЦикла;
		
		История.ЗакончитьАвтогруппировкуСтрок();
		История.Вывести(ОбластьПодвалТаблицы);
		История.Вывести(ОбластьПодвал);
		
		//История.Показать();
		//КонецЕсли;
		
		//Возврат История;
	КонецФункции
	
	
	Процедура ВывестиДокумент(Расчет, тДок=Неопределено) Экспорт
		
		Макет = ПолучитьМакет("МакетЦО");
		
		Если Расчет.Области.Найти("Подвал")=Неопределено Тогда
			ОбластьМакета = Макет.ПолучитьОбласть("Подвал");
			Расчет.Вывести(ОбластьМакета);
		КонецЕсли;
		
		ОбластьМакета = Макет.ПолучитьОбласть("СтрокаДок");
		ОбластьМакета.Параметры.Документ = тДок;
		Расчет.Вывести(ОбластьМакета);
		
	КонецПроцедуры //ВывестиДокумент()
	
	Функция РассчитатьЗаказНаСервере(ПараметрыРасчета) Экспорт
		
		Если Специфика="Семья" Тогда
			СемьяОпт = Справочники.Контрагенты.НайтиПоКоду("000001843");
			СемьяОптПодр = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000162");
		Иначе
			СемьяОпт = Справочники.Контрагенты.ПустаяСсылка();
			СемьяОптПодр = Справочники.ПодразделенияКомпании.ПустаяСсылка();
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(ДатаАнализа) Тогда
			ДатаАнализа = Дата - 1;
		КонецЕсли;
		
		ДатаЗаказа			= ПараметрыРасчета.ДатаЗаказа;
		Контрагент			= ПараметрыРасчета.Контрагент;
		СубПоставщик		= ПараметрыРасчета.СубПоставщик;
		Номенклатура		= ПараметрыРасчета.Номенклатура;
		СрокПоставки		= ПараметрыРасчета.СрокПоставки;
		ВремяПринятия		= ПараметрыРасчета.ВремяПринятия;
		СтраховойЗапас		= ПараметрыРасчета.СтраховойЗапас;
		ВариантРасчета		= ПараметрыРасчета.ВариантРасчета;
		ПромежутокДней		= ПараметрыРасчета.ПромежутокДней;
		МассивНоменклатуры	= ПараметрыРасчета.ОтборНоменклатуры;
		МассивИсключений	= ПараметрыРасчета.Исключения;
		ОтборПользователя	= ПараметрыРасчета.ОтборПользователя;
		Подразделение		= ПараметрыРасчета.Подразделение; //магазин
		БиржевыеТовары		= ПараметрыРасчета.БиржевыеТовары;
		СогласованныеЦены	= ПараметрыРасчета.СогласованныеЦены;
		
		НачалоАнализаПродаж = Дата("00010101"); КонецАнализаПродаж = Дата("00010101");
		Если ЗначениеЗаполнено(ПараметрыРасчета.НачалоАнализаПродаж) Тогда
			НачалоАнализаПродаж = ПараметрыРасчета.НачалоАнализаПродаж;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПараметрыРасчета.КонецАнализаПродаж) Тогда
			КонецАнализаПродаж = ПараметрыРасчета.КонецАнализаПродаж;
		КонецЕсли;
		
		//Определим блокировку подразделения и контрагента для заказов
		ЗапросБлокировки = Новый Запрос("
		|ВЫБРАТЬ
		|	ПодразделениеКомпании,
		|	Контрагент,
		|	Номенклатура,
		|	Заблокировано,
		|	МАКСИМУМ(СрокДействия) КАК СрокДействия
		|ИЗ
		|	(ВЫБРАТЬ
		|		ПодразделениеКомпании,
		|		Контрагент,
		|		Номенклатура,
		|		Заблокировано,
		|		СрокДействия
		|	ИЗ
		|		РегистрСведений.БлокировкаАссортимента.СрезПоследних(&НаДату, ХозОперация=ЗНАЧЕНИЕ(Справочник.ХозОперации.БлокировкаАссортиментаКЗаказу) И ПодразделениеКомпании В(&Подразделение) И Контрагент В(&Контрагент))
		|	ГДЕ
		|		Заблокировано И (СрокДействия >= &НаДату ИЛИ СрокДействия=ДАТАВРЕМЯ(1,1,1))
		|	ОБЪЕДИНИТЬ
		|	ВЫБРАТЬ
		|		ПодразделениеКомпании,
		|		Контрагент,
		|		Номенклатура,
		|		Заблокировано,
		|		СрокДействия
		|	ИЗ
		|		РегистрСведений.БлокировкаАссортимента.СрезПоследних(&НаДату, ХозОперация=ЗНАЧЕНИЕ(Справочник.ХозОперации.БлокировкаПриемки) И ПодразделениеКомпании В(&Подразделение) И Контрагент В(&Контрагент))
		|	ГДЕ
		|		Заблокировано И (СрокДействия >= &НаДату ИЛИ СрокДействия=ДАТАВРЕМЯ(1,1,1))
		|) КАК ВложенныйЗапрос
		|СГРУППИРОВАТЬ ПО
		|	ПодразделениеКомпании,
		|	Контрагент,
		|	Номенклатура,
		|	Заблокировано
		|");
		
		МассивПодразделений = Новый Массив;
		МассивПодразделений.Добавить(Справочники.ПодразделенияКомпании.ПустаяСсылка());
		Если ФормированиеЗаказаВЦО Тогда
			МассивПодразделений.Добавить(Подразделение);
		Иначе
			МассивПодразделений.Добавить(ПодразделениеКомпании);
			МассивПодразделений.Добавить(ПодразделениеКомпании.Родитель);
		КонецЕсли;
		
		МассивКонтрагентов = Новый Массив;
		МассивКонтрагентов.Добавить(Контрагент);
		МассивКонтрагентов.Добавить(Справочники.Контрагенты.ПустаяСсылка());
		
		ЗапросБлокировки.УстановитьПараметр("НаДату", КонецДня(Дата));
		ЗапросБлокировки.УстановитьПараметр("Подразделение", МассивПодразделений);
		ЗапросБлокировки.УстановитьПараметр("Контрагент", МассивКонтрагентов);
		
		тзБлокировок = ЗапросБлокировки.Выполнить().Выгрузить();
		
		БлокПодразделения = тзБлокировок.НайтиСтроки(Новый Структура("ПодразделениеКомпании,Контрагент,Номенклатура", ПодразделениеКомпании, Справочники.Контрагенты.ПустаяСсылка(), Справочники.Номенклатура.ПустаяСсылка()));
		Если БлокПодразделения.Количество()>0 Тогда
			ВывестиСообщение(НСтр("ru='Подразделение """ + ПодразделениеКомпании + """ заблокировано для заказа.'"));
			Возврат Ложь;
		Иначе
			БлокПодразделения = тзБлокировок.НайтиСтроки(Новый Структура("ПодразделениеКомпании,Контрагент,Номенклатура", ПодразделениеКомпании.Родитель, Справочники.Контрагенты.ПустаяСсылка(), Справочники.Номенклатура.ПустаяСсылка()));
		КонецЕсли;
		Если БлокПодразделения.Количество()>0 Тогда
			ВывестиСообщение(НСтр("ru='Подразделение """ + ПодразделениеКомпании.Родитель + """ заблокировано для заказа.'"));
			Возврат Ложь;
		ИначеЕсли ЗначениеЗаполнено(Подразделение) Тогда
			БлокПодразделения = тзБлокировок.НайтиСтроки(Новый Структура("ПодразделениеКомпании,Контрагент,Номенклатура", Подразделение, Справочники.Контрагенты.ПустаяСсылка(), Справочники.Номенклатура.ПустаяСсылка()));
		КонецЕсли;
		Если БлокПодразделения.Количество()>0 Тогда
			ВывестиСообщение(НСтр("ru='Подразделение """ + Подразделение + """ заблокировано для заказа.'"));
			Возврат Ложь;
		КонецЕсли;
		
		БлокКонтрагента = тзБлокировок.НайтиСтроки(Новый Структура("Контрагент,Номенклатура", Контрагент, Справочники.Номенклатура.ПустаяСсылка()));
		Если БлокКонтрагента.Количество()>0 Тогда
			ВывестиСообщение(НСтр("ru='Контрагент " + Контрагент + " заблокирован для заказа.'"));
			Возврат Ложь;
		КонецЕсли;
		
		МассивСкладов = Новый Массив; МассивСкладовРЦ = Новый Массив;
		Если ФормированиеЗаказаВЦО Тогда
			ЗапросСкладов = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.СкладыКомпании ГДЕ ПодразделениеКомпании=&Подразделение");
			ЗапросСкладов.УстановитьПараметр("Подразделение", Подразделение);
			МассивСкладов = ЗапросСкладов.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			ТипЦены = МассивСкладов[0].ПодразделениеКомпании.ТипЦенРеализации;
			
			ЗапросСкладовРЦ = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.СкладыКомпании ГДЕ ПодразделениеКомпании=&Подразделение");
			Если Специфика="Семья" Тогда
				ЗапросСкладовРЦ = Новый Запрос("ВЫБРАТЬ
				|	СкладыКомпанииДополнительныеРеквизиты.Ссылка КАК Ссылка,
				|	ВЫРАЗИТЬ(СкладыКомпанииДополнительныеРеквизиты.Значение КАК СТРОКА) КАК Значение
				|ИЗ
				|	Справочник.СкладыКомпании.ДополнительныеРеквизиты КАК СкладыКомпанииДополнительныеРеквизиты
				|ГДЕ
				|	СкладыКомпанииДополнительныеРеквизиты.Ссылка.ПодразделениеКомпании = &Подразделение
				|	И СкладыКомпанииДополнительныеРеквизиты.Свойство.Наименование = ""КодNS2000 (Склады компании)""
				|	И НЕ СкладыКомпанииДополнительныеРеквизиты.Значение В (""80"", ""81"", ""82"", ""83"", ""31"", ""33"", ""15"")");
			КонецЕсли;   
			
			ЗапросСкладовРЦ.УстановитьПараметр("Подразделение", ПодразделениеКомпании);
			МассивСкладовРЦ = ЗапросСкладовРЦ.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Иначе
			Если Специфика="мясницкий" И ВариантФормирования=0 И Автоформирование Тогда
				ЗапросСкладов = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.СкладыКомпании ГДЕ Розничный И ПодразделениеКомпании=&Подразделение");
				ЗапросСкладов.УстановитьПараметр("Подразделение", Подразделение);
				МассивСкладов = ЗапросСкладов.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			Иначе
				МассивСкладов.Добавить(СкладКомпании);
			КонецЕсли;
			ТипЦены = ТипЦены;
		КонецЕсли;
		
		//получим доступную номенклатуру для заказа
		Запрос = Новый Запрос("");
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		
		Запрос.УстановитьПараметр("НаДату", КонецДня(Дата));
		Запрос.УстановитьПараметр("ДатаУчетаЗаказов", ?(НеУчитыватьТекущиеЗаказы, НачалоДня(Дата)-1, КонецДня(Дата)));
		Запрос.УстановитьПараметр("ДатаНезакрытыхЗаказов", КонецДня(Дата) - 86400 * ДнейУчетаНезакрытыхЗаказов);
		Запрос.УстановитьПараметр("ДатаДляАкции", Дата + 86400 * ПромежутокДней);
		Запрос.УстановитьПараметр("ДатаЗавтра", КонецДня(Дата + 86400));
		Запрос.УстановитьПараметр("Подразделение", ?(ФормированиеЗаказаВЦО, Подразделение, ПодразделениеКомпании));
		Запрос.УстановитьПараметр("Контрагент", ?(Контрагент=СемьяОпт И ЗначениеЗаполнено(СубПоставщик), СубПоставщик, Контрагент));
		Запрос.УстановитьПараметр("тзБлокировок", тзБлокировок);
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("СкладКомпании", МассивСкладов);
		Запрос.УстановитьПараметр("СкладКомпанииРЦ", МассивСкладовРЦ);
		Запрос.УстановитьПараметр("ТипЦены", ТипЦены);
		Запрос.УстановитьПараметр("ГруппаПоставки", ?(Контрагент=СемьяОпт И ЗначениеЗаполнено(СубПоставщик), СемьяОптПодр.ГруппаПоставки, ?(ФормированиеЗаказаВЦО, Подразделение.ГруппаПоставки, ПодразделениеКомпании.ГруппаПоставки)));
		Запрос.УстановитьПараметр("ПодразделениеСоглЦен", ?(Контрагент=СемьяОпт И ЗначениеЗаполнено(СубПоставщик), СемьяОптПодр, ?(ФормированиеЗаказаВЦО, Подразделение, ПодразделениеКомпании)));
		Если ВариантРасчета=1 ИЛИ ВариантРасчета=0 Тогда
			Запрос.УстановитьПараметр("ПараметрРасчета", Справочники.ПараметрыНоменклатуры.РассчитаннаяПотребность);
		ИначеЕсли ВариантРасчета=2 Тогда
			Запрос.УстановитьПараметр("ПараметрРасчета", Справочники.ПараметрыНоменклатуры.РассчитаннаяСредняяПотребность);
		КонецЕсли;
		Запрос.УстановитьПараметр("БиржевыеТовары", БиржевыеТовары);
		Запрос.УстановитьПараметр("НачалоПериода", НачалоАнализаПродаж);
		Запрос.УстановитьПараметр("КонецПериода", КонецДня(КонецАнализаПродаж));
		Запрос.УстановитьПараметр("ЭтоФрОв", ВариантФормирования=3);
		Запрос.УстановитьПараметр("КонтрагентСемьяОпт", СемьяОпт);
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	тзБлокировок.Номенклатура,
		|	тзБлокировок.Заблокировано,
		|	тзБлокировок.СрокДействия
		|ПОМЕСТИТЬ Блокировки
		|ИЗ
		|	&тзБлокировок КАК тзБлокировок
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Если Специфика="Реми" Тогда
			
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ПодразделениеКомпании КАК ПодразделениеКомпании,
			|	Номенклатура КАК Группа,
			|	Формат КАК Формат
			|ПОМЕСТИТЬ Подразделения
			|ИЗ
			|	РегистрСведений.ФорматыАссортиментаПодразделений.СрезПоследних(&НаДату, ПодразделениеКомпании=&Подразделение) КАК ФорматыАссортиментаПодразделенийСрезПоследних
			|СГРУППИРОВАТЬ ПО
			|	ПодразделениеКомпании,
			|	Номенклатура,
			|	Формат
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Ссылка КАК Номенклатура,
			|	Ссылка.Родитель КАК Группа
			|ПОМЕСТИТЬ Товары
			|ИЗ
			|	Справочник.Номенклатура КАК Номенклатура
			|ГДЕ
			|	1=1
			|	И Ссылка В ИЕРАРХИИ(&Номенклатура) И Ссылка НЕ В ИЕРАРХИИ(&Исключения)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.Номенклатура КАК Номенклатура,
			|	СтруктураИерархииНоменклатуры.Группа КАК Группа
			|ПОМЕСТИТЬ ТоварыСГруппами
			|ИЗ
			|	Товары КАК Товары
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
			|	ПО Товары.Группа = СтруктураИерархииНоменклатуры.Номенклатура
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|	Товары.Номенклатура,
			|	Товары.Группа
			|ИЗ
			|	Товары КАК Товары
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Подразделения.ПодразделениеКомпании КАК ПодразделениеКомпании,
			|	Подразделения.Формат КАК Формат,
			|	ТоварыСГруппами.Номенклатура КАК Номенклатура
			|ПОМЕСТИТЬ ПодразделенияИТовары
			|ИЗ
			|	Подразделения КАК Подразделения
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТоварыСГруппами КАК ТоварыСГруппами
			|	ПО ТоварыСГруппами.Группа = Подразделения.Группа
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Формат КАК Формат,
			|	Номенклатура КАК Номенклатура,
			|	Состояние КАК Состояние
			|ПОМЕСТИТЬ АссортиментФорматов
			|ИЗ
			|	РегистрСведений.АссортиментФорматов.СрезПоследних(&НаДату, 1=1 И Номенклатура В ИЕРАРХИИ(&Номенклатура) И Номенклатура НЕ В ИЕРАРХИИ(&Исключения)) КАК АссортиментФорматовСрезПоследних
			|ГДЕ
			|	Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ПодразделенияИТовары.Номенклатура КАК Номенклатура,
			|	АссортиментФорматов.Состояние КАК Состояние
			|ПОМЕСТИТЬ Ассортимент
			|ИЗ
			|	ПодразделенияИТовары КАК ПодразделенияИТовары
			|	ЛЕВОЕ СОЕДИНЕНИЕ АссортиментФорматов КАК АссортиментФорматов
			|	ПО ПодразделенияИТовары.Номенклатура = АссортиментФорматов.Номенклатура И ПодразделенияИТовары.Формат = АссортиментФорматов.Формат
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура";
			Если МассивНоменклатуры.Количество()>0 Тогда
				Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Номенклатура В ИЕРАРХИИ(&Номенклатура)", "");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ссылка В ИЕРАРХИИ(&Номенклатура)", "");
			КонецЕсли;
			Если МассивИсключений.Количество()>0 Тогда
				Запрос.УстановитьПараметр("Исключения", МассивИсключений);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Номенклатура НЕ В ИЕРАРХИИ(&Исключения)", "");
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ссылка НЕ В ИЕРАРХИИ(&Исключения)", "");
			КонецЕсли;
			
		Иначе
			
			Запрос.Текст = "
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Номенклатура,
			|	Состояние
			|ПОМЕСТИТЬ Ассортимент
			|ИЗ
			|	РегистрСведений.ОграничениеАссортиментаПодразделения.СрезПоследних(&НаДату, ПодразделениеКомпании=&Подразделение И Номенклатура В ИЕРАРХИИ(&Номенклатура) И Номенклатура НЕ В ИЕРАРХИИ(&Исключения)) КАК Ассортимент
			|ГДЕ
			|	Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура";
			Если МассивНоменклатуры.Количество()>0 Тогда
				Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Номенклатура В ИЕРАРХИИ(&Номенклатура)", "");
			КонецЕсли;
			Если МассивИсключений.Количество()>0 Тогда
				Запрос.УстановитьПараметр("Исключения", МассивИсключений);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Номенклатура НЕ В ИЕРАРХИИ(&Исключения)", "");
			КонецЕсли;
			
		КонецЕсли;
		
		Запрос.Выполнить();
		
		ЗапросГруппПользователя = Новый Запрос("ВЫБРАТЬ Номенклатура ИЗ Справочник.Пользователи.ГруппыТоваров ГДЕ Ссылка=&Пользователь");
		ЗапросГруппПользователя.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
		МассивГруппПользователя = ЗапросГруппПользователя.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
		
		Если ВариантФормирования=0 Тогда
			
			Если Специфика="Реми" Тогда
				
				Запрос.Текст = "
				|ВЫБРАТЬ
				|	Номенклатура,
				|	МАКСИМУМ(ВЫБОР КОГДА СпособПоставки=ЗНАЧЕНИЕ(Перечисление.СпособыПоставки.ТранзитнаяПоставка) ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ) КАК Транзит
				//|	МАКСИМУМ(Истина) Транзит
				|ПОМЕСТИТЬ СтатусыЗаказов
				|ИЗ
				|	РегистрСведений.ремиСтатусыЗаказов
				|ГДЕ
				|	ГруппаПоставки=&ГруппаПоставкиМагазина ИЛИ ГруппаПоставки=ЗНАЧЕНИЕ(Справочник.ГруппыПоставки.ПустаяСсылка)
				|СГРУППИРОВАТЬ ПО
				|	Номенклатура
				|
				|//////////////////////////////////////////////////
				|;
				|ВЫБРАТЬ
				|	СогласованныеЦены.Номенклатура КАК Номенклатура,
				|	СогласованныеЦены.ПодразделениеКомпании КАК ПодразделениеКомпании,
				|	СогласованныеЦены.ГруппаПоставки КАК ГруппаПоставки,
				|	СогласованныеЦены.Контрагент КАК Контрагент,
				|	СогласованныеЦены.Приоритет КАК Приоритет,
				|	СогласованныеЦены.Период КАК ДатаНачалаДействия,
				|	СогласованныеЦены.СрокДействия КАК СрокДействия,
				|	СогласованныеЦены.Регистратор КАК Регистратор,
				|	СогласованныеЦены.Цена КАК СогласованнаяЦена,
				|	СогласованныеЦены.МинимальныйЗаказ1 КАК МинимальныйЗаказ1,
				|	СогласованныеЦены.МинимальныйЗаказ2 КАК МинимальныйЗаказ2,
				|	СогласованныеЦены.КвантПоставки КАК КвантПоставки
				|ПОМЕСТИТЬ ТаблицаСогласованныеЦены
				|ИЗ
				|	РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
				|	ЛЕВОЕ СОЕДИНЕНИЕ Ассортимент КАК Ассортимент
				|	ПО СогласованныеЦены.Номенклатура = Ассортимент.Номенклатура
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСв
				|	ПО ДопСв.Объект=СогласованныеЦены.Номенклатура И ДопСв.Свойство=&свЗаказИзЦО
				|	ЛЕВОЕ СОЕДИНЕНИЕ СтатусыЗаказов КАК СтатусыЗаказов
				|	ПО СтатусыЗаказов.Номенклатура=СогласованныеЦены.Номенклатура
				|ГДЕ
				|	(СогласованныеЦены.ПодразделениеКомпании = &ПодразделениеСоглЦен ИЛИ СогласованныеЦены.ГруппаПоставки = &ГруппаПоставки)
				|	И СогласованныеЦены.СрокДействия >= &НаДату
				|	И СогласованныеЦены.Период <= &НаДату
				|	И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&Номенклатура)
				|	И СогласованныеЦены.Номенклатура НЕ В ИЕРАРХИИ(&Исключения)
				|	И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&ОтборПользователя)
				|	И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&ГруппыПользователя)
				|	И Ассортимент.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
				|	И ЕСТЬNULL(ДопСв.Значение, ЛОЖЬ) = &ЗаказИзЦО
				|	И ЕСТЬNULL(СтатусыЗаказов.Транзит, &Транзит)=&Транзит
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура, ПодразделениеКомпании, ГруппаПоставки, Контрагент";
				
				Запрос.УстановитьПараметр("ГруппаПоставкиМагазина", ПодразделениеКомпании.ГруппаПоставки);
				Запрос.УстановитьПараметр("Транзит", ЗначениеЗаполнено(СубПоставщик));
				
			Иначе
				
				Запрос.Текст = "
				|ВЫБРАТЬ
				|	СогласованныеЦены.Номенклатура КАК Номенклатура,
				|	СогласованныеЦены.ПодразделениеКомпании КАК ПодразделениеКомпании,
				|	СогласованныеЦены.ГруппаПоставки КАК ГруппаПоставки,
				|	СогласованныеЦены.Контрагент КАК Контрагент,
				|	СогласованныеЦены.Приоритет КАК Приоритет,
				|	СогласованныеЦены.Период КАК ДатаНачалаДействия,
				|	СогласованныеЦены.СрокДействия КАК СрокДействия,
				|	СогласованныеЦены.Регистратор КАК Регистратор,
				|	СогласованныеЦены.Цена КАК СогласованнаяЦена,
				|	СогласованныеЦены.МинимальныйЗаказ1 КАК МинимальныйЗаказ1,
				|	СогласованныеЦены.МинимальныйЗаказ2 КАК МинимальныйЗаказ2,
				|	СогласованныеЦены.КвантПоставки КАК КвантПоставки
				|ПОМЕСТИТЬ ТаблицаСогласованныеЦены
				|ИЗ
				|	РегистрСведений.СогласованныеЦены КАК СогласованныеЦены
				|	ЛЕВОЕ СОЕДИНЕНИЕ Ассортимент КАК Ассортимент
				|	ПО СогласованныеЦены.Номенклатура = Ассортимент.Номенклатура
				|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеСведения КАК ДопСв
				|	ПО ДопСв.Объект=СогласованныеЦены.Номенклатура И ДопСв.Свойство=&свЗаказИзЦО
				|ГДЕ
				|	(СогласованныеЦены.ПодразделениеКомпании = &ПодразделениеСоглЦен ИЛИ СогласованныеЦены.ГруппаПоставки = &ГруппаПоставки)
				|	И СогласованныеЦены.СрокДействия >= &НаДату
				|	И СогласованныеЦены.Период <= &НаДату
				|	И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&Номенклатура)
				|	И СогласованныеЦены.Номенклатура НЕ В ИЕРАРХИИ(&Исключения)
				|	И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&ОтборПользователя)
				|	И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&ГруппыПользователя)
				|	И Ассортимент.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
				|	И ЕСТЬNULL(ДопСв.Значение, ЛОЖЬ) = &ЗаказИзЦО
				|ИНДЕКСИРОВАТЬ ПО
				|	Номенклатура, ПодразделениеКомпании, ГруппаПоставки, Контрагент";
				
			КонецЕсли;
			
			Если МассивНоменклатуры.Количество()>0 Тогда
				Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&Номенклатура)", "");
			КонецЕсли;
			Если ОтборПользователя.Количество()>0 Тогда
				Запрос.УстановитьПараметр("ОтборПользователя", ОтборПользователя);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&ОтборПользователя)", "");
			КонецЕсли;
			Если МассивИсключений.Количество()>0 Тогда
				Запрос.УстановитьПараметр("Исключения", МассивИсключений);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СогласованныеЦены.Номенклатура НЕ В ИЕРАРХИИ(&Исключения)", "");
			КонецЕсли;
			Если МассивГруппПользователя.Количество()>0 Тогда
				Запрос.УстановитьПараметр("ГруппыПользователя", МассивГруппПользователя);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&ГруппыПользователя)", "");
			КонецЕсли;
			свЗаказИзЦО = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Заказывается из ЦО");
			Запрос.УстановитьПараметр("свЗаказИзЦО", свЗаказИзЦО);
			Если свЗаказИзЦО=Неопределено ИЛИ ФормированиеЗаказаВЦО Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ЕСТЬNULL(ДопСв.Значение, ЛОЖЬ) = &ЗаказИзЦО", "");
			Иначе
				Запрос.УстановитьПараметр("ЗаказИзЦО", ФормированиеЗаказаВЦО);
			КонецЕсли;	
			Если НеУчитыватьАссортимент Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ассортимент.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)", "");
			КонецЕсли;
			
			Запрос.Выполнить();
			
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	СогласованныеЦены.Контрагент КАК Контрагент,
			|	СогласованныеЦены.Номенклатура КАК Номенклатура,
			|	МИНИМУМ(СогласованныеЦены.МинимальныйЗаказ1) КАК МинимальныйЗаказ1,
			|	МИНИМУМ(СогласованныеЦены.МинимальныйЗаказ2) КАК МинимальныйЗаказ2,
			|	МАКСИМУМ(СогласованныеЦены.КвантПоставки) КАК КвантПоставки,
			|	МАКСИМУМ(СогласованныеЦены.СогласованнаяЦена) КАК Цена
			|ПОМЕСТИТЬ СогласованныеЦены
			|ИЗ
			|	ТаблицаСогласованныеЦены КАК СогласованныеЦены
			|ГДЕ
			|	СогласованныеЦены.Регистратор В
			|			(ВЫБРАТЬ ПЕРВЫЕ 1
			|				ТаблицаСогласованныеЦены.Регистратор КАК Регистратор
			|			ИЗ
			|				ТаблицаСогласованныеЦены КАК ТаблицаСогласованныеЦены
			|			ГДЕ
			|				ТаблицаСогласованныеЦены.Номенклатура = СогласованныеЦены.Номенклатура
			//|				И ТаблицаСогласованныеЦены.Контрагент = СогласованныеЦены.Контрагент
			|				И (НЕ ТаблицаСогласованныеЦены.Номенклатура В(&БиржевыеТовары) ИЛИ ТаблицаСогласованныеЦены.Контрагент=&Контрагент)
			|				И ТаблицаСогласованныеЦены.ПодразделениеКомпании = СогласованныеЦены.ПодразделениеКомпании
			|				И ТаблицаСогласованныеЦены.ГруппаПоставки = СогласованныеЦены.ГруппаПоставки
			|			УПОРЯДОЧИТЬ ПО
			|				ТаблицаСогласованныеЦены.Приоритет УБЫВ,
			|				ТаблицаСогласованныеЦены.ДатаНачалаДействия УБЫВ,
			|				ТаблицаСогласованныеЦены.Регистратор.Дата УБЫВ,
			|				ТаблицаСогласованныеЦены.СрокДействия)
			//|				ВЫБОР КОГДА ТаблицаСогласованныеЦены.Контрагент=&Контрагент ТОГДА 1 ИНАЧЕ 0 КОНЕЦ УБЫВ)
			|	И СогласованныеЦены.СогласованнаяЦена<>0	
			|СГРУППИРОВАТЬ ПО
			|	СогласованныеЦены.Контрагент,
			|	СогласованныеЦены.Номенклатура
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура";
			Запрос.Выполнить();
			
		Иначе //ВариантФормирования <> 0
			
			Запрос.Текст = "
			|ВЫБРАТЬ
			|	ВнешнийЗапросЦен.Номенклатура КАК Номенклатура,
			|	ВнешнийЗапросЦен.ПодразделениеКомпании КАК ПодразделениеКомпании,
			|	ВнешнийЗапросЦен.ГруппаПоставки КАК ГруппаПоставки,
			|	ВнешнийЗапросЦен.Контрагент КАК Контрагент,
			|	ВнешнийЗапросЦен.Цена КАК Цена,
			|	ВнешнийЗапросЦен.МинимальныйЗаказ1 КАК МинимальныйЗаказ1,
			|	ВнешнийЗапросЦен.МинимальныйЗаказ2 КАК МинимальныйЗаказ2,
			|	ВнешнийЗапросЦен.КвантПоставки КАК КвантПоставки
			|ПОМЕСТИТЬ ТаблицаСогласованныеЦены
			|ИЗ
			|	&ВнешнийЗапросЦен КАК ВнешнийЗапросЦен
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура
			|;
			|
			|ВЫБРАТЬ
			|	СогласованныеЦены.Контрагент КАК Контрагент,
			|	СогласованныеЦены.Номенклатура КАК Номенклатура,
			|	МАКСИМУМ(СогласованныеЦены.Цена) КАК Цена,
			|	МИНИМУМ(СогласованныеЦены.МинимальныйЗаказ1) КАК МинимальныйЗаказ1,
			|	МИНИМУМ(СогласованныеЦены.МинимальныйЗаказ2) КАК МинимальныйЗаказ2,
			|	МАКСИМУМ(СогласованныеЦены.КвантПоставки) КАК КвантПоставки
			|ПОМЕСТИТЬ СогласованныеЦены
			|ИЗ
			|	ТаблицаСогласованныеЦены КАК СогласованныеЦены
			|	ЛЕВОЕ СОЕДИНЕНИЕ Ассортимент КАК Ассортимент
			|	ПО СогласованныеЦены.Номенклатура = Ассортимент.Номенклатура
			|ГДЕ
			|	(ПодразделениеКомпании = &ПодразделениеСоглЦен ИЛИ ГруппаПоставки = &ГруппаПоставки)
			|	И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&Номенклатура)
			|	И СогласованныеЦены.Номенклатура НЕ В ИЕРАРХИИ(&Исключения)
			|	И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&ГруппыПользователя)
			|	И Ассортимент.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)
			|СГРУППИРОВАТЬ ПО
			|	СогласованныеЦены.Контрагент,
			|	СогласованныеЦены.Номенклатура
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура";
			Запрос.УстановитьПараметр("ВнешнийЗапросЦен", СогласованныеЦены);
			//Запрос.УстановитьПараметр("Пользователь", ПараметрыСеанса.ТекущийПользователь);
			Если МассивНоменклатуры.Количество()>0 Тогда
				Запрос.УстановитьПараметр("Номенклатура", МассивНоменклатуры);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&Номенклатура)", "");
			КонецЕсли;
			Если МассивИсключений.Количество()>0 Тогда
				Запрос.УстановитьПараметр("Исключения", МассивИсключений);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СогласованныеЦены.Номенклатура НЕ В ИЕРАРХИИ(&Исключения)", "");
			КонецЕсли;
			Если МассивГруппПользователя.Количество()>0 Тогда
				Запрос.УстановитьПараметр("ГруппыПользователя", МассивГруппПользователя);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СогласованныеЦены.Номенклатура В ИЕРАРХИИ(&ГруппыПользователя)", "");
			КонецЕсли;
			Если НеУчитыватьАссортимент Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Ассортимент.Состояние = ЗНАЧЕНИЕ(Перечисление.СостоянияТовараВАссортименте.Введен)", "");
			КонецЕсли;
			Если ВариантФормирования=2 Тогда
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ПодразделениеКомпании = &ПодразделениеСоглЦен ИЛИ ГруппаПоставки = &ГруппаПоставки)", "Истина");
			ИначеЕсли ВариантФормирования=3 Тогда
				Если Подразделение<>СемьяОптПодр Тогда //это магазины (нужно определить параметр определяющий графики магазинов при своде)
					Запрос.Текст = СтрЗаменить(Запрос.Текст, "(ПодразделениеКомпании = &ПодразделениеСоглЦен ИЛИ ГруппаПоставки = &ГруппаПоставки)", "Истина");
				КонецЕсли;
			КонецЕсли;
			
			Запрос.Выполнить();
			
		КонецЕсли;
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	СогласованныеЦены.Контрагент КАК Контрагент,
		|	ВЫРАЗИТЬ(СогласованныеЦены.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	СогласованныеЦены.МинимальныйЗаказ1 КАК МинимальныйЗаказ1,
		|	СогласованныеЦены.МинимальныйЗаказ2 КАК МинимальныйЗаказ2,
		|	СогласованныеЦены.КвантПоставки КАК КвантПоставки,
		|	СогласованныеЦены.Цена КАК Цена,
		|	Блокировки.Заблокировано КАК Заблокировано,
		|	Блокировки.СрокДействия КАК ДатаБлокировки
		|ПОМЕСТИТЬ ТоварыКЗаказу
		|ИЗ
		|	СогласованныеЦены КАК СогласованныеЦены
		|	ЛЕВОЕ СОЕДИНЕНИЕ Блокировки КАК Блокировки
		|	ПО Блокировки.Номенклатура=СогласованныеЦены.Номенклатура
		|ГДЕ
		|	СогласованныеЦены.Контрагент=&КонтрагентСолЦен
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		
		Если ВариантФормирования=0 Тогда
			Запрос.УстановитьПараметр("КонтрагентСолЦен", ?(Контрагент=СемьяОпт И ЗначениеЗаполнено(СубПоставщик), СубПоставщик, Контрагент));
		ИначеЕсли ВариантФормирования=3 И ЗначениеЗаполнено(Контрагент) Тогда
			Запрос.УстановитьПараметр("КонтрагентСолЦен", Контрагент);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "СогласованныеЦены.Контрагент=&КонтрагентСолЦен", "Истина");
		КонецЕсли;
		
		Запрос.Выполнить(); //Запрос.МенеджерВременныхТаблиц.Таблицы.Получить(4).ПолучитьДанные().Выгрузить()
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Номенклатура,
		|	Параметр,
		|	Значение
		|ПОМЕСТИТЬ ПараметрыНоменклатуры
		|ИЗ
		|	РегистрСведений.ПараметрыНоменклатуры.СрезПоследних(&НаДату, Подразделение=&Подразделение И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу)) КАК Параметры
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура, Параметр";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Номенклатура,
		|	СУММА(КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ОстаткиТоваров
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&НаДату, СкладКомпании В(&СкладКомпании) И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу)) КАК ОстаткиТоваровКомпании
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Номенклатура,
		|	СУММА(КоличествоОстаток) КАК Количество
		|ПОМЕСТИТЬ ОстаткиРЦ
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваровКомпании.Остатки(&НаДату, СкладКомпании В(&СкладКомпанииРЦ) И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу)) КАК ОстаткиТоваровКомпании
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Номенклатура,
		|	СУММА(ЗаказаноОстаток) КАК Заказано
		|ПОМЕСТИТЬ ТоварыВПути
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&ДатаУчетаЗаказов, ЗаказПоставщику.ПодразделениеКомпании=&Подразделение И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу) И ЗаказПоставщику.СрокПоставки >= &ДатаНезакрытыхЗаказов И &НаДату<>&ДатаНезакрытыхЗаказов) КАК ЗаказыПоставщикамОстатки
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Номенклатура,
		|	СУММА(ЗаказаноОстаток) КАК Заказано
		|ПОМЕСТИТЬ ТоварыНаЗавтра
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НаДату, &ЭтоФрОв И ЗаказПоставщику.ПодразделениеКомпании=&Подразделение И Контрагент=&КонтрагентСемьяОпт И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу) И ЗаказПоставщику.СрокПоставки МЕЖДУ &НаДату И &ДатаЗавтра) КАК ЗаказыПоставщикамОстатки
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Номенклатура,
		|	СУММА(ЗаказаноОстаток) КАК Заказано
		|ПОМЕСТИТЬ ТоварыНаБудущее
		|ИЗ
		|	РегистрНакопления.ЗаказыПоставщикам.Остатки(&НаДату, &ЭтоФрОв И ЗаказПоставщику.ПодразделениеКомпании=&Подразделение И Контрагент=&КонтрагентСемьяОпт И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу) И ЗаказПоставщику.СрокПоставки > &ДатаЗавтра) КАК ЗаказыПоставщикамОстатки
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Штрихкоды.Объект КАК Номенклатура,
		|	МИНИМУМ(Штрихкоды.ЕдиницаИзмерения.Наименование) КАК ТарноеМесто
		|ПОМЕСТИТЬ ТарныеМеста
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.Объект В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу)
		|	И Штрихкоды.ЕдиницаИзмерения.Коэффициент <> 1
		|СГРУППИРОВАТЬ ПО
		|	Штрихкоды.Объект
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ЕдиницыИзмерения.Владелец КАК Номенклатура,
		|	МАКСИМУМ(ЕдиницыИзмерения.Наименование) КАК ТарноеМесто
		|ПОМЕСТИТЬ ТарныеМеста2
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	(ЕдиницыИзмерения.Владелец В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу)
		|	И ЕдиницыИзмерения.Коэффициент <> 1 ИЛИ ЕдиницыИзмерения.Наименование ПОДОБНО ""1*%"")
		|СГРУППИРОВАТЬ ПО
		|	ЕдиницыИзмерения.Владелец
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ЕдиницыИзмерения.Владелец КАК Номенклатура,
		|	МАКСИМУМ(ЕдиницыИзмерения.Коэффициент) КАК КвантПаллеты
		|ПОМЕСТИТЬ КвантыПаллет
		|ИЗ
		|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
		|ГДЕ
		|	(ЕдиницыИзмерения.Владелец В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу)
		|	И ЕдиницыИзмерения.Наименование ПОДОБНО ""Палета"")
		|СГРУППИРОВАТЬ ПО
		|	ЕдиницыИзмерения.Владелец
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Цены.Номенклатура КАК Номенклатура,
		|	МАКСИМУМ(Цены.Цена) КАК Цена
		|ПОМЕСТИТЬ ТаблицаЦен
		|ИЗ
		|	РегистрСведений.Цены.СрезПоследних(&НаДату, ТипЦен=&ТипЦены И ПодразделениеКомпании=&Подразделение И Контрагент=ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка) И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу)) КАК Цены
		|ГДЕ
		|	Цены.Цена > 0
		|СГРУППИРОВАТЬ ПО
		|	Цены.Номенклатура
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Объект КАК Номенклатура,
		|	Истина КАК Действует,
		|	МАКСИМУМ(ДополнительныйЗапас) КАК НуженДопЗапас
		|ПОМЕСТИТЬ Акции
		|ИЗ
		|	РегистрСведений.СкидкиСтроки.СрезПоследних(, СрокДействия>=&НаДату И ПодразделениеКомпании=&Подразделение И Объект В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу)) КАК СкидкиСтроки
		|ГДЕ
		|	Действует И Период<=&ДатаДляАкции
		|СГРУППИРОВАТЬ ПО
		|	Объект
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура";
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Номенклатура КАК Номенклатура,
		|	СУММА(КоличествоОборот) КАК ПродажаЗаПериод
		|ПОМЕСТИТЬ ПроизвольныеПродажи
		|ИЗ
		|	РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Период, СкладКомпании В(&СкладКомпании) И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу)) КАК ПродажиОбороты
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура";
		
		Если НЕ ЗначениеЗаполнено(НачалоАнализаПродаж) И НЕ ЗначениеЗаполнено(КонецАнализаПродаж) Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыКЗаказу)", "Ложь");
		КонецЕсли;
		
		Запрос.Выполнить();
		
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	ТоварыКЗаказу.Контрагент КАК Контрагент,
		|	ТоварыКЗаказу.Номенклатура КАК Номенклатура,
		|	ТоварыКЗаказу.Заблокировано КАК Заблокировано,
		|	ТоварыКЗаказу.ДатаБлокировки КАК ДатаБлокировки,
		|	ТоварыКЗаказу.Цена КАК Цена,
		|	ВЫБОР КОГДА Истина ТОГДА ТоварыКЗаказу.МинимальныйЗаказ1 ИНАЧЕ ТоварыКЗаказу.МинимальныйЗаказ2 КОНЕЦ КАК МинимальныйЗаказ,
		|	ВЫБОР КОГДА ТоварыКЗаказу.КвантПоставки=0 ТОГДА
		|		ВЫБОР КОГДА ТоварыКЗаказу.Номенклатура.КратностьПоставок=0 ТОГДА
		|			ВЫБОР КОГДА ТоварыКЗаказу.Номенклатура.ТипНоменклатуры.Весовой ТОГДА
		|				0.001
		|			ИНАЧЕ
		|				1
		|			КОНЕЦ
		|		ИНАЧЕ
		|			ТоварыКЗаказу.Номенклатура.КратностьПоставок
		|		КОНЕЦ
		|	ИНАЧЕ
		|		ТоварыКЗаказу.КвантПоставки
		|	КОНЕЦ КАК КвантПоставки,
		|	ЕСТЬNULL(ПараметрПотребность.Значение,0) КАК РасчетнаяПотребность,
		|	ВЫБОР КОГДА ЕСТЬNULL(Акции.Действует, Ложь) ТОГДА ЕСТЬNULL(ПараметрМинОстатокАкции.Значение,0) ИНАЧЕ ЕСТЬNULL(ПараметрМинОстаток.Значение,0) КОНЕЦ КАК МинимальныйОстаток,
		|	ВЫБОР КОГДА ЕСТЬNULL(Акции.НуженДопЗапас, Ложь) ТОГДА ЕСТЬNULL(ПараметрДопЗапас.Значение,0) ИНАЧЕ 0 КОНЕЦ ДопЗапасНаАкцию,
		|	ЕСТЬNULL(ОстаткиТоваров.Количество,0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ОстаткиРЦ.Количество,0) КАК ОстатокРЦ,
		|	ЕСТЬNULL(ТоварыВПути.Заказано,0) КАК КоличествоВПути,
		|	ЕСТЬNULL(ТарныеМеста.ТарноеМесто, ЕСТЬNULL(ТарныеМеста2.ТарноеМесто, """")) КАК ТарноеМесто,
		|	ЕСТЬNULL(КвантыПаллет.КвантПаллеты,0) КАК КвантПаллеты,
		|	ЕСТЬNULL(ТаблицаЦен.Цена, 0) КАК ЦенаРозничная,
		|	ЕСТЬNULL(Акции.Действует, Ложь) КАК ЕстьАкция,
		|	ЕСТЬNULL(ПроизвольныеПродажи.ПродажаЗаПериод, 0) КАК ПродажаЗаПериод,
		|	ЕСТЬNULL(ТоварыНаЗавтра.Заказано, 0) КАК ПоставкаЗавтра,
		|	ЕСТЬNULL(ТоварыНаБудущее.Заказано, 0) КАК ПоставкаВБудущем
		|ИЗ
		|	ТоварыКЗаказу КАК ТоварыКЗаказу
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыНоменклатуры КАК ПараметрПотребность
		|	ПО ТоварыКЗаказу.Номенклатура=ПараметрПотребность.Номенклатура И ПараметрПотребность.Параметр=&ПараметрРасчета
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыНоменклатуры КАК ПараметрМинОстаток
		|	ПО ТоварыКЗаказу.Номенклатура=ПараметрМинОстаток.Номенклатура И ПараметрМинОстаток.Параметр=ЗНАЧЕНИЕ(Справочник.ПараметрыНоменклатуры.МинимальныйОстаток)
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыНоменклатуры КАК ПараметрМинОстатокАкции
		|	ПО ТоварыКЗаказу.Номенклатура=ПараметрМинОстаток.Номенклатура И ПараметрМинОстаток.Параметр=ЗНАЧЕНИЕ(Справочник.ПараметрыНоменклатуры.МинимальныйОстатокНаПериодАкции)
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПараметрыНоменклатуры КАК ПараметрДопЗапас
		|	ПО ТоварыКЗаказу.Номенклатура=ПараметрДопЗапас.Номенклатура И ПараметрДопЗапас.Параметр=ЗНАЧЕНИЕ(Справочник.ПараметрыНоменклатуры.ДополнительныйЗапасНаАкцию)
		|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиТоваров КАК ОстаткиТоваров
		|	ПО ТоварыКЗаказу.Номенклатура=ОстаткиТоваров.Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТоварыВПути КАК ТоварыВПути
		|	ПО ТоварыКЗаказу.Номенклатура=ТоварыВПути.Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТарныеМеста КАК ТарныеМеста
		|	ПО ТоварыКЗаказу.Номенклатура=ТарныеМеста.Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТарныеМеста2 КАК ТарныеМеста2
		|	ПО ТоварыКЗаказу.Номенклатура=ТарныеМеста2.Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ КвантыПаллет КАК КвантыПаллет
		|	ПО ТоварыКЗаказу.Номенклатура=КвантыПаллет.Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаЦен КАК ТаблицаЦен
		|	ПО ТоварыКЗаказу.Номенклатура=ТаблицаЦен.Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ Акции КАК Акции
		|	ПО ТоварыКЗаказу.Номенклатура=Акции.Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ ОстаткиРЦ КАК ОстаткиРЦ
		|	ПО ТоварыКЗаказу.Номенклатура=ОстаткиРЦ.Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ ПроизвольныеПродажи КАК ПроизвольныеПродажи
		|	ПО ТоварыКЗаказу.Номенклатура=ПроизвольныеПродажи.Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаЗавтра КАК ТоварыНаЗавтра
		|	ПО ТоварыКЗаказу.Номенклатура=ТоварыНаЗавтра.Номенклатура
		|	ЛЕВОЕ СОЕДИНЕНИЕ ТоварыНаБудущее КАК ТоварыНаБудущее
		|	ПО ТоварыКЗаказу.Номенклатура=ТоварыНаБудущее.Номенклатура
		|";
		
		тзТоварыКЗаказу = Запрос.Выполнить().Выгрузить();
		
		Если тзТоварыКЗаказу.Количество()=0 Тогда
			//ВывестиСообщение(НСтр("ru='Нет товаров для заказа по контрагенту " + Контрагент + ".'"));
			Возврат Ложь;
		КонецЕсли;
		
		//переопределим квант поставки, если он указан в единицах измерения
		Если Специфика="Реми" Тогда
			Для Каждого ТекущаяСтрока Из тзТоварыКЗаказу Цикл
				КвантПоставки = ПолучитьКвантыПоставки(ТекущаяСтрока.Контрагент, Подразделение, ТекущаяСтрока.Номенклатура);
				Если КвантПоставки<>Неопределено Тогда
					ТекущаяСтрока.КвантПоставки = КвантПоставки;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
		
		//определим средние продажи
		
		ЗапросПериодВыбытия = Новый Запрос("
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ВнешнийИсточник.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура
		|ПОМЕСТИТЬ ТоварыКЗаказу
		|ИЗ
		|	&ВнешнийИсточник КАК ВнешнийИсточник
		|;
		|
		|///////////////////////////////////////
		|ВЫБРАТЬ
		|	Номенклатура,
		|	МАКСИМУМ(ПериодВыбытия) КАК ПериодВыбытия,
		|	МАКСИМУМ(УчетДней) КАК УчетДней
		|ИЗ
		|	(ВЫБРАТЬ
		|		Номенклатура,
		|		ВЫБОР КОГДА Номенклатура.Родитель.ПериодВыбытия<>0 ТОГДА Номенклатура.Родитель.ПериодВыбытия
		|			КОГДА Номенклатура.Родитель.Родитель.ПериодВыбытия<>0 ТОГДА Номенклатура.Родитель.Родитель.ПериодВыбытия
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.ПериодВыбытия<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.ПериодВыбытия
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.ПериодВыбытия
		|		ИНАЧЕ &ПериодВыбытияПоУмолчанию КОНЕЦ КАК ПериодВыбытия,
		|		0 КАК УчетДней
		|	ИЗ
		|		ТоварыКЗаказу КАК ТоварыКЗаказу
		|	ОБЪЕДИНИТЬ ВСЕ
		|	ВЫБРАТЬ
		|		Номенклатура,
		|		0,
		|		ВЫБОР КОГДА Номенклатура.Родитель.УчетДнейПриРасчетеЗаказа<>0 ТОГДА Номенклатура.Родитель.УчетДнейПриРасчетеЗаказа
		|			КОГДА Номенклатура.Родитель.Родитель.УчетДнейПриРасчетеЗаказа<>0 ТОГДА Номенклатура.Родитель.Родитель.УчетДнейПриРасчетеЗаказа
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа
		|			КОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа<>0 ТОГДА Номенклатура.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.Родитель.УчетДнейПриРасчетеЗаказа
		|		ИНАЧЕ &УчетДнейПоУмолчанию КОНЕЦ
		|	ИЗ
		|		ТоварыКЗаказу КАК ТоварыКЗаказу) КАК ВложенныйЗапрос
		|СГРУППИРОВАТЬ ПО
		|	Номенклатура");
		ЗапросПериодВыбытия.УстановитьПараметр("ВнешнийИсточник", тзТоварыКЗаказу);
		ЗапросПериодВыбытия.УстановитьПараметр("УчетДнейПоУмолчанию", УчетДнейПриРасчетеЗаказаПоУмолчанию);
		ЗапросПериодВыбытия.УстановитьПараметр("ПериодВыбытияПоУмолчанию", ПериодВыбытияПоУмолчанию);
		тзПериодВыбытия = ЗапросПериодВыбытия.Выполнить().Выгрузить();
		
		тзПериодов = тзПериодВыбытия.Скопировать(,"ПериодВыбытия");
		тзПериодов.Свернуть("ПериодВыбытия");
		
		тзПродажиПоДням = Новый ТаблицаЗначений;
		тзПродажиПоДням.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзПродажиПоДням.Колонки.Добавить("КоличествоОборот", Новый ОписаниеТипов("Число"));
		тзПродажиПоДням.Колонки.Добавить("КоличествоОстаток", Новый ОписаниеТипов("Число"));
		тзПродажиПоДням.Колонки.Добавить("День", Новый ОписаниеТипов("Дата"));
		
		тзПродаж = Новый ТаблицаЗначений;
		тзПродаж.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
		тзПродаж.Колонки.Добавить("КоличествоОборот", Новый ОписаниеТипов("Число"), Новый КвалификаторыЧисла(15,3));
		тзПродаж.Колонки.Добавить("ДнейПродаж", Новый ОписаниеТипов("Число"), Новый КвалификаторыЧисла(5,0));
		тзПродаж.Колонки.Добавить("СреднийОборот", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(15,3)));
		тзПродаж.Колонки.Добавить("ПериодВыбытия", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(3,0)));
		тзПродаж.Колонки.Добавить("УчетДней", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(1,0)));
		
		ДопРеквизитСобственноеЮЛ = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("СобственноеЮЛ");
		
		//обходим заданные периоды
		Для Каждого текПериод Из тзПериодов Цикл
			
			//конПериода = НачалоДня(Объект.Дата)-1;
			конПериода = КонецДня(ДатаАнализа);
			начПериода = НачалоДня(конПериода - ((текПериод.ПериодВыбытия-1) * 86400));
			//стрНачалоПериода = "ДАТАВРЕМЯ(" + Формат(Год(начПериода),"ЧГ=") + "," + Месяц(начПериода) + "," + День(начПериода) + ")";
			//стрКонецПериода = "ДАТАВРЕМЯ(" + Формат(Год(конПериода),"ЧГ=") + "," + Месяц(конПериода) + "," + День(конПериода) + ",23,59,59)";
			
			//получим продажи товаров по дням
			ТекстЗапросПродажи = "
			|ВЫБРАТЬ
			|	ВнешнийИсточник.Номенклатура,
			|	ВнешнийИсточник.ПериодВыбытия
			|ПОМЕСТИТЬ ТоварыВыбытия
			|ИЗ
			|	&ВнешнийИсточник КАК ВнешнийИсточник
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура
			|;
			|
			|///////////////////////////////////////
			|ВЫБРАТЬ
			|	Номенклатура,
			|	День,
			|	СУММА(КоличествоОборот-КоличествоУценка) КАК КоличествоОборот,
			|	СУММА(КоличествоУценка) КАК КоличествоУценка		
			|ИЗ (";
			
			Если Специфика="Семья" Тогда
				ТекстЗапросПродажи = ТекстЗапросПродажи + "
				|	ВЫБРАТЬ
				|		ПродажиОбороты.Номенклатура КАК Номенклатура,
				|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ) КАК День,
				|		СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
				|		0 КАК КоличествоУценка
				|	ИЗ
				|		РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Регистратор, СкладКомпании В(&СкладКомпании) И НЕ Покупатель В(&КонтрагентыИсключения) И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыВыбытия ГДЕ ПериодВыбытия=" + текПериод.ПериодВыбытия + ")) КАК ПродажиОбороты
				|	СГРУППИРОВАТЬ ПО
				|		ПродажиОбороты.Номенклатура,
				|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ)
				|
				|	ОБЪЕДИНИТЬ ВСЕ
				|
				|	ВЫБРАТЬ
				|		ПродажиУценка.Номенклатура,
				|		НАЧАЛОПЕРИОДА(ПродажиУценка.Период, ДЕНЬ),
				|		0,
				|		СУММА(ПродажиУценка.КоличествоОборот)
				|	ИЗ
				|		РегистрНакопления.РСПродажиУценка.Обороты(&НачалоПериода, &КонецПериода, Регистратор, СкладКомпании В(&СкладКомпании) И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыВыбытия ГДЕ ПериодВыбытия=" + текПериод.ПериодВыбытия + ")) КАК ПродажиУценка
				|	СГРУППИРОВАТЬ ПО
				|		ПродажиУценка.Номенклатура,
				|		НАЧАЛОПЕРИОДА(ПродажиУценка.Период, ДЕНЬ)";
			Иначе
				ТекстЗапросПродажи = ТекстЗапросПродажи + "
				|	ВЫБРАТЬ
				|		ПродажиОбороты.Номенклатура КАК Номенклатура,
				|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ) КАК День,
				|		СУММА(ПродажиОбороты.КоличествоОборот) КАК КоличествоОборот,
				|		0 КАК КоличествоУценка
				|	ИЗ
				|		РегистрНакопления.Продажи.Обороты(&НачалоПериода, &КонецПериода, Регистратор, СкладКомпании В(&СкладКомпании) И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыВыбытия ГДЕ ПериодВыбытия=" + текПериод.ПериодВыбытия + ")) КАК ПродажиОбороты
				|	СГРУППИРОВАТЬ ПО
				|		ПродажиОбороты.Номенклатура,
				|		НАЧАЛОПЕРИОДА(ПродажиОбороты.Период, ДЕНЬ)
				|
				|	ОБЪЕДИНИТЬ ВСЕ
				|
				|	ВЫБРАТЬ
				|		Номенклатура,
				|		НАЧАЛОПЕРИОДА(Период, ДЕНЬ),
				|		СУММА(Количество),
				|		0
				|	ИЗ
				|		РегистрНакопления.ОстаткиТоваровКомпании КАК ОстаткиТоваровКомпании
				|	ГДЕ
				|		ВидДвижения=ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
				|		И Период МЕЖДУ &НачалоПериода И &КонецПериода
				|		И СкладКомпании В(&СкладКомпании)
				|		И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыВыбытия ГДЕ ПериодВыбытия=" + текПериод.ПериодВыбытия + ")
				|		И ХозОперация=ЗНАЧЕНИЕ(Справочник.ХозОперации.ПередачаИнгредиентовВПроизводство)
				|	СГРУППИРОВАТЬ ПО
				|		Номенклатура,
				|		НАЧАЛОПЕРИОДА(Период, ДЕНЬ)";
			КонецЕсли;
			
			ТекстЗапросПродажи = ТекстЗапросПродажи + ") КАК ВложенныйЗапрос
			|СГРУППИРОВАТЬ ПО
			|	Номенклатура,
			|	День
			|ИТОГИ
			|	СУММА(КоличествоОборот),
			|	СУММА(КоличествоУценка)
			|ПО
			|	Номенклатура";
			Запрос = Новый Запрос(ТекстЗапросПродажи);
			Запрос.УстановитьПараметр("НачалоПериода", начПериода);
			Запрос.УстановитьПараметр("КонецПериода", конПериода);
			Запрос.УстановитьПараметр("ВнешнийИсточник", тзПериодВыбытия);
			Запрос.УстановитьПараметр("СкладКомпании", МассивСкладов);
			
			Если Специфика="Семья" Тогда
				ЗапросКонтрагентов = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ Ссылка ИЗ Справочник.Контрагенты.ДополнительныеРеквизиты ГДЕ Свойство=&Свойство");
				ЗапросКонтрагентов.УстановитьПараметр("Свойство", ДопРеквизитСобственноеЮЛ);
				тзКонтрагентовИсключения = ЗапросКонтрагентов.Выполнить().Выгрузить();
				Запрос.УстановитьПараметр("КонтрагентыИсключения", тзКонтрагентовИсключения.ВыгрузитьКолонку("Ссылка")); 
			КонецЕсли;
			
			ДеревоПродажЗаПериод = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			//сформируем таблицу остатков по дням периода
			Запрос = Новый Запрос("
			|ВЫБРАТЬ
			|	ВнешнийИсточник.Номенклатура,
			|	ВнешнийИсточник.ПериодВыбытия
			|ПОМЕСТИТЬ ТоварыВыбытия
			|ИЗ
			|	&ВнешнийИсточник КАК ВнешнийИсточник
			|ИНДЕКСИРОВАТЬ ПО
			|	Номенклатура
			|;
			|
			|///////////////////////////////////////
			|ВЫБРАТЬ
			|	Остатки.Номенклатура КАК Номенклатура,
			|	НАЧАЛОПЕРИОДА(Остатки.Период, ДЕНЬ) КАК День,
			//|	СУММА(Остатки.КоличествоНачальныйОстаток) КАК КоличествоОстаток
			|	СУММА(Остатки.КоличествоКонечныйОстаток) КАК КоличествоОстаток
			|ИЗ
			//|	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(" + стрНачалоПериода + ", " + стрКонецПериода + ", День, ,СкладКомпании В(&СкладКомпании) И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыВыбытия ГДЕ ПериодВыбытия=" + текПериод.ПериодВыбытия + ")) КАК Остатки
			|	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, День, ,СкладКомпании В(&СкладКомпании) И Номенклатура В(ВЫБРАТЬ Номенклатура ИЗ ТоварыВыбытия ГДЕ ПериодВыбытия=" + текПериод.ПериодВыбытия + ")) КАК Остатки
			|СГРУППИРОВАТЬ ПО
			|	Остатки.Номенклатура,
			|	НАЧАЛОПЕРИОДА(Остатки.Период, ДЕНЬ)
			|ИТОГИ
			|	СУММА(КоличествоОстаток) 
			|ПО
			|	Остатки.Номенклатура
			|");
			Запрос.УстановитьПараметр("НачалоПериода", начПериода);
			Запрос.УстановитьПараметр("КонецПериода", конПериода);
			Запрос.УстановитьПараметр("ВнешнийИсточник", тзПериодВыбытия);
			Запрос.УстановитьПараметр("СкладКомпании", МассивСкладов);
			ДеревоОстатковЗаПериод = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			//получаем товары с параметрами выбытия, относящикся к данному периоду
			МассивНайденныхСтрок = тзПериодВыбытия.НайтиСтроки(Новый Структура("ПериодВыбытия", текПериод.ПериодВыбытия));
			
			Для Каждого ТекущаяСтрока Из МассивНайденныхСтрок Цикл
				
				НоваяСтрокаПродаж = тзПродаж.Добавить();
				НоваяСтрокаПродаж.Номенклатура		= ТекущаяСтрока.Номенклатура;
				НоваяСтрокаПродаж.ПериодВыбытия		= ТекущаяСтрока.ПериодВыбытия;
				НоваяСтрокаПродаж.УчетДней			= ТекущаяСтрока.УчетДней;
				
				СтрокаДереваПродаж = ДеревоПродажЗаПериод.Строки.Найти(ТекущаяСтрока.Номенклатура, "Номенклатура");
				СтрокаДереваОстатков = ДеревоОстатковЗаПериод.Строки.Найти(ТекущаяСтрока.Номенклатура, "Номенклатура");
				
				тзПродажиПоДням.Очистить();
				
				//формируем таблицу продаж по дням за весь период выбытия
				КоличествоОстаток = 0;
				Для День=0 По текПериод.ПериодВыбытия-1 Цикл	//Для День=0 По текПериод.ПериодВыбытия Цикл
					ДеньПериода = НачалоДня(ДатаАнализа)-(текПериод.ПериодВыбытия-День-1)*86400; //ДеньПериода = НачалоДня(Объект.Дата)-(текПериод.ПериодВыбытия-День)*86400;
					КоличествоОборот = 0; //КоличествоОстаток = 0;
					
					Если СтрокаДереваПродаж<>Неопределено Тогда
						СтрокаПериодаПродаж = СтрокаДереваПродаж.Строки.Найти(ДеньПериода, "День");
						Если СтрокаПериодаПродаж<>Неопределено Тогда
							КоличествоОборот = СтрокаПериодаПродаж.КоличествоОборот;
						КонецЕсли;
					КонецЕсли;
					
					Если СтрокаДереваОстатков<>Неопределено Тогда
						СтрокаПериодаОстатка = СтрокаДереваОстатков.Строки.Найти(ДеньПериода, "День");
						Если СтрокаПериодаОстатка<>Неопределено Тогда
							КоличествоОстаток = СтрокаПериодаОстатка.КоличествоОстаток;
						КонецЕсли;
					КонецЕсли;
					
					////////////////////////////////////////////////
					//Определяем дни выбытия по параметру <УчетДней>
					
					Если ТекущаяСтрока.УчетДней=3 ИЛИ ТекущаяСтрока.УчетДней=6 Тогда //Все дни
						
						НоваяСтрока = тзПродажиПоДням.Добавить();
						НоваяСтрока.Номенклатура		= ТекущаяСтрока.Номенклатура;
						НоваяСтрока.КоличествоОборот	= КоличествоОборот;
						НоваяСтрока.КоличествоОстаток	= КоличествоОстаток;
						НоваяСтрока.День				= ДеньПериода;
						
					ИначеЕсли ТекущаяСтрока.УчетДней=2 ИЛИ ТекущаяСтрока.УчетДней=5 Тогда //Дни, когда товар продавался
						
						Если КоличествоОборот>0 Тогда
							
							НоваяСтрока = тзПродажиПоДням.Добавить();
							НоваяСтрока.Номенклатура		= ТекущаяСтрока.Номенклатура;
							НоваяСтрока.КоличествоОборот	= КоличествоОборот;
							НоваяСтрока.КоличествоОстаток	= КоличествоОстаток;
							НоваяСтрока.День				= ДеньПериода;
							
						КонецЕсли;
						
					ИначеЕсли ТекущаяСтрока.УчетДней=1 ИЛИ ТекущаяСтрока.УчетДней=4 Тогда //Дни, когда товар был на остатках
						
						Если КоличествоОстаток>0 ИЛИ КоличествоОборот>0 Тогда
							
							НоваяСтрока = тзПродажиПоДням.Добавить();
							НоваяСтрока.Номенклатура		= ТекущаяСтрока.Номенклатура;
							НоваяСтрока.КоличествоОборот	= КоличествоОборот;
							НоваяСтрока.КоличествоОстаток	= КоличествоОстаток;
							НоваяСтрока.День				= ДеньПериода;
							
						КонецЕсли;
						
					КонецЕсли;
					
				КонецЦикла;	
				
				/////////////////////////////
				//АКЦИИ
				Если НеУчитыватьАкцииПриАнализеПродаж Тогда
					МассивУдаления = Новый Массив;
					Для Каждого СтрокаПродаж Из тзПродажиПоДням Цикл
						
						//заменим акционные продажи на средние
						Если ПолучитьАкцииНаДату(СтрокаПродаж.День, СтрокаПродаж.Номенклатура) Тогда
							МассивУдаления.Добавить(СтрокаПродаж);
						КонецЕсли;
						
					КонецЦикла;
					
					Для Каждого СтрокаУдаления Из МассивУдаления Цикл
						тзПродажиПоДням.Удалить(СтрокаУдаления);
					КонецЦикла;
				КонецЕсли;
				/////////////////////////////
				
				ДнейПродаж = тзПродажиПоДням.Количество();
				ПродажиЗаПериод = тзПродажиПоДням.Итог("КоличествоОборот");
				
				////////////////////////////////////////////////////
				//получим среднедневные продажи и срежем пики
				Если ПроцентПикаПродаж<>0 И ПродажиЗаПериод>0 Тогда
					СреднийОборот = ПродажиЗаПериод / ?(ДнейПродаж=0, 1, ДнейПродаж);  // без учета акционных дней
					
					МассивУдаления = Новый Массив;
					Для Каждого ДневныеПродажи Из тзПродажиПоДням Цикл
						//расчитаем пик продаж, прибавив процент к средниму обороту
						СреднийОборотНаПике = СреднийОборот + (СреднийОборот / 100 * ПроцентПикаПродаж);
						
						Если ДневныеПродажи.КоличествоОборот>=СреднийОборотНаПике Тогда
							//исключим день и оборот
							МассивУдаления.Добавить(ДневныеПродажи);
						КонецЕсли;
					КонецЦикла;
					
					Для Каждого СтрокаУдаления Из МассивУдаления Цикл
						тзПродажиПоДням.Удалить(СтрокаУдаления);
					КонецЦикла;
				КонецЕсли;
				
				///////////////////////////////////
				//расчитываем среднедневные продажи
				
				НоваяСтрокаПродаж.ДнейПродаж = ДнейПродаж; //тзПродажиПоДням.Количество();
				НоваяСтрокаПродаж.КоличествоОборот = тзПродажиПоДням.Итог("КоличествоОборот");
				НоваяСтрокаПродаж.СреднийОборот = НоваяСтрокаПродаж.КоличествоОборот / ?(НоваяСтрокаПродаж.ДнейПродаж=0, 1, НоваяСтрокаПродаж.ДнейПродаж);
				
			КонецЦикла;
			
		КонецЦикла;
		
		//формируем конечный результат
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	ВнешнийИсточник.Контрагент КАК Контрагент,
		|	ВЫРАЗИТЬ(ВнешнийИсточник.Номенклатура КАК Справочник.Номенклатура) КАК Номенклатура,
		|	ВнешнийИсточник.Заблокировано КАК Заблокировано,
		|	ВнешнийИсточник.ДатаБлокировки КАК ДатаБлокировки,
		|	ВнешнийИсточник.МинимальныйЗаказ КАК МинимальныйЗаказ,
		|	ВнешнийИсточник.КвантПоставки КАК КвантПоставки,
		|	ВнешнийИсточник.РасчетнаяПотребность КАК РасчетнаяПотребность,
		|	ВнешнийИсточник.МинимальныйОстаток КАК МинимальныйОстаток,
		|	ВнешнийИсточник.ДопЗапасНаАкцию КАК ДопЗапасНаАкцию,
		|	ВнешнийИсточник.КоличествоОстаток КАК КоличествоОстаток,
		|	ВнешнийИсточник.ОстатокРЦ КАК ОстатокРЦ,
		|	ВнешнийИсточник.КоличествоВПути КАК КоличествоВПути,
		|	ВнешнийИсточник.ТарноеМесто КАК ТарноеМесто,
		|	ВнешнийИсточник.Цена КАК Цена,
		|	ВнешнийИсточник.ЦенаРозничная КАК ЦенаРозничная,
		|	ВнешнийИсточник.ПродажаЗаПериод КАК ПродажаЗаПериод,
		|	ВнешнийИсточник.ПоставкаЗавтра КАК ПоставкаЗавтра,
		|	ВнешнийИсточник.ПоставкаВБудущем КАК ПоставкаВБудущем
		|ПОМЕСТИТЬ ТоварыКЗаказу
		|ИЗ
		|	&ВнешнийИсточник1 КАК ВнешнийИсточник
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|///////////////////////////////////////
		|ВЫБРАТЬ
		|	ВнешнийИсточник.Номенклатура КАК Номенклатура,
		|	ВнешнийИсточник.ДнейПродаж КАК ДнейПродаж,
		|	ВнешнийИсточник.КоличествоОборот КАК КоличествоОборот,
		|	ВнешнийИсточник.СреднийОборот КАК СреднийОборот,
		|	ВнешнийИсточник.УчетДней КАК УчетДней,
		|	ВнешнийИсточник.ПериодВыбытия КАК ПериодВыбытия,
		|	ВЫБОР КОГДА ВнешнийИсточник.УчетДней<4 ТОГДА Истина ИНАЧЕ Ложь КОНЕЦ КАК УчитыватьОстаток
		|ПОМЕСТИТЬ Продажи
		|ИЗ
		|	&ВнешнийИсточник2 КАК ВнешнийИсточник
		|ИНДЕКСИРОВАТЬ ПО
		|	Номенклатура
		|;
		|
		|///////////////////////////////////////
		|ВЫБРАТЬ
		|	ТоварыКЗаказу.Контрагент КАК Контрагент,
		|	ТоварыКЗаказу.Номенклатура КАК Номенклатура,
		|	ТоварыКЗаказу.Заблокировано КАК Заблокировано,
		|	ТоварыКЗаказу.ДатаБлокировки КАК ДатаБлокировки,
		|	ТоварыКЗаказу.МинимальныйЗаказ КАК МинимальныйЗаказ,
		|	ТоварыКЗаказу.КвантПоставки КАК КвантПоставки,
		|	ТоварыКЗаказу.РасчетнаяПотребность КАК РасчетнаяПотребность,
		|	ТоварыКЗаказу.МинимальныйОстаток КАК МинимальныйОстаток,
		|	ТоварыКЗаказу.ДопЗапасНаАкцию КАК ДопЗапасНаАкцию,
		|	ТоварыКЗаказу.КоличествоОстаток КАК КоличествоОстаток,
		|	ТоварыКЗаказу.ОстатокРЦ КАК ОстатокРЦ,
		|	ТоварыКЗаказу.КоличествоВПути КАК КоличествоВПути,
		|	ТоварыКЗаказу.ТарноеМесто КАК ТарноеМесто,
		|	ТоварыКЗаказу.Цена КАК Цена,
		|	ТоварыКЗаказу.ЦенаРозничная КАК ЦенаРозничная,
		|	ТоварыКЗаказу.ПродажаЗаПериод КАК ПродажаЗаПериод,
		|	ТоварыКЗаказу.ПоставкаЗавтра КАК ПоставкаЗавтра,
		|	ТоварыКЗаказу.ПоставкаВБудущем КАК ПоставкаВБудущем,
		|	ЕСТЬNULL(Продажи.КоличествоОборот,0) КАК КоличествоОборот,
		|	ЕСТЬNULL(Продажи.ДнейПродаж,0) КАК ДнейПродаж,
		|	ЕСТЬNULL(Продажи.СреднийОборот,0) КАК СреднесуточнаяПродажа,
		|	ЕСТЬNULL(Продажи.УчетДней,0) КАК УчетДней,
		|	ЕСТЬNULL(Продажи.ПериодВыбытия,0) КАК ПериодВыбытия,
		|	ВЫБОР
		|		КОГДА &ВариантРасчета=0 ТОГДА ЕСТЬNULL(Продажи.СреднийОборот,0) * &ПромежутокДней
		|		КОГДА &ВариантРасчета=2 ТОГДА ТоварыКЗаказу.РасчетнаяПотребность * &ПромежутокДней
		|		ИНАЧЕ ТоварыКЗаказу.РасчетнаяПотребность
		|	КОНЕЦ
		|	+ ТоварыКЗаказу.МинимальныйОстаток + ТоварыКЗаказу.ДопЗапасНаАкцию - ТоварыКЗаказу.КоличествоВПути
		|	- ВЫБОР КОГДА ЕСТЬNULL(Продажи.УчитыватьОстаток,Истина) И ТоварыКЗаказу.КоличествоОстаток>0 ТОГДА ТоварыКЗаказу.КоличествоОстаток ИНАЧЕ 0 КОНЕЦ
		|	+ ВЫБОР КОГДА &ВариантРасчета=0 И ЕСТЬNULL(Продажи.КоличествоОборот,0)=0 И ТоварыКЗаказу.МинимальныйОстаток+ТоварыКЗаказу.ДопЗапасНаАкцию=0 И ТоварыКЗаказу.КоличествоОстаток<=0 И ТоварыКЗаказу.КоличествоВПути=0 ТОГДА ТоварыКЗаказу.КвантПоставки ИНАЧЕ 0 КОНЕЦ
		|	КАК РекомендуемоеКоличество
		|ПОМЕСТИТЬ РезультатРасчета
		|ИЗ
		|	ТоварыКЗаказу КАК ТоварыКЗаказу
		|	ЛЕВОЕ СОЕДИНЕНИЕ Продажи КАК Продажи
		|	ПО ТоварыКЗаказу.Номенклатура=Продажи.Номенклатура
		|;
		|
		|///////////////////////////////////////
		|ВЫБРАТЬ
		|	РезультатРасчета.Контрагент КАК Контрагент,
		|	РезультатРасчета.Номенклатура КАК Номенклатура,
		|	РезультатРасчета.Заблокировано КАК Заблокировано,
		|	РезультатРасчета.ДатаБлокировки КАК ДатаБлокировки,
		|	ЕСТЬNULL(СтруктураИерархииНоменклатуры.Группа,РезультатРасчета.Номенклатура.Родитель) КАК Родитель,
		|	РезультатРасчета.МинимальныйЗаказ КАК МинимальныйЗаказ,
		|	РезультатРасчета.КвантПоставки КАК КвантПоставки,
		|	РезультатРасчета.РасчетнаяПотребность КАК РасчетнаяПотребность,
		|	РезультатРасчета.МинимальныйОстаток КАК МинимальныйОстаток,
		|	РезультатРасчета.ДопЗапасНаАкцию КАК ДопЗапасНаАкцию,
		|	РезультатРасчета.КоличествоОстаток КАК КоличествоОстаток,
		|	РезультатРасчета.ОстатокРЦ КАК ОстатокРЦ,
		|	РезультатРасчета.КоличествоВПути КАК КоличествоВПути,
		|	РезультатРасчета.ТарноеМесто КАК ТарноеМесто,
		|	РезультатРасчета.Цена КАК Цена,
		|	РезультатРасчета.ЦенаРозничная КАК ЦенаРозничная,
		|	РезультатРасчета.ПродажаЗаПериод КАК ПродажаЗаПериод,
		|	РезультатРасчета.КоличествоОборот КАК КоличествоОборот,
		|	РезультатРасчета.ДнейПродаж КАК ДнейПродаж,
		|	РезультатРасчета.СреднесуточнаяПродажа КАК СреднесуточнаяПродажа,
		|	РезультатРасчета.УчетДней КАК УчетДней,
		|	РезультатРасчета.ПериодВыбытия КАК ПериодВыбытия,
		|	РезультатРасчета.ПоставкаЗавтра КАК ПоставкаЗавтра,
		|	РезультатРасчета.ПоставкаВБудущем КАК ПоставкаВБудущем,
		|	ВЫБОР
		|		КОГДА РезультатРасчета.РекомендуемоеКоличество < РезультатРасчета.КвантПоставки И РезультатРасчета.КвантПоставки < РезультатРасчета.МинимальныйЗаказ ТОГДА 0
		|		КОГДА РезультатРасчета.РекомендуемоеКоличество < РезультатРасчета.МинимальныйЗаказ ТОГДА РезультатРасчета.МинимальныйЗаказ
		|		ИНАЧЕ РезультатРасчета.РекомендуемоеКоличество
		|	КОНЕЦ КАК РекомендуемоеКоличество,
		|	ВЫБОР
		|		КОГДА РезультатРасчета.КвантПоставки=0 ИЛИ (РезультатРасчета.РекомендуемоеКоличество < РезультатРасчета.КвантПоставки И РезультатРасчета.КвантПоставки < РезультатРасчета.МинимальныйЗаказ) ТОГДА 0
		|		КОГДА РезультатРасчета.РекомендуемоеКоличество < РезультатРасчета.МинимальныйЗаказ ТОГДА РезультатРасчета.МинимальныйЗаказ
		|		ИНАЧЕ 
		|			ВЫБОР
		|				КОГДА РезультатРасчета.РекомендуемоеКоличество - (ВЫРАЗИТЬ(РезультатРасчета.РекомендуемоеКоличество / РезультатРасчета.КвантПоставки - 0.25 КАК ЧИСЛО(15, 0))) * РезультатРасчета.КвантПоставки < РезультатРасчета.КвантПоставки / 4 
		|				ТОГДА РезультатРасчета.КвантПоставки * (ВЫРАЗИТЬ(РезультатРасчета.РекомендуемоеКоличество / РезультатРасчета.КвантПоставки - 0.25 КАК ЧИСЛО(15, 0)))
		|				ИНАЧЕ РезультатРасчета.КвантПоставки * (1 + (ВЫРАЗИТЬ(РезультатРасчета.РекомендуемоеКоличество / РезультатРасчета.КвантПоставки - 0.25 КАК ЧИСЛО(15, 0))))
		|			КОНЕЦ
		|	КОНЕЦ КАК КоличествоСУчетомКратности
		|ПОМЕСТИТЬ ПромежуточныйРезультат
		|ИЗ
		|	РезультатРасчета КАК РезультатРасчета
		|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтруктураИерархииНоменклатуры КАК СтруктураИерархииНоменклатуры
		|	ПО РезультатРасчета.Номенклатура.Родитель = СтруктураИерархииНоменклатуры.Номенклатура И СтруктураИерархииНоменклатуры.Уровень=2
		|;
		|
		|///////////////////////////////////////
		|ВЫБРАТЬ
		|	ПромежуточныйРезультат.Контрагент КАК Контрагент,
		|	ПромежуточныйРезультат.Номенклатура КАК Номенклатура,
		|	ПромежуточныйРезультат.Заблокировано КАК Заблокировано,
		|	ПромежуточныйРезультат.ДатаБлокировки КАК ДатаБлокировки,
		|	ПромежуточныйРезультат.Номенклатура.Артикул КАК Код,
		|	ПромежуточныйРезультат.Родитель КАК Родитель,
		|	ПромежуточныйРезультат.Родитель.Наименование КАК РодительНаименование,
		|	ПромежуточныйРезультат.Номенклатура.НаименованиеПолное КАК НоменклатураНаименование,
		|	ПромежуточныйРезультат.Номенклатура.СрокХраненияТовара КАК СрокГодности,
		|	ПромежуточныйРезультат.МинимальныйЗаказ КАК МинимальныйЗаказ,
		|	ПромежуточныйРезультат.КвантПоставки КАК КратностьПоставок,
		|	ПромежуточныйРезультат.РасчетнаяПотребность КАК РасчетнаяПотребность,
		|	ПромежуточныйРезультат.МинимальныйОстаток КАК МинимальныйЗапас,
		|	ПромежуточныйРезультат.ДопЗапасНаАкцию КАК ДопЗапасНаАкцию,
		|	ПромежуточныйРезультат.КоличествоОстаток КАК ОстатокНаСкладе,
		|	ПромежуточныйРезультат.ОстатокРЦ КАК ОстатокНаРЦ,
		|	ПромежуточныйРезультат.КоличествоВПути КАК ТоварыВПути,
		|	ПромежуточныйРезультат.ТарноеМесто КАК ТарноеМесто,
		|	ПромежуточныйРезультат.Цена КАК Цена,
		|	ПромежуточныйРезультат.ЦенаРозничная КАК ЦенаРозничная,
		|	ПромежуточныйРезультат.ПродажаЗаПериод КАК ПродажаЗаПериод,
		|	ПромежуточныйРезультат.КоличествоОборот КАК КоличествоПродаж,
		|	ПромежуточныйРезультат.СреднесуточнаяПродажа КАК СреднесуточнаяПродажа,
		|	ПромежуточныйРезультат.УчетДней КАК УчетДней,
		|	ПромежуточныйРезультат.ПериодВыбытия КАК ПериодВыбытия,
		|	ПромежуточныйРезультат.ДнейПродаж КАК ДнейПродаж,
		|	ПромежуточныйРезультат.ПоставкаЗавтра КАК ПоставкаЗавтра,
		|	ПромежуточныйРезультат.ПоставкаВБудущем КАК ПоставкаВБудущем,
		|	ВЫБОР КОГДА ПромежуточныйРезультат.Заблокировано ТОГДА 0 ИНАЧЕ ПромежуточныйРезультат.РекомендуемоеКоличество КОНЕЦ КАК РекомендуемоеКоличество,
		|	ВЫБОР КОГДА ПромежуточныйРезультат.Заблокировано ТОГДА 0 ИНАЧЕ ПромежуточныйРезультат.КоличествоСУчетомКратности КОНЕЦ КАК КоличествоСУчетомКратности,
		//|	ПромежуточныйРезультат.КоличествоСУчетомКратности * ПромежуточныйРезультат.Цена КАК Сумма,
		|	ВЫБОР КОГДА ПромежуточныйРезультат.КоличествоСУчетомКратности > 0 И НЕ ПромежуточныйРезультат.Заблокировано ТОГДА ИСТИНА ИНАЧЕ ЛОЖЬ КОНЕЦ КАК ПеренестиВЗаказ,
		|	0 КАК Количество
		|ИЗ
		|	ПромежуточныйРезультат КАК ПромежуточныйРезультат
		|ГДЕ
		|	(НЕ &ТолькоСРекомендациями ИЛИ ПромежуточныйРезультат.РекомендуемоеКоличество > 0)
		|УПОРЯДОЧИТЬ ПО
		|	ПромежуточныйРезультат.Родитель,
		//|	ПромежуточныйРезультат.Номенклатура ИЕРАРХИЯ,
		|	ПромежуточныйРезультат.Номенклатура.Наименование
		|");
		Запрос.УстановитьПараметр("ВнешнийИсточник1", тзТоварыКЗаказу);
		Запрос.УстановитьПараметр("ВнешнийИсточник2", тзПродаж);
		Запрос.УстановитьПараметр("ПромежутокДней", ПромежутокДней + СтраховойЗапас);
		Запрос.УстановитьПараметр("ВариантРасчета", ВариантРасчета);
		Запрос.УстановитьПараметр("ТолькоСРекомендациями", ТолькоТоварыСРекомендациями);
		
		Если Специфика = "мясницкий" Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"ПромежуточныйРезультат.Родитель","ПромежуточныйРезультат.Номенклатура.ИерархияАльтернативная");
		КонецЕсли;	
		
		тзРезультат = Запрос.Выполнить().Выгрузить();
		
		Если ФормированиеЗаказаВЦО Тогда
			Для Каждого СтрокаРезультата Из тзРезультат Цикл
				Если ВариантФормирования=3 И ЗначениеЗаполнено(Контрагент) Тогда
					СтруктураОтбора = Новый Структура("Подразделение,Номенклатура", Подразделение, СтрокаРезультата.Номенклатура);
					МассивНайденныхСтрок = Товары.НайтиСтроки(СтруктураОтбора);
					Если МассивНайденныхСтрок.Количество()>0 Тогда Продолжить; КонецЕсли;
				КонецЕсли;
				
				НоваяСтрока = Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаРезультата);
				
				НоваяСтрока.Подразделение	= Подразделение;
				НоваяСтрока.СрокПоставки	= СрокПоставки;
				НоваяСтрока.ВариантРасчета	= ВариантРасчета;
				НоваяСтрока.ПромежутокДней	= ПромежутокДней;
				НоваяСтрока.ВремяПринятия	= ВремяПринятия;
			КонецЦикла;
		Иначе
			Товары.Загрузить(тзРезультат);
		КонецЕсли;
		
		текДатаПоставки = ДатаЗаказа + (СрокПоставки * 86400);
		//Объект.ДатаПоставки = ДатаПоставки;
		
		РасчитатьАкции(текДатаПоставки);
		
		Возврат Истина;
		
	КонецФункции //РассчитатьЗаказНаСервере()
	
	Функция ПолучитьГрафики(ПараметрыГрафиков) Экспорт
		
		ПолучитьВесьГрафик	= ПараметрыГрафиков.ПолучитьВесьГрафик;
		ГрафикиЦОИМагазинов	= ПараметрыГрафиков.ГрафикиЦОИМагазинов;
		СтраховойЗапасВДнях	= ПараметрыГрафиков.СтраховойЗапасВДнях;
		МассивПодразделений	= ПараметрыГрафиков.МассивПодразделений;
		МассивНоменклатуры	= ПараметрыГрафиков.МассивНоменклатуры;
		
		
		//получим график заказа
		Запрос = Новый Запрос("
		|ВЫБРАТЬ
		|	График.Подразделение,
		|	График.Контрагент,
		|	График.Номенклатура,
		|	График.СегментНоменклатуры,
		|	График.ДниНедели,
		|	График.ДниНеделиПоставки,
		|	График.Неделя,
		|	График.Периодичность,
		|	График.СрокПоставки,
		|	График.СтраховойЗапас,
		|	График.ВремяПринятияЗаказа,
		|	График.ВариантРасчета,
		|	График.СубПоставщик,
		|	График.ДопПризнак КАК ДопПризнак,
		|	График.ФормированиеЗаказаВЦО
		|ИЗ
		|	РегистрСведений.ГрафикиЗаказов.СрезПоследних(&НаДату, Истина И Подразделение В(&Подразделение) И Контрагент=&Контрагент И СубПоставщик=&СубПоставщик И СегментНоменклатуры=&СегментНоменклатуры) КАК График
		|ГДЕ
		|	График.Контрагент<>ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
		|");
		Запрос.УстановитьПараметр("НаДату", КонецДня(Дата));
		Если ЗначениеЗаполнено(Поставщик) Тогда
			Запрос.УстановитьПараметр("Контрагент", Поставщик);
		Иначе
			МассивПоставщиков = ПолучитьПоставщиковПоФильтруТоваров(МассивНоменклатуры);
			Если МассивПоставщиков.Количество()>0 И НЕ ПолучитьВесьГрафик И НЕ ФормированиеЗаказаВЦО Тогда //временно отключил фильтр по поставщикам из согл.цен для ЦО
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Контрагент=&Контрагент", "И Контрагент В(&Поставщики)");
				Запрос.УстановитьПараметр("Поставщики", МассивПоставщиков);
			Иначе
				Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Контрагент=&Контрагент", "");
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ПоставщикРЦ) Тогда
			Запрос.УстановитьПараметр("СубПоставщик", ПоставщикРЦ);
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СубПоставщик=&СубПоставщик", "");
		КонецЕсли;
		
		Запрос.УстановитьПараметр("СегментНоменклатуры", СегментНоменклатуры);
		//Если НЕ ЗначениеЗаполнено(СегментНоменклатуры) Тогда
		//	Запрос.Текст = СтрЗаменить(Запрос.Текст, "И СегментНоменклатуры=&СегментНоменклатуры", "");
		//Иначе
		//	Запрос.УстановитьПараметр("СегментНоменклатуры", СегментНоменклатуры);		
		//КонецЕсли;
		
		Если ВариантФормирования<>1 Тогда
			МассивПодразделений.Очистить();
			МассивПодразделений.Добавить(ПодразделениеКомпании);
		КонецЕсли;
		Если МассивПодразделений.Количество()=0 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст, "И Подразделение В(&Подразделение)", "");
		Иначе
			Запрос.УстановитьПараметр("Подразделение", МассивПодразделений);
		КонецЕсли;
		
		ВсеГрафики = Ложь;
		Если ВариантФормирования=1 Тогда
			ВсеГрафики = ГрафикиЦОИМагазинов;
		КонецЕсли;
		
		тзГрафик = Запрос.Выполнить().Выгрузить();
		тзГрафик.Колонки.Добавить("ПромежутокДней", Новый ОписаниеТипов("Число"));
		тзГрафик.Колонки.Добавить("ДатаЗаказа", Новый ОписаниеТипов("Дата"));
		тзГрафик.Колонки.Добавить("ДатаПоследнегоЗаказа", Новый ОписаниеТипов("Дата"));
		тзГрафик.Колонки.Добавить("ДатаСледующегоЗаказа", Новый ОписаниеТипов("Дата"));
		тзГрафик.Колонки.Добавить("ОтборНоменклатуры", Новый ОписаниеТипов("Массив"));
		тзГрафик.Колонки.Добавить("ИсключенияНоменклатуры", Новый ОписаниеТипов("Массив"));
		тзГрафик.Колонки.Добавить("Заказ", Новый ОписаниеТипов("ДокументСсылка.ЗаказПоставщику"));
		
		//формарование графика (дозаполнение)
		Для Каждого СтрокаГрафика Из тзГрафик Цикл
			
			Если ФормированиеЗаказаВЦО<>СтрокаГрафика.ФормированиеЗаказаВЦО И НЕ ВсеГрафики Тогда
				Продолжить;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(СтрокаГрафика.ВремяПринятияЗаказа) Тогда
				СтрокаГрафика.ВремяПринятияЗаказа = Дата("00010101235959");
			КонецЕсли;
			
			ДеньНеделиЗаказа = ДеньНедели(Дата);
			СледующийСрокПоставки = СтрокаГрафика.СрокПоставки;
			
			//формируем отборы номенклатуры
			МассивОтбора = Новый Массив;
			МассивИсключений = Новый Массив;
			
			Если ЗначениеЗаполнено(СтрокаГрафика.СегментНоменклатуры) Тогда
				МассивОтбора = Справочники.СегментыНоменклатуры.ПолучитьНоменклатуруСегмента(СтрокаГрафика.СегментНоменклатуры);
				
			ИначеЕсли ЗначениеЗаполнено(СтрокаГрафика.Номенклатура) Тогда
				МассивОтбора.Добавить(СтрокаГрафика.Номенклатура);
				
			Иначе
				НайденныеСтроки = тзГрафик.НайтиСтроки(Новый Структура("Контрагент,СубПоставщик", СтрокаГрафика.Контрагент, СтрокаГрафика.СубПоставщик));
				Для Каждого текСтрока Из НайденныеСтроки Цикл
					Если ЗначениеЗаполнено(текСтрока.Номенклатура) Тогда
						
						МассивИсключений.Добавить(текСтрока.Номенклатура);
						
					ИначеЕсли ЗначениеЗаполнено(текСтрока.СегментНоменклатуры) Тогда
						
						МассивСегмента = Справочники.СегментыНоменклатуры.ПолучитьНоменклатуруСегмента(текСтрока.СегментНоменклатуры);
						Для Каждого НоменклатураСегмента Из МассивСегмента Цикл
							МассивИсключений.Добавить(НоменклатураСегмента);
						КонецЦикла;
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
			
			СтрокаГрафика.ОтборНоменклатуры = МассивОтбора;
			СтрокаГрафика.ИсключенияНоменклатуры = МассивИсключений;
			
			ДатаПоследнегоЗаказа = ПолучитьДатуПоследнегоЗаказа(ПодразделениеКомпании, СтрокаГрафика);
			
			СтрокаГрафика.ДатаПоследнегоЗаказа = ДатаПоследнегоЗаказа;
			
			Для дн=0 По 365 Цикл //количество цикла зависит от возможного(разумного) количества в периодичности
				
				Если НЕ ЗначениеЗаполнено(СтрокаГрафика.ДатаЗаказа) Тогда
					текРеквизит = "ДатаЗаказа";
				Иначе
					текРеквизит = "ДатаСледующегоЗаказа";
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаГрафика.ДниНедели) Тогда
					
					Если СтрНайти(СтрокаГрафика.ДниНедели, ДеньНеделиЗаказа)>0 Тогда
						
						//проверим периодичность
						Если текРеквизит="ДатаЗаказа" И ЗначениеЗаполнено(ДатаПоследнегоЗаказа) Тогда
							ДопустимаяДатаЗаказа = НачалоДня(ДатаПоследнегоЗаказа) + (СтрокаГрафика.Периодичность*86400);
						ИначеЕсли текРеквизит="ДатаСледующегоЗаказа" Тогда
							ДопустимаяДатаЗаказа = НачалоДня(Дата) + (СтрокаГрафика.Периодичность*86400);
						Иначе
							ДопустимаяДатаЗаказа = НачалоДня(Дата);
						КонецЕсли;
						
						Если ПолучитьВесьГрафик ИЛИ ВариантФормирования=2 Тогда
							ДопустимаяДатаЗаказа = Дата("00010101");
						КонецЕсли;
						
						ДатаЗаказа = НачалоДня(Дата) + (дн*86400);
						ЧётнаяНеделя = НеделяГода(ДатаЗаказа)%2=0;
						
						Если СтрокаГрафика.Неделя=0 ИЛИ (СтрокаГрафика.Неделя=2 И ЧётнаяНеделя) ИЛИ (СтрокаГрафика.Неделя=1 И НЕ ЧётнаяНеделя) Тогда
							Если ДопустимаяДатаЗаказа<=ДатаЗаказа Тогда
								СтрокаГрафика[текРеквизит] = ДатаЗаказа;
							КонецЕсли;
						КонецЕсли;
						
						//если указаны дни недели поставки, то рассчитаем срок поставки
						Если текРеквизит="ДатаЗаказа" Тогда
							
							Если ЗначениеЗаполнено(СтрокаГрафика.ДниНеделиПоставки) И ЗначениеЗаполнено(СтрокаГрафика.ДатаЗаказа) Тогда
								ПорядокДняЗаказа = Найти(СтрокаГрафика.ДниНедели, ДеньНеделиЗаказа);
								ДеньНеделиПоставки = Число(Сред(СтрокаГрафика.ДниНеделиПоставки, ПорядокДняЗаказа, 1));
								Если ДеньНеделиПоставки>0 Тогда
									Если ДеньНеделиЗаказа>ДеньНеделиПоставки Тогда
										СтрокаГрафика.СрокПоставки = 7 - ДеньНеделиЗаказа + ДеньНеделиПоставки;
									ИначеЕсли ДеньНеделиЗаказа<ДеньНеделиПоставки Тогда
										СтрокаГрафика.СрокПоставки = ДеньНеделиПоставки - ДеньНеделиЗаказа;
									Иначе
										СтрокаГрафика.СрокПоставки = 7;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
						Иначе //дата след.заказа
							
							Если ЗначениеЗаполнено(СтрокаГрафика.ДниНеделиПоставки) И ЗначениеЗаполнено(СтрокаГрафика.ДатаСледующегоЗаказа) Тогда
								ПорядокДняЗаказа = Найти(СтрокаГрафика.ДниНедели, ДеньНеделиЗаказа);
								ДеньНеделиПоставки = Число(Сред(СтрокаГрафика.ДниНеделиПоставки, ПорядокДняЗаказа, 1));
								Если ДеньНеделиПоставки>0 Тогда
									Если ДеньНеделиЗаказа>ДеньНеделиПоставки Тогда
										СледующийСрокПоставки = 7 - ДеньНеделиЗаказа + ДеньНеделиПоставки;
									ИначеЕсли ДеньНеделиЗаказа<ДеньНеделиПоставки Тогда
										СледующийСрокПоставки = ДеньНеделиПоставки - ДеньНеделиЗаказа;
									Иначе
										СледующийСрокПоставки = 7;
									КонецЕсли;
								КонецЕсли;
							КонецЕсли;
							
						КонецЕсли;
						
					КонецЕсли;
					
					ДеньНеделиЗаказа = ?(ДеньНеделиЗаказа + 1 > 7, 1, ДеньНеделиЗаказа + 1);
					
					//ИначеЕсли СтрокаГрафика.Периодичность>0 Тогда
					//	
					//	Если текРеквизит="ДатаЗаказа" И ЗначениеЗаполнено(ДатаПоследнегоЗаказа) Тогда
					//		ДопустимаяДатаЗаказа = НачалоДня(ДатаПоследнегоЗаказа) + (СтрокаГрафика.Периодичность*86400);
					//	ИначеЕсли текРеквизит="ДатаСледующегоЗаказа" Тогда
					//		ДопустимаяДатаЗаказа = НачалоДня(Дата) + (СтрокаГрафика.Периодичность*86400);
					//	Иначе
					//		ДопустимаяДатаЗаказа = НачалоДня(Дата);
					//	КонецЕсли;
					//	
					//	ДатаЗаказа = НачалоДня(Дата) + (дн*86400);
					//	ЧётнаяНеделя = НеделяГода(ДатаЗаказа)%2=0;
					//	
					//	Если СтрокаГрафика.Неделя=0 ИЛИ (СтрокаГрафика.Неделя=2 И ЧётнаяНеделя) ИЛИ (СтрокаГрафика.Неделя=1 И НЕ ЧётнаяНеделя) Тогда
					//		Если ДопустимаяДатаЗаказа<=ДатаЗаказа Тогда
					//			СтрокаГрафика[текРеквизит] = ДатаЗаказа;
					//		КонецЕсли;
					//	КонецЕсли;
					//	
					//Иначе
					//	
					//	ДатаЗаказа = НачалоДня(Дата) + (дн*86400);
					//	ЧётнаяНеделя = НеделяГода(ДатаЗаказа)%2=0;
					//	
					//	Если СтрокаГрафика.Неделя=0 ИЛИ (СтрокаГрафика.Неделя=2 И ЧётнаяНеделя) ИЛИ (СтрокаГрафика.Неделя=1 И НЕ ЧётнаяНеделя) Тогда
					//		СтрокаГрафика[текРеквизит] = ДатаЗаказа;
					//	КонецЕсли;
					
				КонецЕсли;
				
				Если ЗначениеЗаполнено(СтрокаГрафика.ДатаЗаказа) И ЗначениеЗаполнено(СтрокаГрафика.ДатаСледующегоЗаказа) Тогда
					//Если НЕ ЗначениеЗаполнено(СтрокаГрафика.ДатаЗаказа) Тогда
					Прервать;
				ИначеЕсли ЗначениеЗаполнено(СтрокаГрафика.ДатаСледующегоЗаказа) Тогда
					СтрокаГрафика.ПромежутокДней = ((НачалоДня(СтрокаГрафика.ДатаСледующегоЗаказа) - НачалоДня(СтрокаГрафика.ДатаЗаказа)) / 86400) + СледующийСрокПоставки;// + ?(СтрокаГрафика.СтраховойЗапас>0, СтрокаГрафика.СтраховойЗапас, СтраховойЗапасВДнях);
					Прервать;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЦикла;
		
		тзГрафик.Сортировать("ВремяПринятияЗаказа ВОЗР");
		
		Возврат тзГрафик;
		
	КонецФункции //ПолучитьГрафики()
	
	Функция ПолучитьСтруктуруДеления(Контрагент)
		
		МассивПодразделений = Новый Массив;
		МассивКартегорий = Новый Массив;
		МассивПроизводителей = Новый Массив;
		МассивВидовЗаказа = Новый Массив;
		
		//получим доп.реквизиты контрагента для разделения
		ЗапросКонтрагентов = Новый Запрос("ВЫБРАТЬ Значение ИЗ Справочник.Контрагенты.ДополнительныеРеквизиты ГДЕ Ссылка=&Ссылка И Свойство=&Свойство");
		ЗапросКонтрагентов.УстановитьПараметр("Ссылка", Контрагент);
		
		ДопРеквПроизводитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Разбивать заказ по производителю (Контрагенты и контакты)", Истина);
		ЗапросКонтрагентов.УстановитьПараметр("Свойство", ДопРеквПроизводитель);
		Выборка = ЗапросКонтрагентов.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ДелениеПоПроизводителю = Выборка.Значение;
		Иначе
			ДелениеПоПроизводителю = Ложь;
		КонецЕсли;
		
		ДопРеквКатегория = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Разбивать заказ по категории (Контрагенты и контакты)", Истина);
		ЗапросКонтрагентов.УстановитьПараметр("Свойство", ДопРеквКатегория);
		Выборка = ЗапросКонтрагентов.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			УровеньКатегории = Выборка.Значение;
		Иначе
			УровеньКатегории = 0;
		КонецЕсли;
		
		МассивГрупп = Новый Массив;
		Если УровеньКатегории<>0 Тогда
			ЗапросГрупп = Новый Запрос("
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Группа
			|ПОМЕСТИТЬ Группы
			|ИЗ
			|	РегистрСведений.СтруктураИерархииНоменклатуры
			|ГДЕ
			|	Уровень=&УровеньКатегории
			|;
			|ВЫБРАТЬ
			|	Номенклатура
			|ИЗ
			|	РегистрСведений.СтруктураИерархииНоменклатуры
			|ГДЕ
			|	Порядок=1
			|	И НЕ Номенклатура В(ВЫБРАТЬ Группа ИЗ Группы)
			|	И Уровень+1=&УровеньКатегории
			|ОБЪЕДИНИТЬ
			|ВЫБРАТЬ
			|	Группа
			|ИЗ
			|	Группы
			|");
			ЗапросГрупп.УстановитьПараметр("УровеньКатегории", УровеньКатегории - 1);
			МассивГрупп = ЗапросГрупп.Выполнить().Выгрузить().ВыгрузитьКолонку("Номенклатура");
		КонецЕсли;
		
		ДелениеПоВидуЗаявки = ЕстьРеквизит(Контрагент,"ЕРПМастерКлюч") И Контрагент.ЕРПМастерКлюч="00000019376"; //Объект.Специфика="мясницкий"
		МассивЗаявок = Новый Массив;
		
		Для Каждого ТекущаяСтрока Из Товары Цикл
			
			Если ВариантФормирования=1 Тогда
				ПодразделениеЗаказа = ТекущаяСтрока.Подразделение;
				Если НЕ ЗначениеЗаполнено(ПодразделениеЗаказа) Тогда
					Продолжить;
				КонецЕсли;
				Если МассивПодразделений.Найти(ПодразделениеЗаказа)=Неопределено Тогда
					МассивПодразделений.Добавить(ПодразделениеЗаказа);
				КонецЕсли;
			КонецЕсли;
			
			Номенклатура = ТекущаяСтрока.Номенклатура;
			
			Если НЕ ЗначениеЗаполнено(Номенклатура) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ДелениеПоПроизводителю И ЗначениеЗаполнено(Номенклатура.Производитель) И МассивПроизводителей.Найти(Номенклатура.Производитель)=Неопределено Тогда
				МассивПроизводителей.Добавить(Номенклатура.Производитель);
			КонецЕсли;
			
			Для Каждого Группа Из МассивГрупп Цикл
				Если Номенклатура.ПринадлежитЭлементу(Группа) Тогда
					МассивКартегорий.Добавить(Группа);
				КонецЕсли;
			КонецЦикла;
			
			Если ДелениеПоВидуЗаявки И ЗначениеЗаполнено(Номенклатура.ит_ВидЗаявки) И МассивЗаявок.Найти(Номенклатура.ит_ВидЗаявки)=Неопределено Тогда
				МассивЗаявок.Добавить(Номенклатура.ит_ВидЗаявки);
			КонецЕсли;
			
		КонецЦикла;	
		
		Если МассивЗаявок.Количество()>0 Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ВидЗаказа ИЗ РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры ГДЕ ВидЗаказаНоменклатура В(&МассивЗаявок)");
			Запрос.УстановитьПараметр("МассивЗаявок", МассивЗаявок);
			МассивВидовЗаказа = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ВидЗаказа");
		КонецЕсли;
		
		Если МассивПодразделений.Количество()=0 Тогда
			МассивПодразделений.Добавить(ПодразделениеКомпании);
		КонецЕсли;
		
		Если МассивПроизводителей.Количество()=0 Тогда
			МассивПроизводителей.Добавить();
		Иначе
			МассивПроизводителей.Добавить(Справочники.Производители.ПустаяСсылка());
		КонецЕсли;
		
		Если МассивКартегорий.Количество()=0 Тогда
			МассивКартегорий.Добавить();
		КонецЕсли;
		
		Если МассивВидовЗаказа.Количество()=0 Тогда
			МассивВидовЗаказа.Добавить();
		Иначе
			МассивВидовЗаказа.Добавить(Перечисления.рздВидыЗаказовЕРП.ПустаяСсылка());
		КонецЕсли;
		
		Возврат Новый Структура("Подразделения,Категории,Производители,ВидыЗаказа", МассивПодразделений, МассивКартегорий, МассивПроизводителей, МассивВидовЗаказа);
		
	КонецФункции //ПолучитьСтруктуруДеления()
	
	Функция ПолучитьСкладыЗаказа(Подразделение) Экспорт
		
		СкладыЗаказа = Новый Соответствие;
		
		Если ЕстьРеквизит(Подразделение,"СкладыЗаказа") Тогда
			Для Каждого ТекущаяСтрока Из Подразделение.СкладыЗаказа Цикл
				СкладыЗаказа.Вставить(ТекущаяСтрока.СкладКомпании, ТекущаяСтрока.Номенклатура);
			КонецЦикла;
		КонецЕсли;
		
		Если СкладыЗаказа.Количество()=0 Тогда
			СкладыЗаказа.Вставить("");
		КонецЕсли;
		
		Возврат СкладыЗаказа;
		
	КонецФункции //ПолучитьСкладыЗаказа()
	
	Функция ПолучитьНоменклатуруПоВидамЗаказа(Подразделение) Экспорт
		
		МассивНоменклатуры = Новый Массив;
		
		Если НЕ ЗначениеЗаполнено(Подразделение) Тогда Возврат МассивНоменклатуры; КонецЕсли;
		
		Макет = ПолучитьМакет("ВремяПоВидамЗаказа");
		
		КоличествоСтрок = Макет.ВысотаТаблицы;
		КоличествоКолонок = Макет.ШиринаТаблицы;
		
		НомерСтроки = 0;
		Для НомСтроки=2 По КоличествоСтрок Цикл
			Если СокрЛП(Подразделение.Код)=СокрЛП(Макет.Область(НомСтроки,2).Текст) Тогда
				НомерСтроки = НомСтроки;
			КонецЕсли;
		КонецЦикла;
		
		Если НомерСтроки=0 Тогда Возврат МассивНоменклатуры; КонецЕсли;
		
		МассивВидовЗаказа = Новый Массив;
		Для НомКолонки=3 По КоличествоКолонок Цикл
			ВидЗаказа = СокрЛП(Макет.Область(1,НомКолонки).Текст);
			Если ЗначениеЗаполнено(ВидЗаказа) Тогда
				
				Попытка
					ВидЗаказа = Перечисления.рздВидыЗаказовЕРП[ВидЗаказа];
				Исключение
					Сообщить("Не удалось получить из макета, Вид заказа: " + ВидЗаказа);
					Продолжить;
				КонецПопытки;
				
				ВремяЗаказа = СокрЛП(Макет.Область(НомерСтроки,НомКолонки).Текст);
				
				Если СтрДлина(ВремяЗаказа)<>5 Тогда Продолжить; КонецЕсли;
				
				ВремяЗаказа = Дата(0001,01,01,Лев(ВремяЗаказа,2),Сред(ВремяЗаказа,4,2),00);
				ТекВремя = Дата(0001,01,01,Час(ТекущаяДата()),Минута(ТекущаяДата()),Секунда(ТекущаяДата()));
				
				//проверим время
				Если ВремяЗаказа>ТекВремя Тогда Продолжить; КонецЕсли;
				
				//проверим наличие документа
				Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Ссылка ИЗ Документ.ЗаказПоставщику ГДЕ Проведен И Контрагент.ЕРПМастерКлюч=""00000019376"" И ит_ВидЗаявки=&ВидЗаявки И Дата МЕЖДУ &ДатаНач И &ДатаКон");
				Запрос.УстановитьПараметр("ВидЗаявки", ВидЗаказа);
				Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Дата));
				Запрос.УстановитьПараметр("ДатаКон", КонецДня(Дата));
				
				Выборка = Запрос.Выполнить().Выбрать();
				Если Выборка.Следующий() Тогда Продолжить; КонецЕсли;
				
				//добавим
				МассивВидовЗаказа.Добавить(ВидЗаказа);
			КонецЕсли;
		КонецЦикла;
		
		Если МассивВидовЗаказа.Количество()=0 Тогда
			
			Возврат МассивНоменклатуры;
			
		Иначе	
			
			//получим номенклатуру по видам заказа
			Запрос = Новый Запрос("
			|ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	Рег.ВидЗаказаНоменклатура
			|ПОМЕСТИТЬ ВидыЗаказа
			|ИЗ
			|	РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК Рег
			|ГДЕ
			|	Рег.ВидЗаказа В(&МассивВидов)
			|;
			|ВЫБРАТЬ
			|	Ссылка
			|ИЗ
			|	Справочник.Номенклатура
			|ГДЕ
			|	ит_ВидЗаявки В(ВЫБРАТЬ ВидЗаказаНоменклатура ИЗ ВидыЗаказа)
			|");
			Запрос.УстановитьПараметр("МассивВидов", МассивВидовЗаказа);
			
			Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
			
		КонецЕсли;
		
	КонецФункции //ПолучитьНоменклатуруПоВидамЗаказа()
	
	//Начальная процедура для вызова из команды
	//
	Процедура СформироватьЗаказыПоГрафикам()
		
		ТолькоТоварыСРекомендациями = Истина;
		
		ПараметрыГрафиков = Новый Структура("ПолучитьВесьГрафик,ГрафикиЦОИМагазинов,СтраховойЗапасВДнях,МассивПодразделений, МассивНоменклатуры", Ложь, Ложь, 0, Новый Массив, Новый Массив);
		
		тзГрафик = ПолучитьГрафики(ПараметрыГрафиков);
		
		ПараметрыРасчета = Новый Структура("ДатаЗаказа,Контрагент,СубПоставщик,Номенклатура,СрокПоставки,ВремяПринятия,СтраховойЗапас,ВариантРасчета,ПромежутокДней,ДнейПродаж,ОтборНоменклатуры,Исключения,ОтборПользователя,Подразделение,БиржевыеТовары,ВремяФормирования,СогласованныеЦены,НачалоАнализаПродаж,КонецАнализаПродаж");
		
		Если Специфика="Семья" Тогда
			ЗапросБиржи = Новый Запрос("ВЫБРАТЬ	Ссылка ИЗ Справочник.Номенклатура ГДЕ НЕ ЭтоГруппа И смБонуснаяГруппа.Наименование ПОДОБНО ""%биржа%""");
			БиржевыеТовары = ЗапросБиржи.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Иначе
			БиржевыеТовары = Справочники.Номенклатура.ПустаяСсылка();
		КонецЕсли;
		
		Если Специфика="мясницкий" Тогда
			Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ ВидЗаказа, ВидЗаказаНоменклатура ИЗ РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры");
			тзВидовЗаказа = Запрос.Выполнить().Выгрузить();
			тзВидовЗаказа.Индексы.Добавить("ВидЗаказаНоменклатура");
		КонецЕсли;
		
		ОтборПользователя = Новый Массив;
		
		СогласованныеЦены = ПолучитьСогласованныеЦены(ОтборПользователя, БиржевыеТовары);
		
		Товары.Очистить();
		
		//обработка графика
		Для Каждого СтрокаГрафика Из тзГрафик Цикл
			
			//пропускаем графики на другую дату
			Если НачалоДня(СтрокаГрафика.ДатаЗаказа)<>НачалоДня(Дата) Тогда
				Продолжить;
			КонецЕсли;
			
			текОтборПользователя = ОтборПользователя;
			
			//формируем автозаказ после времни принятия
			Если НЕ НеУчитыватьВремяЗаказа Тогда
				Если Специфика="мясницкий" И СтрокаГрафика.Контрагент.ЕРПМастерКлюч="00000019376" Тогда
					текОтборПользователя = ПолучитьНоменклатуруПоВидамЗаказа(СтрокаГрафика.Подразделение);
					
					Если текОтборПользователя.Количество()=0 Тогда Продолжить; КонецЕсли;
					
				ИначеЕсли ЗначениеЗаполнено(СтрокаГрафика.ВремяПринятияЗаказа)
					И СтрокаГрафика.ВремяПринятияЗаказа >= (Дата(0001,01,01,Час(ТекущаяДата()),Минута(ТекущаяДата()),Секунда(ТекущаяДата()))) Тогда
					
					Продолжить;
				КонецЕсли;
			КонецЕсли;
			
			ПараметрыРасчета.ДатаЗаказа			= СтрокаГрафика.ДатаЗаказа;
			ПараметрыРасчета.Контрагент			= СтрокаГрафика.Контрагент;
			ПараметрыРасчета.СубПоставщик		= СтрокаГрафика.СубПоставщик;
			ПараметрыРасчета.Номенклатура		= ?(ЗначениеЗаполнено(СтрокаГрафика.СегментНоменклатуры), СтрокаГрафика.СегментНоменклатуры, СтрокаГрафика.Номенклатура);
			ПараметрыРасчета.СрокПоставки		= СтрокаГрафика.СрокПоставки;
			ПараметрыРасчета.ВремяПринятия		= СтрокаГрафика.ВремяПринятияЗаказа;
			ПараметрыРасчета.СтраховойЗапас		= СтрокаГрафика.СтраховойЗапас;
			ПараметрыРасчета.ВариантРасчета		= СтрокаГрафика.ВариантРасчета;
			ПараметрыРасчета.ПромежутокДней		= СтрокаГрафика.ПромежутокДней;
			ПараметрыРасчета.ОтборНоменклатуры	= СтрокаГрафика.ОтборНоменклатуры;
			ПараметрыРасчета.Исключения			= СтрокаГрафика.ИсключенияНоменклатуры;
			ПараметрыРасчета.ДнейПродаж			= 0;
			ПараметрыРасчета.Подразделение		= СтрокаГрафика.Подразделение;
			ПараметрыРасчета.ОтборПользователя	= текОтборПользователя;
			ПараметрыРасчета.БиржевыеТовары		= БиржевыеТовары;
			ПараметрыРасчета.СогласованныеЦены	= СогласованныеЦены;
			ПараметрыРасчета.ВремяФормирования	= ТекущаяДата();
			
			ВсеОк = РассчитатьЗаказНаСервере(ПараметрыРасчета);
			
			Если ВсеОк Тогда
				СтруктураДеления = ПолучитьСтруктуруДеления(СтрокаГрафика.Контрагент);
				
				МассивПодразделений	 = СтруктураДеления.Подразделения;
				МассивКатегорий		 = СтруктураДеления.Категории;
				МассивПроизводителей = СтруктураДеления.Производители;
				МассивВидовЗаказа	 = СтруктураДеления.ВидыЗаказа;
				
				Для Каждого текПодразделение Из МассивПодразделений Цикл
					
					СкладыЗаказа = ПолучитьСкладыЗаказа(текПодразделение);
					
					Для Каждого СтрокаСклада Из СкладыЗаказа Цикл //деление по юр.лицам
						
						Для Каждого текКатегория Из МассивКатегорий Цикл
							
							Для Каждого текПроизводитель Из МассивПроизводителей Цикл
								
								Для Каждого текВидЗаказа Из МассивВидовЗаказа Цикл
									
									ВыбранныеТовары = Новый Соответствие;
									
									Для Каждого ТекущаяСтрока Из Товары Цикл
										Если ТекущаяСтрока.РекомендуемоеКоличество<=0 И ТекущаяСтрока.КоличествоСУчетомКратности<=0 И Специфика<>"мясницкий" Тогда
											Продолжить;
										КонецЕсли;
										
										Если ВариантФормирования=1 И ТекущаяСтрока.Подразделение<>текПодразделение Тогда
											Продолжить;
										КонецЕсли;
										
										Если ЗначениеЗаполнено(СтрокаСклада.Значение) И НЕ ТекущаяСтрока.Номенклатура.ПринадлежитЭлементу(СтрокаСклада.Значение) Тогда
											Продолжить;
										КонецЕсли;
										
										Если текКатегория<>Неопределено И НЕ ТекущаяСтрока.Номенклатура.ПринадлежитЭлементу(текКатегория) Тогда
											Продолжить;
										КонецЕсли;
										
										Если текПроизводитель<>Неопределено И ТекущаяСтрока.Номенклатура.Производитель<>текПроизводитель Тогда
											Продолжить;
										КонецЕсли;
										
										Если текВидЗаказа<>Неопределено Тогда //Специфика="мясницкий"
											СтрокаВидаЗаказа = тзВидовЗаказа.Найти(ТекущаяСтрока.Номенклатура.ит_ВидЗаявки, "ВидЗаказаНоменклатура");
											Если СтрокаВидаЗаказа=Неопределено Тогда
												ВидЗаказа = Перечисления.рздВидыЗаказовЕРП.ПустаяСсылка();
											Иначе
												ВидЗаказа = СтрокаВидаЗаказа.ВидЗаказа;
											КонецЕсли;
											Если текВидЗаказа<>ВидЗаказа Тогда
												Продолжить;
											КонецЕсли;
										КонецЕсли;
										
										ВыбранныеТовары.Вставить(ТекущаяСтрока.Номенклатура, ТекущаяСтрока.КоличествоСУчетомКратности);
										
									КонецЦикла;
									
									Если ВыбранныеТовары.Количество()>0 Тогда
										
										ПараметрыВыполнения = Новый Структура("Контрагент,СубПоставщик,ДатаПоставки,ВремяПринятия,ОграничениеНоменклатуры,ВыбранныеТовары,Объект,СоздатьДокумент,Проводить");
										ПараметрыВыполнения.Контрагент		= ПараметрыРасчета.Контрагент;
										ПараметрыВыполнения.СубПоставщик	= ПараметрыРасчета.СубПоставщик;
										ПараметрыВыполнения.СоздатьДокумент	= Истина;
										ПараметрыВыполнения.ВыбранныеТовары	= ВыбранныеТовары;
										ПараметрыВыполнения.Объект			= ЭтотОбъект;
										ПараметрыВыполнения.Проводить		= Истина;
										
										Если ВариантФормирования=1 Тогда
											ПараметрыВыполнения.Вставить("Подразделение", ПодразделениеКомпании);
										Иначе
											ПараметрыВыполнения.ДатаПоставки			= ПараметрыРасчета.ДатаЗаказа + (ПараметрыРасчета.СрокПоставки * 86400);
											ПараметрыВыполнения.ВремяПринятия			= ПараметрыРасчета.ВремяПринятия;
											ПараметрыВыполнения.ОграничениеНоменклатуры	= ПараметрыРасчета.Номенклатура;
										КонецЕсли;
										
										Если текВидЗаказа<>Неопределено Тогда //Специфика="мясницкий"
											ПараметрыВыполнения.Вставить("ВидЗаказа", текВидЗаказа);
										КонецЕсли;
										
										ВыполнитьКоманду("ФормированиеЗаказовПоставщику", ПараметрыВыполнения);
										
									КонецЕсли;
									
								КонецЦикла;
								
							КонецЦикла;
							
						КонецЦикла;
						
					КонецЦикла;
					
				КонецЦикла;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецПроцедуры//СформироватьЗаказыПоГрафикам()
	
	Функция СоздатьДопРеквизит(Наименование, ТипЗначения, ЭтоСведение=Ложь)
		
		об = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
		об.Заголовок = Наименование;
		об.Наименование = об.Заголовок + " (Заказы поставщикам)";
		об.Виден = Истина;
		об.Доступен = Истина;
		об.ЭтоДополнительноеСведение = ЭтоСведение;
		об.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ЗаказПоставщику;
		об.ТипЗначения = ТипЗначения;
		об.Записать();
		
		обНаборСв = Справочники.НаборыДополнительныхРеквизитовИСведений.Документ_ЗаказПоставщику.ПолучитьОбъект();
		НоваяСтрока = обНаборСв[?(ЭтоСведение,"ДополнительныеСведения","ДополнительныеРеквизиты")].Добавить();
		НоваяСтрока.Свойство = об.Ссылка;
		обНаборСв.Записать();
		
		Возврат об.Ссылка;
		
	КонецФункции //СоздатьДопРеквизит
	
	Процедура Инициализация()
		
		СемьяОпт = Справочники.Контрагенты.НайтиПоКоду("000001843");
		СемьяОптПодр = Справочники.ПодразделенияКомпании.НайтиПоКоду("000000162");
		РемиОпт = Справочники.ПодразделенияКомпании.НайтиПоКоду("ДК-000065");
		
		Если СтрНайти(НРег(СемьяОпт.Наименование),"семья")>0 Тогда
			Специфика = "Семья";
		ИначеЕсли СтрНайти(НРег(РемиОпт.Наименование),"хабаровск")>0 Тогда
			Специфика = "Реми";
		ИначеЕсли ЕстьРеквизит(Поставщик,"ЕРПМастерКлюч") Тогда
			Специфика = "мясницкий";
		Иначе
			Специфика = "";
		КонецЕсли;
		
		ДопРеквЦО = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Заказ сформирован в ЦО (Заказы поставщикам)", Истина);
		Если НЕ ЗначениеЗаполнено(ДопРеквЦО) Тогда
			СоздатьДопРеквизит("Заказ сформирован в ЦО", Новый ОписаниеТипов("Булево"));
		КонецЕсли;
		
		ДопРеквМагазин = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Заказ сформирован в Магазине (Заказы поставщикам)", Истина);
		Если НЕ ЗначениеЗаполнено(ДопРеквМагазин) Тогда
			СоздатьДопРеквизит("Заказ сформирован в Магазине", Новый ОписаниеТипов("Булево"));
		КонецЕсли;
		
		ДопРеквПризнак = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Дополнительный признак (Заказы поставщикам)", Истина);
		Если НЕ ЗначениеЗаполнено(ДопРеквПризнак) Тогда
			СоздатьДопРеквизит("Дополнительный признак", Новый ОписаниеТипов("Строка"));
		КонецЕсли;
		
		ДопРеквВремя = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Время принятия заказа (Заказы поставщикам)", Истина);
		Если НЕ ЗначениеЗаполнено(ДопРеквВремя) Тогда
			СоздатьДопРеквизит("Время принятия заказа", Новый ОписаниеТипов("Дата"));
		КонецЕсли;
		
		ДопРеквПроизводитель = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Разбивать заказ по производителю (Контрагенты и контакты)", Истина);
		Если НЕ ЗначениеЗаполнено(ДопРеквПроизводитель) Тогда
			об = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
			об.Заголовок = "Разбивать заказ по производителю";
			об.Наименование = об.Заголовок + " (Контрагенты и контакты)";
			об.Виден = Истина;
			об.Доступен = Истина;
			об.ЭтоДополнительноеСведение = Ложь;
			об.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты;
			об.ТипЗначения = Новый ОписаниеТипов("Булево");
			об.Записать();
			
			обНаборСв = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты.ПолучитьОбъект();
			НоваяСтрока = обНаборСв.ДополнительныеРеквизиты.Добавить();
			НоваяСтрока.Свойство = об.Ссылка;
			обНаборСв.Записать();
		КонецЕсли;
		
		ДопРеквКатегория = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Разбивать заказ по категории (Контрагенты и контакты)", Истина);
		Если НЕ ЗначениеЗаполнено(ДопРеквКатегория) Тогда
			об = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
			об.Заголовок = "Разбивать заказ по категории";
			об.Наименование = об.Заголовок + " (Контрагенты и контакты)";
			об.Виден = Истина;
			об.Доступен = Истина;
			об.ЭтоДополнительноеСведение = Ложь;
			об.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты;
			об.ТипЗначения = Новый ОписаниеТипов("Число");
			об.Записать();
			
			обНаборСв = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Контрагенты.ПолучитьОбъект();
			НоваяСтрока = обНаборСв.ДополнительныеРеквизиты.Добавить();
			НоваяСтрока.Свойство = об.Ссылка;
			обНаборСв.Записать();
		КонецЕсли;
		
		ДопСвЗаказИзЦО = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Заказывается из ЦО (Доп. свойства справочника ""Номенклатура""(общие))", Истина);
		Если НЕ ЗначениеЗаполнено(ДопСвЗаказИзЦО) Тогда
			об = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
			об.Заголовок = "Заказывается из ЦО";
			об.Наименование = об.Заголовок + " (Доп. свойства справочника ""Номенклатура""(общие))";
			об.Виден = Истина;
			об.Доступен = Истина;
			об.ЭтоДополнительноеСведение = Истина;
			об.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие;
			об.ТипЗначения = Новый ОписаниеТипов("Булево");
			об.Записать();
			
			обНаборСв = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_Номенклатура_Общие.ПолучитьОбъект();
			НоваяСтрока = обНаборСв.ДополнительныеСведения.Добавить();
			НоваяСтрока.Свойство = об.Ссылка;
			обНаборСв.Записать();
		КонецЕсли;
		
		Если Специфика="мясницкий" Тогда
			ДопРеквИспользоватьВАвтозаказе = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.НайтиПоНаименованию("Использовать в автозаказе (Подразделения компании)", Истина);
			Если НЕ ЗначениеЗаполнено(ДопРеквИспользоватьВАвтозаказе) Тогда
				об = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.СоздатьЭлемент();
				об.Заголовок = "Использовать в автозаказе";
				об.Наименование = об.Заголовок + " (Подразделения компании)";
				об.Виден = Истина;
				об.Доступен = Истина;
				об.ЭтоДополнительноеСведение = Ложь;
				об.НаборСвойств = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ПодразделенияКомпании;
				об.ТипЗначения = Новый ОписаниеТипов("Булево");
				об.Записать();
				
				обНаборСв = Справочники.НаборыДополнительныхРеквизитовИСведений.Справочник_ПодразделенияКомпании.ПолучитьОбъект();
				НоваяСтрока = обНаборСв.ДополнительныеРеквизиты.Добавить();
				НоваяСтрока.Свойство = об.Ссылка;
				обНаборСв.Записать();
			КонецЕсли;
		КонецЕсли;
		
	КонецПроцедуры //Инициализация()
	
	Инициализация();
	
#КонецЕсли