// Модуль основной формы документа "Акт постановки на баланс"
&НаКлиенте
перем ШтрихКодДляПоиска;

&НаКлиенте
Перем УдаляемыеСтроки; // Для удаления акцизных марок

&НаКлиенте
Перем КоличествоУдаленныхМарок; // Для удаления акцизных марок

////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

#Область Статус

&НаСервере
Процедура ОбновитьСтатусОбработки()
	
	Возврат;
	
	МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Объект.Ссылка);
	
	ИмяДокумента    = Объект.Ссылка.Метаданные().Имя;
	СтатусПоУмолчанию = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработкиПоУмолчанию(ИмяДокумента);
	СтатусОбработки    = СтатусПоУмолчанию.СтатусОбработки;
	ДальнейшееДействие = СтатусПоУмолчанию.ДальнейшееДействие;
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ
		|	Статусы.СтатусОбработки КАК СтатусОбработки,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие1 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие1
		|	КОНЕЦ КАК ДальнейшееДействие1,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие2 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие2
		|	КОНЕЦ КАК ДальнейшееДействие2,
		|	ВЫБОР
		|		КОГДА Статусы.ДальнейшееДействие3 В (&МассивДальнейшиеДействия)
		|			ТОГДА ЗНАЧЕНИЕ(Перечисление.ДальнейшиеДействияЕГАИС.НеТребуется)
		|		ИНАЧЕ Статусы.ДальнейшееДействие3
		|	КОНЕЦ КАК ДальнейшееДействие3
		|ИЗ
		|	РегистрСведений.СтатусыДокументовЕГАИС КАК Статусы
		|ГДЕ
		|	Статусы.Документ = &Документ";
		
		Запрос.УстановитьПараметр("Документ",                 Объект.Ссылка);
		Запрос.УстановитьПараметр("МассивДальнейшиеДействия", ИнтеграцияЕГАИС.НеотображаемыеВДокументахДальнейшиеДействия());
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			СтатусОбработки = Выборка.СтатусОбработки;
			ДальнейшееДействие = Новый Массив;
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие1);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие2);
			ДальнейшееДействие.Добавить(Выборка.ДальнейшееДействие3);
		КонецЕсли;
		
	КонецЕсли;
	
	ДопустимыеДействия = Новый Массив;
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.СгенерируйтеКодыУпаковок);
	ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ЗавершитеФормированиеГрупповойТары);
	//ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеОперацию);
	//ДопустимыеДействия.Добавить(Перечисления.ДальнейшиеДействияЕГАИС.ОтменитеПередачуДанных);
	СтатусОбработкиПредставление = ИнтеграцияЕГАИС.ПредставлениеСтатусаОбработки(
		СтатусОбработки,
		ДальнейшееДействие,
		ДопустимыеДействия);
	
КонецПроцедуры

&НаСервере
Функция ПолучитьНачальныйНомерУпаковки()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ТаблицаУпаковки.КодМаркировкиУпаковки КАК КодМаркировкиУпаковки
	|ПОМЕСТИТЬ
	|	ТаблицаУпаковки
	|ИЗ
	|	&Упаковки КАК ТаблицаУпаковки
	|;
	|
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВложенныйЗапрос.КодМаркировкиУпаковки) КАК КодМаркировкиУпаковки
	|ИЗ
	|	(ВЫБРАТЬ
	|		МАКСИМУМ(ТаблицаУпаковки.КодМаркировкиУпаковки) КАК КодМаркировкиУпаковки
	|	ИЗ
	|		Документ.ФормированиеГрупповойТарыИСМП.Упаковки КАК ТаблицаУпаковки
	|	ГДЕ
	|		ТаблицаУпаковки.Ссылка.ПодразделениеКомпании = &ПодразделениеКомпании И 
	|		ТаблицаУпаковки.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания И
	|		ТаблицаУпаковки.ТипУпаковки = &ТипУпаковки
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		МАКСИМУМ(ТаблицаУпаковки.КодМаркировкиУпаковки) КАК КодМаркировкиУпаковки
	|	ИЗ
	|		ТаблицаУпаковки КАК ТаблицаУпаковки) КАК ВложенныйЗапрос
	|";
	
	Запрос.УстановитьПараметр("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	Запрос.УстановитьПараметр("ДатаНачала",            НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("ДатаОкончания",         КонецМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Упаковки",              Объект.Упаковки.Выгрузить());
	Запрос.УстановитьПараметр("ТипУпаковки",           Объект.ТипУпаковки);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Если Выборка.КодМаркировкиУпаковки = Null Тогда
			ПоследнийНомер = 0;
		Иначе
			ПоследнийНомер = Число(Сред(Выборка.КодМаркировкиУпаковки, 12, 7));
		КонецЕсли;
	Иначе
		ПоследнийНомер = 0;
	КонецЕсли;
	
	НомерУпаковки = ПоследнийНомер + 1;
	
	Возврат НомерУпаковки;
	
КонецФункции

&НаСервере
Функция ПолучитьПрефиксКомпании()
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Организация",   Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение", Объект.ПодразделениеКомпании);
	
	Результат = "";
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	МАКСИМУМ(ВложеннаяТаблица.GLN_Организации) КАК GLN_Организации,
	|	МАКСИМУМ(ВложеннаяТаблица.GLN_Подразделения) КАК GLN_Подразделения
	|ИЗ
	|	(ВЫБРАТЬ
	|		"""" КАК GLN_Организации,
	|		ПодразделенияКомпании.GLN КАК GLN_Подразделения
	|	ИЗ
	|		Справочник.ПодразделенияКомпании КАК ПодразделенияКомпании
	|	ГДЕ
	|		ПодразделенияКомпании.Ссылка = &Подразделение
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ТабОрганизации.GLN,
	|		""""
	|	ИЗ
	|		Справочник.Организации КАК ТабОрганизации
	|	ГДЕ
	|		ТабОрганизации.Ссылка = &Организация) КАК ВложеннаяТаблица
	|";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если СтрДлина(СокрЛП(Выборка.GLN_Организации)) > 13 Тогда
			Результат = Выборка.GLN_Организации;
		ИначеЕсли СтрДлина(СокрЛП(Выборка.GLN_Подразделения)) > 13 Тогда
			Результат = Выборка.GLN_Подразделения;
		КонецЕсли;
	КонецЕсли;
	
	Результат = Лев(СокрЛП(Результат) + "000000000", 9);
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ПолучитьКонтрольнуюСумму(Знач КодМаркировки)
	
	СуммаПозиций = 0;
	ЧетныйСимвол = Ложь;
	Пока НЕ КодМаркировки = "" Цикл
		ТекущийСимвол = Число(Прав(КодМаркировки, 1));
		Если ЧетныйСимвол Тогда
			ЧетныйСимвол = Ложь;
		Иначе
			ТекущийСимвол = ТекущийСимвол * 3;
			ЧетныйСимвол = Истина;
		КонецЕсли;
		СуммаПозиций = СуммаПозиций + ТекущийСимвол;
		
		КодМаркировки = Лев(КодМаркировки, СтрДлина(КодМаркировки)-1);
	КонецЦикла;
	
	Результат = Число(Прав("0"+Строка(СуммаПозиций), 1));
	Если Результат > 0 Тогда
		Результат = 10 - Результат;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура СоздатьНомераУпаковок()
	
	ИдентификаторПрименения = "00";
	ЦифраРасширения         = ?(Объект.ТипУпаковки = Перечисления.ТипыУпаковок.УпаковкаМультитоварная, "1", "2"); // от 0 до 9
	ПрефиксКомпании         = ПолучитьПрефиксКомпании();
	
	ДатаСоздания = Формат(Объект.Дата, "ДФ=MMyy");
	ДатаСоздания = Прав("0000" + СокрЛП(ДатаСоздания), 4);
	
	ПрефиксМаркировки = ИдентификаторПрименения + ЦифраРасширения + ПрефиксКомпании;
	
	НомерУпаковки = ПолучитьНачальныйНомерУпаковки();
	
	Объект.Упаковки.Очистить();
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		
		Если ТекущаяСтрока.Количество = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		Если ПустаяСтрока(ТекущаяСтрока.ИдентификаторСтроки) Тогда
			Продолжить;
		КонецЕсли;
		
		Счетчик = 0;
		КоличествоСтрок = ТекущаяСтрока.Количество;
		Пока Счетчик < ТекущаяСтрока.Количество Цикл
			КодМаркировкиУпаковки = ПрефиксМаркировки + Прав("0000000" + Формат(НомерУпаковки, "ЧГ=0"), 7);
			
			КодМаркировкиУпаковки = КодМаркировкиУпаковки + ПолучитьКонтрольнуюСумму(КодМаркировкиУпаковки);
			
			НоваяСтрока = Объект.Упаковки.Добавить();
			НоваяСтрока.ИдентификаторСтроки   = ТекущаяСтрока.ИдентификаторСтроки;
			НоваяСтрока.КодМаркировкиУпаковки = КодМаркировкиУпаковки;
			НоваяСтрока.УровеньВложенности    = 1;
			
			Счетчик       = Счетчик + 1;
			НомерУпаковки = НомерУпаковки + 1;
		КонецЦикла;
		
	КонецЦикла;
	
	Объект.УпаковкиСозданы = Истина;
	
	Записать();
	
	//ВывестиВеткуУпаковок();
	ЗаполнитьРеквизитыУпаковок();
	
	//ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Объект.Ссылка);
	//ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.ЗавершитеФормированиеГрупповойТары;
	//ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.УпаковкаКоробок;
	//ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(Объект.Ссылка.Метаданные(), ТекущееСостояние.ВидСтатуса);
	//
	//РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ТекущееСостояние);
	
	ОбновитьСтатусОбработки();
	
КонецПроцедуры

&НаСервере
Процедура ЗавершитьУпаковку()
	
	//ТекущееСостояние = РегистрыСведений.СтатусыДокументовЕГАИС.ТекущееСостояние(Объект.Ссылка);
	//ТекущееСостояние.ДальнейшееДействие1 = Перечисления.ДальнейшиеДействияЕГАИС.НеТребуется;
	//ТекущееСостояние.ВидСтатуса          = Перечисления.ВидыСтатусовОбработкиЕГАИС.ЗавершеноФормированиеГрупповойТары;
	//ТекущееСостояние.СтатусОбработки     = Справочники.СтатусыОбработкиЕГАИС.ПолучитьСтатусОбработки(Объект.Ссылка.Метаданные(), ТекущееСостояние.ВидСтатуса);
	//
	//РегистрыСведений.СтатусыДокументовЕГАИС.ВыполнитьЗаписьВРегистр(ТекущееСостояние);
	
	ОбновитьСтатусОбработки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "СгенерируйтеКодыУпаковок" Тогда
		
		Если Объект.Товары.Количество() = 0 Тогда
			ВывестиСообщение(НСтр("ru = 'Не заполнены товарные позиции'"));
			Возврат;
		КонецЕсли;
		
		Если Объект.Товары.Итог("Количество") = 0 Тогда
			ВывестиСообщение(НСтр("ru = 'Не задано количество упаковок'"));
			Возврат;
		КонецЕсли;
		
		Если Объект.Товары.Итог("КоличествоБазовое") = 0 Тогда
			ВывестиСообщение(НСтр("ru = 'Не задано количество марок'"));
			Возврат;
		КонецЕсли;
		
		СоздатьНомераУпаковок();
		
	ИначеЕсли НавигационнаяСсылкаФорматированнойСтроки = "ЗавершитеФормированиеГрупповойТары" Тогда
		
		//ИнтеграцияЕГАИСКлиент.ПодготовитьКПередаче(
		//	Объект.Ссылка,
		//	ПредопределенноеЗначение("Перечисление.ДальнейшиеДействияЕГАИС.ЗапроситеОтменуПроведения"),
		//	ЭтотОбъект.УникальныйИдентификатор);
		ЗавершитьУпаковку();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если Не РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	Если ПроверитьЗаполнение() Тогда
		Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Запись));
	КонецЕсли;
	
	Если Не Модифицированность И ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ОбработатьНажатиеНавигационнойСсылки(ДополнительныеПараметры.НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьВыгрузку(ИмяДействия)
	
	ДополнительныеПараметры = Новый Структура();
	ДополнительныеПараметры.Вставить("Действие",    ИмяДействия);
	ДополнительныеПараметры.Вставить("Документ",    Объект.Ссылка);
	ДополнительныеПараметры.Вставить("Организация", Объект.Организация);
	ДополнительныеПараметры.Вставить("ОбработкаРезультата",
		Новый ОписаниеОповещения("ПолучитьЗапросЗавершение", ЭтотОбъект, ИмяДействия));
	
	МаркировкаТоваровКлиент.ОтправитьПолучитьДокумент(
		ЭтотОбъект,
		Объект,
		ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	
	Если Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.АгрегацияИСМП") Тогда
		ИмяДействия = "ОтправкаЗапросаАгрегацииКодовМаркировки";
		ВыполнитьВыгрузку(ИмяДействия);
	ИначеЕсли Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.РасформированиеАгрегатаИСМП") Тогда
		ИмяДействия = "ОтправкаЗапросаРазАгрегацииКодовМаркировки";
		ВыполнитьВыгрузку(ИмяДействия);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьУпаковки(Команда)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если Модифицированность ИЛИ (Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение", ЭтотОбъект, Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", "СгенерируйтеКодыУпаковок"));
		ТекстВопроса = НСтр("ru = 'Для продолжения документ необходимо записать. Записать?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработатьНажатиеНавигационнойСсылки("СгенерируйтеКодыУпаковок");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ПолучитьЗапросЗавершение(РезультатОбмена, ДополнительныеПараметры) Экспорт
	
	// Обновиить отображение документа
	Прочитать();
	
	Если ЭтотОбъект.РежимОбменаСЧестнымЗнаком = 
			ПредопределенноеЗначение("Перечисление.СпособыОбменаСЧестнымЗнаком.Файловый")
			И РезультатОбмена = Истина Тогда
		Объект.Статус = ПредопределенноеЗначение("Перечисление.СтатусыДокументовМаркировки.Отправлен");
		Модифицированность = Истина;
	КонецЕсли;
	
КонецПроцедуры

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
	СписокВыбора = Элементы.Статус.СписокВыбора;
	СписокВыбора.Очистить();
	СписокВыбора.Добавить(Перечисления.СтатусыДокументовМаркировки.Новый);
	СписокВыбора.Добавить(Перечисления.СтатусыДокументовМаркировки.Отправлен);
	СписокВыбора.Добавить(Перечисления.СтатусыДокументовМаркировки.Выполнен);
	СписокВыбора.Добавить(Перечисления.СтатусыДокументовМаркировки.Отменен);
	
	СписокВыбора = Элементы.ОсобенностьУчета.СписокВыбора;
	СписокВыбора.ЗагрузитьЗначения(МаркировкаТоваровСервер.ОсобенностиУчетаДляСозданияДокументов());
	
	МаркировкаТоваровСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Элементы.Статус.ОтображениеПодсказки = ?(
		ЗначениеЗаполнено(Объект.ОписаниеОшибки),
		ОтображениеПодсказки.ОтображатьСправа,
		ОтображениеПодсказки.Нет
	);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(
		Элементы,
		"ИдентификаторДокумента",
		"Видимость",
		ЭтотОбъект.РежимОбменаСЧестнымЗнаком = ПредопределенноеЗначение("Перечисление.СпособыОбменаСЧестнымЗнаком.ЧерезAPI")
	);
	
	Если Объект.ХозОперация = Справочники.ХозОперации.РасформированиеАгрегатаИСМП Тогда
		Если Не Элементы.СтраницаУпаковки.Видимость Тогда
			Элементы.СтраницаУпаковки.Видимость = Истина;
		КонецЕсли;
		Элементы.ВидУпаковки.Видимость           = Истина;
		Элементы.СтраницаТрансформация.Видимость = Ложь;
		Элементы.СтраницаТовары.Видимость        = Ложь;
		Элементы.СформироватьУпаковки.Видимость  = Ложь;
		Элементы.ВыгрузитьДобавление.Видимость   = Ложь;
		Элементы.ВыгрузитьИзъятие.Видимость      = Ложь;
		Элементы.Выгрузить.Видимость             = Истина;
		Элементы.КодМаркировкиУпаковки.Видимость = Ложь;
		Если НЕ Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУпаковки Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаУпаковки;
		КонецЕсли;
	ИначеЕсли Объект.ХозОперация = Справочники.ХозОперации.ТрансформацияАгрегатаИСМП Тогда
		Если Не Элементы.СтраницаТрансформация.Видимость Тогда
			Элементы.СтраницаТрансформация.Видимость = Истина;
		КонецЕсли;
		Элементы.ВидУпаковки.Видимость           = Ложь;
		Элементы.СтраницаУпаковки.Видимость      = Ложь;
		Элементы.СтраницаТовары.Видимость        = Ложь;
		Элементы.СформироватьУпаковки.Видимость  = Ложь;
		Элементы.ВыгрузитьДобавление.Видимость   = Истина;
		Элементы.ВыгрузитьИзъятие.Видимость      = Истина;
		Элементы.Выгрузить.Видимость             = Ложь;
		Элементы.КодМаркировкиУпаковки.Видимость = Истина;
		Если НЕ Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТрансформация Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТрансформация;
		КонецЕсли;
	Иначе
		Если Не Элементы.СтраницаТовары.Видимость Тогда
			Элементы.СтраницаТовары.Видимость = Истина;
		КонецЕсли;
		Элементы.ВидУпаковки.Видимость           = Ложь;
		Элементы.СтраницаТрансформация.Видимость = Ложь;
		Элементы.СтраницаУпаковки.Видимость      = Ложь;
		Элементы.СформироватьУпаковки.Видимость  = Истина;
		Элементы.ВыгрузитьДобавление.Видимость   = Ложь;
		Элементы.ВыгрузитьИзъятие.Видимость      = Ложь;
		Элементы.Выгрузить.Видимость             = Истина;
		Элементы.КодМаркировкиУпаковки.Видимость = Ложь;
		Элементы.СформироватьУпаковки.Доступность = (НЕ Объект.УпаковкиСозданы);
		
		Если НЕ Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары;
		КонецЕсли;
	КонецЕсли;
	
	//ВключенЗапретИзмененияПроведённых = НЕ обПраво("РедактированиеПроведенныхДокументов",ДокументОбъект.Права);
	//ЭлементыФормы.ДействияФормы.Кнопки.ПередатьДанныеВЕГАИС.Доступность = (ДокументОбъект.Статус = Справочники.СтатусыОбработкиЕГАИС.ГотовКОтправке) И НЕ (ФормаДокумента.ТолькоПросмотр И НЕ ВключенЗапретИзмененияПроведённых);
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

&НаСервере
Процедура ОбновитьПредставленияНаФорме(Прочитать = Ложь)
	
	Если Прочитать Тогда
		Прочитать();
	Иначе
		ОбновитьСтатусОбработки();
	КонецЕсли;
	
	//ОбновитьИнформациюОткрытияФормыСканирования();
	//УправлениеДоступностьюЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформлениеПредставлениеМарок(ЭтотОбъект);
//	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформлениеАлкогольнаяПродукция(ЭтотОбъект);
	
КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
// Параметры:
//  ИмяСобытия - Строка - Имя события, при работе которого необходимо проверить блокировку.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	//Сформирован = НЕ (Документы.ФормированиеГрупповойТарыИСМП.ВидыСтатусовДвижений().Найти(СтатусОбработки) = Неопределено);
	//ЭлементыФомы = ";СтраницаДополнительно, Шапка";
	//СписокРеквизитов.Добавить("Марки", "Марки",Сформирован);
	//СписокРеквизитов.Добавить("Товары","Товары",Сформирован);
	//СписокРеквизитов.Добавить(ЭлементыФомы, ЭлементыФомы,Сформирован);
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомКлиент.ОткрытьПодборНоменклатуры(ЭтотОбъект, Истина);
	
КонецПроцедуры // ПодборНоменклатуры()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыИСМП.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	ОбновитьСтатусОбработки();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыИСМП.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДатаПриИзменении()

&НаСервере
Процедура СтатусПриИзмененииНаСервере()
	
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	
	СтатусПриИзмененииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусРасширеннаяПодсказкаНажатие(Элемент)
	
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("Заголовок", НСтр("ru = 'Ошибка при отправке запроса'"));
	ПараметрыФормы.Вставить("Сообщение", Объект.ОписаниеОшибки);
	
	ОткрытьФорму(
		"Обработка.МодульОбменаИСМП.Форма.ФормаСообщенияПользователю",
		ПараметрыФормы,
		ЭтотОбъект,
		, , , ,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыИСМП.ТоварыНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыНоменклатураПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыИСМП.ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Характеристика номенклатуры".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЕдиницаИзмеренияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыИСМП.ТоварыЕдиницаИзмеренияПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Единица измерения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЕдиницаИзмеренияПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество базовое" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоБазовоеПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыИСМП.ТоварыКоличествоБазовоеПриИзменении(Объект, ТекущиеДанные);
	
КонецПроцедуры // ТоварыКоличествоБазовоеПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество базовое".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоБазовоеПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоБазовоеПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоБазовоеПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыИСМП.ТоварыКоличествоПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Алкогольная продукция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	ПараметрыДействия = Новый Структура;
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыИСМП.ТоварыАлкогольнаяПродукцияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ИзмениласьНоменклатура", Ложь) Тогда
		ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия);
	КонецЕсли;

КонецПроцедуры // ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Алкогольная продукция".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыАлкогольнаяПродукцияПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыАлкогольнаяПродукцияПриИзмененииНаСервере();
	
КонецПроцедуры //ТоварыАлкогольнаяПродукцияПриИзменении()

// Обработчик события возникающего на клиенте  в момент нажатия кнопки выбора или клавиши F4 реквизита "Алкогольная продукция".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыАлкогольнаяПродукцияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыАлкогольнаяПродукцияНачалоВыбора(ЭтотОбъект, Элемент, ДанныеВыбора, СтандартнаяОбработка);
	
КонецПроцедуры //ТоварыАлкогольнаяПродукцияНачалоВыбора()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"


// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	УдаляемыеСтроки = Новый Массив;
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ, УдаляемыеСтроки);
	
КонецПроцедуры // ТоварыПередУдалением()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования,,, "");
		
КонецПроцедуры // ТоварыПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
&НаСервере
Процедура ТоварыПослеУдаленияНаСервере(ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Товары, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("УдаляемыеСтрокиМарки",УдаляемыеСтроки);
	
	// Обработаем событие в контексте сервера
	ТоварыПослеУдаленияНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТоварыПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // ТоварыПроверкаПеретаскивания()

// Обработчик события возникающего на клиенте при начале редактирования строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока - Булево - Признак редактирования новой строки.
//  Копирование - Булево - Определяет режим копирования.
//
&НаКлиенте
Процедура ТоварыПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элементы.Товары.ТекущиеДанные.ИдентификаторСтроки = Новый УникальныйИдентификатор;
	КонецЕсли;
	
КонецПроцедуры // ТоварыПриНачалеРедактирования()

&НаСервере
Процедура ЗаполнитьРеквизитыУпаковок()
	
	Для Каждого ТекущаяСтрока Из Объект.Товары Цикл
		Вместимость = ТекущаяСтрока.Коэффициент;
		УпаковкиСтроки = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ТекущаяСтрока.ИдентификаторСтроки));
		Для Каждого ТекущаяУпаковка Из УпаковкиСтроки Цикл
			МаркиВУпаковке = Объект.Марки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, КодМаркировкиУпаковки", ТекущаяСтрока.ИдентификаторСтроки, ТекущаяУпаковка.КодМаркировкиУпаковки));
			Упаковано = МаркиВУпаковке.Количество();
			
			ТекущаяУпаковка.Вместимость = Вместимость;
			ТекущаяУпаковка.Упаковано   = Упаковано;
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Упаковки.ОтборСтрок = Новый ФиксированнаяСтруктура("ИдентификаторСтроки", ТекущиеДанные.ИдентификаторСтроки);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при двойном щелчке мыши (нажатии клавиши Enter) в ячейке таблицы.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ВыбраннаяСтрока - Значение выбранной строки.
//  Поле - Булево - Активное поле (колонка).
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения стандартной (системной) обработки события.
//
&НаКлиенте
Процедура ТоварыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ИнтеграцияЕГАИСКлиент.ТоварыВыбор(Объект, ЭтотОбъект, Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка);
	
КонецПроцедуры //ТоварыВыбор()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ УПАКОВОК"

//&НаКлиенте
//Процедура МаркировкаУпаковокПриАктивизацииСтроки(Элемент)
//	
//	//ТекущиеДанныеТоваров = Элементы.Товары.ТекущиеДанные;
//	//Если ТекущиеДанныеТоваров = Неопределено Тогда
//	//	Возврат;
//	//КонецЕсли;
//	//
//	//ТекущиеДанные = Элементы.МаркировкаУпаковок.ТекущиеДанные;
//	//Если ТекущиеДанные = Неопределено Тогда
//	//	Элементы.МаркиСтроки.ОтборСтрок = Неопределено;
//	//	Возврат;
//	//КонецЕсли;
//	//
//	//Элементы.МаркиСтроки.ОтборСтрок = Новый ФиксированнаяСтруктура("КодМаркировкиУпаковки", ТекущиеДанные.КодМаркировкиУпаковки);
//	//
//КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ"

// Обработчик события возникающего при изменении данных реквизита "КодМарки" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура МаркиКодМаркиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Марки.НайтиПоИдентификатору(Элементы.МаркиСтроки.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.ФормированиеГрупповойТарыИСМП.МаркиКодМаркиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // МаркиКодМаркиПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура МаркиКодМаркиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Марки.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		
		ТекущиеДанные.КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущиеДанные.КодМаркировки);
		
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	МаркиКодМаркиПриИзмененииНаСервере();
	
КонецПроцедуры //МаркиКодМаркиПриИзменении()

&НаКлиенте
Функция ЭтоКодМаркировки(ШтрихКод, ТекстСообщения)
	
	ШтрихКод = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ШтрихКод, ТекстСообщения);
	Возврат ПустаяСтрока(ТекстСообщения);
	
КонецФункции

&НаКлиенте
Процедура МаркиСтрокиКодМаркиПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.МаркиСтроки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//ТекущиеДанные.КодМаркировки = МаркировкаТоваровКлиентСервер.ПолучитьКодМаркировки(ТекущиеДанные.КодМаркировки);
	ТекстСообщения = "";
	Если НЕ ЭтоКодМаркировки(ТекущиеДанные.КодМаркировки, ТекстСообщения) Тогда
		ВывестиСообщение(ТекстСообщения, ЭтотОбъект, "Товары[#].КодМаркировки", ТекущиеДанные.НомерСтроки);
		ТекущиеДанные.КодМаркировки = "";
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	МаркиКодМаркиПриИзмененииНаСервере();
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "МАРКИ"

&НаКлиенте
Процедура МаркиСтрокиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	ТекущиеДанные = Элементы.МаркиСтроки.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если НоваяСтрока И (НЕ ЗначениеЗаполнено(ТекущиеДанные.ИдентификаторСтроки)) Тогда
		ТекущиеДанные.ИдентификаторСтроки = Элементы.Товары.ТекущиеДанные.ИдентификаторСтроки;
		ТекущиеДанные.КодМаркировкиУпаковки  = Элементы.Упаковки.ТекущиеДанные.КодМаркировкиУпаковки;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МаркиСтрокиПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если Копирование Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Если Элементы.Упаковки.ТекущиеДанные = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура МаркиПередУдалением(Элемент, Отказ)                                                    
	
	// Определим структуру параметров обработки текущего события
	УдаляемыеСтроки = Новый Массив;
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.МаркиПередУдалением(ЭтотОбъект, Элемент, Отказ, УдаляемыеСтроки);
	
КонецПроцедуры // МаркиПередУдалением()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура МаркиПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	УправлениеДиалогомДокументаСервер.МаркиПослеУдаления(ЭтотОбъект, Элементы.Товары, ПараметрыДействия);
	
КонецПроцедуры // МаркиПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура МаркиПослеУдаления(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("УдаляемыеСтрокиМарки",УдаляемыеСтроки);
	
	// Обработаем событие в контексте сервера
	МаркиПослеУдаленияНаСервере(ПараметрыДействия);
	
КонецПроцедуры // МаркиПослеУдаления()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//
&НаКлиенте
Процедура МаркиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.МаркиПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования);

КонецПроцедуры // МаркиПриОкончанииРедактирования()

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.МаркиКДобавлению.ОтборСтрок = Новый ФиксированнаяСтруктура("Добавить", Истина);
	Элементы.МаркиКУдалению.ОтборСтрок   = Новый ФиксированнаяСтруктура("Удалить",  Истина);
	
	ОбновитьСтатусОбработки();
	
	Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		Если НЕ ЗначениеЗаполнено(СтрокаТабличнойЧасти.ИдентификаторСтроки) Тогда
			СтрокаТабличнойЧасти.ИдентификаторСтроки = Новый УникальныйИдентификатор;
		КонецЕсли;
	КонецЦикла;
	
	ЗаполнитьРеквизитыУпаковок();
	
	МаркировкаТоваровСервер.ИнициализироватьСлужебныеРеквизиты(ЭтотОбъект);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоМарка(ШтрихКод)
	
	Результат = Ложь;
	
	Если СтрДлина(ШтрихКод) = 68 ИЛИ СтрДлина(ШтрихКод) = 150 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция ЭтоУпаковка(ШтрихКод)
	
	Результат = Ложь;
	
	Если СтрДлина(ШтрихКод) = 26 Тогда
		Результат = Истина;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ПоискМарки(ШтрихКод)
	
	НайденныеСтроки = Объект.Марки.НайтиСтроки(Новый Структура("КодМарки", ШтрихКод));
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	ТаблицаМарок.Ссылка,
		|	ТаблицаМарок.НомерСтроки
		|ИЗ
		|	Документ.ФормированиеГрупповойТарыИСМП.Марки КАК ТаблицаМарок
		|ГДЕ
		|	ТаблицаМарок.КодМарки = &ШтрихКод
		|";
		
		Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
		РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			ВывестиСообщение(НСтр("ru = 'Марка: %1 не найдена'"), Объект,,,, ШтрихКод);
		Иначе
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ВывестиСообщение(НСтр("ru = 'Марка: %1 используется в документе: %2'"), Объект, "Марки[#].КодМарки", Выборка.НомерСтроки,, ШтрихКод, Выборка.Ссылка);
		КонецЕсли;
		
	Иначе
		Элементы.Марки.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПоискУпаковки(ШтрихКод)
	
	НайденныеУпаковки = Объект.Упаковки.НайтиСтроки(Новый Структура("КодМаркировкиУпаковки", ШтрихКод));
	Если НайденныеУпаковки.Количество()>0 Тогда
		Элементы.Упаковки.ТекущаяСтрока = НайденныеУпаковки[0].ПолучитьИдентификатор();
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ТаблицаУпаковки.Ссылка,
	|	ТаблицаУпаковки.НомерСтроки
	|ИЗ
	|	Документ.ФормированиеГрупповойТарыИСМП.Упаковки КАК ТаблицаУпаковки
	|ГДЕ
	|	ТаблицаУпаковки.КодМаркировкиУпаковки = &ШтрихКод
	|";
	
	Запрос.УстановитьПараметр("ШтрихКод", ШтрихКод);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		ВывестиСообщение(НСтр("ru = 'Упаковка: %1 не найдена'"), Объект,,,, ШтрихКод);
	Иначе
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ВывестиСообщение(НСтр("ru = 'Упаковка: %1 используется в документе: %2'"), Объект, "Упаковки[#].КодМаркировкиУпаковки", Выборка.НомерСтроки,, ШтрихКод, Выборка.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеМарки(ШтрихКод)
	
	НайденныеСтроки = Объект.Марки.НайтиСтроки(Новый Структура("КодМарки", ШтрихКод));
	Если НайденныеСтроки.Количество() = 0 Тогда
		
		Если Элементы.Товары.ТекущаяСтрока = Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Не выбрана товарная строка'"), Объект);
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
		ИдентификаторСтроки = ТекущиеДанные.ИдентификаторСтроки;
		
		ИтогУпаковано = 0;
		ТаблицаУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки", ИдентификаторСтроки));
		Для Каждого СтрокаУпаковки Из ТаблицаУпаковок Цикл
			ИтогУпаковано = ИтогУпаковано + СтрокаУпаковки.Упаковано;
		КонецЦикла;
		
		Если ТекущиеДанные.КоличествоБазовое <= ИтогУпаковано Тогда
			ВывестиСообщение(НСтр("ru = 'Внимание, текущая товарная позиция уже заполнена. Отсканируйте марку в другую товарную позицию'"), Объект);
			Возврат;
		КонецЕсли;
		
		Если Элементы.Упаковки.ТекущаяСтрока = Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Не выбрана строка с упаковкой'"), Объект);
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Объект.Упаковки.НайтиПоИдентификатору(Элементы.Упаковки.ТекущаяСтрока);
		Если ТекущиеДанные.Упаковано = ТекущиеДанные.Вместимость Тогда
			ВывестиСообщение(НСтр("ru = 'Внимание, текущая упаковка уже заполнена. Отсканируйте марку в другую упаковку'"), Объект);
			Возврат;
		КонецЕсли;
		
		КодМаркировкиУпаковки = ТекущиеДанные.КодМаркировкиУпаковки;
		
		НоваяСтрока = Объект.Марки.Добавить();
		НоваяСтрока.ИдентификаторСтроки = ИдентификаторСтроки;
		НоваяСтрока.КодМаркировкиУпаковки  = КодМаркировкиУпаковки;
		НоваяСтрока.КодМарки            = ШтрихКод;
		
		Модифицированность = Истина;
		
		ТекущиеДанные.Упаковано = ТекущиеДанные.Упаковано + 1;
		
	Иначе
		ДанныеНайденнойМарки = НайденныеСтроки[0];
		Если Элементы.Упаковки.ТекущаяСтрока = Неопределено Тогда
			ВывестиСообщение(НСтр("ru = 'Данная марка уже внесена в упаковку: %1'"), Объект,,,, ДанныеНайденнойМарки.КодМаркировкиУпаковки);
		Иначе
			ТекущиеДанные = Объект.Упаковки.НайтиПоИдентификатору(Элементы.Упаковки.ТекущаяСтрока);
			Если ТекущиеДанные.КодМаркировкиУпаковки = ДанныеНайденнойМарки.КодМаркировкиУпаковки Тогда
				ВывестиСообщение(НСтр("ru = 'Данная марка уже внесена в текущую упаковку'"));
			Иначе
				ВывестиСообщение(НСтр("ru = 'Данная марка уже внесена в упаковку: %1'"), Объект,,,, ДанныеНайденнойМарки.КодМаркировкиУпаковки);
			КонецЕсли;
		КонецЕсли;
		//Элементы.Марки.ТекущаяСтрока = НайденныеСтроки[0].ПолучитьИдентификатор();
	КонецЕсли;
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	Если ИмяСобытия = "ИзменениеСостоянияЕГАИС"
		И Параметр.Ссылка = Объект.Ссылка Тогда
		
		Если Параметр.Свойство("ОбъектИзменен")
			И Параметр.ОбъектИзменен Тогда
			ОбновитьПредставленияНаФорме(Истина);
		Иначе
			ОбновитьПредставленияНаФорме(Ложь);
		КонецЕсли;
		
	КонецЕсли;
	
	Если ИмяСобытия = "ВыполненОбменЕГАИС"
		И (Параметр = Неопределено
		Или (ТипЗнч(Параметр) = Тип("Структура") И Параметр.ОбновлятьСтатусЕГАИСВФормахДокументов)) Тогда
		
		ОбновитьПредставленияНаФорме(Истина);
		
	КонецЕсли;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	ШтрихКод = ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ШтрихКод", "");
	Если ЭтоУпаковка(ШтрихКод) Тогда
		ПоискУпаковки(ШтрихКод);
		Возврат;
	КонецЕсли;
	
	Если ЭтоМарка(ШтрихКод) Тогда
		
		Если Элементы.Товары.ТекущиеДанные = Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбрана товарная строка'"), 5, НСтр("ru = 'Ошибка сканирования'"));
			Возврат;
		КонецЕсли;
		
		Если Элементы.Упаковки.ТекущиеДанные = Неопределено Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Не выбрана строка с упаковкой'"), 5, НСтр("ru = 'Ошибка сканирования'"));
			Возврат;
		КонецЕсли;
		
		ТекущиеДанные = Элементы.Упаковки.ТекущиеДанные;
		Если ТекущиеДанные.Упаковано = ТекущиеДанные.Вместимость Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Внимание, текущая упаковка уже заполнена. Отсканируйте марку в другую упаковку'"), 5, НСтр("ru = 'Ошибка сканирования'"));
			Возврат;
		КонецЕсли;
		
		Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаТовары Тогда
			
			ДобавлениеМарки(ШтрихКод);
			
		ИначеЕсли Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаМарки Тогда
			
			ПоискМарки(ШтрихКод);
			
		КонецЕсли;
		
		Возврат;
		
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.МаркиКДобавлению.ОтборСтрок = Новый ФиксированнаяСтруктура("Добавить", Истина);
	Элементы.МаркиКУдалению.ОтборСтрок   = Новый ФиксированнаяСтруктура("Удалить",  Истина);
	
	МаркировкаТоваровСервер.ИнициализироватьСлужебныеРеквизиты(ЭтотОбъект);
	
	ОбновитьСтатусОбработки();
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	ЗаполнитьРеквизитыУпаковок();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьРеквизитыУпаковок();
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	ОбновитьСтатусОбработки();
		
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура СтатусОбработкиПредставлениеОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ОчиститьСообщения();
	
	Если Модифицированность ИЛИ (Не ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		ОписаниеОповещенияВопрос = Новый ОписаниеОповещения("СтатусОбработкиОбработкаНавигационнойСсылкиЗавершение", ЭтотОбъект, Новый Структура("НавигационнаяСсылкаФорматированнойСтроки", НавигационнаяСсылкаФорматированнойСтроки));
		ТекстВопроса = НСтр("ru = 'Для продолжения документ необходимо записать. Записать?'");
		ПоказатьВопрос(ОписаниеОповещенияВопрос, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		ОбработатьНажатиеНавигационнойСсылки(НавигационнаяСсылкаФорматированнойСтроки);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеПодбораМарок(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеСтроки = ДополнительныеПараметры.ДанныеСтроки;
	
	ИнтеграцияЕГАИСКлиент.ПослеПодбораМарок(ЭтотОбъект, Объект, ДанныеСтроки, Результат);
	
	ТоварыКоличествоПриИзменении(Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркиПриАктивизацииСтроки(Элемент)
	
	//СтрокиУпаковок = ДеревоУпаковок.ПолучитьЭлементы();
	//СтрокиУпаковок.Очистить();
	ТекущиеДанные = Элементы.Марки.ТекущиеДанные;
	Если Объект.Марки.Количество() = 0 ИЛИ ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.Упаковки.ОтборСтрок = Новый ФиксированнаяСтруктура("КодМаркировкиУпаковки", ТекущиеДанные.КодМаркировкиУпаковки);
	
	//Если ЗначениеЗаполнено(ТекущиеДанные.КодМаркировкиУпаковки) Тогда
	//	НоваяУпаковка = СтрокиУпаковок.Добавить();
	//	НоваяУпаковка.КодМаркировкиУпаковки = ТекущиеДанные.КодМаркировкиУпаковки;
	//	Элементы.ДеревоУпаковок.ТекущаяСтрока = НоваяУпаковка;
	//КонецЕсли;
	
	//МассивУпаковок = Объект.Упаковки.НайтиСтроки(Новый Структура("ИдентификаторСтроки, КодМаркировкиУпаковки", ТекущиеДанные.ИдентификаторСтроки, ТекущиеДанные.КодМаркировкиУпаковки));
	//ВложенностьУпаковки = МассивУпаковок.Количество();
	//
	//Пока ВложенностьУпаковки > 0 Цикл
	//	
	//	Для Каждого СтрокаУпаковки Из МассивУпаковок Цикл
	//		Если СтрокаУпаковки.УровеньВложенности = ВложенностьУпаковки Тогда
	//			НоваяУпаковка = СтрокиУпаковок.Добавить();
	//			НоваяУпаковка.КодМаркировкиУпаковки = СтрокаУпаковки.КодМаркировкиГруппыУпаковок;
	//			СтрокиУпаковок = НоваяУпаковка.ПолучитьЭлементы();
	//			Прервать;
	//		КонецЕсли;
	//	КонецЦикла;
	//	
	//	ВложенностьУпаковки = ВложенностьУпаковки - 1;
	//	
	//КонецЦикла;
	
	//Если ЗначениеЗаполнено(ТекущиеДанные.КодМаркировкиУпаковки) Тогда
	//	НоваяУпаковка = СтрокиУпаковок.Добавить();
	//	НоваяУпаковка.КодМаркировкиУпаковки = ТекущиеДанные.КодМаркировкиУпаковки;
	//	Элементы.ДеревоУпаковок.ТекущаяСтрока = НоваяУпаковка;
	//КонецЕсли;
	//
КонецПроцедуры

&НаКлиенте
Процедура МаркиСтрокиПередУдалением(Элемент, Отказ)
	
	КоличествоУдаленныхМарок = Элементы.МаркиСтроки.ВыделенныеСтроки.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура МаркиСтрокиПослеУдаления(Элемент)
	
	ТекущиеДанные = Элементы.Упаковки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные.Упаковано = Макс(0, ТекущиеДанные.Упаковано-КоличествоУдаленныхМарок);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТовары(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПоискВТаблицеТоварыРезультатОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТоварыРезультатОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ШтрихКодДляПоиска = РезультатОповещения;
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ПоискПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКоду(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавлениеНовыхПозицийПоШтрихКодуОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКодуОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ДобавлениеНовыхПозицийПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборВТаблицеТовары(Команда)
	Элементы.Товары.ОтборСтрок = Неопределено;
КонецПроцедуры

&НаКлиенте
Процедура УпаковкиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанныеТоваров = Элементы.Товары.ТекущиеДанные;
	Если ТекущиеДанныеТоваров = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.Упаковки.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Элементы.МаркиСтроки.ОтборСтрок = Неопределено;
		Возврат;
	КонецЕсли;
	
	Элементы.МаркиСтроки.ОтборСтрок = Новый ФиксированнаяСтруктура("КодМаркировкиУпаковки", ТекущиеДанные.КодМаркировкиУпаковки);
	
КонецПроцедуры

&НаКлиенте
Процедура МаркиКДобавлениюПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	НоваяСтрока = Объект.Марки.Добавить();
	НоваяСтрока.Добавить = Истина;
	
	Элементы.Марки.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура МаркиКУдалениюПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Истина;
	НоваяСтрока = Объект.Марки.Добавить();
	НоваяСтрока.Удалить = Истина;
	
	Элементы.Марки.ТекущаяСтрока = НоваяСтрока.ПолучитьИдентификатор();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьИзъятие(Команда)
	
	ВыполнитьВыгрузку("ОтправкаЗапросаТрансформацияАгрегацииИзъятие");
	
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьДобавление(Команда)
	
	ВыполнитьВыгрузку("ОтправкаЗапросаТрансформацияАгрегацииДобавление");
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ШтрихКодДляПоиска = "";
