
#Область ОбработкаСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьОтображениеЭлементовФормы();	
	
КонецПроцедуры

&НаКлиенте
Процедура РасположениеПриИзменении(Элемент)
	
	ОбновитьОтображениеЭлементовФормы();		
	
КонецПроцедуры

&НаКлиенте
Процедура ПолноеИмяФайлаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ОбработчикЗавершения = Новый ОписаниеОповещения("ПолноеИмяФайлаЗавершениеВыбора", ЭтаФорма);
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	ДиалогОткрытияФайла.Фильтр = НСтр("ru = 'Обработка'; en = 'Processing'") + "(*.epf)|*.epf";
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл обработки";
	ДиалогОткрытияФайла.Показать(ОбработчикЗавершения);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработкаКомандФормы

&НаКлиенте
Процедура СформироватьКлюч(Команда)
	
	КлючРодителя = ПолучитьКлючРодителя();
	КлючЭлемента = SSL_IT_СтроковыеФункцииКлиентСервер.ПолучитьКлючПоСтроке(Объект.Наименование);
	
	Если ПустаяСтрока(КлючРодителя) Тогда 
		Объект.Ключ = КлючЭлемента;
	Иначе
		Объект.Ключ = СтрШаблон("%1_%2", КлючРодителя, КлючЭлемента);
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьОтображениеЭлементовФормы()
	
	Элементы.СсылкаНаМетаданные.Видимость = 
		(Объект.Расположение = ПредопределенноеЗначение("Перечисление.SSL_IT_ВариантыРасположенияОбработок.Конфигурация"));
	
	Элементы.СсылкаНаОбработку.Видимость = 
		(Объект.Расположение = ПредопределенноеЗначение("Перечисление.SSL_IT_ВариантыРасположенияОбработок.Справочник"));
		
	Элементы.ПолноеИмяФайла.Видимость = 
		(Объект.Расположение = ПредопределенноеЗначение("Перечисление.SSL_IT_ВариантыРасположенияОбработок.Диск"));	
		
КонецПроцедуры	

&НаКлиенте
Процедура ПолноеИмяФайлаЗавершениеВыбора(МассивФайлов, ДополнительныеПараметры) Экспорт
	
	Если МассивФайлов <> Неопределено 
		И МассивФайлов.Количество() > 0 Тогда 
		Модифицированность = Истина;
		Объект.ПолноеИмяФайла = МассивФайлов.Получить(0);	
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ПолучитьКлючРодителя()
	
	Возврат Объект.Родитель.Ключ;
	
КонецФункции	

#КонецОбласти