
#Область ПрограммныйИнтерфейс

// Устанавливает стандартный интерфейс клиентского приложения.
//
Процедура УстановитьСтандартныйИнтерфейс() Экспорт
	
	Настройки = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
	НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	
	НастройкиСостава.Верх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых"));
	Лево = Новый ГруппаНастройкиСоставаИнтерфейсаКлиентскогоПриложения;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ТорговыйКомплексЭДО.ВерсияРежимаСовместимости(), "8.3.15.0") < 0 Тогда 
		Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельИнструментов"));
	КонецЕсли;
	Лево.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельРазделов"));
	НастройкиСостава.Лево.Добавить(Лево);
	
	Настройки.УстановитьСостав(НастройкиСостава);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Настройки);
	
	НачальнаяСтраница = Новый НастройкиНачальнойСтраницы;
	СоставФорм = Новый СоставФормНачальнойСтраницы;
	СоставФорм.ЛеваяКолонка.Добавить(ТорговыйКомплексЭДО.ФормаОбменСКонтрагентамиТекущиеДелаПоЭДО());
	НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);
	ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиНачальнойСтраницы", "", НачальнаяСтраница);
	
КонецПроцедуры

// Переопределяет получение формы счета-фактуры.
//
// Параметры:
//  ВидФормы				 - Строка - Имя стандартной формы.
//  Параметры				 - Структура - Параметры формы.
//  ВыбраннаяФорма			 - Строка - Имя открываемой формы.
//  ДополнительнаяИнформация - Структура - Дополнительная информация открытия формы.
//  СтандартнаяОбработка	 - Булево - Признак отказа от выполнения операции.
//
Процедура ОбработкаПолученияФормыСчетаФактуры(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка) Экспорт
	
	Если ВидФормы = "ФормаСписка"
		ИЛИ ВидФормы = "ФормаВыбора" Тогда
		Возврат;
	КонецЕсли;
	
	ВидДокумента = Неопределено;
	Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
		ВидДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "ВидДокумента");
		
	ИначеЕсли Параметры.Свойство("ЗначенияЗаполнения") Тогда
		Если Параметры.ЗначенияЗаполнения.Свойство("ВидДокумента") Тогда
			ВидДокумента = Параметры.ЗначенияЗаполнения.ВидДокумента;
		ИначеЕсли Параметры.ЗначенияЗаполнения.Свойство("Основание")
			И ТипЗнч(Параметры.ЗначенияЗаполнения.Основание) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
			ВидДокумента = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.ЗначенияЗаполнения.Основание, "ВидДокумента");
		КонецЕсли;
		
	ИначеЕсли Параметры.Свойство("ЗначениеКопирования") И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
		ВидДокумента = Параметры.ЗначениеКопирования.ВидДокумента;
		
	КонецЕсли;
	
	//Если ВидДокумента = Перечисления.ВидыДокументов.СчетФактураНаАванс Тогда
	//	СтандартнаяОбработка = Ложь;
	//	ВыбраннаяФорма = "ФормаДокументаНаАванс";
	//КонецЕсли;
	
КонецПроцедуры

// Выполняет поиск номенклатуры в регистре сведений "Штрихкоды".
//
// Параметры:
//  Штрихкод - Строка - штрих-код товара.
// 
// Возвращаемое значение:
//  Массив - найденные товары.
//  Неопределено - если товар не найден.
//
Функция НоменклатураПоШтрихкоду(Знач Штрихкод) Экспорт
	
	НоменклатураПоШтрихкоду = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(Штрихкод);
	
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(НоменклатураПоШтрихкоду);
	
КонецФункции

// См. ОбщегоНазначения.ЗначенияРеквизитовОбъекта.
//
Функция ЗначенияРеквизитовОбъекта(Ссылка, Знач Реквизиты, ВыбратьРазрешенные = Ложь) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, Реквизиты, ВыбратьРазрешенные);
	
КонецФункции

// См. ОбщегоНазначения.ЗначениеРеквизитаОбъекта.
//
Функция ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные = Ложь)  Экспорт
	
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, ИмяРеквизита, ВыбратьРазрешенные);

КонецФункции

// Выполняет поиск номенклатуры по идентификатору сервиса 1С:Номенклатура.
// 
// Параметры:
//  ИдентификаторНоменклатуры - Строка - идентификатор в сервисе 1С:Номенклатура.
//  ИдентификаторФормы - Строка - уникальный идентификатор формы.
//
// Возвращаемое значение:
//  Структура - Данные номенклатуры.
//
Функция ДанныеНоменклатурыСервиса(Знач ИдентификаторНоменклатуры, Знач ИдентификаторФормы) Экспорт
	
	ДанныеНоменклатуры = Новый Структура;
	
	НоменклатураИХарактеристика = Новый Структура;
	НоменклатураИХарактеристика.Вставить("ИдентификаторНоменклатуры", ИдентификаторНоменклатуры);
	НоменклатураИХарактеристика.Вставить("ИдентификаторХарактеристики");
	
	Идентификаторы = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(НоменклатураИХарактеристика);
	ТаблицаНоменклатуры = РаботаСНоменклатурой.НоменклатураИХарактеристикиПоИдентификаторам(Идентификаторы);
	Если ЗначениеЗаполнено(ТаблицаНоменклатуры) Тогда
		ДанныеНоменклатуры.Вставить("Загружена", Истина);
		ДанныеНоменклатуры.Вставить("Ссылка", ТаблицаНоменклатуры[0].Номенклатура);
		Возврат ДанныеНоменклатуры;
	КонецЕсли;
	
	ПараметрыОперации = Новый Структура("Идентификаторы, АктуализироватьВспомогательныеДанные, ПолучатьТолькоОсновныеДанные",
		ИдентификаторНоменклатуры, Ложь, Истина);
	
	ДлительнаяОперация = РаботаСНоменклатуройСлужебныйВызовСервера.ПолучитьДанныеНоменклатурыСервиса(
		ПараметрыОперации, ИдентификаторФормы, Неопределено);
	
	ДанныеНоменклатуры.Вставить("Загружена", Ложь);
	ДанныеНоменклатуры.Вставить("ДлительнаяОперация", ДлительнаяОперация);
	
	Возврат ДанныеНоменклатуры;
	
КонецФункции

// Возвращает документы-основания по счету-фактуре для создания корректировки.
//
// Параметры:
//  СчетФактура - СправочникСсылка.СчетФактураВыданный - исправляемый документ счет-фактура.
//  ВидОперации - ПеречислениеСсылка.ВидыОпераций - операция корректировки счета-фактуры.
// 
// Возвращаемое значение:
//  Массив - параметры открытия формы объекта счета-фактуры.
//     * - ДокументСсылка.РеализацияТоваров - основание счета-фактуры.
//
Функция ОснованияСчетаФактурыВыданногоДляКорректировки(Знач СчетФактура, Знач ВидОперации) Экспорт
	
	Возврат ТорговыйКомплексЭДО.ОснованияСчетаФактурыВыданногоДляКорректировки(СчетФактура, ВидОперации);
	
КонецФункции

Функция КоэффициентПересчетаВБазовыеЕдиницы(Знач Упаковка) Экспорт
	
	Если ЗначениеЗаполнено(Упаковка) Тогда
		Коэффициент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Упаковка, "Коэффициент");
	Иначе
		Коэффициент = 1;
	КонецЕсли;
	
	Возврат Коэффициент;
	
КонецФункции

#Область СозданиеНовогоКонтрагентаПриВводе

// Формирует строку "Создать" при отсутствии данных выбора.
//
// Параметры:
//  Параметры			 - Структура - смотри одноименный параметр события "АвтоПодбор"/"ОкончаниеВводаТекста".
//  ОкончаниеВводаТекста - Булево - признак обработки события "ОкончаниеВводаТекста".
// 
// Возвращаемое значение:
//  СписокЗначений - список данных выбора при вводе по строке, автоподборе текста и быстром выборе.
//
Функция ДанныеВыбораКонтрагента(Параметры, ОкончаниеВводаТекста = Ложь) Экспорт

	ДанныеВыбора = Справочники.Контрагенты.ПолучитьДанныеВыбора(Параметры);
	Если ДанныеВыбора.Количество() = 0 Тогда
		СтрокаПоиска = СокрЛП(Параметры.СтрокаПоиска);
		ДлинаСтроки  = СтрДлина(СтрокаПоиска);
		ЭтоСтрокаИНН = СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(СтрокаПоиска);
		Если ЭтоСтрокаИНН Тогда
			МассивПодстрок = Новый Массив;
			МассивПодстрок.Добавить(НСтр("ru='Создать: ИНН'"));
			МассивПодстрок.Добавить(" ");
			ИНН = Лев(СтрокаПоиска, 12);
			ЭтоКорректныйИНН = (ДлинаСтроки = 10
				И РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, Истина, ""))
				ИЛИ (ДлинаСтроки = 12
				И РегламентированныеДанныеКлиентСервер.ИННСоответствуетТребованиям(ИНН, Ложь, ""));
			Если ЭтоКорректныйИНН Тогда
				МассивПодстрок.Добавить(
					Новый ФорматированнаяСтрока(ИНН, ШрифтыСтиля.ЖирныйШрифтБЭД, ЦветаСтиля.РезультатУспехЦвет));
			Иначе
				МассивПодстрок.Добавить(ИНН);
			КонецЕсли;
			СколькоВопросов = ?(ЭтоКорректныйИНН ИЛИ ДлинаСтроки >= 12, 0, 
				?(ДлинаСтроки < 10, 10 - ДлинаСтроки, 12 - ДлинаСтроки));
			ЗнакиВопроса = Лев("????????????", СколькоВопросов);
			ЛишниеЦифры  = Сред(СтрокаПоиска, 13);
			МассивПодстрок.Добавить(
				Новый ФорматированнаяСтрока(ЗнакиВопроса + ЛишниеЦифры, , ЦветаСтиля.ЦветТекстаНекорректногоКонтрагента));
			ПредставлениеНового = Новый ФорматированнаяСтрока(МассивПодстрок);
		Иначе
			ПредставлениеНового = СтрШаблон(НСтр("ru='Создать: %1'"), СтрокаПоиска);
		КонецЕсли;
		ДанныеВыбора.Добавить(СтрокаПоиска, ПредставлениеНового);
		Если ОкончаниеВводаТекста Тогда
			// Добавляем вторую строку, чтобы в этом режиме не срабатывал автовыбор единственной строки.
			ДанныеВыбора.Добавить(""); 
		КонецЕсли;
	КонецЕсли;
	
	Возврат ДанныеВыбора;

КонецФункции 

#КонецОбласти

//// Настраивает интерфейс приложения
////
//// Параметры:
////  СтруктураПараметров - Структура - параметры, полученные на клиенте, содержит поля:
////    * ЭтоМобильныйКлиент - Булево - если Истина, то запущен мобильный клиент
////    * ПоказыватьСтартовыйПомощникКЭДО - Булево - если Истина, то нужно запустить помощник.
////  ТребуетсяОбновлениеИнтерфейса - Булево - признак необходимости вызвать функцию ОбновитьИнтерфейс().
////
//Процедура НастроитьИнтерфейс(Знач СтруктураПараметров, ТребуетсяОбновлениеИнтерфейса) Экспорт
//	
//	ПоказатьСкрытьСодержимоеПанелей(СтруктураПараметров.ЭтоМобильныйКлиент, ТребуетсяОбновлениеИнтерфейса);
//	
//	Если СтруктураПараметров.ПоказыватьСтартовыйПомощникКЭДО Тогда
//		Если УстановитьИнтерфейсСтартовыйПомощникКЭДО() Тогда
//			ТребуетсяОбновлениеИнтерфейса = Истина;
//		КонецЕсли;
//	Иначе
//		Если ТорговыйКомплексЭДО.ВосстановитьСистемныеНастройки() Тогда
//			ТребуетсяОбновлениеИнтерфейса = Истина;
//		КонецЕсли;
//	КонецЕсли;

//КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ФормаПустойРабочийСтол()
	
	Возврат "ОбщаяФорма.ПустойРабочийСтол";

КонецФункции

Процедура СохранитьНастройкиСтартовогоПомощникаКЭДО(НастройкиПомощникаКЭДО) Экспорт
	
	ХранилищеНастроекПомощника = Новый ХранилищеЗначения(НастройкиПомощникаКЭДО);
	
	УстановитьПривилегированныйРежим(Истина);
	Константы.НастройкиСтартовогоПомощникаКЭДО.Установить(ХранилищеНастроекПомощника);
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

// Устанавливает стартовый помощник ЭДО как начальный интерфейс клиентского приложения.
//
// Возвращаемое значение:
//  Булево - признак установления интерфейса стартовый помощник ЭДО.
//
Функция УстановитьИнтерфейсСтартовыйПомощникКЭДО()
	
	Форма = ТорговыйКомплексЭДО.ФормаСтартовыйПомощникКЭДО();
	
	ПустаяФорма = ФормаПустойРабочийСтол();
	
	КлючОбъектаХраненияНачальнойСтраницы      = "НастройкиНачальнойСтраницыКЭДО";
	КлючОбъектаНачальнойСтраницыПередОчисткой = "Общее/НастройкиНачальнойСтраницыПередОчисткой";
	КлючОбъектаХраненияПриложения             = "НастройкиИнтерфейсаКлиентскогоПриложенияКЭДО";
	
	КлючОбъектаНачальнойСтраницы         = "Общее/НастройкиНачальнойСтраницы";
	КлючОбъектаПриложения                = "Общее/НастройкиИнтерфейсаКлиентскогоПриложения";
	
	СохраненныеНастройкиНачальнойСтраницы = ХранилищеСистемныхНастроек.Загрузить(КлючОбъектаХраненияНачальнойСтраницы);
	НачальнаяСтраницаНастройки = ХранилищеСистемныхНастроек.Загрузить(КлючОбъектаНачальнойСтраницы);
	
	Если НЕ ТорговыйКомплексЭДО.ФормаУстановленаНаНачальнойСтранице(НачальнаяСтраницаНастройки, Форма) Тогда
		
		НастройкиПриложения = ХранилищеСистемныхНастроек.Загрузить(КлючОбъектаПриложения, "");
		СохраненныеНастройкиПриложения = ХранилищеСистемныхНастроек.Загрузить(КлючОбъектаХраненияПриложения, "");
		
		Если НЕ ТорговыйКомплексЭДО.ФормаУстановленаНаНачальнойСтранице(НачальнаяСтраницаНастройки, ПустаяФорма) Тогда
			ХранилищеСистемныхНастроек.Сохранить(КлючОбъектаХраненияНачальнойСтраницы, "", НачальнаяСтраницаНастройки);
			ХранилищеСистемныхНастроек.Сохранить(КлючОбъектаХраненияПриложения, "", НастройкиПриложения);
		Иначе
			ХранилищеСистемныхНастроек.Сохранить(КлючОбъектаНачальнойСтраницыПередОчисткой, "", СохраненныеНастройкиНачальнойСтраницы);
			ХранилищеСистемныхНастроек.Сохранить(КлючОбъектаХраненияНачальнойСтраницы, "", СохраненныеНастройкиНачальнойСтраницы);
			Если СохраненныеНастройкиПриложения = Неопределено Тогда
				ХранилищеСистемныхНастроек.Сохранить(КлючОбъектаХраненияПриложения, "", НастройкиПриложения);
			Иначе
				ХранилищеСистемныхНастроек.Сохранить(КлючОбъектаХраненияПриложения, "", СохраненныеНастройкиПриложения);
			КонецЕсли;
		КонецЕсли;
		
		Настройки        = Новый НастройкиИнтерфейсаКлиентскогоПриложения;
		НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения;
		Настройки.УстановитьСостав(НастройкиСостава);
		
		ХранилищеСистемныхНастроек.Сохранить(КлючОбъектаПриложения, "", Настройки);
		
		НачальнаяСтраница = Новый НастройкиНачальнойСтраницы;
		СоставФорм        = Новый СоставФормНачальнойСтраницы;
		СоставФорм.ЛеваяКолонка.Добавить(Форма);
		НачальнаяСтраница.УстановитьСоставФорм(СоставФорм);
		
		ХранилищеСистемныхНастроек.Сохранить(КлючОбъектаНачальнойСтраницы, "", НачальнаяСтраница);
		
		Возврат Истина;
		
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Процедура ПоказатьСкрытьСодержимоеПанелей(ЭтоМобильныйКлиент, ТребуетсяОбновлениеИнтерфейса)
	
	//УстановитьПривилегированныйРежим(Истина);
	//СравнениеЗначений = Новый СравнениеЗначений;
	//
	//ТекущиеНастройкиПанелиРазделов = ХранилищеСистемныхНастроек.Загрузить(
	//	"Общее/ПанельРазделов/НастройкиКомандногоИнтерфейса");
	//ПанельРазделов = Обработки.НачалоРаботыКЭДО.ПолучитьМакет("ПанельРазделов");
	//СтрокаНастроек = ПанельРазделов.ПолучитьТекст();
	//ПанельРазделовДляМобильногоКлиента = ЗначениеИзСтрокиВнутр(СтрокаНастроек);
	//Если СравнениеЗначений.Сравнить(ТекущиеНастройкиПанелиРазделов, ПанельРазделовДляМобильногоКлиента) <> 0 Тогда
	//	ХранилищеСистемныхНастроек.Сохранить("ПанельРазделовКЭДО", , ТекущиеНастройкиПанелиРазделов);
	//	Если ЭтоМобильныйКлиент Тогда
	//		ТребуетсяОбновлениеИнтерфейса = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//ТекущиеНастройкиПанелиНавигации = ХранилищеСистемныхНастроек.Загрузить(
	//	"ОсновнойРаздел/ПанельНавигации/НастройкиКомандногоИнтерфейса");
	//ПанельНавигации = Обработки.НачалоРаботыКЭДО.ПолучитьМакет("ПанельНавигации");
	//СтрокаНастроек = ПанельНавигации.ПолучитьТекст();
	//ПанельНавигацииДляМобильногоКлиента = ЗначениеИзСтрокиВнутр(СтрокаНастроек);
	//Если СравнениеЗначений.Сравнить(ТекущиеНастройкиПанелиНавигации, ПанельНавигацииДляМобильногоКлиента) <> 0 Тогда
	//	ХранилищеСистемныхНастроек.Сохранить("ПанельНавигацииКЭДО", , ТекущиеНастройкиПанелиНавигации);
	//	Если ЭтоМобильныйКлиент Тогда
	//		ТребуетсяОбновлениеИнтерфейса = Истина;
	//	КонецЕсли;
	//КонецЕсли;

	//ТекущиеНастройкиПанелиДействий = ХранилищеСистемныхНастроек.Загрузить(
	//	"ОсновнойРаздел/ПанельДействий/НастройкиКомандногоИнтерфейса");
	//ПанельДействий = Обработки.НачалоРаботыКЭДО.ПолучитьМакет("ПанельДействий");
	//СтрокаНастроек = ПанельДействий.ПолучитьТекст();
	//ПанельДействийДляМобильногоКлиента = ЗначениеИзСтрокиВнутр(СтрокаНастроек);
	//Если СравнениеЗначений.Сравнить(ТекущиеНастройкиПанелиДействий, ПанельДействийДляМобильногоКлиента) <> 0 Тогда
	//	ХранилищеСистемныхНастроек.Сохранить("ПанельДействийКЭДО", , ТекущиеНастройкиПанелиДействий);
	//	Если ЭтоМобильныйКлиент Тогда
	//		ТребуетсяОбновлениеИнтерфейса = Истина;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если ЭтоМобильныйКлиент Тогда
	//	ХранилищеСистемныхНастроек.Сохранить(
	//		"Общее/ПанельРазделов/НастройкиКомандногоИнтерфейса", , ПанельРазделовДляМобильногоКлиента);
	//	ХранилищеСистемныхНастроек.Сохранить(
	//		"ОсновнойРаздел/ПанельНавигации/НастройкиКомандногоИнтерфейса", , ПанельНавигацииДляМобильногоКлиента);
	//	ХранилищеСистемныхНастроек.Сохранить(
	//		"ОсновнойРаздел/ПанельДействий/НастройкиКомандногоИнтерфейса", , ПанельДействийДляМобильногоКлиента);
	//Иначе
	//	Настройки = ХранилищеСистемныхНастроек.Загрузить("ПанельРазделовКЭДО");
	//	Если СравнениеЗначений.Сравнить(Настройки, ТекущиеНастройкиПанелиРазделов) <> 0 Тогда
	//		ТребуетсяОбновлениеИнтерфейса = Истина;
	//	КонецЕсли;
	//	ХранилищеСистемныхНастроек.Сохранить("Общее/ПанельРазделов/НастройкиКомандногоИнтерфейса", , Настройки);
	//	
	//	Настройки = ХранилищеСистемныхНастроек.Загрузить("ПанельНавигацииКЭДО");
	//	Если СравнениеЗначений.Сравнить(Настройки, ТекущиеНастройкиПанелиНавигации) <> 0 Тогда
	//		ТребуетсяОбновлениеИнтерфейса = Истина;
	//	КонецЕсли;
	//	ХранилищеСистемныхНастроек.Сохранить("ОсновнойРаздел/ПанельНавигации/НастройкиКомандногоИнтерфейса", , Настройки);
	//	
	//	Настройки = ХранилищеСистемныхНастроек.Загрузить("ПанельДействийКЭДО");
	//	Если СравнениеЗначений.Сравнить(Настройки, ТекущиеНастройкиПанелиДействий) <> 0 Тогда
	//		ТребуетсяОбновлениеИнтерфейса = Истина;
	//	КонецЕсли;
	//	ХранилищеСистемныхНастроек.Сохранить("ОсновнойРаздел/ПанельДействий/НастройкиКомандногоИнтерфейса", , Настройки);
	//КонецЕсли;

КонецПроцедуры

Функция НачатьОбновлениеИнформацииПоПриглашениямВ1СЭДО(КлючиСинхронизации, УникальныйИдентификатор) Экспорт
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Обновление информации о приглашениях в сервисе 1С:ЭДО'");
	
	Возврат ДлительныеОперации.ВыполнитьФункцию(ПараметрыВыполнения,
		"СинхронизацияЭДО.ПолучитьПриглашения", КлючиСинхронизации, Неопределено);
	
КонецФункции

#КонецОбласти
