
Функция ОпределитьЦенуПриходаПересортица(Дата,СкладКомпании,Номенклатура,Ставка) Экспорт
Запрос = Новый Запрос("ВЫБРАТЬ
                      |	ПартииТоваровКомпанииОстатки.Номенклатура,
                      |	ВЫБОР
                      |		КОГДА ПартииТоваровКомпанииОстатки.КоличествоОстаток = 0
                      |			ТОГДА 0
                      |		ИНАЧЕ ПартииТоваровКомпанииОстатки.СуммаОстаток / ПартииТоваровКомпанииОстатки.КоличествоОстаток
                      |	КОНЕЦ КАК Цена,
                      |	ПартииТоваровКомпанииОстатки.Номенклатура.СтавкаНДС.Ставка КАК Ставка
                      |ИЗ
                      |	РегистрНакопления.ПартииТоваровКомпании.Остатки(
                      |			&Дата,
                      |			СкладКомпании = &СкладКомпании
                      |				И Номенклатура = &Номенклатура) КАК ПартииТоваровКомпанииОстатки");
						  
	Запрос.УстановитьПараметр("Дата",Дата);
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		ЦенаПрих = Результат.Цена;
		Ставка = Результат.Ставка;
	Иначе
		ЦенаПрих = 0;
	КонецЕсли;	
	Если ЦенаПрих <= 0 тогда 
		ЦенаПрих = ПолучитьЦенуПоследнегоПрихода(СкладКомпании,Номенклатура,Дата);
	КонецЕсли;  
	Если ЦенаПрих <= 0 тогда 
		//ЦенаПрих = обПолучитьЦену(СкладКомпании.ТипЦенСебестоимости,Номенклатура,Дата);
		//rarus+AleksT 21.09.2020 для Мясницкий ряд ЦенообразованиеСервер.ПолучитьЦену
		ЦенаПрих = ЦенообразованиеСервер.ПолучитьЦену(СкладКомпании.ТипЦенСебестоимости,Номенклатура,Дата);
	КонецЕсли;
	Если Ставка = 0 тогда 
		Ставка = Номенклатура.СтавкаНДС.Ставка;
	КонецЕсли;
	Возврат ЦенаПрих;
КонецФункции

Функция ПолучитьАдресДоставкиКонтрагента(Контрагент) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.видыКонтактнойИнформации.АдресФактический)
	|			ТОГДА 1
	|		ИНАЧЕ ВЫБОР
	|				КОГДА КонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.видыКонтактнойИнформации.АдресЮридический)
	|					ТОГДА 2
	|				ИНАЧЕ 3
	|			КОНЕЦ
	|	КОНЕЦ КАК Порядок,
	|	КонтактнаяИнформация.Представление,
	|	КонтактнаяИнформация.Вид
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация КАК КонтактнаяИнформация
	|ГДЕ
	|	КонтактнаяИнформация.Объект = &Объект
	|	И КонтактнаяИнформация.Тип = ЗНАЧЕНИЕ(Перечисление.ТипыКонтактнойИнформации.Адрес)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Порядок");
	
	Запрос.УстановитьПараметр("Объект",Контрагент);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		АдресДоставки = Результат.Представление;
	Иначе
		АдресДоставки = "";
	КонецЕсли;	
	Возврат АдресДоставки;
КонецФункции

Процедура ОпределитьАртикул(ЭтотОбъект,Отказ) Экспорт
	//Цепелев  +++ 2020-02-06-11-16
	//Если Константы.итОтключитьАвтонумерациюАртикулаНоменклатуры.Получить() Тогда
	//	Возврат;
	//КонецЕсли;
	Если Константы.итОтключитьАвтонумерациюАртикулаНоменклатуры.Получить() И НЕ ЭтотОбъект.Этогруппа Тогда
		Возврат;
	КонецЕсли;
	//Цепелев  --- 2020-02-06-11-16              
		
	АртикулРозница = ЭтотОбъект.Артикул;
	Этогруппа = ЭтотОбъект.Этогруппа;
	Если Этогруппа тогда
		ДлинаАртикула = 3;
		ОтборГруппа = " И Номенклатура.Этогруппа ";
	иначе
		ДлинаАртикулаЗнач = стрдлина(АртикулРозница);
		ДлинаАртикула = ?(ДлинаАртикулаЗнач<4,4,ДлинаАртикулаЗнач);
		ОтборГруппа = " И НЕ Номенклатура.Этогруппа ";  
	КонецЕсли;
	Если ЗначениеЗаполнено(АртикулРозница) и СтрДлина(АртикулРозница) >= ДлинаАртикула тогда
		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Номенклатура.Ссылка
		                      |ИЗ
		                      |	Справочник.Номенклатура КАК Номенклатура
		                      |ГДЕ
		                      |	Номенклатура.Артикул = &АртикулРозница
		                      |	И НЕ Номенклатура.Ссылка = &Ссылка"+ОтборГруппа);
		Запрос.УстановитьПараметр("АртикулРозница",АртикулРозница);
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Количество() > 0 тогда
			Результат.Следующий();
			Сообщить("Такой артикул уже используется в "+Результат.Ссылка+". (Сделайте артикул пустым и он сам назначится!)");
			Отказ = Истина;
		КонецЕсли;	
	Иначе
		Если Этогруппа тогда
			АртикулРозница ="100";
		Иначе	
			АртикулРозница = Справочники.ИТ_НастройкиДописанногоФункционала.ПоследнийАртикул.Значение;
			Если НЕ ЗначениеЗаполнено(АртикулРозница) тогда
				АртикулРозница = "0001";
			КонецЕсли;
		КонецЕсли;

		Запрос = Новый Запрос("ВЫБРАТЬ
		                      |	Номенклатура.Артикул КАК АртикулРозница
		                      |ИЗ
		                      |	Справочник.Номенклатура КАК Номенклатура
		                      |ГДЕ
		                      |	НЕ Номенклатура.Ссылка = &Ссылка 
							  |	И Номенклатура.Артикул>="+АртикулРозница+ОтборГруппа+"
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	АртикулРозница УБЫВ");
		Запрос.УстановитьПараметр("Ссылка",ЭтотОбъект.Ссылка);
		Результат = Запрос.Выполнить().Выгрузить();  
		Найден = Результат.Найти(АртикулРозница,"АртикулРозница"); 
		Пока ЗначениеЗаполнено(Найден) Цикл		
			Если НЕ Лев(АртикулРозница,1) = "0" тогда
				ДлинаАртикула = стрдлина(Формат(Число(АртикулРозница) + 1,"ЧГ=0;ЧВН="));
			КонецЕсли;
			АртикулРозница = Формат(Число(АртикулРозница) + 1,"ЧГ=0;ЧВН=;ЧЦ="+Строка(ДлинаАртикула));  
			Найден = Результат.Найти(АртикулРозница,"АртикулРозница");  			
		КонецЦикла; 
		Если НЕ Этогруппа тогда
			Получ = Справочники.ИТ_НастройкиДописанногоФункционала.ПоследнийАртикул.ПолучитьОбъект();
			Получ.Значение = АртикулРозница;
			Получ.Записать();
		КонецЕсли;
		ЭтотОбъект.Артикул = АртикулРозница; 
	КонецЕсли; 
КонецПроцедуры

Функция ОпределитьШтрихкод(Объект) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод
	|ИЗ
	|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.Объект = &Объект
	|
	|УПОРЯДОЧИТЬ ПО
	|	ШтрихКоды.ОсновнойШтрихкод УБЫВ");
	Запрос.УстановитьПараметр("Объект",Объект);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.ШтрихКод;
	Иначе
		Возврат "";
	КонецЕсли;
	 
КонецФункции

Функция УбратьПрефиксНомера(НомерДок) Экспорт
	
	Номер = СокрЛП(НомерДок);	
	// удаление префикса из номера документа
	Если НЕ Лев(Номер,1) = "0" тогда
		//Номер = Сред(Номер,3);
		Номер = Сред(Номер,4);
	КонецЕсли;
	Если НЕ Лев(Номер,1) = "0" тогда
		Номер = Сред(Номер,3);
	КонецЕсли; 
	
	// так же, может остаться "минус" впереди
	Если Лев(Номер, 1) = "-" Тогда
		Номер = Сред(Номер, 2);
	КонецЕсли;
	
	// удаление ведущих нулей
	Пока Лев(Номер, 1)="0" Цикл
		Номер = Сред(Номер, 2);
	КонецЦикла;
	
	Возврат Номер;

КонецФункции // ПолучитьНомерНаПечать()

Функция ПолучитьЦенуПоследнегоПрихода(Склад,Номенклатура,Дата) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 10
	|	ПартииТоваровКомпании.Сумма / ПартииТоваровКомпании.Количество КАК Цена
	|ПОМЕСТИТЬ Раз
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании КАК ПартииТоваровКомпании
	|ГДЕ
	|	ПартииТоваровКомпании.Номенклатура = &Номенклатура
	|	И ПартииТоваровКомпании.СкладКомпании = &СкладКомпании
	|	И ПартииТоваровКомпании.Период < &Дата
	|	И ПартииТоваровКомпании.ВидДвижения = ЗНАЧЕНИЕ(виддвижениянакопления.приход)
	|	И ПартииТоваровКомпании.Сумма > 0
	|	И ПартииТоваровКомпании.Количество > 0
	|
	|УПОРЯДОЧИТЬ ПО
	|	ПартииТоваровКомпании.Период УБЫВ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(СРЕДНЕЕ(Раз.Цена), 0) КАК Цена
	|ИЗ
	|	Раз КАК Раз");
						  
	Запрос.УстановитьПараметр("Дата",Дата);	
	Запрос.УстановитьПараметр("Номенклатура",Номенклатура);	
	Запрос.УстановитьПараметр("СкладКомпании",Склад);
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Цена;
	Иначе
		Возврат 0;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьСебестоимость(Номенклатура,Дата,Склад=Неопределено) Экспорт
	ЗапросВн = Новый Запрос("ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ПартииТоваровКомпанииОстатки.КоличествоОстаток = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ПартииТоваровКомпанииОстатки.КоличествоОстаток = 0
	|					ТОГДА 0
	|				ИНАЧЕ ПартииТоваровКомпанииОстатки.СуммаОстаток / ПартииТоваровКомпанииОстатки.КоличествоОстаток
	|			КОНЕЦ
	|	КОНЕЦ КАК Цена
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|			&Дата,
	|			Номенклатура = &Номенклатура
	|				И ВЫБОР
	|					КОГДА &Склад = НЕОПРЕДЕЛЕНО
	|						ТОГДА ИСТИНА
	|					ИНАЧЕ &Склад = СкладКомпании
	|				КОНЕЦ) КАК ПартииТоваровКомпанииОстатки");
	ЗапросВн.УстановитьПараметр("Номенклатура",Номенклатура);
	ЗапросВн.УстановитьПараметр("Склад",Склад);
	ЗапросВн.УстановитьПараметр("Дата",Дата);
	РезультатВн = ЗапросВн.Выполнить().Выбрать();
	Если РезультатВн.Следующий() тогда
		Цена = РезультатВн.Цена;   				
	Иначе   
		Цена = 0;
	КонецЕсли;
	Возврат Цена;
КонецФункции

Функция ПолучитьСуммуНоменклатуры(Склад,Номенклатура,Дата) Экспорт
	ЗапросВн = Новый Запрос("ВЫБРАТЬ
	|	ПартииТоваровКомпанииОстатки.СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|			&Дата,
	|			Номенклатура = &Номенклатура
	|				И СкладКомпании = &Склад) КАК ПартииТоваровКомпанииОстатки");
	ЗапросВн.УстановитьПараметр("Номенклатура",Номенклатура);
	ЗапросВн.УстановитьПараметр("Склад",Склад);
	ЗапросВн.УстановитьПараметр("Дата",Дата);
	РезультатВн = ЗапросВн.Выполнить().Выбрать();
	Если РезультатВн.Следующий() тогда
		СуммаОстаток = РезультатВн.СуммаОстаток;   				
	Иначе   
		СуммаОстаток = 0;
	КонецЕсли;
	Возврат СуммаОстаток;
КонецФункции

Функция ОбработкаСоСканера(ЭтаФорма, Источник, Событие, Данные) Экспорт
	
	Если Источник = "Сканер" Тогда
		СписокТоваров = ЭтаФорма.Товары;
		Преф = Лев(СокрЛП(Данные),2);
		Если Преф=Строка(Константы.ПрефиксВесовогоШК.Получить()) 
			или Преф = "29"
			или Преф = "24"
			или Преф = "28"
			или Преф = "25" Тогда
			штрих = Лев(СокрЛП(Данные),7);	
			Колво = Число(Лев(Прав(Данные, 6), 5))/1000;
		Иначе
			штрих = СокрЛП(Данные);	
			Колво = 1;
		КонецЕсли;	
		Запрос = Новый Запрос("ВЫБРАТЬ
		|	ШтрихКоды.Объект,
		|	ШтрихКоды.Объект.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	ШтрихКоды.Объект.ОсновнаяЕдиницаИзмерения.Коэффициент КАК Коэффициент
		|ИЗ
		|	РегистрСведений.ШтрихКоды КАК ШтрихКоды
		|ГДЕ
		|	ШтрихКоды.ШтрихКод = &ШтрихКод
		|	И ШтрихКоды.Объект ССЫЛКА Справочник.Номенклатура");
		Запрос.УстановитьПараметр("ШтрихКод",штрих);
		Результат = Запрос.Выполнить().Выбрать();
		Если Результат.Следующий() Тогда
			Новстр = СписокТоваров.Добавить();
			Новстр.Номенклатура = Результат.Объект;
			Новстр.ШтрихКод = штрих;				
			Новстр.ЕдиницаИзмерения = Результат.ЕдиницаИзмерения;
			Новстр.Коэффициент = Результат.Коэффициент ;
			Новстр.КоличествоФакт = Колво; 
			Возврат Истина;
		Иначе
			Сообщить("ШК не найден");
		КонецЕсли;   
	КонецЕсли;	
	Возврат Ложь;
КонецФункции

Процедура ЗаписатьВИсториюСканирования(ЭтотОбъект,ЭтаФорма,СтрокаНоменклатура,Штрихкод) Экспорт
	Попытка
	Набор = РегистрыСведений.ИТ_ИсторияСканирования.СоздатьНаборЗаписей();
	Новстр = Набор.Добавить();
	Новстр.Период = ТекущаяДата();
	Если ЭтотОбъект.Этоновый() тогда
		ЭтотОбъект.Записать();
		ЭтаФорма.Заголовок = СтрЗаменить(ЭтаФорма.Заголовок,"Новый","Записан");
		Новстр.Документ = ЭтотОбъект.Ссылка;
	Иначе
		Новстр.Документ = ЭтотОбъект.Ссылка;
	КонецЕсли;
	Новстр.Штрихкод = Штрихкод;
	Новстр.Номенклатура = СтрокаНоменклатура.Номенклатура;
	Новстр.Количество = СтрокаНоменклатура.Количество;
	Новстр.Автор = ПараметрыСеанса.Пользователь;
	Новстр.Действие = "Ввод со сканера";
	ГСЧ = Новый ГенераторСлучайныхЧисел;
	Новстр.КлючУникальности = ГСЧ.СлучайноеЧисло(1, 99);
	Набор.Записать(Ложь);
	Исключение КонецПопытки;
КонецПроцедуры

Функция СоответствуетДоговорИПодразделение(ПодразделениеКомпании,ДоговорВзаиморасчетов) Экспорт
	Если Нрег(ПодразделениеКомпании.Наименование) = Нрег(ДоговорВзаиморасчетов.Наименование) тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;      	
КонецФункции

Функция ПроверитьПолучитсяЛиОтрицательныйОстаток(ЭтотОбъект,РежимЗаписи) Экспорт
	ТипЗнчЭтотОбъект = ТипЗнч(ЭтотОбъект);	
	Момент = ЭтотОбъект.Дата+1;
	Если Момент<ТекущаяДата()-7776000 Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнчЭтотОбъект = тип("ДокументОбъект.ПоступлениеТоваров") 
		ИЛИ ТипЗнчЭтотОбъект = тип("ДокументОбъект.ВводОстатковТоваров") тогда
		СкладКомпании = ЭтотОбъект.СкладКомпании;
		ТаблицаТовары = ЭтотОбъект.Товары.Выгрузить(,"Номенклатура,КоличествоБазовое");
		ТаблицаТовары.Колонки.Найти("КоличествоБазовое").Имя = "Количество";
	ИначеЕсли ТипЗнчЭтотОбъект = тип("ДокументОбъект.ПеремещениеТоваров") 
		и (ЭтотОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваров или ЭтотОбъект.ХозОперация = Справочники.ХозОперации.ПеремещениеТоваровИзФилиала)  Тогда
		СкладКомпании = ЭтотОбъект.СкладПолучатель;
		ТаблицаТовары = ЭтотОбъект.Товары.Выгрузить(,"Номенклатура,КоличествоБазовое");
		ТаблицаТовары.Колонки.Найти("КоличествоБазовое").Имя = "Количество";
	ИначеЕсли ТипЗнчЭтотОбъект = тип("ДокументОбъект.ОтчетПроизводстваЗаСмену") Тогда
		СкладКомпании = ЭтотОбъект.СкладКомпании;
		ТаблицаТовары = ЭтотОбъект.Продукция.Выгрузить(,"Номенклатура,Количество");
	ИначеЕсли ТипЗнчЭтотОбъект = тип("ДокументОбъект.Разделка") Тогда
		СкладКомпании = ЭтотОбъект.СкладКомпании;
		ТаблицаТовары = ЭтотОбъект.Товары.Выгрузить(,"Номенклатура,Количество");
	Иначе
		Возврат Ложь;
	КонецЕсли; 	
	
	Запрос=Новый Запрос("ВЫБРАТЬ
	 |	ОстаткиТоваровКомпанииОстаткиИОбороты.Регистратор,
	 |	ОстаткиТоваровКомпанииОстаткиИОбороты.Номенклатура,
	 |	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоНачальныйОстаток,
	 |	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоОборот,
	 |	ОстаткиТоваровКомпанииОстаткиИОбороты.КоличествоКонечныйОстаток
	 |ПОМЕСТИТЬ ДвижениеТоваров
	 |ИЗ
	 |	РегистрНакопления.ОстаткиТоваровКомпании.ОстаткиИОбороты(
	 |			&Момент,
	 |			,
	 |			Регистратор,
	 |			,
	 |			Номенклатура В (&Номенклатура)
	 |				И СкладКомпании = &СкладКомпании) КАК ОстаткиТоваровКомпанииОстаткиИОбороты
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ДвижениеТоваров.Номенклатура,
	 |	МИНИМУМ(ДвижениеТоваров.КоличествоКонечныйОстаток) КАК Количество
	 |ИЗ
	 |	ДвижениеТоваров КАК ДвижениеТоваров
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ДвижениеТоваров.Номенклатура");
	
	Запрос.УстановитьПараметр("Момент",Момент); 	
	Запрос.УстановитьПараметр("Номенклатура",ТаблицаТовары.ВыгрузитьКолонку("Номенклатура"));
	Запрос.УстановитьПараметр("СкладКомпании",СкладКомпании);
	
	РезультатОстатки=Запрос.Выполнить().Выгрузить();
	ВИтоге = ложь;
	Для каждого Текстрока из ТаблицаТовары Цикл
		Найден = РезультатОстатки.Найти(Текстрока.Номенклатура,"Номенклатура");
		Если НЕ Найден = Неопределено тогда 
			Если Текстрока.Количество>Найден.Количество тогда
				Сообщить("Распроведение документа образует отрицательный остаток на " +СкладКомпании +" по: "+Текстрока.Номенклатура+": "+Строка(Найден.Количество-Текстрока.Количество));
				ВИтоге = Истина; 
			КонецЕсли; 
		Иначе
			Сообщить("Распроведение документа образует отрицательный остаток на " +СкладКомпании +" по: "+Текстрока.Номенклатура+": "+Строка(-Текстрока.Количество));
			ВИтоге = Истина;  
		КонецЕсли;					
	КонецЦикла;      	
	Если ВИтоге тогда
		Сообщить("РАСПРОВЕДЕНИЕ ДОКУМЕНТА, ОБРАЗУЮЩЕГО ОТРИЦАТЕЛЬНЫЕ ОСТАТКИ ЗАПРЕЩЕНО.");
	КонецЕсли;
	
	Возврат ВИтоге;

КонецФункции

Процедура ДобавитьОтветственныхЛицВТОРГ12(Макет,ТабДокумент,СкладКомпании,Дата) Экспорт
//ТабДокумент = новый ТабличныйДокумент;
	ОбластьПодвала11						= Макет.ПолучитьОбласть("Подвал11");
	ОбластьПодвала21 						= Макет.ПолучитьОбласть("Подвал21");
	ОбластьПодвала31 						= Макет.ПолучитьОбласть("Подвал31");
	ОбластьПодвала41 						= Макет.ПолучитьОбласть("Подвал41");
	ОбластьПодвала12 						= Макет.ПолучитьОбласть("Подвал12");
	ОбластьПодвала22 						= Макет.ПолучитьОбласть("Подвал22");
	ОбластьПодвала32						= Макет.ПолучитьОбласть("Подвал32");
	ОбластьПодвала42 						= Макет.ПолучитьОбласть("Подвал42");
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка2,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка3,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка4,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка5
	//                      |ИЗ
	//                      |	Справочник.ИТ_НастройкиДописанногоФункционала.Таблица КАК ИТ_НастройкиДописанногоФункционалаТаблица
	//                      |ГДЕ
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Ссылка.Наименование = ""Настройки подписей документов""
	//                      |	И (ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = &Склад
	//                      |			ИЛИ ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = ЗНАЧЕНИЕ(справочник.СкладыКомпании.пустаяссылка))");
						  
						  
						  
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ИТ_ПодписиДокументовТаблица.ВидДокумента КАК Колонка2,
	|	ИТ_ПодписиДокументовТаблица.Должность КАК Колонка3,
	|	ИТ_ПодписиДокументовТаблица.ФИО КАК Колонка4,
	|	ИТ_ПодписиДокументовТаблица.Приказ КАК Колонка5
	|ИЗ
	|	Документ.ИТ_ПодписиДокументов.Таблица КАК ИТ_ПодписиДокументовТаблица
	|ГДЕ
	|	(ИТ_ПодписиДокументовТаблица.Склад_Подразделение = &Склад
	|			ИЛИ ИТ_ПодписиДокументовТаблица.Склад_Подразделение = ЗНАЧЕНИЕ(справочник.СкладыКомпании.пустаяссылка))
	|	И ИТ_ПодписиДокументовТаблица.Ссылка В
	|			(ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИТ_ПодписиДокументов.Ссылка
	|			ИЗ
	|				Документ.ИТ_ПодписиДокументов КАК ИТ_ПодписиДокументов
	|			ГДЕ
	|				ИТ_ПодписиДокументов.Дата <= &Дата
	|				И ИТ_ПодписиДокументов.Проведен
	|			УПОРЯДОЧИТЬ ПО
	|				ИТ_ПодписиДокументов.Дата УБЫВ)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ИТ_ПодписиДокументовТаблица.НомерСтроки");
						  
	Запрос.УстановитьПараметр("Дата",Дата);					  
	Запрос.УстановитьПараметр("Склад",СкладКомпании);					  
	ТаблицаОтвЛиц = Запрос.Выполнить().Выгрузить();
	Отбор = Новый Структура();
	Отбор.Вставить("Колонка2","Ответственный"); 
	Отобранные = ТаблицаОтвЛиц.НайтиСтроки(Отбор);
	Если Отобранные.Количество() = 0 тогда
		Новстр = Новый Структура;
		Новстр.Вставить("Колонка1","");
		Новстр.Вставить("Колонка2","");
		Новстр.Вставить("Колонка3","");
		Новстр.Вставить("Колонка4","");
		Новстр.Вставить("Колонка5","");
		Отобранные.Добавить(Новстр);
	КонецЕсли;
	СчетПЧ = 1;
	Для каждого ТекСтрока из Отобранные Цикл
		Если ТекСтрока.Колонка5 = "" или ТекСтрока.Колонка5 = Неопределено тогда
			ОбластьПодвала11.Параметры.Доверенность = "Отпуск груза разрешил";
		Иначе
			ОбластьПодвала11.Параметры.Доверенность = ТекСтрока.Колонка5;
		КонецЕсли;
		ОбластьПодвала11.Параметры.ДолжностьРуководителя = ТекСтрока.Колонка3;
		ОбластьПодвала11.Параметры.ФИОРуководителя = ТекСтрока.Колонка4;
		ТабДокумент.Вывести(ОбластьПодвала11);
		Если СчетПЧ<=4 тогда
			Выполнить("ТабДокумент.Присоединить(ОбластьПодвала"+СчетПЧ+"2)");
		КонецЕСли;
		СчетПЧ = СчетПЧ + 1;
	КонецЦикла;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("Колонка2","Бухгалтер"); 
	Отобранные = ТаблицаОтвЛиц.НайтиСтроки(Отбор);
	Если Отобранные.Количество() = 0 тогда
		Новстр = Новый Структура;
		Новстр.Вставить("Колонка1","");
		Новстр.Вставить("Колонка2","");
		Новстр.Вставить("Колонка3","");
		Новстр.Вставить("Колонка4","");
		Новстр.Вставить("Колонка5","");
		Отобранные.Добавить(Новстр);
	КонецЕсли;
	Для каждого ТекСтрока из Отобранные Цикл
		Если ТекСтрока.Колонка5 = "" или ТекСтрока.Колонка5 = Неопределено тогда
			ОбластьПодвала21.Параметры.Доверенность = "Главный (старший) бухгалтер";
		Иначе
			ОбластьПодвала21.Параметры.Доверенность = ТекСтрока.Колонка5;
		КонецЕсли;
		//ОбластьПодвала11.Параметры.ДолжностьРуководителя = ТекСтрока.Колонка3;
		ОбластьПодвала21.Параметры.ФИОГлавБухгалтера = ТекСтрока.Колонка4;
		ТабДокумент.Вывести(ОбластьПодвала21);
		Если СчетПЧ<=4 тогда
			Выполнить("ТабДокумент.Присоединить(ОбластьПодвала"+СчетПЧ+"2)");
		КонецЕСли;
		СчетПЧ = СчетПЧ + 1;
	КонецЦикла;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("Колонка2","Отпустил"); 
	Отобранные = ТаблицаОтвЛиц.НайтиСтроки(Отбор);
	Если Отобранные.Количество() = 0 тогда
		Новстр = Новый Структура;
		Новстр.Вставить("Колонка1","");
		Новстр.Вставить("Колонка2","");
		Новстр.Вставить("Колонка3","");
		Новстр.Вставить("Колонка4","");
		Новстр.Вставить("Колонка5","");
		Отобранные.Добавить(Новстр);
	КонецЕсли;
	Для каждого ТекСтрока из Отобранные Цикл
		Если ТекСтрока.Колонка5 = "" или ТекСтрока.Колонка5 = Неопределено тогда
			ОбластьПодвала31.Параметры.Доверенность = "Отпуск груза произвел";
		Иначе
			ОбластьПодвала31.Параметры.Доверенность = ТекСтрока.Колонка5;
		КонецЕсли; 
		ОбластьПодвала31.Параметры.ДолжностьКладовщика = ТекСтрока.Колонка3;
		ОбластьПодвала31.Параметры.ФИОКладовщика = ТекСтрока.Колонка4;
		ТабДокумент.Вывести(ОбластьПодвала31);
		Если СчетПЧ<=4 тогда
			Выполнить("ТабДокумент.Присоединить(ОбластьПодвала"+СчетПЧ+"2)");
		КонецЕСли;
		СчетПЧ = СчетПЧ + 1;
	КонецЦикла;	
	
	ТабДокумент.Вывести(ОбластьПодвала41);
	Если СчетПЧ<=4 тогда
		Выполнить("ТабДокумент.Присоединить(ОбластьПодвала"+СчетПЧ+"2)");
	КонецЕСли;
	
КонецПроцедуры

Процедура ДобавитьОтветственныхЛицВПКО(Макет,ТабДокумент,ПодразделениеКомпании,Дата) Экспорт
//ТабДокумент = новый ТабличныйДокумент;
	ОбластьГлавбух						= Макет.ПолучитьОбласть("Главбух");
	ОбластьКассир 						= Макет.ПолучитьОбласть("Кассир");
	  	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка2,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка3,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка4,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка5
	//                      |ИЗ
	//                      |	Справочник.ИТ_НастройкиДописанногоФункционала.Таблица КАК ИТ_НастройкиДописанногоФункционалаТаблица
	//                      |ГДЕ
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Ссылка.Наименование = ""Настройки подписей документов""
	//                      |	И (ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1.ПодразделениеКомпании = &Подразделение
	//                      |			ИЛИ ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = &Подразделение
	//                      |			ИЛИ ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = ЗНАЧЕНИЕ(справочник.складыкомпании.пустаяссылка)
	//                      |			ИЛИ ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = ЗНАЧЕНИЕ(справочник.подразделениякомпании.пустаяссылка))");
						  
						  
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИТ_ПодписиДокументовТаблица.ВидДокумента КАК Колонка2,
	                      |	ИТ_ПодписиДокументовТаблица.Должность КАК Колонка3,
	                      |	ИТ_ПодписиДокументовТаблица.ФИО КАК Колонка4,
	                      |	ИТ_ПодписиДокументовТаблица.Приказ КАК Колонка5
	                      |ИЗ
	                      |	Документ.ИТ_ПодписиДокументов.Таблица КАК ИТ_ПодписиДокументовТаблица
	                      |ГДЕ
	                      |	(ИТ_ПодписиДокументовТаблица.Склад_Подразделение.Подразделение = &Подразделение
	                      |			ИЛИ ИТ_ПодписиДокументовТаблица.Склад_Подразделение = &Подразделение
	                      |			ИЛИ ИТ_ПодписиДокументовТаблица.Склад_Подразделение = ЗНАЧЕНИЕ(справочник.складыкомпании.пустаяссылка)
	                      |			ИЛИ ИТ_ПодписиДокументовТаблица.Склад_Подразделение = ЗНАЧЕНИЕ(справочник.подразделениякомпании.пустаяссылка))
	                      |	И ИТ_ПодписиДокументовТаблица.Ссылка В
	                      |			(ВЫБРАТЬ ПЕРВЫЕ 1
	                      |				ИТ_ПодписиДокументов.Ссылка
	                      |			ИЗ
	                      |				Документ.ИТ_ПодписиДокументов КАК ИТ_ПодписиДокументов
	                      |			ГДЕ
	                      |				ИТ_ПодписиДокументов.Дата <= &Дата
	                      |				И ИТ_ПодписиДокументов.Проведен
	                      |			УПОРЯДОЧИТЬ ПО
	                      |				ИТ_ПодписиДокументов.Дата УБЫВ)");

	Запрос.УстановитьПараметр("Дата",Дата);					  
	Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);					  
	ТаблицаОтвЛиц = Запрос.Выполнить().Выгрузить();
	Отбор = Новый Структура();
	Отбор.Вставить("Колонка2","БухгалтерПКО"); 
	Отобранные = ТаблицаОтвЛиц.НайтиСтроки(Отбор);
	Если Отобранные.Количество() = 0 тогда
		Новстр = Новый Структура;
		Новстр.Вставить("Колонка1","");
		Новстр.Вставить("Колонка2","");
		Новстр.Вставить("Колонка3","");
		Новстр.Вставить("Колонка4","");
		Новстр.Вставить("Колонка5","");
		Отобранные.Добавить(Новстр);
	КонецЕсли;
	Для каждого ТекСтрока из Отобранные Цикл
		Если ТекСтрока.Колонка5 = "" или ТекСтрока.Колонка5 = Неопределено тогда
			ОбластьГлавбух.Параметры.Доверенность = "Главный бухгалтер";
		Иначе
			ОбластьГлавбух.Параметры.Доверенность = ТекСтрока.Колонка5;
		КонецЕсли;
		ОбластьГлавбух.Параметры.ФИОГлавногоБухгалтера = ТекСтрока.Колонка4;
		ТабДокумент.Вывести(ОбластьГлавбух);
	КонецЦикла;	
	
	Отбор = Новый Структура();
	Отбор.Вставить("Колонка2","Кассир"); 
	Отобранные = ТаблицаОтвЛиц.НайтиСтроки(Отбор);
	Если Отобранные.Количество() = 0 тогда
		Новстр = Новый Структура;
		Новстр.Вставить("Колонка1","");
		Новстр.Вставить("Колонка2","");
		Новстр.Вставить("Колонка3","");
		Новстр.Вставить("Колонка4","");
		Новстр.Вставить("Колонка5","");
		Отобранные.Добавить(Новстр);
	КонецЕсли;
	Для каждого ТекСтрока из Отобранные Цикл
		Если ТекСтрока.Колонка5 = "" или ТекСтрока.Колонка5 = Неопределено тогда
			ОбластьКассир.Параметры.Доверенность = "Получил кассир";
		Иначе
			ОбластьКассир.Параметры.Доверенность = ТекСтрока.Колонка5;
		КонецЕсли;       
		//ОбластьПодвала11.Параметры.ДолжностьРуководителя = ТекСтрока.Колонка3;
		ОбластьКассир.Параметры.ФИОКассира = ТекСтрока.Колонка4;
		ТабДокумент.Вывести(ОбластьКассир);
	КонецЦикла;	
		
КонецПроцедуры

Процедура ДобавитьОтветственныхЛицВРКО(Макет,ТабДокумент,ПодразделениеКомпании,Дата) Экспорт
//ТабДокумент = новый ТабличныйДокумент;
	ОбластьКассир 						= Макет.ПолучитьОбласть("Кассир");
	  	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка2,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка3,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка4,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка5
	//                      |ИЗ
	//                      |	Справочник.ИТ_НастройкиДописанногоФункционала.Таблица КАК ИТ_НастройкиДописанногоФункционалаТаблица
	//                      |ГДЕ
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Ссылка.Наименование = ""Настройки подписей документов""
	//                      |	И (ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1.ПодразделениеКомпании = &Подразделение
	//                      |			ИЛИ ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = &Подразделение
	//                      |			ИЛИ ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = ЗНАЧЕНИЕ(справочник.складыкомпании.пустаяссылка)
	//                      |			ИЛИ ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = ЗНАЧЕНИЕ(справочник.подразделениякомпании.пустаяссылка))");
						  
						  
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИТ_ПодписиДокументовТаблица.ВидДокумента КАК Колонка2,
	                      |	ИТ_ПодписиДокументовТаблица.Должность КАК Колонка3,
	                      |	ИТ_ПодписиДокументовТаблица.ФИО КАК Колонка4,
	                      |	ИТ_ПодписиДокументовТаблица.Приказ КАК Колонка5
	                      |ИЗ
	                      |	Документ.ИТ_ПодписиДокументов.Таблица КАК ИТ_ПодписиДокументовТаблица
	                      |ГДЕ
	                      |	(ИТ_ПодписиДокументовТаблица.Склад_Подразделение.Подразделение = &Подразделение
	                      |			ИЛИ ИТ_ПодписиДокументовТаблица.Склад_Подразделение = &Подразделение
	                      |			ИЛИ ИТ_ПодписиДокументовТаблица.Склад_Подразделение = ЗНАЧЕНИЕ(справочник.складыкомпании.пустаяссылка)
	                      |			ИЛИ ИТ_ПодписиДокументовТаблица.Склад_Подразделение = ЗНАЧЕНИЕ(справочник.подразделениякомпании.пустаяссылка))
	                      |	И ИТ_ПодписиДокументовТаблица.Ссылка В
	                      |			(ВЫБРАТЬ ПЕРВЫЕ 1
	                      |				ИТ_ПодписиДокументов.Ссылка
	                      |			ИЗ
	                      |				Документ.ИТ_ПодписиДокументов КАК ИТ_ПодписиДокументов
	                      |			ГДЕ
	                      |				ИТ_ПодписиДокументов.Дата <= &Дата
	                      |				И ИТ_ПодписиДокументов.Проведен
	                      |			УПОРЯДОЧИТЬ ПО
	                      |				ИТ_ПодписиДокументов.Дата УБЫВ)");
						  
	Запрос.УстановитьПараметр("Дата",Дата);					  
	Запрос.УстановитьПараметр("Подразделение",ПодразделениеКомпании);					  
	ТаблицаОтвЛиц = Запрос.Выполнить().Выгрузить();
		
	Отбор = Новый Структура();
	Отбор.Вставить("Колонка2","Кассир"); 
	Отобранные = ТаблицаОтвЛиц.НайтиСтроки(Отбор);
	Если Отобранные.Количество() = 0 тогда
		Новстр = Новый Структура;
		Новстр.Вставить("Колонка1","");
		Новстр.Вставить("Колонка2","");
		Новстр.Вставить("Колонка3","");
		Новстр.Вставить("Колонка4","");
		Новстр.Вставить("Колонка5","");
		Отобранные.Добавить(Новстр);
	КонецЕсли;
	Для каждого ТекСтрока из Отобранные Цикл
		Если ТекСтрока.Колонка5 = "" или ТекСтрока.Колонка5 = Неопределено тогда
			ОбластьКассир.Параметры.Доверенность = "Выдал кассир";
		Иначе
			ОбластьКассир.Параметры.Доверенность = ТекСтрока.Колонка5;
		КонецЕсли;       
		//ОбластьПодвала11.Параметры.ДолжностьРуководителя = ТекСтрока.Колонка3;
		ОбластьКассир.Параметры.ФИОКассира = ТекСтрока.Колонка4;
		ТабДокумент.Вывести(ОбластьКассир);
	КонецЦикла;	
		
КонецПроцедуры

Процедура ДобавитьОтветственныхЛицВСчетФактуру(Макет,ТабДокумент,СкладИлиПоразделение,Дата) Экспорт
//ТабДокумент = новый ТабличныйДокумент;
	//ОбластьПодвала1							= Макет.ПолучитьОбласть("Подвал1");
	ОбластьПодвала2 						= Макет.ПолучитьОбласть("Подвал2");
	ПустаяЛевая 							= Макет.ПолучитьОбласть("ПустаяЛевая");
	Левая 									= Макет.ПолучитьОбласть("Левая");
	Правая 									= Макет.ПолучитьОбласть("Правая");
	
	//Запрос = Новый Запрос("ВЫБРАТЬ
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка2,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка3,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка4,
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Колонка5
	//                      |ИЗ
	//                      |	Справочник.ИТ_НастройкиДописанногоФункционала.Таблица КАК ИТ_НастройкиДописанногоФункционалаТаблица
	//                      |ГДЕ
	//                      |	ИТ_НастройкиДописанногоФункционалаТаблица.Ссылка.Наименование = ""Настройки подписей документов""
	//                      |	И (ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1.ПодразделениеКомпании = &СкладИлиПоразделение
	//                      |			ИЛИ ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = &СкладИлиПоразделение
	//                      |			ИЛИ ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = ЗНАЧЕНИЕ(справочник.складыкомпании.пустаяссылка)
	//                      |			ИЛИ ИТ_НастройкиДописанногоФункционалаТаблица.Колонка1 = ЗНАЧЕНИЕ(справочник.подразделениякомпании.пустаяссылка))");
						  
						  
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ИТ_ПодписиДокументовТаблица.ВидДокумента КАК Колонка2,
	                      |	ИТ_ПодписиДокументовТаблица.Должность КАК Колонка3,
	                      |	ИТ_ПодписиДокументовТаблица.ФИО КАК Колонка4,
	                      |	ИТ_ПодписиДокументовТаблица.Приказ КАК Колонка5
	                      |ИЗ
	                      |	Документ.ИТ_ПодписиДокументов.Таблица КАК ИТ_ПодписиДокументовТаблица
	                      |ГДЕ
	                      |	(ИТ_ПодписиДокументовТаблица.Склад_Подразделение.Подразделение = &СкладИлиПоразделение
	                      |			ИЛИ ИТ_ПодписиДокументовТаблица.Склад_Подразделение = &СкладИлиПоразделение
	                      |			ИЛИ ИТ_ПодписиДокументовТаблица.Склад_Подразделение = ЗНАЧЕНИЕ(справочник.складыкомпании.пустаяссылка)
	                      |			ИЛИ ИТ_ПодписиДокументовТаблица.Склад_Подразделение = ЗНАЧЕНИЕ(справочник.подразделениякомпании.пустаяссылка))
	                      |	И ИТ_ПодписиДокументовТаблица.Ссылка В
	                      |			(ВЫБРАТЬ ПЕРВЫЕ 1
	                      |				ИТ_ПодписиДокументов.Ссылка
	                      |			ИЗ
	                      |				Документ.ИТ_ПодписиДокументов КАК ИТ_ПодписиДокументов
	                      |			ГДЕ
	                      |				ИТ_ПодписиДокументов.Дата <= &Дата
	                      |				И ИТ_ПодписиДокументов.Проведен
	                      |			УПОРЯДОЧИТЬ ПО
	                      |				ИТ_ПодписиДокументов.Дата УБЫВ)");
						  
	Запрос.УстановитьПараметр("Дата",Дата);					  
	Запрос.УстановитьПараметр("СкладИлиПоразделение",СкладИлиПоразделение);					  
 	ТаблицаОтвЛиц = Запрос.Выполнить().Выгрузить();
 	Отбор = Новый Структура();
	Отбор.Вставить("Колонка2","РуководительСчетФактура"); 
	Отобранные = ТаблицаОтвЛиц.НайтиСтроки(Отбор);
	Если Отобранные.Количество() = 0 тогда
		Новстр = Новый Структура;
		Новстр.Вставить("Колонка1","");
		Новстр.Вставить("Колонка2","");
		Новстр.Вставить("Колонка3","");
		Новстр.Вставить("Колонка4","");
		Новстр.Вставить("Колонка5","");
		Отобранные.Добавить(Новстр);
	КонецЕсли;
	
	Отбор = Новый Структура();
	Отбор.Вставить("Колонка2","БухгалтерСчетФактура"); 
	ОтобранныеБух = ТаблицаОтвЛиц.НайтиСтроки(Отбор);
	Если ОтобранныеБух.Количество() = 0 тогда
		Новстр = Новый Структура;
		Новстр.Вставить("Колонка1","");
		Новстр.Вставить("Колонка2","");
		Новстр.Вставить("Колонка3","");
		Новстр.Вставить("Колонка4","");
		Новстр.Вставить("Колонка5","");
		ОтобранныеБух.Добавить(Новстр);
	КонецЕсли;
	
	СчетПЧ = 0;
	Для каждого ТекСтрока из Отобранные Цикл
		Если ТекСтрока.Колонка5 = "" или ТекСтрока.Колонка5 = Неопределено тогда
			Левая.Параметры.Доверенность = "Руководитель организации или иное уполномоченное лицо";
		Иначе
			Левая.Параметры.Доверенность = ТекСтрока.Колонка5;
		КонецЕсли;
		//ОбластьПодвала11.Параметры.ДолжностьРуководителя = ТекСтрока.Колонка3;
		Левая.Параметры.ФИО = ТекСтрока.Колонка4;
		ТабДокумент.Вывести(Левая);
		
		Если СчетПЧ<=ОтобранныеБух.Количество()-1 тогда
			ТекСтрокаБух = ОтобранныеБух[СчетПЧ];
			Если ТекСтрокаБух.Колонка5 = "" или ТекСтрокаБух.Колонка5 = Неопределено тогда
				Правая.Параметры.Доверенность = "Главный бухгалтер или иное уполномоченное лицо";
			Иначе
				Правая.Параметры.Доверенность = ТекСтрокаБух.Колонка5;
			КонецЕсли;  
			Правая.Параметры.ФИО = ТекСтрокаБух.Колонка4;			
			ТабДокумент.Присоединить(Правая);
		КонецЕСли;
		СчетПЧ = СчетПЧ + 1;
	КонецЦикла;	
	
	Пока СчетПЧ<=ОтобранныеБух.Количество()-1 Цикл
		ТекСтрокаБух = ОтобранныеБух[СчетПЧ];
		Если ТекСтрокаБух.Колонка5 = "" или ТекСтрокаБух.Колонка5 = Неопределено тогда
			ПустаяЛевая.Параметры.Доверенность = "Главный бухгалтер или иное уполномоченное лицо";
		Иначе
			ПустаяЛевая.Параметры.Доверенность = ТекСтрокаБух.Колонка5;
		КонецЕсли;  
		ПустаяЛевая.Параметры.ФИО = ТекСтрокаБух.Колонка4;			
		ТабДокумент.Вывести(ПустаяЛевая);
		СчетПЧ = СчетПЧ + 1;
	КонецЦикла; 	
	
	ТабДокумент.Вывести(ОбластьПодвала2);	
		
КонецПроцедуры

Процедура АвтоматическийВыпускПродукции(СсылкаДок,ДокументОснование) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ТаблТовары.Номенклатура,
	|	ТаблТовары.Количество
	|ПОМЕСТИТЬ ТаблТовары
	|ИЗ
	|	&ТаблТовары КАК ТаблТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблТовары.Номенклатура,
	|	ТаблТовары.Количество,
	|	ИТ_АвтоматическийВыпускПродукцииСрезПоследних.Номенклатура.ОсновнаяЕдиницаИзмерения КАК ЕдиницаИзмерения
	|ПОМЕСТИТЬ ТаблДляОстатка
	|ИЗ
	|	РегистрСведений.ИТ_АвтоматическийВыпускПродукции.СрезПоследних(&Дата, ) КАК ИТ_АвтоматическийВыпускПродукцииСрезПоследних
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблТовары КАК ТаблТовары
	|		ПО ИТ_АвтоматическийВыпускПродукцииСрезПоследних.Номенклатура = ТаблТовары.Номенклатура
	|ГДЕ
	|	ИТ_АвтоматическийВыпускПродукцииСрезПоследних.Включить
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблТовары
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблДляОстатка.Номенклатура,
	|	ТаблДляОстатка.Количество - ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0) КАК Количество,
	|	ТаблДляОстатка.ЕдиницаИзмерения
	|ИЗ
	|	ТаблДляОстатка КАК ТаблДляОстатка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваровКомпании.Остатки(
	|				ДОБАВИТЬКДАТЕ(&Дата, СЕКУНДА, -1),
	|				СкладКомпании = &СкладКомпании
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							ТаблДляОстатка.Номенклатура
	|						ИЗ
	|							ТаблДляОстатка КАК ТаблДляОстатка)) КАК ОстаткиТоваровКомпанииОстатки
	|		ПО (ОстаткиТоваровКомпанииОстатки.Номенклатура = ТаблДляОстатка.Номенклатура)
	|ГДЕ
	|	ТаблДляОстатка.Количество > ЕСТЬNULL(ОстаткиТоваровКомпанииОстатки.КоличествоОстаток, 0)");
	Запрос.УстановитьПараметр("ТаблТовары",СсылкаДок.Товары);
	Запрос.УстановитьПараметр("Дата",СсылкаДок.Дата);
	Запрос.УстановитьПараметр("СкладКомпании",СсылкаДок.СкладКомпании);
	Результат = Запрос.Выполнить().Выгрузить();
	
	Если Результат.Количество() = 0 и НЕ ЗначениеЗаполнено(ДокументОснование) тогда
		Возврат;
	КонецЕсли;
		
	Если ЗначениеЗаполнено(ДокументОснование) тогда
		Докум = ДокументОснование.ПолучитьОбъект();
		Если Результат.Количество() = 0 и НЕ Докум.ПометкаУдаления тогда
			ДокументОснование.ПолучитьОбъект().УстановитьПометкуУдаления(Истина);
			Возврат;
		ИначеЕсли Результат.Количество() = 0 тогда
			Возврат;
		ИначеЕсли Докум.ПометкаУдаления тогда
			Докум.УстановитьПометкуУдаления(Ложь);
		КонецЕсли; 
		Если Результат.Итог("Количество") = Докум.Продукция.итог("Количество") и Докум.Проведен и Докум.Дата = СсылкаДок.Дата-1 тогда
			Возврат;
		КонецЕсли;		
		Докум.Продукция.Очистить();
	Иначе
		Докум = Документы.ОтчетПроизводстваЗаСмену.СоздатьДокумент();
		Докум.УстановитьНовыйНомер();
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Докум,СсылкаДок,"Автор,Организация,ПодразделениеКомпании,ВалютаДокумента,КурсДокумента,СкладКомпании,ТипЦен,РегламентированныйУчет");
	Докум.Дата = СсылкаДок.Дата-1;
	Докум.ХозОперация = Справочники.ХозОперации.ОтчетПроизводстваЗаСмену;
	Докум.ЗаменятьИнгредиентыАналогами = Истина;
	//Докум.ИТ_ВидОперации = Справочники.ИТ_ВидОперации.НайтиПоНаименованию("");
	
	Для Каждого ТекСтрока из Результат Цикл
		Новстр = Докум.Продукция.Добавить();
		ЗаполнитьЗначенияСвойств(Новстр,ТекСтрока);
		Новстр.Коэффициент = 1; 
		Новстр.Рецептура = РасчетПроизводства.ПолучитьОсновнуюРецептуру(Новстр.Номенклатура,Докум.Дата,Справочники.ХозОперации.Рецептура,Докум.ПодразделениеКомпании);
	КонецЦикла;
	Попытка
		Докум.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Попытка
		Докум.Записать();
		Исключение КонецПопытки;
	КонецПопытки;
	ДокументОснование = Докум.Ссылка;
	
КонецПроцедуры

Процедура АвтоматическийПересортТовараПриПоступлении(Ссылка) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	ИТ_АвтоматическийПересортСрезПоследних.ОсновнаяНоменклатура,
	|	ИТ_АвтоматическийПересортСрезПоследних.Номенклатура,
	|	ИТ_АвтоматическийПересортСрезПоследних.Номенклатура.ОсновнаяЕдиницаИзмерения КАК НоменклатураЕдиницаИзмерения,
	|	ИТ_АвтоматическийПересортСрезПоследних.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК НоменклатураКоэффициент,
	|	ИТ_АвтоматическийПересортСрезПоследних.ОсновнаяНоменклатура.ОсновнаяЕдиницаИзмерения КАК ОсновнаяНоменклатураЕдиницаИзмерения,
	|	ИТ_АвтоматическийПересортСрезПоследних.ОсновнаяНоменклатура.ОсновнаяЕдиницаИзмерения.Коэффициент КАК ОсновнаяНоменклатураКоэффициент
	|ИЗ
	|	РегистрСведений.ИТ_АвтоматическийПересорт.СрезПоследних(&Дата, ) КАК ИТ_АвтоматическийПересортСрезПоследних
	|ГДЕ
	|	НЕ ИТ_АвтоматическийПересортСрезПоследних.Отключен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПересортицаТоваров.Ссылка
	|ИЗ
	|	Документ.ПересортицаТоваров КАК ПересортицаТоваров
	|ГДЕ
	|	ПересортицаТоваров.ДокументОснование = &ДокументОснование");
	Запрос.УстановитьПараметр("Дата",Ссылка.Дата);
	Запрос.УстановитьПараметр("ДокументОснование",Ссылка);
	Результат = Запрос.ВыполнитьПакет();
	ТаблПересорта = Результат[0].Выгрузить();
	ЕстьДокум = Результат[1].Выбрать();
	Если ЕстьДокум.следующий() тогда
		Докум = ЕстьДокум.Ссылка.ПолучитьОбъект();
		БылаТаблица = Докум.Товары.выгрузить();
		Докум.Товары.Очистить();
	Иначе
		Докум = Документы.ПересортицаТоваров.СоздатьДокумент();
	КонецЕсли; 
		
	Для каждого ТекСтрока из Ссылка.Товары Цикл
		Найден = ТаблПересорта.Найти(ТекСтрока.Номенклатура,"Номенклатура");
		Если НЕ Найден = Неопределено тогда 
			Новстр = Докум.Товары.Добавить();
			Новстр.НоменклатураРасход = Найден.Номенклатура;
			Новстр.КоличествоРасход = ТекСтрока.Количество;
			Новстр.ЕдиницаИзмеренияРасход = Найден.НоменклатураЕдиницаИзмерения;
			Новстр.КоэффициентРасход = Найден.НоменклатураКоэффициент;
			Новстр.НоменклатураПриход = Найден.ОсновнаяНоменклатура;
			Новстр.КоличествоПриход = ТекСтрока.Количество;   
			Новстр.ЕдиницаИзмеренияПриход = Найден.ОсновнаяНоменклатураЕдиницаИзмерения;   
			Новстр.КоэффициентПриход = Найден.ОсновнаяНоменклатураКоэффициент;   
		КонецЕсли;		
	КонецЦикла;
	Если Докум.Товары.Количество() = 0 тогда 
		Если НЕ Докум.ЭтоНовый() и НЕ Докум.ПометкаУдаления тогда
			Докум.записать(РежимЗаписиДокумента.ОтменаПроведения);
			Докум.УстановитьПометкуУдаления(Истина);
			Сообщить("Удален автоматический пересорт: "+Докум.Ссылка);
		КонецЕсли;
		Возврат;
	Иначе
		Если НЕ Докум.ЭтоНовый() и Докум.ПометкаУдаления тогда
			Докум.ПометкаУдаления = Ложь;
		КонецЕсли;  
	КонецЕсли;	
	Если СравнитьТаблицыНаборовЗаписей(Докум.Товары.Выгрузить() , БылаТаблица) и Докум.СкладКомпании = Ссылка.СкладКомпании и Докум.Проведен тогда
		Возврат;
	КонецЕсли;
	Докум.Дата = Ссылка.Дата+1;
	Докум.ХозОперация = Справочники.ХозОперации.ПеретариваниеТоваров;
	Докум.ПодразделениеКомпании = Ссылка.ПодразделениеКомпании;
	Докум.ВалютаДокумента = Ссылка.ВалютаДокумента;
	Докум.ТипЦен = Ссылка.ТипЦен;
	Докум.КурсВалютыУпр = Ссылка.КурсВалютыУпр;
	Докум.КурсДокумента = Ссылка.КурсДокумента;
	Докум.Автор = Ссылка.Автор;
	Докум.Организация = Ссылка.Организация;
	Докум.СкладКомпании = Ссылка.СкладКомпании;
	Докум.СтатьяПричиныПересортицы = Справочники.СтатьиДоходовИРасходов.Пересортица;
	Докум.РегламентированныйУчет = Ссылка.РегламентированныйУчет;
	Докум.ДокументОснование = Ссылка;
	//Докум.ПолучитьФорму().Открыть();
	Попытка
		Докум.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		Докум.Записать();
	КонецПопытки;
	Сообщить("Автоматический пересорт: "+Докум.Ссылка);
	
КонецПроцедуры

Функция СравнитьТаблицыНаборовЗаписей(ТаблицаЗначений1, ТаблицаЗначений2) Экспорт

            Если ТипЗнч(ТаблицаЗначений1) <> Тип("ТаблицаЗначений") ИЛИ ТипЗнч(ТаблицаЗначений2) <> Тип("ТаблицаЗначений") Тогда
                        Возврат Ложь;
            КонецЕсли; 
            
            Если ТаблицаЗначений1.Количество() <> ТаблицаЗначений2.Количество() Тогда
                        Возврат Ложь;
            КонецЕсли; 

            Если ТаблицаЗначений1.Колонки.Количество() <> ТаблицаЗначений2.Колонки.Количество() Тогда
                        Возврат Ложь;
            КонецЕсли;
            
            // Проверим поля
            Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
                        Если ТаблицаЗначений2.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
                                   Возврат Ложь;
                        КонецЕсли;
            КонецЦикла; 
            Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
                        Если ТаблицаЗначений1.Колонки.Найти(Колонка.Имя) = Неопределено Тогда
                                   Возврат Ложь;
                        КонецЕсли;
            КонецЦикла; 
            
            // сформируем строку индекса для оптимизации поиска по таблице значений
            СтрокаИндекса = "";
            Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
                        Если СтрокаИндекса = "" Тогда
                                   СтрокаИндекса = Колонка.Имя;
                        Иначе
                                   СтрокаИндекса = СтрокаИндекса+","+Колонка.Имя;
                        КонецЕсли;
            КонецЦикла;
            // добавим индекс
            ТаблицаЗначений2.Индексы.Добавить(СтрокаИндекса);
            
            // Проверим записи
            Для каждого СтрокаТаблицы Из ТаблицаЗначений1 Цикл
                        СтруктураПоиска = Новый Структура;
                        Для каждого Колонка Из ТаблицаЗначений1.Колонки Цикл
                                   СтруктураПоиска.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
                        КонецЦикла;
                        СтрокиТаблицы2 = ТаблицаЗначений2.НайтиСтроки(СтруктураПоиска);
                        Если СтрокиТаблицы2.Количество() <> 1 Тогда
                                   Возврат Ложь;
                        КонецЕсли; 
            КонецЦикла;
            
            // сформируем строку индекса для оптимизации поиска по таблице значений
            СтрокаИндекса = "";
            Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
                        Если СтрокаИндекса = "" Тогда
                                   СтрокаИндекса = Колонка.Имя;
                        Иначе
                                   СтрокаИндекса = СтрокаИндекса+","+Колонка.Имя;
                        КонецЕсли;
            КонецЦикла;
            // добавим индекс
            ТаблицаЗначений1.Индексы.Добавить(СтрокаИндекса);
            
            Для каждого СтрокаТаблицы Из ТаблицаЗначений2 Цикл
                        СтруктураПоиска = Новый Структура;
                        Для каждого Колонка Из ТаблицаЗначений2.Колонки Цикл
                                   СтруктураПоиска.Вставить(Колонка.Имя, СтрокаТаблицы[Колонка.Имя]);
                        КонецЦикла;
                        СтрокиТаблицы1 = ТаблицаЗначений1.НайтиСтроки(СтруктураПоиска);
                        Если СтрокиТаблицы1.Количество() <> 1 Тогда
                                   Возврат Ложь;
                        КонецЕсли; 
            КонецЦикла;
            
            Возврат Истина;
            
КонецФункции // СравнитьТаблицыЗначений()

Процедура СделатьТранзитнуюСпецификацию(Ссылка) Экспорт
		
	Если Ссылка.ХозОперация=Справочники.ХозОперации.ПеремещениеТоваровВФилиал И Ссылка.СкладПолучатель.ПринимаетСпецификациюПеремещений Тогда
		ИДДокументаОтгрузки=СокрЛП(Ссылка.УникальныйИдентификатор());

		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
		|	СпецификацияПеремещений.ИДДокументаОтгрузки
		|ИЗ
		|	РегистрСведений.СпецификацияПеремещений КАК СпецификацияПеремещений
		|ГДЕ
		|	СпецификацияПеремещений.ИДДокументаОтгрузки = &ИДДокументаОтгрузки
		|
		|СГРУППИРОВАТЬ ПО
		|	СпецификацияПеремещений.ИДДокументаОтгрузки");
		Запрос.УстановитьПараметр("ИДДокументаОтгрузки",ИДДокументаОтгрузки);
		Если Запрос.Выполнить().Пустой() тогда
			#Если Клиент тогда
				Режим = РежимДиалогаВопрос.ДаНет;
				Ответ = Вопрос("Передать транзитную спецификацию на "+Ссылка.СкладПолучатель+"?", Режим, 0);
				Если Ответ = КодВозвратаДиалога.Нет Тогда
					Возврат;
				КонецЕсли; 
			#КонецЕсли  
		КонецЕсли;
		
		//Если Режим=РежимПроведенияДокумента.Оперативный Тогда
			ОбменЧерезФайл=Ссылка.СкладПолучатель.ОбменСпецификациямиЧерезФайл;
			НаборЗаписейТранзит=РегистрыСведений.СпецификацияПеремещений.СоздатьНаборЗаписей();
			НаборЗаписейТранзит.Отбор.ИДДокументаОтгрузки.Значение=ИДДокументаОтгрузки; НаборЗаписейТранзит.Отбор.ИДДокументаОтгрузки.Использование=Истина;
			ТаблицаСпецификации=Ссылка.Товары.Выгрузить();
			ТаблицаСпецификации.Свернуть("Номенклатура,ХарактеристикаНоменклатуры","Количество,СуммаРозничная");
			Для Каждого СтрокаТовар Из ТаблицаСпецификации Цикл
				Если СтрокаТовар.Количество=0 Тогда
					Продолжить;
				КонецЕсли;
				НоваяЗапись=НаборЗаписейТранзит.Добавить();
				НоваяЗапись.ИДДокументаОтгрузки=ИДДокументаОтгрузки;
				НоваяЗапись.ПодразделениеКомпании=Ссылка.СкладПолучатель;
				НоваяЗапись.Номенклатура=СтрокаТовар.Номенклатура;
				НоваяЗапись.ЕдиницаИзмерения=ПолучитьЕдиницуИзмеренияПоБазовой(СтрокаТовар.Номенклатура);
				НоваяЗапись.ХарактеристикаНоменклатуры=СтрокаТовар.ХарактеристикаНоменклатуры;
				НоваяЗапись.ДатаДокумента=Ссылка.Дата;
				НоваяЗапись.НомерДокумента=Ссылка.Номер; //TruA
				НоваяЗапись.Количество=СтрокаТовар.Количество;
				НоваяЗапись.Комментарий=СокрЛП(Ссылка);
				НоваяЗапись.НеобходимаВыгрузка=ОбменЧерезФайл;
				
				// ищем суммы
				СтруктураОтбора=Новый Структура("Номенклатура,ХарактеристикаНоменклатуры",СтрокаТовар.Номенклатура,СтрокаТовар.ХарактеристикаНоменклатуры);
				МассивСтрок=Ссылка.Товары.НайтиСтроки(СтруктураОтбора);
				Если МассивСтрок.Количество()=0 Тогда
					СтруктураОтбора=Новый Структура("Номенклатура",СтрокаТовар.Номенклатура);
					МассивСтрок=Ссылка.Товары.НайтиСтроки(СтруктураОтбора);
				КонецЕсли;
				СтрокаЦен=МассивСтрок[0];
				
				НоваяЗапись.Цена=СтрокаЦен.ЦенаРозничная;
				НоваяЗапись.Сумма=СтрокаЦен.СуммаРозничная;
			КонецЦикла;
			НаборЗаписейТранзит.Записать(Истина);
		//КонецЕсли;
	КонецЕсли;	
КонецПроцедуры

Процедура ПроверкаОстаткаНаКонецДня(ДвижениеПартий,Дата,Склад,ФлагПроведен,Отказ) Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	Табл.Номенклатура,
	|	ВЫБОР
	|		КОГДА Табл.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
	|			ТОГДА Табл.Количество
	|		ИНАЧЕ -Табл.Количество
	|	КОНЕЦ КАК Количество,
	|	Табл.ВидДвижения
	|ПОМЕСТИТЬ Табл
	|ИЗ
	|	&ДвижениеПартий КАК Табл
	|ГДЕ
	|	НЕ Табл.ХозОперация В (ЗНАЧЕНИЕ(справочник.хозоперации.ОтчетПроизводстваЗаСмену), ЗНАЧЕНИЕ(справочник.хозоперации.ПоступлениеТоваровСреднееОтрицательное))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Табл.Номенклатура,
	|	СУММА(Табл.Количество) КАК Количество
	|ПОМЕСТИТЬ Табл2
	|ИЗ
	|	Табл КАК Табл
	|
	|СГРУППИРОВАТЬ ПО
	|	Табл.Номенклатура,
	|	Табл.Номенклатура.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Табл2.Номенклатура,
	|	Табл2.Номенклатура.Код КАК Код,
	|	ВЫБОР
	|		КОГДА &ФлагПроведен
	|			ТОГДА ЕСТЬNULL(ПартииТоваровКомпанииОстатки.КоличествоОстаток, 0)
	|		ИНАЧЕ ЕСТЬNULL(ПартииТоваровКомпанииОстатки.КоличествоОстаток, 0) + Табл2.Количество
	|	КОНЕЦ КАК Количество
	|ИЗ
	|	Табл2 КАК Табл2
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваровКомпании.Остатки(
	|				&Дата,
	|				СкладКомпании = &СкладКомпании
	|					И Номенклатура В
	|						(ВЫБРАТЬ
	|							Табл2.Номенклатура
	|						ИЗ
	|							Табл2 КАК Табл2
	|						ГДЕ
	|							Табл2.Количество < 0)) КАК ПартииТоваровКомпанииОстатки
	|		ПО (ПартииТоваровКомпанииОстатки.Номенклатура = Табл2.Номенклатура)
	|ГДЕ
	|	Табл2.Количество < 0
	|	И ЕСТЬNULL(ПартииТоваровКомпанииОстатки.КоличествоОстаток, 0) + Табл2.Количество < 0");
	Запрос.УстановитьПараметр("СкладКомпании",Склад);
	Запрос.УстановитьПараметр("Дата",КонецДня(Дата));
	Запрос.УстановитьПараметр("ДвижениеПартий",ДвижениеПартий);
	Запрос.УстановитьПараметр("ФлагПроведен",ФлагПроведен);


	Результат = Запрос.Выполнить().Выбрать();					  
	Пока Результат.следующий() Цикл 		
		Сообщить("["+Результат.Код+"] Товара "+Результат.Номенклатура+" на конец дня не хватает: "+(-1)*Результат.Количество);
		Отказ = Истина;
	КонецЦикла;   	
	
КонецПроцедуры

Процедура ЗарегистрироватьВТаблицеРегистрацииДляОбмена(Объект) Экспорт
	#Если сервер тогда
	ИБТекущая = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().ИнформационнаяБаза;
	РежимРегистрации = 2;
	Запрос = Новый Запрос("
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗапросПоРодителю.Узел КАК Узел
	|ИЗ
	|(ВЫБРАТЬ ПЕРВЫЕ 1
	|	Ссылка.Родитель КАК Узел
	|ИЗ
	|	Справочник.СтруктураИнформационныхБаз
	|ГДЕ
	|	Ссылка = &ИБТекущая) КАК ЗапросПоРодителю 
	|ГДЕ
	|   ЗапросПоРодителю.Узел <> &ПустойУзел
	|И  ВЫБОР КОГДА &РежимРегистрации = 3 ТОГДА ЗапросПоРодителю.Узел <> &ОтправительСообщенияУРИБ ИНАЧЕ Истина КОНЕЦ    
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	Ссылка
	|ИЗ
	|	Справочник.СтруктураИнформационныхБаз
	|ГДЕ
	|	Родитель = &ИБТекущая 
	|И  ВЫБОР КОГДА &РежимРегистрации = 3 ТОГДА Ссылка <> &ОтправительСообщенияУРИБ ИНАЧЕ Истина КОНЕЦ 
	|");
	
	Запрос.УстановитьПараметр("ИБТекущая", ИБТекущая);
	Запрос.УстановитьПараметр("РежимРегистрации", РежимРегистрации); // если 3, то документ пришел по обмену
	Запрос.УстановитьПараметр("ОтправительСообщенияУРИБ", ?(РежимРегистрации=3, ПараметрыСеанса.ОтправительСообщенияУРИБ, Неопределено));
	Запрос.УстановитьПараметр("ПустойУзел", Справочники.СтруктураИнформационныхБаз.ПустаяСсылка());
	Попытка
		НаборУзловТекущейИБ = Запрос.Выполнить();
	Исключение
	КонецПопытки; 
	
	
	НаборРегистрацииДокументов=РегистрыСведений.ТаблицаРегистрацииДокументов.СоздатьНаборЗаписей();
	НаборРегистрацииДокументов.Отбор.Документ.Установить(Объект);
	
	Выборка = НаборУзловТекущейИБ.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Объект.МаршрутОбмена.Найти(Выборка.Узел, "ИнформационнаяБаза") <> Неопределено Тогда			
			ЗаписьРегистрации = НаборРегистрацииДокументов.Добавить();
			ЗаписьРегистрации.Документ						= Объект;
			ЗаписьРегистрации.КонтурОбмена					= Перечисления.КонтурыОбмена.ОсновнойОперативныйДокументооборот;
			ЗаписьРегистрации.Узел							= Выборка.Узел;
			ЗаписьРегистрации.НомерСообщения				= 0;
			//ЗаписьРегистрации.ТребуетПодтвержденияКОтправке	= ложь;
			ЗаписьРегистрации.ДатаРегистрации				= Объект.Дата;
			//ЗаписьРегистрации.УдаленныйОбъект				= Удаление;
			НаборРегистрацииДокументов.Записать(); 
		КонецЕсли;
	КонецЦикла; 
	#КонецЕсли
КонецПроцедуры

Процедура ПроставитьМаршрутОбмена(Данные) Экспорт
	#Если сервер тогда
	Запрос=Новый Запрос("ВЫБРАТЬ
	|	СтруктураИнформационныхБаз.Ссылка
	|ИЗ
	|	Справочник.СтруктураИнформационныхБаз КАК СтруктураИнформационныхБаз
	|ГДЕ
	|	СтруктураИнформационныхБаз.Ссылка В(&МассивПодразделений)
	|	И НЕ СтруктураИнформационныхБаз.Ссылка В(&МассивУзлов)");
	
	МассивПодразделений=Новый Массив;
	ИБ1=Данные.ПодразделениеКомпании.ИнформационнаяБаза;
	Если НЕ ЗначениеЗаполнено(ИБ1) Тогда
		МассивПодразделений.Добавить(ИБ1);
	КонецЕсли;
	ИБ2=Данные.СкладКомпании.Подразделение.ИнформационнаяБаза;
	Если НЕ ЗначениеЗаполнено(ИБ2) Тогда
		МассивПодразделений.Добавить(ИБ2);
	КонецЕсли;
	Запрос.УстановитьПараметр("МассивПодразделений",МассивПодразделений);
	Запрос.УстановитьПараметр("МассивУзлов",Данные.МаршрутОбмена.ВыгрузитьКолонку("ИнформационнаяБаза"));
	Выборка=Запрос.Выполнить().Выбрать();
	Запрос2 = Новый Запрос("
	|ВЫБРАТЬ
	|	Ссылка КАК ИнформационнаяБаза
	|ИЗ
	|	Справочник.СтруктураИнформационныхБаз
	|ГДЕ
	|	Ссылка = &ИБТекущая
	|ИТОГИ ПО 
	|	ИнформационнаяБаза ТОЛЬКО ИЕРАРХИЯ");
	Пока Выборка.Следующий() Цикл
		Запрос2.УстановитьПараметр("ИБТекущая", Выборка.Ссылка);
		КешРодителиТекущегоУзла2 = Запрос2.Выполнить();
		Выборка2 = КешРодителиТекущегоУзла2.Выбрать();
		Пока Выборка2.Следующий() Цикл
			Если НЕ ЗначениеЗаполнено(Выборка2.ИнформационнаяБаза) Тогда
				Если Данные.МаршрутОбмена.Найти(Выборка2.ИнформационнаяБаза,"ИнформационнаяБаза") = Неопределено Тогда
					Стр						= Данные.МаршрутОбмена.Добавить();
					Стр.ИнформационнаяБаза	= Выборка2.ИнформационнаяБаза;
					МаршрутИзменен = Истина; 
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	#КонецЕсли
КонецПроцедуры

//Трофимова +++
Процедура ит_ПроверкаКонтрагентовДоговоровПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	Если Источник.Дата < Константы.ит_ДатаДействияЗапретаДК.Получить() Тогда 
		Возврат;
	КонецЕсли;
	Отказ = Ложь;
	//АвансовыйОтчет
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.АвансовыйОтчет") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит табличной части Расходы.Контрагент
		Для каждого стр из Источник.Расходы Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части Расходы указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит табличной части Расходы.Договор
		Для каждого стр из Источник.Расходы Цикл
			Если ЗначениеЗаполнено(стр.Договор) И стр.Договор.ПометкаУдаления Тогда
				Сообщить("В табличной части Расходы указан Договор помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//АктКорректировкиОтгрузки
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.АктКорректировкиОтгрузки") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//АктКорректировкиПоставки
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.АктКорректировкиПоставки") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВводОстатковВзаиморасчетов
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВводОстатковВзаиморасчетов") Тогда
		//реквизит табличной части Состав.Контрагент
		Для каждого стр из Источник.Состав Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части Состав указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Состав.ДоговорВзаиморасчетов
		Для каждого стр из Источник.Состав Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части Состав указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//ВводОстатковТоваров
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВводОстатковТоваров") Тогда
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//Взаимозачет
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Взаимозачет") Тогда
		//реквизит шапки Дебитор
		Если ТипЗнч(Источник.Дебитор) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.Дебитор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.Дебитор) И Источник.Дебитор.ПометкаУдаления  Тогда
				Сообщить("В документе указан Дебитор помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//реквизит шапки Кредитор
		Если ТипЗнч(Источник.Кредитор) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.Кредитор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.Кредитор) И Источник.Кредитор.ПометкаУдаления  Тогда
				Сообщить("В документе указан Кредитор помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//реквизит табличной части Состав.ДоговорВзаиморасчетовДебитор
		Для каждого стр из Источник.Состав Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетовДебитор) И стр.ДоговорВзаиморасчетовДебитор.ПометкаУдаления Тогда
				Сообщить("В табличной части Состав указан ДоговорВзаиморасчетовДебитор помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Состав.ДоговорВзаиморасчетовКредитор
		Для каждого стр из Источник.Состав Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетовКредитор) И стр.ДоговорВзаиморасчетовКредитор.ПометкаУдаления Тогда
				Сообщить("В табличной части Состав указан ДоговорВзаиморасчетовКредитор помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//ВозвратОтПокупателя
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВозвратОтПокупателя") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВозвратПоставщику
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВозвратПоставщику") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящаяСчетФактура
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящаяСчетФактура") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящаяЭлектроннаяНакладная
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящаяЭлектроннаяНакладная") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящееИзвещение
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящееИзвещение") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийАкцептЗаказа
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийАкцептЗаказа") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийАкцептНакладной
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийАкцептНакладной") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийАкцептСчетФактура
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийАкцептСчетФактура") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийЗаказ
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийЗаказ") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийЗапросКаталога
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийЗапросКаталога") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийЗапросПрайсЛиста
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийЗапросПрайсЛиста") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийКаталогТоваров
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийКаталогТоваров") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийПрайсЛист
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийПрайсЛист") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийРеджектЗаказа
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийРеджектЗаказа") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийРеджектНакладной
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийРеджектНакладной") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийРеджектСчетФактура
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийРеджектСчетФактура") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ВходящийТоварКРаботе
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ВходящийТоварКРаботе") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//Выписка
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Выписка") Тогда
		//реквизит табличной части Состав.ДоговорВзаиморасчетов
		Для каждого стр из Источник.Состав Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части Состав указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Состав.Контрагент
		Для каждого стр из Источник.Состав Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части Состав указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//ЗаказПокупателя
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ЗаказПоставщику
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИзменениеДополнительныхПараметровНоменклатуры
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИзменениеДополнительныхПараметровНоменклатуры") Тогда
		//реквизит табличной части ТоварыДокумента.ОсновнойПоставщик
		Для каждого стр из Источник.ТоварыДокумента Цикл
			Если ТипЗнч(стр.ОсновнойПоставщик) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ОсновнойПоставщик) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ОсновнойПоставщик) И стр.ОсновнойПоставщик.ПометкаУдаления Тогда
					Сообщить("В табличной части ТоварыДокумента указан ОсновнойПоставщик помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//Цепелев  +++ 2019-05-17
		//реквизит табличной части ТоварыДокумента.АльтернативныйПоставщик1
		//Для каждого стр из Источник.ТоварыДокумента Цикл
		//	Если ТипЗнч(стр.АльтернативныйПоставщик1) = Тип("СправочникСсылка.Контрагенты") 
		// 			ИЛИ ТипЗнч(стр.АльтернативныйПоставщик1) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		//		Если ЗначениеЗаполнено(стр.АльтернативныйПоставщик1) И стр.АльтернативныйПоставщик1.ПометкаУдаления Тогда
		//			Сообщить("В табличной части ТоварыДокумента указан АльтернативныйПоставщик1 помеченный на удаление! Строка " + стр.НомерСтроки);
		//			Отказ = Истина;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;
		////реквизит табличной части ТоварыДокумента.АльтернативныйПоставщик2
		//Для каждого стр из Источник.ТоварыДокумента Цикл
		//	Если ТипЗнч(стр.АльтернативныйПоставщик2) = Тип("СправочникСсылка.Контрагенты") 
		// 			ИЛИ ТипЗнч(стр.АльтернативныйПоставщик2) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		//		Если ЗначениеЗаполнено(стр.АльтернативныйПоставщик2) И стр.АльтернативныйПоставщик2.ПометкаУдаления Тогда
		//			Сообщить("В табличной части ТоварыДокумента указан АльтернативныйПоставщик2 помеченный на удаление! Строка " + стр.НомерСтроки);
		//			Отказ = Истина;
		//		КонецЕсли;
		//	КонецЕсли;
		//КонецЦикла;
		//реквизит табличной части ТоварыДокумента.АльтернативныйПоставщик1
		Для каждого стр из Источник.ТоварыДокумента Цикл
			Если ТипЗнч(стр.АльтернативныйПоставщик1) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.АльтернативныйПоставщик1) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
				Если ЗначениеЗаполнено(стр.АльтернативныйПоставщик1) И стр.АльтернативныйПоставщик1.ПометкаУдаления Тогда
					Сообщить("В табличной части ТоварыДокумента указан АльтернативныйПоставщик1 помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ТоварыДокумента.АльтернативныйПоставщик2
		Для каждого стр из Источник.ТоварыДокумента Цикл
			Если ТипЗнч(стр.АльтернативныйПоставщик2) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.АльтернативныйПоставщик2) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
				Если ЗначениеЗаполнено(стр.АльтернативныйПоставщик2) И стр.АльтернативныйПоставщик2.ПометкаУдаления Тогда
					Сообщить("В табличной части ТоварыДокумента указан АльтернативныйПоставщик2 помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;

		//Цепелев  --- 2019-05-17              
		
	КонецЕсли;
	//ИзменениеЦен
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИзменениеЦен") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Поставщик
		Если ТипЗнч(Источник.Поставщик) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.Поставщик) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.Поставщик) И Источник.Поставщик.ПометкаУдаления  Тогда
				Сообщить("В документе указан Поставщик помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//ИзменениеЦенСводное
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИзменениеЦенСводное") Тогда
		//реквизит шапки Поставщик
		Если ТипЗнч(Источник.Поставщик) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.Поставщик) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.Поставщик) И Источник.Поставщик.ПометкаУдаления  Тогда
				Сообщить("В документе указан Поставщик помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//Инвентаризация
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Инвентаризация") Тогда
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//Инкассация
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Инкассация") Тогда
		//реквизит шапки ДоговорВзаиморасчетовИнкассатор
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетовИнкассатор) И Источник.ДоговорВзаиморасчетовИнкассатор.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетовИнкассатор помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетовПлатежнаяСистема
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетовПлатежнаяСистема) И Источник.ДоговорВзаиморасчетовПлатежнаяСистема.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетовПлатежнаяСистема помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ПлатежнаяСистема
		Если ТипЗнч(Источник.ПлатежнаяСистема) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.ПлатежнаяСистема) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.ПлатежнаяСистема) И Источник.ПлатежнаяСистема.ПометкаУдаления  Тогда
				Сообщить("В документе указан ПлатежнаяСистема помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//реквизит шапки Инкассатор
		Если ТипЗнч(Источник.Инкассатор) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.Инкассатор) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.Инкассатор) И Источник.Инкассатор.ПометкаУдаления  Тогда
				Сообщить("В документе указан Инкассатор помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//ИсходящаяСчетФактура
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящаяСчетФактура") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящаяЭлектроннаяНакладная
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящаяЭлектроннаяНакладная") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящееИзвещение
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящееИзвещение") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящийЗаказ
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящийЗаказ") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящийЗапросКаталога
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящийЗапросКаталога") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящийЗапросПрайсЛиста
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящийЗапросПрайсЛиста") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящийКаталогТоваров
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящийКаталогТоваров") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящийПрайсЛист
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящийПрайсЛист") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящийРеджектАкцептЗаказа
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящийРеджектАкцептЗаказа") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящийРеджектАкцептНакладной
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящийРеджектАкцептНакладной") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящийРеджектАкцептСчетаФактуры
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящийРеджектАкцептСчетаФактуры") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ИсходящийТоварКРаботе
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ИсходящийТоварКРаботе") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//КонсолидированныеВзаиморасчеты
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КонсолидированныеВзаиморасчеты") Тогда
		//реквизит табличной части Состав.Контрагент
		Для каждого стр из Источник.Состав Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части Состав указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//КорректировкаДолга
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КорректировкаДолга") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит табличной части Состав.ДоговорВзаиморасчетов
		Для каждого стр из Источник.Состав Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части Состав указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//КорректировкаЗаказаПокупателя
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КорректировкаЗаказаПокупателя") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//КорректировкаЗаказаПоставщику
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КорректировкаЗаказаПоставщику") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//КорректировкаУчетныхДанных
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КорректировкаУчетныхДанных") Тогда
		//реквизит табличной части ВыданныеКредиты.Контрагент
		Для каждого стр из Источник.ВыданныеКредиты Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части ВыданныеКредиты указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ВыданныеКредиты.Банк
		Для каждого стр из Источник.ВыданныеКредиты Цикл
			Если ТипЗнч(стр.Банк) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.Банк) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.Банк) И стр.Банк.ПометкаУдаления Тогда
					Сообщить("В табличной части ВыданныеКредиты указан Банк помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ЗаказыПокупателей.Контрагент
		Для каждого стр из Источник.ЗаказыПокупателей Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части ЗаказыПокупателей указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ЗаказыПоставщикам.Контрагент
		Для каждого стр из Источник.ЗаказыПоставщикам Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части ЗаказыПоставщикам указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части КонсолидированныйВзаиморасчетыКомпании.Контрагент
		Для каждого стр из Источник.КонсолидированныйВзаиморасчетыКомпании Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части КонсолидированныйВзаиморасчетыКомпании указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Цены.Контрагент
		Для каждого стр из Источник.Цены Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части Цены указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части РасчетыПоБонусам.Контрагент
		Для каждого стр из Источник.РасчетыПоБонусам Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части РасчетыПоБонусам указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части БюджетноеПланирование.Аналитика
		Для каждого стр из Источник.БюджетноеПланирование Цикл
			Если ТипЗнч(стр.Аналитика) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.Аналитика) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.Аналитика) И стр.Аналитика.ПометкаУдаления Тогда
					Сообщить("В табличной части БюджетноеПланирование указан Аналитика помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ПредоставленныеСкидки.Контрагент
		Для каждого стр из Источник.ПредоставленныеСкидки Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части ПредоставленныеСкидки указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Продажи.Покупатель
		Для каждого стр из Источник.Продажи Цикл
			Если ТипЗнч(стр.Покупатель) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.Покупатель) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.Покупатель) И стр.Покупатель.ПометкаУдаления Тогда
					Сообщить("В табличной части Продажи указан Покупатель помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Продажи.Поставщик
		Для каждого стр из Источник.Продажи Цикл
			Если ТипЗнч(стр.Поставщик) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.Поставщик) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.Поставщик) И стр.Поставщик.ПометкаУдаления Тогда
					Сообщить("В табличной части Продажи указан Поставщик помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Планирование.ВидАналитикиПланирования2
		Для каждого стр из Источник.Планирование Цикл
			Если ТипЗнч(стр.ВидАналитикиПланирования2) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ВидАналитикиПланирования2) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ВидАналитикиПланирования2) И стр.ВидАналитикиПланирования2.ПометкаУдаления Тогда
					Сообщить("В табличной части Планирование указан ВидАналитикиПланирования2 помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Планирование.ВидАналитикиПланирования1
		Для каждого стр из Источник.Планирование Цикл
			Если ТипЗнч(стр.ВидАналитикиПланирования1) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ВидАналитикиПланирования1) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ВидАналитикиПланирования1) И стр.ВидАналитикиПланирования1.ПометкаУдаления Тогда
					Сообщить("В табличной части Планирование указан ВидАналитикиПланирования1 помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части РеализованныеТовары.Контрагент
		Для каждого стр из Источник.РеализованныеТовары Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части РеализованныеТовары указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ПартииТоваровОтданные.Контрагент
		Для каждого стр из Источник.ПартииТоваровОтданные Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части ПартииТоваровОтданные указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ОстаткиТоваровКомпании.Контрагент
		Для каждого стр из Источник.ОстаткиТоваровКомпании Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части ОстаткиТоваровКомпании указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части РасчетыПоБонусам.ДоговорБонусов
		Для каждого стр из Источник.РасчетыПоБонусам Цикл
			Если ЗначениеЗаполнено(стр.ДоговорБонусов) И стр.ДоговорБонусов.ПометкаУдаления Тогда
				Сообщить("В табличной части РасчетыПоБонусам указан ДоговорБонусов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части РасчетыПоБонусам.ДоговорПоставки
		Для каждого стр из Источник.РасчетыПоБонусам Цикл
			Если ЗначениеЗаполнено(стр.ДоговорПоставки) И стр.ДоговорПоставки.ПометкаУдаления Тогда
				Сообщить("В табличной части РасчетыПоБонусам указан ДоговорПоставки помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части БюджетноеПланирование.Аналитика
		Для каждого стр из Источник.БюджетноеПланирование Цикл
			Если ТипЗнч(стр.Аналитика) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.Аналитика) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.Аналитика) И стр.Аналитика.ПометкаУдаления Тогда
					Сообщить("В табличной части БюджетноеПланирование указан Аналитика помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Продажи.ДоговорВзаиморасчетов
		Для каждого стр из Источник.Продажи Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части Продажи указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Планирование.ВидАналитикиПланирования2
		Для каждого стр из Источник.Планирование Цикл
			Если ТипЗнч(стр.ВидАналитикиПланирования2) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ВидАналитикиПланирования2) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ВидАналитикиПланирования2) И стр.ВидАналитикиПланирования2.ПометкаУдаления Тогда
					Сообщить("В табличной части Планирование указан ВидАналитикиПланирования2 помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Планирование.ВидАналитикиПланирования1
		Для каждого стр из Источник.Планирование Цикл
			Если ТипЗнч(стр.ВидАналитикиПланирования1) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ВидАналитикиПланирования1) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ВидАналитикиПланирования1) И стр.ВидАналитикиПланирования1.ПометкаУдаления Тогда
					Сообщить("В табличной части Планирование указан ВидАналитикиПланирования1 помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части РеализованныеТовары.ДоговорВзаиморасчетов
		Для каждого стр из Источник.РеализованныеТовары Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части РеализованныеТовары указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ПартииТоваровОтданные.ДоговорВзаиморасчетов
		Для каждого стр из Источник.ПартииТоваровОтданные Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части ПартииТоваровОтданные указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ВыданныеКредиты.ДоговорВзаиморасчетовСБанком
		Для каждого стр из Источник.ВыданныеКредиты Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетовСБанком) И стр.ДоговорВзаиморасчетовСБанком.ПометкаУдаления Тогда
				Сообщить("В табличной части ВыданныеКредиты указан ДоговорВзаиморасчетовСБанком помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ВзаиморасчетыКомпании.ДоговорВзаиморасчетов
		Для каждого стр из Источник.ВзаиморасчетыКомпании Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части ВзаиморасчетыКомпании указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ВзаиморасчетыКомпании.Контрагент
		Для каждого стр из Источник.ВзаиморасчетыКомпании Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части ВзаиморасчетыКомпании указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//КредитныйДоговор
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.КредитныйДоговор") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Банк
		Если ТипЗнч(Источник.Банк) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.Банк) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.Банк) И Источник.Банк.ПометкаУдаления  Тогда
				Сообщить("В документе указан Банк помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетовСБанком
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетовСБанком) И Источник.ДоговорВзаиморасчетовСБанком.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетовСБанком помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//НазначениеСкидок
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.НазначениеСкидок") Тогда
		//реквизит табличной части Скидки.Свойство
		Для каждого стр из Источник.Скидки Цикл
			Если ТипЗнч(стр.Свойство) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.Свойство) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
				Если ЗначениеЗаполнено(стр.Свойство) И стр.Свойство.ПометкаУдаления Тогда
					Сообщить("В табличной части Скидки указан Свойство помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Скидки.Договор
		Для каждого стр из Источник.Скидки Цикл
			Если ЗначениеЗаполнено(стр.Договор) И стр.Договор.ПометкаУдаления Тогда
				Сообщить("В табличной части Скидки указан Договор помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//НалоговаяНакладная
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.НалоговаяНакладная") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ОтчетКомиссионера
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ОтчетКомиссионера") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ОтчетКомитенту
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ОтчетКомитенту") Тогда
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//Переоценка
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Переоценка") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ПланФакт
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПланФакт") Тогда
		//реквизит шапки ОбъектПланирования
		Если ТипЗнч(Источник.ОбъектПланирования) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.ОбъектПланирования) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.ОбъектПланирования) И Источник.ОбъектПланирования.ПометкаУдаления  Тогда
				Сообщить("В документе указан ОбъектПланирования помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//реквизит табличной части ПараметрыПлана.ЗначениеПараметра
		Для каждого стр из Источник.ПараметрыПлана Цикл
			Если ТипЗнч(стр.ЗначениеПараметра) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ЗначениеПараметра) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ЗначениеПараметра) И стр.ЗначениеПараметра.ПометкаУдаления Тогда
					Сообщить("В табличной части ПараметрыПлана указан ЗначениеПараметра помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Показатели.ВидАналитикиПланирования2
		Для каждого стр из Источник.Показатели Цикл
			Если ТипЗнч(стр.ВидАналитикиПланирования2) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ВидАналитикиПланирования2) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ВидАналитикиПланирования2) И стр.ВидАналитикиПланирования2.ПометкаУдаления Тогда
					Сообщить("В табличной части Показатели указан ВидАналитикиПланирования2 помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Показатели.ВидАналитикиПланирования1
		Для каждого стр из Источник.Показатели Цикл
			Если ТипЗнч(стр.ВидАналитикиПланирования1) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ВидАналитикиПланирования1) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ВидАналитикиПланирования1) И стр.ВидАналитикиПланирования1.ПометкаУдаления Тогда
					Сообщить("В табличной части Показатели указан ВидАналитикиПланирования1 помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит шапки ОбъектПланирования
		Если ТипЗнч(Источник.ОбъектПланирования) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.ОбъектПланирования) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.ОбъектПланирования) И Источник.ОбъектПланирования.ПометкаУдаления  Тогда
				Сообщить("В документе указан ОбъектПланирования помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//реквизит табличной части Показатели.ВидАналитикиПланирования1
		Для каждого стр из Источник.Показатели Цикл
			Если ТипЗнч(стр.ВидАналитикиПланирования1) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ВидАналитикиПланирования1) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ВидАналитикиПланирования1) И стр.ВидАналитикиПланирования1.ПометкаУдаления Тогда
					Сообщить("В табличной части Показатели указан ВидАналитикиПланирования1 помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части Показатели.ВидАналитикиПланирования2
		Для каждого стр из Источник.Показатели Цикл
			Если ТипЗнч(стр.ВидАналитикиПланирования2) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ВидАналитикиПланирования2) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ВидАналитикиПланирования2) И стр.ВидАналитикиПланирования2.ПометкаУдаления Тогда
					Сообщить("В табличной части Показатели указан ВидАналитикиПланирования2 помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит табличной части ПараметрыПлана.ЗначениеПараметра
		Для каждого стр из Источник.ПараметрыПлана Цикл
			Если ТипЗнч(стр.ЗначениеПараметра) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.ЗначениеПараметра) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.ЗначениеПараметра) И стр.ЗначениеПараметра.ПометкаУдаления Тогда
					Сообщить("В табличной части ПараметрыПлана указан ЗначениеПараметра помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//ПлатежноеПоручение
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПлатежноеПоручение") Тогда
		//реквизит табличной части ПоСделкам.ДоговорВзаиморасчетов
		Для каждого стр из Источник.ПоСделкам Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части ПоСделкам указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ПоступлениеДопРасходов
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПоступлениеДопРасходов") Тогда
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ПоступлениеТоваров
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПоступлениеТоваров") Тогда
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит табличной части Товары.Производитель
		Для каждого стр из Источник.Товары Цикл
			Если ТипЗнч(стр.Производитель) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.Производитель) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
				Если ЗначениеЗаполнено(стр.Производитель) И стр.Производитель.ПометкаУдаления Тогда
					Сообщить("В табличной части Товары указан Производитель помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ПредварительноеПоступлениеТоваров
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПредварительноеПоступлениеТоваров") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//Приложение2КНалоговойНакладной
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Приложение2КНалоговойНакладной") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//ПриходныйКассовыйОрдер
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПриходныйКассовыйОрдер") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит табличной части Сделки.ДоговорВзаиморасчетов
		Для каждого стр из Источник.Сделки Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части Сделки указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//ПриходныйСкладскойОрдер
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПриходныйСкладскойОрдер") Тогда
		//реквизит шапки ВладелецТовара
		Если ТипЗнч(Источник.ВладелецТовара) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.ВладелецТовара) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.ВладелецТовара) И Источник.ВладелецТовара.ПометкаУдаления  Тогда
				Сообщить("В документе указан ВладелецТовара помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//ПротоколСогласованияЦен
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ПротоколСогласованияЦен") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//Разделка
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Разделка") Тогда
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//РасходныйКассовыйОрдер
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РасходныйКассовыйОрдер") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит табличной части Сделки.ДоговорВзаиморасчетов
		Для каждого стр из Источник.Сделки Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части Сделки указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//РасходныйСкладскойОрдер
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РасходныйСкладскойОрдер") Тогда
		//реквизит шапки ВладелецТовара
		Если ТипЗнч(Источник.ВладелецТовара) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.ВладелецТовара) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.ВладелецТовара) И Источник.ВладелецТовара.ПометкаУдаления  Тогда
				Сообщить("В документе указан ВладелецТовара помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//РасчетБонусов
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РасчетБонусов") Тогда
		//реквизит табличной части Бонусы.ДоговорВзаиморасчетов
		Для каждого стр из Источник.Бонусы Цикл
			Если ЗначениеЗаполнено(стр.ДоговорВзаиморасчетов) И стр.ДоговорВзаиморасчетов.ПометкаУдаления Тогда
				Сообщить("В табличной части Бонусы указан ДоговорВзаиморасчетов помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//РеализацияТоваров
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РеализацияТоваров") Тогда
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Грузополучатель
		Если ТипЗнч(Источник.Грузополучатель) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.Грузополучатель) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.Грузополучатель) И Источник.Грузополучатель.ПометкаУдаления  Тогда
				Сообщить("В документе указан Грузополучатель помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//РезервированиеЗаказовПокупателя
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.РезервированиеЗаказовПокупателя") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//СнятиеРезервовЗаказовПокупателя
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СнятиеРезервовЗаказовПокупателя") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//Событие
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.Событие") Тогда
		//реквизит табличной части СторонниеЛица.Контрагент
		Для каждого стр из Источник.СторонниеЛица Цикл
			Если ЗначениеЗаполнено(стр.Контрагент) И стр.Контрагент.ПометкаУдаления Тогда
				Сообщить("В табличной части СторонниеЛица указан Контрагент помеченный на удаление! Строка " + стр.НомерСтроки);
				Отказ = Истина;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	//СписаниеТоваров
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СписаниеТоваров") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//СчетНаОплату
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СчетНаОплату") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//СчетФактураВыданный
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СчетФактураВыданный") Тогда
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Грузополучатель
		Если ТипЗнч(Источник.Грузополучатель) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.Грузополучатель) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.Грузополучатель) И Источник.Грузополучатель.ПометкаУдаления  Тогда
				Сообщить("В документе указан Грузополучатель помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	//СчетФактураПолученный
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СчетФактураПолученный") Тогда
		//реквизит шапки ДоговорВзаиморасчетов
		Если ЗначениеЗаполнено(Источник.ДоговорВзаиморасчетов) И Источник.ДоговорВзаиморасчетов.ПометкаУдаления  Тогда
			Сообщить("В документе указан ДоговорВзаиморасчетов помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Контрагент
		Если ЗначениеЗаполнено(Источник.Контрагент) И Источник.Контрагент.ПометкаУдаления  Тогда
			Сообщить("В документе указан Контрагент помеченный на удаление!");
			Отказ = Истина;
		КонецЕсли;
		//реквизит шапки Грузоотправитель
		Если ТипЗнч(Источник.Грузоотправитель) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.Грузоотправитель) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			Если ЗначениеЗаполнено(Источник.Грузоотправитель) И Источник.Грузоотправитель.ПометкаУдаления  Тогда
				Сообщить("В документе указан Грузоотправитель помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	//ЭлектронноеПисьмо
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.ЭлектронноеПисьмо") Тогда
		//реквизит шапки СсылкаНаОбъект
		Если ТипЗнч(Источник.СсылкаНаОбъект) = Тип("СправочникСсылка.Контрагенты") 
		 		ИЛИ ТипЗнч(Источник.СсылкаНаОбъект) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
			Если ЗначениеЗаполнено(Источник.СсылкаНаОбъект) И Источник.СсылкаНаОбъект.ПометкаУдаления  Тогда
				Сообщить("В документе указан СсылкаНаОбъект помеченный на удаление!");
				Отказ = Истина;
			КонецЕсли;
		КонецЕсли;
		//реквизит табличной части Получатели.СсылкаНаОбъект
		Для каждого стр из Источник.Получатели Цикл
			Если ТипЗнч(стр.СсылкаНаОбъект) = Тип("СправочникСсылка.Контрагенты") 
		 			ИЛИ ТипЗнч(стр.СсылкаНаОбъект) = Тип("СправочникСсылка.ДоговорыВзаиморасчетов") Тогда
				Если ЗначениеЗаполнено(стр.СсылкаНаОбъект) И стр.СсылкаНаОбъект.ПометкаУдаления Тогда
					Сообщить("В табличной части Получатели указан СсылкаНаОбъект помеченный на удаление! Строка " + стр.НомерСтроки);
					Отказ = Истина;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
//Трофимова ---

//Цепелев  +++ 2018-11-07 
 // Позволяет определить есть ли среди реквизитов шапки Объекта реквизит с переданным именем.
Функция ЕстьРеквизитОбъекта(ИмяРеквизита, Объект) Экспорт

МетаданныеОбъекта = Объект.Метаданные();
Если МетаданныеОбъекта.Реквизиты.Найти(ИмяРеквизита) = Неопределено Тогда
Возврат Ложь;
Иначе
Возврат Истина;
КонецЕсли; 

КонецФункции //Цепелев  --- 2018-11-07

// Позволяет определить есть ли среди реквизитов шапки документа
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ит_ЕстьРеквизитДокумента(ИмяРеквизита, МетаданныеДокумента) Экспорт

	Возврат НЕ (МетаданныеДокумента.Реквизиты.Найти(ИмяРеквизита) = Неопределено);

КонецФункции // ЕстьРеквизитДокумента()

// Позволяет определить есть ли табличная часть документа с переданным именем.
//
// Параметры: 
//  ИмяТабЧасти - строковое имя искомой табличной части,
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ит_ЕстьТабЧастьДокумента(ИмяТабЧасти, МетаданныеДокумента) Экспорт

	Если МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти) = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли; 

КонецФункции // ЕстьТабЧастьДокумента()

// Позволяет определить есть ли среди реквизитов табличной части документа
// реквизит с переданным именем.
//
// Параметры: 
//  ИмяРеквизита - строковое имя искомого реквизита, 
//  МетаданныеДокумента - объект описания метаданных документа, среди реквизитов которого производится поиск.
//  ИмяТабЧасти  - строковое имя табличной части документа, среди реквизитов которого производится поиск
//
// Возвращаемое значение:
//  Истина - нашли реквизит с таким именем, Ложь - не нашли.
//
Функция ит_ЕстьРеквизитТабЧастиДокумента(ИмяРеквизита, МетаданныеДокумента, ИмяТабЧасти) Экспорт

	ТабЧасть = МетаданныеДокумента.ТабличныеЧасти.Найти(ИмяТабЧасти);

	Если ТабЧасть = Неопределено Тогда // Нет такой таб. части в документе
		Возврат Ложь;

	Иначе
		Возврат НЕ (ТабЧасть.Реквизиты.Найти(ИмяРеквизита) = Неопределено);

	КонецЕсли;

КонецФункции // ЕстьРеквизитТабЧастиДокумента()

//Цепелев  +++ 2018-11-07                                                              
Функция НоменклатураЗаблокировананаДату(Номенклатура,ДатаПроверки) Экспорт
	Результат = Ложь;
	
	Если ЕстьРеквизитОбъекта("ит_НеИспользовать",Номенклатура)	Тогда
		Если ДатаПроверки>=Номенклатура.ит_НеИспользовать и ЗначениеЗаполнено(Номенклатура.ит_НеИспользовать) Тогда
			Результат = Истина;
			Возврат Результат;
		КонецЕсли;	
	КонецЕсли;
	Возврат Результат;
КонецФункции//Цепелев  --- 2018-11-07
//Цепелев  +++ 2018-11-07
Процедура ит_ПроверкаЗаблокированнойНоменклатурыДокументПоступления(Источник, Отказ, РежимПроведения) Экспорт
	//ПоступлениеТоваров.Товары
	Если ит_ЕстьТабЧастьДокумента("Товары",Источник.Метаданные()) Тогда
		Если ит_ЕстьРеквизитТабЧастиДокумента("Номенклатура",Источник.Метаданные(),"Товары") 
			Тогда
				//реквизит табличной части Товары.Номенклатура
				Для каждого стр из Источник.Товары Цикл
					Если ЗначениеЗаполнено(стр.Номенклатура) И ЗначениеЗаполнено(Источник.Дата) И НоменклатураЗаблокировананаДату(стр.Номенклатура,Источник.Дата) Тогда
						Сообщить("В табличной части Товары указана заблокированная Номенклатура по периоду использования! Строка " + стр.НомерСтроки);
						Отказ = Истина;
					КонецЕсли;
				КонецЦикла;
	
			КонецЕсли;                                                                                     
		КонецЕсли;
КонецПроцедуры//Цепелев  --- 2018-11-07     

Функция ПеренаправлениеНаДругойСервис(ПараметрДляОтправкиНаСервер, СтруктураПодключения) Экспорт   //Сервер БД
	Если ТипЗнч(ПараметрДляОтправкиНаСервер)= тип("HTTPСервисЗапрос") Тогда
		ПараметрДляОтправкиНаСервер = ПараметрДляОтправкиНаСервер.ПолучитьТелоКакСтроку();	
	КонецЕсли;	
	
	Если СтруктураПодключения.СерверныйРежим = 2 Тогда
		Попытка
			ВСОпределение = Новый WSОпределения(СтруктураПодключения.Адрес,СтруктураПодключения.ИмяПользователя,СтруктураПодключения.Пароль,300);
			ВСервис       = ВСОпределение.Сервисы.Получить(СтруктураПодключения.URIПространстваИменСервиса,СтруктураПодключения.ИмяСервиса);
			ВТочкаВхода   = ВСервис.ТочкиПодключения.Получить(СтруктураПодключения.ИмяСервиса + "Soap");
			ВОперация     = ВТочкаВхода.Интерфейс.Операции.Получить(СтруктураПодключения.ИмяФункции);    
			
			ВСПрокси = Новый WSПрокси(ВСОпределение, СтруктураПодключения.URIПространстваИменСервиса,СтруктураПодключения.ИмяСервиса,СтруктураПодключения.ИмяСервиса + "Soap"); 
			ВСПрокси.Пользователь = СтруктураПодключения.ИмяПользователя;
			ВСПрокси.Пароль = СтруктураПодключения.Пароль;
			Ответ = "";
			
			Если СтруктураПодключения.ИмяФункции = "ПолучитьОтчет" Тогда
				Ответ = ВСПрокси.ПолучитьОтчет(Новый ХранилищеЗначения(ПараметрДляОтправкиНаСервер,Новый СжатиеДанных(9)));
			КонецЕсли;
			
			Если СтруктураПодключения.ИнформационнаяБаза = Перечисления.ит_ИнформационныеБазы.ROZNICA Тогда
				
				ИмяФункции = СтруктураПодключения.ИмяФункции;
				Если Не ЗначениеЗаполнено(ИмяФункции) Тогда
					
					Если ТипЗнч(ПараметрДляОтправкиНаСервер) = Тип("Строка") Тогда
						ПараметрДляОтправкиНаСервер = глДесериализовать(ПараметрДляОтправкиНаСервер);
					КонецЕсли;
					
					ИмяФункции = ПараметрДляОтправкиНаСервер.ИмяФункции;
					ПараметрДляОтправкиНаСервер.Parameters = СериализаторXDTO.ЗаписатьXDTO(ПараметрДляОтправкиНаСервер.Parameters); 
				КонецЕсли;				
								
				Если ИмяФункции = "GetData" Тогда
					Ответ = ВСПрокси.GetData(ПараметрДляОтправкиНаСервер.DataKey, ПараметрДляОтправкиНаСервер.Parameters);
				КонецЕсли;
				
				Если ИмяФункции = "SendData" Тогда
					Ответ = ВСПрокси.SendData(ПараметрДляОтправкиНаСервер.Data, ПараметрДляОтправкиНаСервер.DataKey, ПараметрДляОтправкиНаСервер.Parameters);
				КонецЕсли;
				
				Если ИмяФункции = "ResponseProcessing" Тогда
					Ответ = ВСПрокси.ResponseProcessing(ПараметрДляОтправкиНаСервер.DataKey, ПараметрДляОтправкиНаСервер.Parameters);
				КонецЕсли;
				
			КонецЕсли;
			
			Если СтруктураПодключения.ИнформационнаяБаза = Перечисления.ит_ИнформационныеБазы.UPR_UPP Тогда
				
				Если СтруктураПодключения.ИмяФункции = "syncdata" Тогда
					ПараметрСтруктура = глДесериализовать(ПараметрДляОтправкиНаСервер);
					Если ПараметрСтруктура.ТипСинхронизации = "ЗаполнениеПоНорме" ИЛИ ПараметрСтруктура.ТипСинхронизации = "ВыгрузкаЗаявки" Тогда
						
						ТекстЗапроса =  "ВЫБРАТЬ
						                |	ит_ТорговыеТочки.ЛинМенеджер
						                |ПОМЕСТИТЬ ВТМенеджер
						                |ИЗ
						                |	Справочник.ит_ТорговыеТочки КАК ит_ТорговыеТочки
						                |ГДЕ
						                |	ит_ТорговыеТочки.ЕРПМастерКлюч = &ЕРПМастерКлюч
						                |;
						                |
						                |////////////////////////////////////////////////////////////////////////////////
						                |ВЫБРАТЬ
						                |	ит_ТорговыеТочки.ЕРПМастерКлюч
						                |ИЗ
						                |	Справочник.ит_ТорговыеТочки КАК ит_ТорговыеТочки
						                |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТМенеджер КАК ВТМенеджер
						                |		ПО ит_ТорговыеТочки.ЛинМенеджер = ВТМенеджер.ЛинМенеджер
						                |ГДЕ
						                |	НЕ ит_ТорговыеТочки.Архив
						                |	И ит_ТорговыеТочки.ДатаОткрытия <= &НачалоДня
						                |	И НЕ ит_ТорговыеТочки.ДатаОткрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
						                |	И (ит_ТорговыеТочки.ДатаЗакрытия > &НачалоДня
						                |			ИЛИ ит_ТорговыеТочки.ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
						                |	И НЕ ит_ТорговыеТочки.ПометкаУдаления";
						Запрос = Новый Запрос(ТекстЗапроса);
						Запрос.УстановитьПараметр("ЕРПМастерКлюч", ПараметрСтруктура.ТТЕРПМастерКлюч);
						Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДата()));
						МассивТТ = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("ЕРПМастерКлюч");
						
						ВыручкаТТ = 1;
						
						НачалоНеделиРасчетаВыручки = НачалоНедели(ПараметрСтруктура.НачалоНедели)-(24*21*3600); 
						СтруктураПолученияВыручкиТочки = Новый Структура("ТипЗапроса, НачалоПериода, КонецПериода, ЕРПМастерКлюч", "ит_ВыручкаПоТТ", НачалоНеделиРасчетаВыручки, КонецНедели(НачалоНеделиРасчетаВыручки), МассивТТ);					
						ОтветРозницы = ПеренаправлениеНаДругойСервис(
							//rarus+AleksT 21.09.2020 для Мясницкий ряд
							//Сериализовать(СтруктураПолученияВыручкиТочки), НастройкиПодключенияWSHS(Справочники.ИнформационныеБазы1С.РозницаHS, "sync"));
							глСериализовать(СтруктураПолученияВыручкиТочки), НастройкиПодключенияWSHS(Справочники.ИнформационныеБазы1С.РозницаHS, "sync"));
						СтруктураОтветаРозницы = глДесериализовать(ОтветРозницы.ПолучитьТелоКакСтроку());
						Если СтруктураОтветаРозницы.Свойство("ТЗ") Тогда
							Для Каждого СтрокаТЗ Из СтруктураОтветаРозницы.ТЗ Цикл
								ВыручкаТТ = ВыручкаТТ + СтрокаТЗ.СданоИтог;
							КонецЦикла;
						КонецЕсли;
										
						ПараметрСтруктура.Вставить("Выручка", ВыручкаТТ);
						ПараметрДляОтправкиНаСервер = глСериализовать(ПараметрСтруктура);
						
					КонецЕсли;
					Ответ = ВСПрокси.syncdata(Новый ХранилищеЗначения(ПараметрДляОтправкиНаСервер,Новый СжатиеДанных(9)));
				КонецЕсли; 
				
			КонецЕсли;
			
			Если СтруктураПодключения.ИнформационнаяБаза = Перечисления.ит_ИнформационныеБазы.ERP_Prodact Тогда 
				
				Если СтруктураПодключения.ИмяФункции = "GetSalePrices" Тогда
					Ответ = ВСПрокси.GetSalePrices(Новый ХранилищеЗначения(ПараметрДляОтправкиНаСервер,Новый СжатиеДанных(9)));
				КонецЕсли;
				
				Если СтруктураПодключения.ИмяФункции = "UploadOrders" Тогда
					Ответ = ВСПрокси.UploadOrders(ПараметрДляОтправкиНаСервер.КлючФункции, ПараметрДляОтправкиНаСервер.Данные);
				КонецЕсли;
				
				Если СтруктураПодключения.ИмяФункции = "GetNomenclature" Тогда
					Ответ = ВСПрокси.GetNomenclature(ПараметрДляОтправкиНаСервер.ВидЗаявки, ПараметрДляОтправкиНаСервер.Исключения);
				КонецЕсли;
				
				Если СтруктураПодключения.ИмяФункции = "GetTable" Тогда
					Ответ = ВСПрокси.GetTable(ПараметрДляОтправкиНаСервер.Дата, ПараметрДляОтправкиНаСервер.ТорговаяТочка);
				КонецЕсли;
				
				Если СтруктураПодключения.ИмяФункции = "GetReport" Тогда
					Ответ = ВСПрокси.GetReport(Новый ХранилищеЗначения(ПараметрДляОтправкиНаСервер,Новый СжатиеДанных(9)));
				КонецЕсли;
				
			КонецЕсли;
			
		Исключение
			ЗаписьЖурналаРегистрации("Ошибка получения данных " + СтруктураПодключения.ИнформационнаяБаза + " " + СтруктураПодключения.ИмяФункции, УровеньЖурналаРегистрации.Ошибка,,,ОписаниеОшибки()); 
			ВызватьИсключение "Недоступна центральная база. Повторите запрос через 10-15 минут.";
		КонецПопытки;
		
		Если Ответ <> "" Тогда
			Возврат Ответ;
		КонецЕсли; 
		
	КонецЕсли; 
	

	Если СтруктураПодключения.СерверныйРежим = 3 Тогда
		HS = Новый HTTPСоединение(
		СтруктураПодключения.Адрес,,СтруктураПодключения.ИмяПользователя,СтруктураПодключения.Пароль,,
		0, // таймаут в секундах
		);
		Попытка
			HSЗапрос = Новый HTTPЗапрос;
			HSЗапрос.АдресРесурса= "/hs/" + СтруктураПодключения.ИмяСервиса + "/" + СтруктураПодключения.ИмяФункции;
			HSЗапрос.УстановитьТелоИзСтроки(ПараметрДляОтправкиНаСервер);
			Ответ = hs.ОтправитьДляОбработки(HSЗапрос);
			HS = Неопределено;
		Исключение
			Сообщить(ИнформацияОбОшибке().Описание, СтатусСообщения.Важное);
		КонецПопытки;
		Возврат Ответ;	
	КонецЕсли; 
	
КонецФункции

Процедура ит_Документы_ОбработкаПроведения(Источник, Отказ, РежимПроведения) Экспорт
	Если ТипЗнч(Источник) = Тип("ДокументОбъект.ПоступлениеТоваров") Тогда
		ОбработкаПроведения_ПоступлениеТоваров(Источник, Отказ, РежимПроведения);
	ИначеЕсли ТипЗнч(Источник) = Тип("ДокументОбъект.ЗаказПоставщику") Тогда
		ОбработкаПроведения_ЗаказПоставщику(Источник, Отказ, РежимПроведения);
	КонецЕсли;	
КонецПроцедуры


Процедура ОбработкаПроведения_ПоступлениеТоваров(Источник, Отказ, РежимПроведения)

	Если ПравоПользователя("ПоступлениеТоваровОтключитьКонтрольЕГАИС") ТОгда
		Возврат;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	""Ошибка: для товара "" + ПоступлениеТоваровТовары.Номенклатура.Наименование + "" не задано соответствие ЕГАИС!"" КАК Ошибка
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	               |		ПО ПоступлениеТоваровТовары.Ссылка = ПоступлениеТоваров.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеНоменклатурыЕГАИС КАК СоответствиеНоменклатурыЕГАИС
	               |		ПО ПоступлениеТоваровТовары.Номенклатура = СоответствиеНоменклатурыЕГАИС.Номенклатура
	               |ГДЕ
	               |	НЕ ПоступлениеТоваровТовары.Номенклатура.КодГАК = ЗНАЧЕНИЕ(Справочник.КодыГак.ПустаяСсылка)
	               |	И СоответствиеНоменклатурыЕГАИС.АлкогольнаяПродукция ЕСТЬ NULL
	               |	И ПоступлениеТоваров.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	""Ошибка: в перечне товаров присутствует алкогольная продукция, необходимо выбрать ТТН ЕГАИС""
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	               |		ПО ПоступлениеТоваровТовары.Ссылка = ПоступлениеТоваров.Ссылка
	               |ГДЕ
	               |	НЕ ПоступлениеТоваровТовары.Номенклатура.КодГАК = ЗНАЧЕНИЕ(Справочник.КодыГак.ПустаяСсылка)
	               |	И ПоступлениеТоваров.ТоварноТранспортнаяНакладнаяЕГАИС = ЗНАЧЕНИЕ(Документ.ТоварноТранспортнаяНакладнаяЕГАИС.ПустаяСсылка)
	               |	И ПоступлениеТоваров.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	""Ошибка: для алкогольной продукции - "" + ПоступлениеТоваровТовары.Номенклатура.Наименование + "" не задан производитель!""
	               |ИЗ
	               |	Документ.ПоступлениеТоваров.Товары КАК ПоступлениеТоваровТовары
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваров КАК ПоступлениеТоваров
	               |		ПО ПоступлениеТоваровТовары.Ссылка = ПоступлениеТоваров.Ссылка
	               |ГДЕ
	               |	НЕ ПоступлениеТоваровТовары.Номенклатура.КодГАК = ЗНАЧЕНИЕ(Справочник.КодыГак.ПустаяСсылка)
	               |	И ПоступлениеТоваровТовары.Производитель = ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)
	               |	И ПоступлениеТоваров.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Источник.Ссылка);
	
	тбЗапроса  = Запрос.Выполнить().Выгрузить();
	
	Отказ = тбЗапроса.Количество() > 0;
	
	Для каждого стртбЗапроса из тбЗапроса Цикл
		#Если Клиент тогда
			Сообщить(стртбЗапроса.Ошибка);
		#КонецЕсли  
	КонецЦикла;	
	
КонецПроцедуры	

Процедура ОбработкаПроведения_ЗаказПоставщику(Источник, Отказ, РежимПроведения)
	Если Источник.ОбменДанными.Загрузка = Истина Тогда 
		Возврат;
	КонецЕсли;	
	
	Отказ = НЕ КонтрольТоваровКонтрагентов(Источник.Ссылка);
	
КонецПроцедуры	

Функция КонтрольТоваровКонтрагентов(Документ) Экспорт
	
	Если ПравоПользователя("ЗаказПоставщикуОтключитьКонтрольТоваровКонтрагентов") ТОгда
		Возврат Истина;
	КонецЕсли;	
	
	тбТовары = Неопределено;
	Поставщик = Неопределено;
	Если ТипЗнч(Документ) = Тип("ДокументСсылка.ЗаказПоставщику") Тогда
		спТовары = Документ.Товары.ВыгрузитьКолонку("Номенклатура");
		Поставщик = Документ.Контрагент;
		Если Поставщик.ит_КонтрольТоваровКонтрагентов Тогда
			Возврат ПроверитьТоварыКонтрагентов(Документ.Дата, Поставщик, спТовары);
		КонецЕсли;
	КонецЕсли;		
	
	Возврат Истина;	
КонецФункции

Функция ПроверитьТоварыКонтрагентов(НаДату, Контрагент, спНоменклатура)
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	спрНоменклатура.Ссылка КАК Номенклатура
	|ИЗ
	|	Справочник.Номенклатура КАК спрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_ТоварыКонтрагентов.СрезПоследних(&НаДату, Контрагент = &Контрагент) КАК ит_ТоварыКонтрагентовСрезПоследних
	|		ПО спрНоменклатура.Ссылка = ит_ТоварыКонтрагентовСрезПоследних.Номенклатура
	|		И ит_ТоварыКонтрагентовСрезПоследних.ВМатрице
	|ГДЕ
	|	спрНоменклатура.Ссылка В (&спНоменклатура)
	|	И ит_ТоварыКонтрагентовСрезПоследних.Номенклатура is null");
	
	
	Запрос.УстановитьПараметр("спНоменклатура",спНоменклатура);
	Запрос.УстановитьПараметр("НаДату",НаДату);
	Запрос.УстановитьПараметр("Контрагент",Контрагент);
	
	тбРезультат = Запрос.Выполнить().Выгрузить();
	
	#Если Клиент тогда
		Для каждого стртбРезультат Из тбРезультат Цикл
			Сообщить("Контроль товаров в матрице для контрагента - " + Контрагент + " ( Товар - " + стртбРезультат.Номенклатура + "  отсутствует в матрице!)", СтатусСообщения.Важное); 
		КонецЦикла; 
	#КонецЕсли
	Возврат тбРезультат.Количество() = 0;	  
КонецФункции	           	

#Область АвтоматическоеФормированиеЗаказовГП //Цепелев  +++ 2019-05-17              \

Процедура АвтоматическоеФормированиеЗаказовГП() Экспорт
		
	Если Не Справочники.ИТ_НастройкиДописанногоФункционала.ВключитьАвтоматическоеФормированиеЗаказовГП.Значение Тогда		
		Возврат;        		
	КонецЕсли;
	
	ДатаЗаявки = КонецДня(ТекущаяДата()) + 1; 
	СтруктураЗаявки = Новый Структура("ДатаЗаявки, ВидПродукции", ДатаЗаявки, Перечисления.рздВидыЗаказовЕРП.ЗаказНаГотовуюПродукцию);
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ит_ТорговыеТочки.Ссылка КАК ТорговаяТочка,
		               |	ит_ТорговыеТочкиГрафикПодачиЗаявокГП.ОкончаниеРаботы КАК ОкончаниеПодачиГП,
		               |	ит_ТорговыеТочки.ит_ШаблоныАвтоматическихЗаявок КАК ШаблонАвтоматическихЗаявок
		               |ПОМЕСТИТЬ ВТТорговыеТочки
		               |ИЗ
		               |	Справочник.ПодразделенияКомпании.ит_ГрафикПодачиЗаявокГП КАК ит_ТорговыеТочкиГрафикПодачиЗаявокГП
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК ит_ТорговыеТочки
		               |		ПО ит_ТорговыеТочкиГрафикПодачиЗаявокГП.Ссылка = ит_ТорговыеТочки.Ссылка
		               |			И (ит_ТорговыеТочкиГрафикПодачиЗаявокГП.ДеньНедели.Порядок = &ПорядокДняНедели)
		               |ГДЕ
		               |	НЕ ит_ТорговыеТочки.ит_Архив
		               |	И ит_ТорговыеТочки.ит_ДатаОткрытия <= &НачалоДня
		               |	И НЕ ит_ТорговыеТочки.ит_ДатаОткрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |	И (ит_ТорговыеТочки.ит_ДатаЗакрытия > &НачалоДня
		               |			ИЛИ ит_ТорговыеТочки.ит_ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
		               |	И НЕ ит_ТорговыеТочки.ПометкаУдаления
		               |	И НЕ ит_ТорговыеТочки.ит_Закрыта = ИСТИНА
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ТорговаяТочка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ЗаказПоставщику.ПодразделениеКомпании КАК ТорговаяТочка
		               |ПОМЕСТИТЬ ТТСЗаявкамиГП
		               |ИЗ
		               |	Документ.ЗаказПоставщику КАК ЗаказПоставщику
		               |ГДЕ
		               |	ЗаказПоставщику.Дата МЕЖДУ &НачалоДня И &КонецДня
		               |	И ЗаказПоставщику.Проведен
		               |	И ЗаказПоставщику.Контрагент = &Контрагент
		               |	И ЗаказПоставщику.ит_ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.рздВидыЗаказовЕРП.ЗаказНаГотовуюПродукцию)
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	ОтказОтЗаявки.ТТ
		               |ИЗ
		               |	Документ.ОтказОтЗаявки КАК ОтказОтЗаявки
		               |ГДЕ
		               |	ОтказОтЗаявки.Дата МЕЖДУ &НачалоДня И &КонецДня
		               |	И ОтказОтЗаявки.Проведен
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ТорговаяТочка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТТорговыеТочки.ТорговаяТочка КАК ТорговаяТочка,
		               |	ВТТорговыеТочки.ШаблонАвтоматическихЗаявок КАК ШаблонАвтоматическихЗаявок
		               |ПОМЕСТИТЬ ВТТочкиКАвтоЗаказу
		               |ИЗ
		               |	ВТТорговыеТочки КАК ВТТорговыеТочки
		               |		ЛЕВОЕ СОЕДИНЕНИЕ ТТСЗаявкамиГП КАК ТТСЗаявкамиГП
		               |		ПО ВТТорговыеТочки.ТорговаяТочка = ТТСЗаявкамиГП.ТорговаяТочка
		               |ГДЕ
		               |	ТТСЗаявкамиГП.ТорговаяТочка ЕСТЬ NULL
		               |	И ВТТорговыеТочки.ОкончаниеПодачиГП < &ТекущееВремя
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ПодразделениеНазначения КАК ТорговаяТочка,
		               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_ОсновнойПоставщикАвтозаказа,
		               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_ОсновнойПоставщикДоговорАвтозаказа,
		               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_ГрузополучательАвтозаказа,
		               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_СкладКомпанииАвтозаказа,
		               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_ОрганизацияАвтозаказа,
		               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_ВидыЗаказовЕРП
		               |ПОМЕСТИТЬ ВТ_ДополнительныеПараметрыАвтозаказа
		               |ИЗ
		               |	РегистрСведений.ит_ДополнительныеПараметрыАвтозаказа.СрезПоследних(
		               |			&КонецДня,
		               |			ПодразделениеНазначения В
		               |				(ВЫБРАТЬ
		               |					ВТТочкиКАвтоЗаказу.ТорговаяТочка
		               |				ИЗ
		               |					ВТТочкиКАвтоЗаказу КАК ВТТочкиКАвтоЗаказу)) КАК ит_ДополнительныеПараметрыАвтозаказаСрезПоследних
		               |
		               |ИНДЕКСИРОВАТЬ ПО
		               |	ТорговаяТочка
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТТочкиКАвтоЗаказу.ТорговаяТочка,
		               |	итШаблоныАвтоматическихЗаявокТовары.Номенклатура,
		               |	итШаблоныАвтоматическихЗаявокТовары.Количество,
		               |	ВЫБОР
		               |		КОГДА итШаблоныАвтоматическихЗаявокТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент = 0
		               |			ТОГДА 1
		               |		ИНАЧЕ итШаблоныАвтоматическихЗаявокТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Коэффициент
		               |	КОНЕЦ КАК Коэффициент,
		               |	итШаблоныАвтоматическихЗаявокТовары.Количество * итШаблоныАвтоматическихЗаявокТовары.Номенклатура.ОсновнаяЕдиницаИзмерения.Вес КАК ИтогКГ,
		               |	ВТ_ДополнительныеПараметрыАвтозаказа.ит_ОсновнойПоставщикАвтозаказа КАК ОсновнойПоставщикАвтозаказа,
		               |	ВТ_ДополнительныеПараметрыАвтозаказа.ит_ОсновнойПоставщикДоговорАвтозаказа КАК ОсновнойПоставщикДоговорАвтозаказа,
		               |	ВТ_ДополнительныеПараметрыАвтозаказа.ит_ГрузополучательАвтозаказа КАК ГрузополучательАвтозаказа,
		               |	ВТ_ДополнительныеПараметрыАвтозаказа.ит_СкладКомпанииАвтозаказа КАК СкладКомпанииАвтозаказа,
		               |	ВТ_ДополнительныеПараметрыАвтозаказа.ит_ОрганизацияАвтозаказа КАК ОрганизацияАвтозаказа,
		               |	ВТ_ДополнительныеПараметрыАвтозаказа.ит_ВидыЗаказовЕРП КАК ВидыЗаказовЕРП
		               |ПОМЕСТИТЬ ВТНоменклатура
		               |ИЗ
		               |	ВТТочкиКАвтоЗаказу КАК ВТТочкиКАвтоЗаказу
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ит_ШаблоныАвтоматическихЗаявок.Товары КАК итШаблоныАвтоматическихЗаявокТовары
		               |		ПО ВТТочкиКАвтоЗаказу.ШаблонАвтоматическихЗаявок = итШаблоныАвтоматическихЗаявокТовары.Ссылка
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДополнительныеПараметрыАвтозаказа КАК ВТ_ДополнительныеПараметрыАвтозаказа
		               |		ПО ВТТочкиКАвтоЗаказу.ТорговаяТочка = ВТ_ДополнительныеПараметрыАвтозаказа.ТорговаяТочка
		               |ГДЕ
		               |	НЕ итШаблоныАвтоматическихЗаявокТовары.Номенклатура.ПометкаУдаления
		               |	И итШаблоныАвтоматическихЗаявокТовары.Номенклатура.ит_НеИспользовать = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТНоменклатура.ТорговаяТочка КАК ТорговаяТочка,
		               |	ВТНоменклатура.ОсновнойПоставщикАвтозаказа КАК ОсновнойПоставщикАвтозаказа,
		               |	ВТНоменклатура.ОсновнойПоставщикДоговорАвтозаказа КАК ОсновнойПоставщикДоговорАвтозаказа,
		               |	ВТНоменклатура.ГрузополучательАвтозаказа КАК ГрузополучательАвтозаказа,
		               |	ВТНоменклатура.СкладКомпанииАвтозаказа КАК СкладКомпанииАвтозаказа,
		               |	ВТНоменклатура.ОрганизацияАвтозаказа КАК ОрганизацияАвтозаказа,
		               |	ВТНоменклатура.ВидыЗаказовЕРП КАК ВидыЗаказовЕРП,
		               |	ВТНоменклатура.Номенклатура,
		               |	ВТНоменклатура.Количество,
		               |	ВТНоменклатура.Коэффициент,
		               |	ВТНоменклатура.ИтогКГ КАК КоличествоКГ,
		               |	ВТНоменклатура.ИтогКГ
		               |ИЗ
		               |	ВТНоменклатура КАК ВТНоменклатура
		               |ИТОГИ
		               |	СУММА(КоличествоКГ)
		               |ПО
		               |	ТорговаяТочка";
			 
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ПорядокДняНедели", ДеньНедели(ТекущаяДата())-1);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ТекущееВремя", Дата(1,1,1) + (ТекущаяДата() - НачалоДня(ТекущаяДата())));
	Запрос.УстановитьПараметр("Контрагент",Справочники.Контрагенты.НайтиПоРеквизиту("ЕРПМастерКлюч","00000019376"));
	ВыборкаТТ = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаТТ.Следующий() Цикл
		
		ЗаявкаПокупателя = Документы.ЗаказПоставщику.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ЗаявкаПокупателя, СтруктураЗаявки);
		 
		ЗаявкаПокупателя.Дата = ТекущаяДата();
		
		СтруктураАвтозаказа = РегистрыСведений.ит_ДополнительныеПараметрыАвтозаказа.ПолучитьСтруктуруАвтозаказаПоПодразделению(ВыборкаТТ.ТорговаяТочка);
		ЗаявкаПокупателя.ПодразделениеКомпании	= ВыборкаТТ.ТорговаяТочка;
		ЗаявкаПокупателя.Контрагент 			= СтруктураАвтозаказа.ОсновнойПоставщикАвтозаказа;
		ЗаявкаПокупателя.ДоговорВзаиморасчетов 	= СтруктураАвтозаказа.ОсновнойПоставщикДоговорАвтозаказа;
		ЗаявкаПокупателя.Грузополучатель 		= СтруктураАвтозаказа.ГрузополучательАвтозаказа;
		ЗаявкаПокупателя.СкладКомпании 			= СтруктураАвтозаказа.СкладКомпанииАвтозаказа;
		ЗаявкаПокупателя.Организация 			= СтруктураАвтозаказа.ОрганизацияАвтозаказа;
		ЗаявкаПокупателя.УстановитьНовыйНомер(ЗаявкаПокупателя.Организация.Префикс);
		
		ЗаявкаПокупателя.ит_ВидЗаявки 			= СтруктураАвтозаказа.ВидыЗаказовЕРП;
		ЗаявкаПокупателя.ХозОперация 			= Справочники.ХозОперации.ЗаказПоставщику;
		ЗаявкаПокупателя.ВалютаДокумента 		= ЗаявкаПокупателя.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
		ЗаявкаПокупателя.ТипЦен 				= ЗаявкаПокупателя.ПодразделениеКомпании.ТипЦенЗакупки;
		
		ЗаявкаПокупателя.КурсДокумента 			= 1;
		ЗаявкаПокупателя.КурсВалютыУпр 			= 1;
		ЗаявкаПокупателя.РегламентированныйУчет = Истина;
		
		
		ЗаявкаПокупателя.СрокПоставки 			= ДатаЗаявки;
		ЗаявкаПокупателя.СрокПоставкиПлан 		= ДатаЗаявки;
     	ЗаявкаПокупателя.Автор 					= Справочники.Пользователи.Робот;

		ЗаявкаПокупателя.ит_Логин = "Автоматический заказ";
		
		ВыборкаНоменклатуры = ВыборкаТТ.Выбрать();
		Пока ВыборкаНоменклатуры.Следующий() Цикл

			Если ЗначениеЗаполнено(ВыборкаНоменклатуры.Количество) Тогда
				
				СтруктураРазрешения = РазрешеноЗаказыватьПозиции(ЗаявкаПокупателя.Дата,ВыборкаНоменклатуры.Номенклатура, ЗаявкаПокупателя.Контрагент);
				Если СтруктураРазрешения.Разрешено = Ложь Тогда
					Если СтруктураРазрешения.Свойство("ЗапретЗаказа") Тогда
						Продолжить;	
					КонецЕсли;						 
				КонецЕсли;
				
				СтрЗамены =	ит_ОбщегоНазначения.ЗаменаПродукции(ЗаявкаПокупателя.Дата,ВыборкаНоменклатуры.Номенклатура, ЗаявкаПокупателя.Контрагент);					
				Если СтрЗамены <> Неопределено Тогда
					Продолжить;	 
				КонецЕсли;
				
				НоваяСтрока = ЗаявкаПокупателя.Товары.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, ВыборкаНоменклатуры);
	
			КонецЕсли;
			
		КонецЦикла;
		
		ТаблицаЦен = ПолучитьТаблицуЦен(ЗаявкаПокупателя.ПодразделениеКомпании.ЕРПМастерКлюч);
		ТЗТовары = ЗаявкаПокупателя.Товары.Выгрузить();
		ДополнитьТаблицуЗаявкиДополнительнымиОтгрузками(ТЗТовары, СтруктураЗаявки, ВыборкаТТ.ТорговаяТочка,ТаблицаЦен);
		ЗаявкаПокупателя.Товары.Загрузить(ТЗТовары);
		//Цепелев  +++ 2019-05-21
		Для каждого СтрокаТовары Из ЗаявкаПокупателя.Товары Цикл
			Если НЕ ЗНачениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения) Тогда
				СтрокаТовары.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ОсновнаяЕдиницаИзмерения;
			КонецЕсли;
			Если НЕ ЗНачениеЗаполнено(СтрокаТовары.Коэффициент) И ЗначениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения) И ЗначениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения.Коэффициент) Тогда
				СтрокаТовары.Коэффициент = СтрокаТовары.ЕдиницаИзмерения.Коэффициент;
			КонецЕсли;
			ЗаявкаПокупателя.ОбработкаРеквизита("Товары.Номенклатура",СтрокаТовары);
		КонецЦикла;
		//Цепелев  --- 2019-05-21              
		Попытка
			ЗаявкаПокупателя.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			//записать в журнал регистрации почему нет автозаказа
			ЗаписьЖурналаРегистрации("Автозаказ. Автоматический заказ", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;
		
	КонецЦикла;
	
	
	
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ит_ТорговыеТочки.Ссылка КАК ТорговаяТочка
	               |ПОМЕСТИТЬ ВТТорговыеТочки
	               |ИЗ
	               |	Справочник.ПодразделенияКомпании.ит_ГрафикПодачиЗаявокГП КАК ит_ТорговыеТочкиГрафикПодачиЗаявокГП
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ПодразделенияКомпании КАК ит_ТорговыеТочки
	               |		ПО ит_ТорговыеТочкиГрафикПодачиЗаявокГП.Ссылка = ит_ТорговыеТочки.Ссылка
	               |			И (ит_ТорговыеТочкиГрафикПодачиЗаявокГП.ДеньНедели.Порядок = &ПорядокДняНедели)
	               |ГДЕ
	               |	НЕ ит_ТорговыеТочки.ит_Архив
	               |	И ит_ТорговыеТочки.ит_ДатаОткрытия <= &НачалоДня
	               |	И НЕ ит_ТорговыеТочки.ит_ДатаОткрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
	               |	И (ит_ТорговыеТочки.ит_ДатаЗакрытия > &НачалоДня
	               |			ИЛИ ит_ТорговыеТочки.ит_ДатаЗакрытия = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0))
	               |	И НЕ ит_ТорговыеТочки.ПометкаУдаления
	               |	И ит_ТорговыеТочкиГрафикПодачиЗаявокГП.ОкончаниеРаботы < &ТекущееВремя
	               |	И НЕ ит_ТорговыеТочки.ит_Закрыта = ИСТИНА
	               |
	               |ИНДЕКСИРОВАТЬ ПО
	               |	ТорговаяТочка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТорговыеТочки.ТорговаяТочка,
	               |	ит_ОзнакомительныеОтгрузкиПоТочкам.ВидНоменклатуры
	               |ПОМЕСТИТЬ ВТИсключения
	               |ИЗ
	               |	ВТТорговыеТочки КАК ВТТорговыеТочки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_ОзнакомительныеОтгрузкиПоТочкам КАК ит_ОзнакомительныеОтгрузкиПоТочкам
	               |		ПО ВТТорговыеТочки.ТорговаяТочка = ит_ОзнакомительныеОтгрузкиПоТочкам.ТорговаяТочка
	               |			И (ит_ОзнакомительныеОтгрузкиПоТочкам.Период = &ДатаЗаказа)
	               |ГДЕ
	               |	НЕ ит_ОзнакомительныеОтгрузкиПоТочкам.ТорговаяТочка ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка,
	               |	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура,
	               |	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.КоличествоПринудительнойОтгрузки
	               |ПОМЕСТИТЬ ВТОзнакомительныеОтгрузки
	               |ИЗ
	               |	РегистрСведений.ит_СтопЛистЗаказаПродукцииНаНоменклатуру.СрезПоследних(, ) КАК ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних
	               |ГДЕ
	               |	&ДатаЗаказа МЕЖДУ ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Период И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ДатаОкончания
	               |	И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ВидОперацииСтопЛистЗаказа В(&МассивВидовОперацииСтопЛистЗаказа)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура,
	               |	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.КоличествоПринудительнойОтгрузки,
	               |	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТТорговыеТочки.ТорговаяТочка,
	               |	ВТОзнакомительныеОтгрузки.Номенклатура.ит_ВидЗаявки КАК ит_ВидЗаявки
	               |ПОМЕСТИТЬ ВТТочкиКОзнакомительнойОтгрузке_ит_ВидЗаявки
	               |ИЗ
	               |	ВТТорговыеТочки КАК ВТТорговыеТочки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТОзнакомительныеОтгрузки КАК ВТОзнакомительныеОтгрузки
	               |		ПО (ВТОзнакомительныеОтгрузки.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
	               |				ИЛИ ВТОзнакомительныеОтгрузки.ТорговаяТочка = ВТТорговыеТочки.ТорговаяТочка)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТочкиКОзнакомительнойОтгрузке_ит_ВидЗаявки.ТорговаяТочка,
	               |	ВТТочкиКОзнакомительнойОтгрузке_ит_ВидЗаявки.ит_ВидЗаявки,
	               |	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа КАК ВидПродукции,
	               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_ОсновнойПоставщикАвтозаказа КАК ОсновнойПоставщикАвтозаказа,
	               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_ОсновнойПоставщикДоговорАвтозаказа КАК ОсновнойПоставщикДоговорАвтозаказа,
	               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_ГрузополучательАвтозаказа КАК ГрузополучательАвтозаказа,
	               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_СкладКомпанииАвтозаказа КАК СкладКомпанииАвтозаказа,
	               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_ОрганизацияАвтозаказа КАК ОрганизацияАвтозаказа,
	               |	ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ит_ВидыЗаказовЕРП КАК ВидыЗаказовЕРП
	               |ПОМЕСТИТЬ ВТТочкиКОзнакомительнойОтгрузке
	               |ИЗ
	               |	ВТТочкиКОзнакомительнойОтгрузке_ит_ВидЗаявки КАК ВТТочкиКОзнакомительнойОтгрузке_ит_ВидЗаявки
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
	               |		ПО ВТТочкиКОзнакомительнойОтгрузке_ит_ВидЗаявки.ит_ВидЗаявки = ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ит_ДополнительныеПараметрыАвтозаказа.СрезПоследних(&ДатаЗаказа, ) КАК ит_ДополнительныеПараметрыАвтозаказаСрезПоследних
	               |		ПО ВТТочкиКОзнакомительнойОтгрузке_ит_ВидЗаявки.ТорговаяТочка = ит_ДополнительныеПараметрыАвтозаказаСрезПоследних.ПодразделениеНазначения
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТТочкиКОзнакомительнойОтгрузке.ТорговаяТочка,
	               |	ВТТочкиКОзнакомительнойОтгрузке.ВидПродукции,
	               |	ВТТочкиКОзнакомительнойОтгрузке.ОсновнойПоставщикАвтозаказа,
	               |	ВТТочкиКОзнакомительнойОтгрузке.ОсновнойПоставщикДоговорАвтозаказа,
	               |	ВТТочкиКОзнакомительнойОтгрузке.ГрузополучательАвтозаказа,
	               |	ВТТочкиКОзнакомительнойОтгрузке.СкладКомпанииАвтозаказа,
	               |	ВТТочкиКОзнакомительнойОтгрузке.ОрганизацияАвтозаказа,
	               |	ВТТочкиКОзнакомительнойОтгрузке.ВидыЗаказовЕРП
	               |ПОМЕСТИТЬ ВТРезультат
	               |ИЗ
	               |	ВТТочкиКОзнакомительнойОтгрузке КАК ВТТочкиКОзнакомительнойОтгрузке
	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТИсключения КАК ВТИсключения
	               |		ПО ВТТочкиКОзнакомительнойОтгрузке.ТорговаяТочка = ВТИсключения.ТорговаяТочка
	               |			И ВТТочкиКОзнакомительнойОтгрузке.ВидПродукции = ВТИсключения.ВидНоменклатуры
	               |ГДЕ
	               |	ВТИсключения.ТорговаяТочка ЕСТЬ NULL
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТРезультат.ТорговаяТочка,
	               |	ВТРезультат.ВидПродукции,
	               |	ВТРезультат.ОсновнойПоставщикАвтозаказа,
	               |	ВТРезультат.ОсновнойПоставщикДоговорАвтозаказа,
	               |	ВТРезультат.ГрузополучательАвтозаказа,
	               |	ВТРезультат.СкладКомпанииАвтозаказа,
	               |	ВТРезультат.ОрганизацияАвтозаказа,
	               |	ВТРезультат.ВидыЗаказовЕРП
	               |ИЗ
	               |	ВТРезультат КАК ВТРезультат
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказПоставщику КАК ЗаявкаПокупателя
	               |		ПО ВТРезультат.ТорговаяТочка = ЗаявкаПокупателя.ПодразделениеКомпании
	               |			И (ВЫБОР
	               |				КОГДА ВТРезультат.ВидПродукции = ЗНАЧЕНИЕ(Перечисление.рздВидыЗаказовЕРП.ЗаказНаГотовуюПродукцию)
	               |						ИЛИ ВТРезультат.ВидПродукции = ЗНАЧЕНИЕ(Перечисление.рздВидыЗаказовЕРП.ЗаказНаОхлажденныеПолуфабрикаты)
	               |					ТОГДА ЗаявкаПокупателя.ит_ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.рздВидыЗаказовЕРП.ЗаказНаГотовуюПродукцию)
	               |							ИЛИ ЗаявкаПокупателя.ит_ВидЗаявки = ЗНАЧЕНИЕ(Перечисление.рздВидыЗаказовЕРП.ЗаказНаОхлажденныеПолуфабрикаты)
	               |				ИНАЧЕ ВТРезультат.ВидПродукции = ЗаявкаПокупателя.ит_ВидЗаявки
	               |			КОНЕЦ)
	               |			И (ЗаявкаПокупателя.Дата = &ДатаЗаказа)
	               |			И (ЗаявкаПокупателя.Проведен)";
				  
	Запрос = Новый Запрос(ТекстЗапроса);
	МассивВОСтопЛист = Новый массив;
	МассивВОСтопЛист.Добавить(Перечисления.ит_ВидОперацииСтопЛистЗаказа.ОзнакомительнаяОтгрузка);
	Запрос.УстановитьПараметр("МассивВидовОперацииСтопЛистЗаказа", МассивВОСтопЛист);
	Запрос.УстановитьПараметр("ПорядокДняНедели", ДеньНедели(ТекущаяДата())-1);
	Запрос.УстановитьПараметр("ДатаЗаказа", ДатаЗаявки);
	Запрос.УстановитьПараметр("НачалоДня", НачалоДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ТекущаяДата()));
	Запрос.УстановитьПараметр("ТекущееВремя", Дата(1,1,1) + (ТекущаяДата() - НачалоДня(ТекущаяДата())));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтруктураЗаявки = Новый Структура("ДатаЗаявки, ВидПродукции", ДатаЗаявки, Выборка.ВидПродукции);
		
		ЗаявкаПокупателя = Документы.ЗаказПоставщику.СоздатьДокумент();
		ЗаполнитьЗначенияСвойств(ЗаявкаПокупателя, СтруктураЗаявки);
		ЗаявкаПокупателя.Дата = ТекущаяДата();
		ЗаявкаПокупателя.ит_Логин = "Ознакомительная отгрузка";
		
		ЗаявкаПокупателя.Дата = ТекущаяДата();
		СтруктураАвтозаказа = РегистрыСведений.ит_ДополнительныеПараметрыАвтозаказа.ПолучитьСтруктуруАвтозаказаПоПодразделению(ВыборкаТТ.ТорговаяТочка);
		ЗаявкаПокупателя.ПодразделениеКомпании	= ВыборкаТТ.ТорговаяТочка;
		ЗаявкаПокупателя.Контрагент 			= СтруктураАвтозаказа.ОсновнойПоставщикАвтозаказа;
		ЗаявкаПокупателя.ДоговорВзаиморасчетов 	= СтруктураАвтозаказа.ОсновнойПоставщикДоговорАвтозаказа;
		ЗаявкаПокупателя.Грузополучатель 		= СтруктураАвтозаказа.ГрузополучательАвтозаказа;
		ЗаявкаПокупателя.СкладКомпании 			= СтруктураАвтозаказа.СкладКомпанииАвтозаказа;
		ЗаявкаПокупателя.Организация 			= СтруктураАвтозаказа.ОрганизацияАвтозаказа;
		ЗаявкаПокупателя.УстановитьНовыйНомер(ЗаявкаПокупателя.Организация.Префикс);
		
		ЗаявкаПокупателя.ит_ВидЗаявки 			= СтруктураАвтозаказа.ВидыЗаказовЕРП;
		ЗаявкаПокупателя.ХозОперация 			= Справочники.ХозОперации.ЗаказПоставщику;
		ЗаявкаПокупателя.ВалютаДокумента 		= ЗаявкаПокупателя.ДоговорВзаиморасчетов.ВалютаВзаиморасчетов;
		ЗаявкаПокупателя.ТипЦен 				= ЗаявкаПокупателя.ПодразделениеКомпании.ТипЦенЗакупки;
		
		ЗаявкаПокупателя.КурсДокумента 			= 1;
		ЗаявкаПокупателя.КурсВалютыУпр 			= 1;
		ЗаявкаПокупателя.РегламентированныйУчет = Истина;
		
		
		ЗаявкаПокупателя.СрокПоставки 			= ДатаЗаявки;
		ЗаявкаПокупателя.СрокПоставкиПлан 		= ДатаЗаявки;
     	ЗаявкаПокупателя.Автор 					= Справочники.Пользователи.Робот;

		ТаблицаЦен = ПолучитьТаблицуЦен(ЗаявкаПокупателя.МастерКлючТТ);
		ТЗТовары = ЗаявкаПокупателя.Товары.Выгрузить();
		ДополнитьТаблицуЗаявкиДополнительнымиОтгрузками(ТЗТовары, СтруктураЗаявки, Выборка.ТорговаяТочка,ТаблицаЦен);
		Если ТЗТовары.Количество() = 0 Тогда
			Продолжить;
		КонецЕсли;
		ЗаявкаПокупателя.Товары.Загрузить(ТЗТовары);
		
		//Цепелев  +++ 2019-05-21
		Для каждого СтрокаТовары Из ЗаявкаПокупателя.Товары Цикл
			Если НЕ ЗНачениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения) Тогда
				СтрокаТовары.ЕдиницаИзмерения = СтрокаТовары.Номенклатура.ОсновнаяЕдиницаИзмерения;
			КонецЕсли;
			Если НЕ ЗНачениеЗаполнено(СтрокаТовары.Коэффициент) И ЗначениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения) И ЗначениеЗаполнено(СтрокаТовары.ЕдиницаИзмерения.Коэффициент) Тогда
				СтрокаТовары.Коэффициент = СтрокаТовары.ЕдиницаИзмерения.Коэффициент;
			КонецЕсли;
			ЗаявкаПокупателя.ОбработкаРеквизита("Товары.Номенклатура",СтрокаТовары);
		КонецЦикла;
		//Цепелев  --- 2019-05-21  
		ЗаявкаПокупателя.СуммаИтог = ЗаявкаПокупателя.Товары.Итог("Сумма");
		Попытка
			ЗаявкаПокупателя.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("Автозаказ. Ознакомительная отгрузка", УровеньЖурналаРегистрации.Ошибка,,, ОписаниеОшибки());
		КонецПопытки;
		МенеджерЗаписи = РегистрыСведений.ит_ОзнакомительныеОтгрузкиПоТочкам.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ТорговаяТочка = Выборка.ТорговаяТочка;
		МенеджерЗаписи.ВидНоменклатуры = Выборка.ВидПродукции;
		МенеджерЗаписи.Период = СтруктураЗаявки.ДатаЗаявки;
		МенеджерЗаписи.Записать();
		
	КонецЦикла;	
	 //Пономаренко А.Ф. 13.03.2019 ---
		
КонецПроцедуры


Функция РазрешеноЗаказыватьПозиции(ДатаЗаказа,Номенклатура,Контрагент) Экспорт
	СтрОграничения = Новый Структура;
	СтрОграничения.Вставить("Разрешено",Истина);
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка,
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура,
		|	СУММА(ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ОграничениеЗаказа) КАК ОграничениеЗаказа,
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ЗапретЗаказа
		|ПОМЕСТИТЬ ВТРезультат
		|ИЗ
		|	РегистрСведений.ит_СтопЛистЗаказаПродукцииНаНоменклатуру.СрезПоследних(, ) КАК ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних
		|ГДЕ
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура = &Номенклатура
		|	И &ДатаЗаказа МЕЖДУ ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Период И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ДатаОкончания
		|	И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ВидОперацииСтопЛистЗаказа В(&МассивВидовОперацииСтопЛистЗаказа)
		|	И (ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
		|			ИЛИ ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка = &Контрагент)
		|
		|СГРУППИРОВАТЬ ПО
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ЗапретЗаказа,
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура,
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРезультат.ТорговаяТочка,
		|	ВТРезультат.Номенклатура,
		|	ВТРезультат.ОграничениеЗаказа,
		|	ВТРезультат.ЗапретЗаказа
		|ИЗ
		|	(ВЫБРАТЬ
		|		МАКСИМУМ(ВТРезультат.ТорговаяТочка) КАК ТорговаяТочка
		|	ИЗ
		|		ВТРезультат КАК ВТРезультат) КАК ВложенныйЗапросТорговаяТочка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТРезультат КАК ВТРезультат
		|		ПО ВложенныйЗапросТорговаяТочка.ТорговаяТочка = ВТРезультат.ТорговаяТочка";
	МассивВОСтопЛист = Новый массив;
	МассивВОСтопЛист.Добавить(Перечисления.ит_ВидОперацииСтопЛистЗаказа.УстановкаЛимитаЗапретЗаказа);
	МассивВОСтопЛист.Добавить(Перечисления.ит_ВидОперацииСтопЛистЗаказа.ПустаяСсылка());
	Запрос.УстановитьПараметр("МассивВидовОперацииСтопЛистЗаказа", МассивВОСтопЛист);
	Запрос.УстановитьПараметр("ДатаЗаказа", ДатаЗаказа);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	 	СтрОграничения.Вставить("Разрешено",Истина);
	КонецЕсли; 
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтрОграничения.Вставить("Разрешено",Ложь);
		Если ВыборкаДетальныеЗаписи.ЗапретЗаказа Тогда
			СтрОграничения.Вставить("ЗапретЗаказа",Истина);
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОграничениеЗаказа) Тогда
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	СУММА(ЕСТЬNULL(ЗаявкаПокупателяТовары.Количество, 0)) КАК Количество,
			|	ЗаявкаПокупателяТовары.Номенклатура
			|ИЗ
			|	Документ.ЗаказПоставщику.Товары КАК ЗаявкаПокупателяТовары
			|ГДЕ
			|	ЗаявкаПокупателяТовары.Ссылка.Проведен
			|	И ЗаявкаПокупателяТовары.Ссылка.Дата МЕЖДУ &НачалоПериод И &КонецПериода
			|	И ЗаявкаПокупателяТовары.Номенклатура = &Номенклатура
			|	И ЗаявкаПокупателяТовары.Ссылка.Контрагент = &Контрагент
			|
			|СГРУППИРОВАТЬ ПО
			|	ЗаявкаПокупателяТовары.Номенклатура";
			Запрос.УстановитьПараметр("КонецПериода", КонецДня(ДатаЗаказа));
			Запрос.УстановитьПараметр("НачалоПериод", ДатаЗаказа);
			Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
			Запрос.УстановитьПараметр("Контрагент", Контрагент);
			РезультатЗапроса = Запрос.Выполнить();
			ТЗДанные = РезультатЗапроса.Выгрузить();
			
			КолВоПоЗаявкам = ТЗДанные.Итог("Количество");
			
			ОграничениеЗаказа = ВыборкаДетальныеЗаписи.ОграничениеЗаказа - КолВоПоЗаявкам;
			
			СтрОграничения.Вставить("ОграничениеЗаказа",?(ОграничениеЗаказа>0,ОграничениеЗаказа,0));
		КонецЕсли;
	
	КонецЦикла; 
	
	возврат СтрОграничения;
	
КонецФункции // ()

Функция ЗаменаПродукции(ДатаЗаказа,Номенклатура, Контрагент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура,
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Коэфициент,
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.НоменклатураЗамены,
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка
		|ПОМЕСТИТЬ ВТРезультат
		|ИЗ
		|	РегистрСведений.ит_СтопЛистЗаказаПродукцииНаНоменклатуру.СрезПоследних(, ) КАК ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних
		|ГДЕ
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура = &Номенклатура
		|	И &ДатаЗаказа МЕЖДУ ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Период И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ДатаОкончания
		|	И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ВидОперацииСтопЛистЗаказа В(&МассивВидовОперацииСтопЛистЗаказа)
		|	И (ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
		|			ИЛИ ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка = &Контрагент)
		|
		|СГРУППИРОВАТЬ ПО
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура,
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Коэфициент,
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.НоменклатураЗамены,
		|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТРезультат.Номенклатура,
		|	ВТРезультат.Коэфициент,
		|	ВТРезультат.НоменклатураЗамены,
		|	ВТРезультат.ТорговаяТочка
		|ИЗ
		|	ВТРезультат КАК ВТРезультат
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			МАКСИМУМ(ВТРезультат.ТорговаяТочка) КАК ТорговаяТочка
		|		ИЗ
		|			ВТРезультат КАК ВТРезультат) КАК ВложенныйЗапросТорговаяТочка
		|		ПО ВТРезультат.ТорговаяТочка = ВложенныйЗапросТорговаяТочка.ТорговаяТочка";
	МассивВОСтопЛист = Новый массив;
	МассивВОСтопЛист.Добавить(Перечисления.ит_ВидОперацииСтопЛистЗаказа.ЗаменаПродукции);
	Запрос.УстановитьПараметр("МассивВидовОперацииСтопЛистЗаказа", МассивВОСтопЛист);
	Запрос.УстановитьПараметр("ДатаЗаказа", ДатаЗаказа);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Выборка = запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СтрЗамены = Новый Структура;
		СтрЗамены.Вставить("НоменклатураЗамены",Выборка.НоменклатураЗамены);
		СтрЗамены.Вставить("Коэфициент", ?(Выборка.Коэфициент=0,1,Выборка.Коэфициент));
		возврат  СтрЗамены;
	КонецЕсли; 
КонецФункции 
#КонецОбласти  //Цепелев  --- 2019-05-17  

#Область НайтиЭлементПоМастерКлючу//Цепелев  +++ 2019-05-20
Функция НайтиЭлементПоМастерКлючу(ИмяСПР,ЕРПМастерКлюч) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НеобходимыйСправочник.Ссылка
	|ИЗ
	|	&ИмяСпр КАК НеобходимыйСправочник
	|ГДЕ
	|	НеобходимыйСправочник.ЕРПМастерКлюч = &ЕРПМастерКлюч";
	
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст,"&ИмяСпр","Справочник." + ИмяСПР);
	
	Запрос.УстановитьПараметр("ЕРПМастерКлюч", ЕРПМастерКлюч);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		возврат ВыборкаДетальныеЗаписи.Ссылка;
		
	КонецЕсли;
	
КонецФункции 
#КонецОбласти  //Цепелев  --- 2019-05-20              

#Область ПолучитьТаблицуЦен //Цепелев  +++ 2019-05-17  
Функция ПолучитьТаблицуЦен(ТорговаяТочка)
	
	Результат = Новый ТаблицаЗначений;
	Результат.Колонки.Добавить("НоменклатураМастерКлюч", Новый ОписаниеТипов("Строка"));       
	Результат.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	
	Если ЗначениеЗаполнено(ТорговаяТочка) Тогда
		ПараметрыОперации = Новый Структура("Дата, ТорговаяТочка", ТекущаяДата(), ит_ОбщегоНазначения.НайтиЭлементПоМастерКлючу(Метаданные.Справочники.ПодразделенияКомпании.Имя, ТорговаяТочка).МастерКлючСГП);
		Ответ = ПеренаправлениеНаДругойСервис(ПараметрыОперации,  НастройкиПодключенияWSHS(Справочники.ит_ИнформационныеБазы1С.ERP_integ77_Prices, "GetTable"));
		
		Если ЗначениеЗаполнено(Ответ) Тогда
			Результат = глДесериализовать(Ответ.Получить());
		КонецЕсли;

	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
//Пономаренко А.Ф. 27.04.2018 ---
#КонецОбласти  //Цепелев  --- 2019-05-17 

#Область ФиксацияИзмененийВЗаявках
Процедура ФиксацияИзмененийОбъекта(Объект) Экспорт
	ЭтотОбъект = Объект;
	Ссылка = Объект.Ссылка;
	
	// Все проверки выполнены, теперь записываем данные в регистр ОповещенияПоЗадачам для дальнейшей рассылки
	// Перебор всех подписчиков
	СообщениеОбИзменении = "";
	
	Если Объект.ЭтоНовый() Тогда
		СообщениеОбИзменении = "Задание успешно создано!"; 		
	КонецЕсли;
	
	
	// Проверяем изменения
	// Реквизиты
	СообщениеОбИзмененииВрем = "";
	Для каждого Реквизит Из ЭтотОбъект.Метаданные().СтандартныеРеквизиты Цикл
		Если ЭтотОбъект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда
			СообщениеОбИзмененииВрем = СообщениеОбИзмененииВрем +  
				" - <b>[" + ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним) + "]</b> изменен с '" + Строка(Ссылка[Реквизит.Имя]) + "' на '" + Строка(ЭтотОбъект[Реквизит.Имя]) + "'" + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	// Реквизиты
	Для каждого Реквизит Из ЭтотОбъект.Метаданные().Реквизиты Цикл
		
		// Пропускаем хранилище
		Если ЭтоСистемныйРеквизит(Реквизит.Имя) Тогда
			Продолжить;
		КонецЕсли;
		
		Если ЭтотОбъект[Реквизит.Имя] <> Ссылка[Реквизит.Имя] Тогда
			СообщениеОбИзмененииВрем = СообщениеОбИзмененииВрем +  
				" - <b>[" + ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним) + "]</b> изменен с '" + Строка(Ссылка[Реквизит.Имя]) + "' на '" + Строка(ЭтотОбъект[Реквизит.Имя]) + "'" + Символы.ПС;
		КонецЕсли;
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(СообщениеОбИзмененииВрем) Тогда
		СообщениеОбИзменении = СообщениеОбИзменении + "Реквизиты:" + Символы.ПС + СообщениеОбИзмененииВрем;
	КонецЕсли;
	
	СообщениеОбИзмененииАвтору = СообщениеОбИзменении;

	// Табличные части
	Для каждого ТЧ Из ЭтотОбъект.Метаданные().ТабличныеЧасти Цикл
				
		Колонки = Новый Массив();		
		
		Для каждого Реквизит Из ЭтотОбъект.Метаданные().ТабличныеЧасти[ТЧ.Имя].Реквизиты Цикл
			Колонки.Добавить(Реквизит.Имя);
		КонецЦикла;
		
		ТЗ1 = Ссылка[ТЧ.Имя].Выгрузить();
		ТЗ2 = ЭтотОбъект[ТЧ.Имя].Выгрузить();
		
		Рез = ит_ОбщегоНазначения.СравнитьПоКлючамТЗ(ТЗ1, ТЗ2, Колонки);
		СообщениеОбИзмененииВрем = "";
		СообщениеОбИзмененииВремАвтору = "";
		Для каждого Строки Из Рез Цикл
			
			// Если ошибка в сравнение таблиц
			Попытка
				СтатусСтр = Строки.Статус;
			Исключение
				Продолжить;
			КонецПопытки;
			
			Если СтатусСтр = -1 Тогда
				// Строка удалена
				СообщениеОбИзмененииВрем = СообщениеОбИзмененииВрем +  
					" Строка N" + Строки.НомерСтроки + " удалена" + Символы.ПС;
				СообщениеОбИзмененииВремАвтору = СообщениеОбИзмененииВремАвтору +
					" Строка N" + Строки.НомерСтроки + " удалена" + Символы.ПС;
			ИначеЕсли СтатусСтр = 1 Тогда					
				// Строка добавлена
				СообщениеОбИзмененииВрем = СообщениеОбИзмененииВрем +  
					" Добавлена строка N" + Строки.НомерСтроки + " с реквизитами:" + Символы.ПС;					
				Для каждого Реквизит Из ЭтотОбъект.Метаданные().ТабличныеЧасти[ТЧ.Имя].Реквизиты Цикл
					Если ЭтоСистемныйРеквизит(Реквизит.Имя) Тогда
						Продолжить;
					КонецЕсли;
					СообщениеОбИзмененииВрем = СообщениеОбИзмененииВрем +  
						" - <b>[" + ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним) + "]</b> '" + Строка(Строки[Реквизит.Имя]) + "'" + Символы.ПС;
				КонецЦикла;
				
				Если ТЧ.Имя = "Сообщения" Тогда
					Если Строки.СкрытоеСообщение = Истина Тогда
						Продолжить;						
					КонецЕсли;
				КонецЕсли;
				
				// Строка добавлена
				СообщениеОбИзмененииВремАвтору = СообщениеОбИзмененииВремАвтору +  
					" Добавлена строка N" + Строки.НомерСтроки + " с реквизитами:" + Символы.ПС;					
				Для каждого Реквизит Из ЭтотОбъект.Метаданные().ТабличныеЧасти[ТЧ.Имя].Реквизиты Цикл
					Если ЭтоСистемныйРеквизит(Реквизит.Имя) Тогда
						Продолжить;
					КонецЕсли;
					СообщениеОбИзмененииВремАвтору = СообщениеОбИзмененииВремАвтору +  
						" - <b>[" + ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним) + "]</b> '" + Строка(Строки[Реквизит.Имя]) + "'" + Символы.ПС;
				КонецЦикла;									
				
			Иначе
				СообщениеОбИзмененииВрем2 = "";
				Для каждого Элемент Из СтатусСтр Цикл
					Если Элемент.Ключ = "НомерСтроки" Тогда
						Реквизит = ЭтотОбъект.Метаданные().ТабличныеЧасти[ТЧ.Имя].СтандартныеРеквизиты[Элемент.Ключ];
					Иначе
						Реквизит = ЭтотОбъект.Метаданные().ТабличныеЧасти[ТЧ.Имя].Реквизиты[Элемент.Ключ];
					КонецЕсли;
					
					// Изменена
					СообщениеОбИзмененииВрем2 = СообщениеОбИзмененииВрем2 + 
						" - <b>[" + ?(ПустаяСтрока(Реквизит.Синоним), Реквизит.Имя, Реквизит.Синоним) + "] изменен с '" + Строка(Элемент.Значение) + "' на '" + Строка("") + "'" + Символы.ПС;
				КонецЦикла;
				
				Если НЕ ПустаяСтрока(СообщениеОбИзмененииВрем2) Тогда
					СообщениеОбИзмененииВрем = СообщениеОбИзмененииВрем +  
						" Строка N" + Строки.НомерСтроки + " измена" + Символы.ПС +
						СообщениеОбИзмененииВрем2;
					СообщениеОбИзмененииВремАвтору = СообщениеОбИзмененииВремАвтору +  
						" Строка N" + Строки.НомерСтроки + " измена" + Символы.ПС +
						СообщениеОбИзмененииВрем2;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
				
		Если НЕ ПустаяСтрока(СообщениеОбИзмененииВрем) Тогда
			СообщениеОбИзменении = СообщениеОбИзменении + 
				"Таблица <b>[" + ?(ПустаяСтрока(ТЧ.Синоним), ТЧ.Имя, ТЧ.Синоним) + "]</b>" + Символы.ПС +
				СообщениеОбИзмененииВрем;			
		КонецЕсли;		
			
		Если НЕ ПустаяСтрока(СообщениеОбИзмененииВремАвтору) Тогда
			СообщениеОбИзмененииАвтору = СообщениеОбИзмененииАвтору + 
				"Таблица <b>[" + ?(ПустаяСтрока(ТЧ.Синоним), ТЧ.Имя, ТЧ.Синоним) + "]</b>" + Символы.ПС +
				СообщениеОбИзмененииВремАвтору;			
		КонецЕсли;		
			
	КонецЦикла;
	
	// Запись в изменения
	Если НЕ ПустаяСтрока(СообщениеОбИзменении) Тогда
		НовоеИзменение 						= Объект.ИсторияИзменений.Добавить();
		НовоеИзменение.ДатаИзменения 		= ТекущаяДата();
		НовоеИзменение.Пользователь 		= ПользователиИнформационнойБазы.ТекущийПользователь();//Пользователи.ТекущийПользователь();
		НовоеИзменение.ИзмененныеРеквизиты 	= СтрЗаменить(СообщениеОбИзменении, Символы.ПС, "<br>");
		Если СообщениеОбИзменении <> СообщениеОбИзмененииАвтору Тогда
			НовоеИзменение.ИзмененныеРеквизитыАвтору = СтрЗаменить(СообщениеОбИзмененииАвтору, Символы.ПС, "<br>");
		КонецЕсли;		
	КонецЕсли;
	
	СообщениеОбИзменении = СтрЗаменить(СообщениеОбИзменении, "<html>", "");
	СообщениеОбИзменении = СтрЗаменить(СообщениеОбИзменении, "</html>", "");
	СообщениеОбИзменении = СтрЗаменить(СообщениеОбИзменении, "<body>", "");
	СообщениеОбИзменении = СтрЗаменить(СообщениеОбИзменении, "</body>", "");
	
	//ДополнительныеСвойства.Вставить("СообщениеОбИзменении", СообщениеОбИзменении);
	
	СообщениеОбИзмененииАвтору = СтрЗаменить(СообщениеОбИзмененииАвтору, "<html>", "");
	СообщениеОбИзмененииАвтору = СтрЗаменить(СообщениеОбИзмененииАвтору, "</html>", "");
	СообщениеОбИзмененииАвтору = СтрЗаменить(СообщениеОбИзмененииАвтору, "<body>", "");
	СообщениеОбИзмененииАвтору = СтрЗаменить(СообщениеОбИзмененииАвтору, "</body>", "");
	
	//ДополнительныеСвойства.Вставить("СообщениеОбИзмененииАвтору", СообщениеОбИзмененииАвтору);
	
КонецПроцедуры
 
//Пономаренко А.Ф. 12.03.2019 +++
Процедура ДополнитьТаблицуЗаявкиДополнительнымиОтгрузками(ТаблицаТоваров, СтруктураЗаявки, Контрагент, ТаблицаЦен=Неопределено) Экспорт
	
	//Пономаренко А.Ф. 25.04.2018 +++
	УжеБылаПринудительнаяОтгрузка = Ложь;
	ТекстЗапроса = "ВЫБРАТЬ
	|	ит_ПринудительныеОтгрузкиПоТочкам.ТорговаяТочка
	|ИЗ
	|	РегистрСведений.ит_ПринудительныеОтгрузкиПоТочкам КАК ит_ПринудительныеОтгрузкиПоТочкам
	|ГДЕ
	|	ит_ПринудительныеОтгрузкиПоТочкам.Период = &ДатаЗаказа
	|	И ит_ПринудительныеОтгрузкиПоТочкам.ТорговаяТочка = &ТорговаяТочка
	|	И ит_ПринудительныеОтгрузкиПоТочкам.ВидНоменклатуры = &ВидНоменклатуры";
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ДатаЗаказа", НачалоДня(СтруктураЗаявки.ДатаЗаявки));
	Запрос.УстановитьПараметр("ТорговаяТочка", Контрагент);
	Запрос.УстановитьПараметр("ВидНоменклатуры", СтруктураЗаявки.ВидПродукции);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		УжеБылаПринудительнаяОтгрузка = Истина;
	КонецЕсли;
	//Пономаренко А.Ф. 25.04.2018 ---
	
	//Пономаренко А.Ф. 11.01.2018 +++				
	Если Не УжеБылаПринудительнаяОтгрузка Тогда
		
		ТЗНовыхПозиций = ТЗДобавленияПозицийПринудительно(СтруктураЗаявки.ДатаЗаявки, СтруктураЗаявки.ВидПродукции, Контрагент);
		
		Если ЗначениеЗаполнено(ТЗНовыхПозиций) Тогда
			
			Если Не ЗначениеЗаполнено(ТаблицаЦен) Тогда
				ТаблицаЦен = ПолучитьТаблицуЦен(Контрагент.ЕРПМастерКлюч);
			КонецЕсли;
			
			Для каждого СтрокаНовыхПозиций Из ТЗНовыхПозиций Цикл
				НовСтрока = ТаблицаТоваров.Добавить();	
				НовСтрока.Номенклатура = СтрокаНовыхПозиций.Номенклатура;
				НовСтрока.Количество = СтрокаНовыхПозиций.КоличествоПринудительнойОтгрузки;
				
				НовСтрока.Цена = НовСтрока.Номенклатура.Цена;
				НовСтрока.Коэффициент = ?(НовСтрока.Номенклатура.Коэф=0,1,НовСтрока.Номенклатура.Коэф);
				
				Если найти(нрег(НовСтрока.Номенклатура.БазоваяЕИ),"кг") >0 Тогда							
					НовСтрока.ИтогКГ = ?(НовСтрока.Номенклатура.Коэф=0,1,НовСтрока.Номенклатура.Коэф) * НовСтрока.Количество;
					НовСтрока.КоличествоКГ = НовСтрока.ИтогКГ;
					НовСтрока.Сумма = НовСтрока.Цена * НовСтрока.ИтогКГ;
				Иначе
					НовСтрока.ИтогКГ = ?(НовСтрока.номенклатура.Вес=0,1,НовСтрока.номенклатура.Вес) * НовСтрока.Количество;
					НовСтрока.КоличествоКГ = НовСтрока.ИтогКГ;
					НовСтрока.Сумма = НовСтрока.Цена * НовСтрока.Количество;
				КонецЕсли;
			КонецЦикла;
			
			МенеджерЗаписи = РегистрыСведений.ит_ПринудительныеОтгрузкиПоТочкам.СоздатьМенеджерЗаписи();
			МенеджерЗаписи.ТорговаяТочка = Контрагент;
			МенеджерЗаписи.ВидНоменклатуры = СтруктураЗаявки.ВидПродукции;
			МенеджерЗаписи.Период = СтруктураЗаявки.ДатаЗаявки;
			МенеджерЗаписи.Записать();
			
		КонецЕсли;
	КонецЕсли;
	//Пономаренко А.Ф. 11.01.2018 ---
	
	//Пономаренко А.Ф. 11.03.2019 +++			
	ВыборкаВидПродукцииНовыхПозиций = ТЗДобавленияПозицийОзнакомительно(СтруктураЗаявки.ДатаЗаявки, Контрагент);
	
	Если ЗначениеЗаполнено(ВыборкаВидПродукцииНовыхПозиций) Тогда
		
		ТЗТоварыКОзнакомлению = ТаблицаТоваров.Скопировать();
		Пока ВыборкаВидПродукцииНовыхПозиций.Следующий() Цикл
			
			//
			Если ВыборкаВидПродукцииНовыхПозиций.ВидПродукции = Перечисления.ВидПродукции.ГотоваяПродукция Тогда
				Если Контрагент.ГрафикПодачиЗаявокГП.Количество() = 0 Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли ВыборкаВидПродукцииНовыхПозиций.ВидПродукции = Перечисления.ВидПродукции.ОхлажденныеПолуфабрикаты Тогда
				Если Не Контрагент.AllowToOrderRefrigeratedSemiFinishedProducts Тогда
					Продолжить;
				КонецЕсли;
			ИначеЕсли ВыборкаВидПродукцииНовыхПозиций.ВидПродукции = Перечисления.ВидПродукции.Полуфабрикаты Тогда
				МорозильныйЛарь = РегистрыСведений.ит_ДополнительныеРеквизитыТТ.ПолучитьЗначениеДополнительногоРеквизита(Контрагент, "МорозильныйЛарь");
				Если Не МорозильныйЛарь = Истина Тогда
					Продолжить;
				КонецЕсли;								
			КонецЕсли;
			//
			
			УжеБылаОзнакомительнаяОтгрузка = Ложь;
			ТекстЗапроса = "ВЫБРАТЬ
			|	ит_ОзнакомительныеОтгрузкиПоТочкам.ТорговаяТочка
			|ИЗ
			|	РегистрСведений.ит_ОзнакомительныеОтгрузкиПоТочкам КАК ит_ОзнакомительныеОтгрузкиПоТочкам
			|ГДЕ
			|	ит_ОзнакомительныеОтгрузкиПоТочкам.Период = &ДатаЗаказа
			|	И ит_ОзнакомительныеОтгрузкиПоТочкам.ТорговаяТочка = &ТорговаяТочка
			|	И ит_ОзнакомительныеОтгрузкиПоТочкам.ВидНоменклатуры = &ВидНоменклатуры";
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("ДатаЗаказа", НачалоДня(СтруктураЗаявки.ДатаЗаявки));
			Запрос.УстановитьПараметр("ТорговаяТочка", Контрагент);
			Запрос.УстановитьПараметр("ВидНоменклатуры", СтруктураЗаявки.ВидПродукции);
			РезультатЗапроса = Запрос.Выполнить();
			Если Не РезультатЗапроса.Пустой() Тогда
				УжеБылаОзнакомительнаяОтгрузка = Истина;
			КонецЕсли;
			
			Если УжеБылаОзнакомительнаяОтгрузка Тогда
				Продолжить;
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(ТаблицаЦен) Тогда
				ТаблицаЦен = ПолучитьТаблицуЦен(Контрагент.ЕРПМастерКлюч);
			КонецЕсли;
			
			ТЗТоварыКОзнакомлению.Очистить();
			ВыборкаНоменклатураНовыхПозиций = ВыборкаВидПродукцииНовыхПозиций.Выбрать();
			Пока ВыборкаНоменклатураНовыхПозиций.Следующий() Цикл
				
				НовСтрока = ТЗТоварыКОзнакомлению.Добавить();	
				НовСтрока.Номенклатура 	= ВыборкаНоменклатураНовыхПозиций.Номенклатура;
				НовСтрока.Количество 	= ВыборкаНоменклатураНовыхПозиций.КоличествоПринудительнойОтгрузки;
				
				НовСтрока.Цена 			= НовСтрока.Номенклатура.Цена;
				НовСтрока.Коэффициент 	= ?(НовСтрока.Номенклатура.Коэф=0,1,НовСтрока.Номенклатура.Коэф);
				
				Если найти(нрег(НовСтрока.Номенклатура.БазоваяЕИ),"кг") >0 Тогда							
					НовСтрока.ИтогКГ = ?(НовСтрока.Номенклатура.Коэф=0,1,НовСтрока.Номенклатура.Коэф) * НовСтрока.Количество;
					НовСтрока.КоличествоКГ = НовСтрока.ИтогКГ;
					НовСтрока.Сумма = НовСтрока.Цена*НовСтрока.ИтогКГ;
				Иначе
					НовСтрока.ИтогКГ = ?(НовСтрока.номенклатура.Вес=0,1,НовСтрока.номенклатура.Вес) * НовСтрока.Количество;
					НовСтрока.КоличествоКГ = НовСтрока.ИтогКГ;
					НовСтрока.Сумма = НовСтрока.Цена*НовСтрока.Количество;
				КонецЕсли;
			КонецЦикла;   						
			
			Если СтруктураЗаявки.ВидПродукции = ВыборкаВидПродукцииНовыхПозиций.ВидПродукции Тогда
				
				Для Каждого СтрокаКОзнакомлению Из ТЗТоварыКОзнакомлению Цикл
					
					НовСтрока = ТаблицаТоваров.Добавить();	
					ЗаполнитьЗначенияСвойств(НовСтрока, СтрокаКОзнакомлению);
					
				КонецЦикла;
				
				МенеджерЗаписи = РегистрыСведений.ит_ОзнакомительныеОтгрузкиПоТочкам.СоздатьМенеджерЗаписи();
				МенеджерЗаписи.ТорговаяТочка = Контрагент;
				МенеджерЗаписи.ВидНоменклатуры = ВыборкаВидПродукцииНовыхПозиций.ВидПродукции;
				МенеджерЗаписи.Период = СтруктураЗаявки.ДатаЗаявки;
				МенеджерЗаписи.Записать();
										
			КонецЕсли;		
			
		КонецЦикла;
		
	КонецЕсли;				
	//Пономаренко А.Ф. 11.03.2019 ---
	
	Если ЗначениеЗаполнено(ТаблицаЦен) Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	ВЫБОР
		               |		КОГДА ВТТаблицаТоваров.НомерСтроки = 0
		               |			ТОГДА 999
		               |		ИНАЧЕ ВТТаблицаТоваров.НомерСтроки
		               |	КОНЕЦ КАК НомерСтроки,
		               |	ВТТаблицаТоваров.Номенклатура,
		               |	ВТТаблицаТоваров.Количество,
		               |	ВТТаблицаТоваров.Коэффициент,
		               |	ВТТаблицаТоваров.Цена,
		               |	ВТТаблицаТоваров.Сумма,
		               |	ВТТаблицаТоваров.ИтогКГ,
		               |	ВТТаблицаТоваров.КоличествоКГ
		               |ПОМЕСТИТЬ ВТТаблицаТоваров
		               |ИЗ
		               |	&ТаблицаТоваров КАК ВТТаблицаТоваров
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТЦены.НоменклатураМастерКлюч,
		               |	ВТЦены.Цена
		               |ПОМЕСТИТЬ ВТЦены
		               |ИЗ
		               |	&ВТЦены КАК ВТЦены
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	ВТТаблицаТоваров.Номенклатура,
		               |	ВТТаблицаТоваров.Количество,
		               |	ВТТаблицаТоваров.Коэффициент,
		               |	ВЫБОР
		               |		КОГДА ВложенныйЗапрос.БазоваяЕИ ПОДОБНО ""%кг%""
		               |			ТОГДА ВложенныйЗапрос.Цена * ВТТаблицаТоваров.ИтогКГ
		               |		ИНАЧЕ ВложенныйЗапрос.Цена * ВТТаблицаТоваров.Количество
		               |	КОНЕЦ КАК Сумма,
		               |	ВТТаблицаТоваров.ИтогКГ,
		               |	ВТТаблицаТоваров.КоличествоКГ,
		               |	ВложенныйЗапрос.Цена КАК Цена
		               |ИЗ
		               |	ВТТаблицаТоваров КАК ВТТаблицаТоваров
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		               |			Номенклатура.Ссылка КАК Ссылка,
		               |			Номенклатура.БазоваяЕИ КАК БазоваяЕИ,
		               |			ВТЦены.Цена КАК Цена
		               |		ИЗ
		               |			ВТЦены КАК ВТЦены
		               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		               |				ПО ВТЦены.НоменклатураМастерКлюч = Номенклатура.ЕРПМастерКлюч) КАК ВложенныйЗапрос
		               |		ПО ВТТаблицаТоваров.Номенклатура = ВложенныйЗапрос.Ссылка
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	ВТТаблицаТоваров.НомерСтроки";
		
		Запрос = Новый Запрос(ТекстЗапроса);
		Запрос.УстановитьПараметр("ТаблицаТоваров", ТаблицаТоваров);
		Запрос.УстановитьПараметр("ВТЦены", ТаблицаЦен);
		
		ТаблицаТоваров = Запрос.Выполнить().Выгрузить();		
		
	КонецЕсли;
	
КонецПроцедуры

Функция ТЗДобавленияПозицийПринудительно(ДатаЗаказа, ВидПродукции, Контрагент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка,
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура,
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.КоличествоПринудительнойОтгрузки
	|ПОМЕСТИТЬ ВТРезультат
	|ИЗ
	|	РегистрСведений.ит_СтопЛистЗаказаПродукцииНаНоменклатуру.СрезПоследних(, ) КАК ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних
	|ГДЕ
	|	&ДатаЗаказа МЕЖДУ ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Период И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ДатаОкончания
	|	И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ВидОперацииСтопЛистЗаказа В(&МассивВидовОперацииСтопЛистЗаказа)
	|	И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура.ит_ВидЗаявки = &ВидПродукции
	|	И (ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
	|			ИЛИ ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка = &Контрагент)
	|
	|СГРУППИРОВАТЬ ПО
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура,
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.КоличествоПринудительнойОтгрузки,
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРезультат.ТорговаяТочка,
	|	ВТРезультат.Номенклатура,
	|	СУММА(ВТРезультат.КоличествоПринудительнойОтгрузки) КАК КоличествоПринудительнойОтгрузки
	|ИЗ
	|	ВТРезультат КАК ВТРезультат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРезультат.ТорговаяТочка,
	|	ВТРезультат.Номенклатура";
	МассивВОСтопЛист = Новый массив;
	МассивВОСтопЛист.Добавить(Перечисления.ит_ВидОперацииСтопЛистЗаказа.ПринудительнаяОтгрузка);
	Запрос.УстановитьПараметр("МассивВидовОперацииСтопЛистЗаказа", МассивВОСтопЛист);
	Запрос.УстановитьПараметр("ДатаЗаказа", ДатаЗаказа);
	Запрос.УстановитьПараметр("ВидПродукции", РегистрыСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ПолучитьВидЗаказаНоменклатура_По_ВидЗаказа(ВидПродукции));
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	возврат запрос.Выполнить().Выгрузить();
КонецФункции 

Функция ТЗДобавленияПозицийОзнакомительно(ДатаЗаказа, Контрагент)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка,
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура,
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.КоличествоПринудительнойОтгрузки,
	|	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа
	|ПОМЕСТИТЬ ВТРезультат
	|ИЗ
	|	РегистрСведений.ит_СтопЛистЗаказаПродукцииНаНоменклатуру.СрезПоследних(, ) КАК ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ит_СоответствиеВидаЗаявкиВидуНоменклатуры КАК ит_СоответствиеВидаЗаявкиВидуНоменклатуры
	|		ПО ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура.ит_ВидЗаявки = ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказаНоменклатура
	|ГДЕ
	|	&ДатаЗаказа МЕЖДУ ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Период И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ДатаОкончания
	|	И ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ВидОперацииСтопЛистЗаказа В(&МассивВидовОперацииСтопЛистЗаказа)
	|	И (ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка = ЗНАЧЕНИЕ(Справочник.ПодразделенияКомпании.ПустаяСсылка)
	|			ИЛИ ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка = &Контрагент)
	|
	|СГРУППИРОВАТЬ ПО
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.Номенклатура,
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.КоличествоПринудительнойОтгрузки,
	|	ит_СтопЛистЗаказаПродукцииНаНоменклатуруСрезПоследних.ТорговаяТочка,
	|	ит_СоответствиеВидаЗаявкиВидуНоменклатуры.ВидЗаказа
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТРезультат.ТорговаяТочка,
	|	ВТРезультат.Номенклатура,
	|	СУММА(ВТРезультат.КоличествоПринудительнойОтгрузки) КАК КоличествоПринудительнойОтгрузки,
	|	ВТРезультат.Номенклатура.ит_ВидЗаявки КАК ит_ВидЗаявки,
	|	ВТРезультат.ВидЗаказа КАК ВидПродукции
	|ИЗ
	|	ВТРезультат КАК ВТРезультат
	|
	|СГРУППИРОВАТЬ ПО
	|	ВТРезультат.ТорговаяТочка,
	|	ВТРезультат.Номенклатура,
	|	ВТРезультат.Номенклатура.ит_ВидЗаявки,
	|	ВТРезультат.ВидЗаказа
	|ИТОГИ ПО
	|	ВидПродукции";
	МассивВОСтопЛист = Новый массив;
	МассивВОСтопЛист.Добавить(Перечисления.ит_ВидОперацииСтопЛистЗаказа.ОзнакомительнаяОтгрузка);
	Запрос.УстановитьПараметр("МассивВидовОперацииСтопЛистЗаказа", МассивВОСтопЛист);
	Запрос.УстановитьПараметр("ДатаЗаказа", ДатаЗаказа);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
КонецФункции

//Пономаренко А.Ф. 12.03.2019 ---
// Проверка на системный реквизит
Функция ЭтоСистемныйРеквизит(Имя)
		
	Возврат Имя = "ИдентификаторСообщения" ИЛИ Имя = "ВложенияСообщения" ИЛИ Имя = "ОписаниеХранилище" ИЛИ Имя = "ДатаКорректировки" ИЛИ Имя = "АвторКорректировки" ИЛИ Имя = "ДанныеЦенников"; 
	
КонецФункции

#КонецОбласти 

#Область  НастройкиПодключения
Функция НастройкиПодключенияWSHS(ИнформационнаяБаза,ИмяФункции)  Экспорт
	
	СтруктураПодключения = Новый Структура();
	СтруктураПодключения.Вставить("ИмяПользователя",ИнформационнаяБаза.Пользователь);
	СтруктураПодключения.Вставить("Пароль",ИнформационнаяБаза.Пароль);
	Если ИнформационнаяБаза.СерверныйРежим = 2 Тогда
		СтруктураПодключения.Вставить("URIПространстваИменСервиса",ИнформационнаяБаза.Сервис);
		СтруктураПодключения.Вставить("Адрес","" + "http://" + ИнформационнаяБаза.ИмяСервера+ "/" +ИнформационнаяБаза.ИмяБазыДанных+ "/ws/"+ИнформационнаяБаза.Сервис+ "?wsdl");
	КонецЕсли; 
	Если ИнформационнаяБаза.СерверныйРежим = 3 Тогда
		СтруктураПодключения.Вставить("Адрес","" +  ИнформационнаяБаза.ИмяСервера+ "/" +ИнформационнаяБаза.ИмяБазыДанных);
		//СтруктураПодключения.Вставить("Ресурс",ИнформационнаяБаза.Сервис);
	КонецЕсли;
	//СтруктураПодключения.Вставить("СтрокаПодключения","http://gn:80/dev_intelis_moskalev/ws/ws_CashOrder?wsdl");//ОТЛАДКА
	СтруктураПодключения.Вставить("ИмяСервиса",ИнформационнаяБаза.Сервис);
	СтруктураПодключения.Вставить("ИмяФункции",ИмяФункции);	
	СтруктураПодключения.Вставить("СерверныйРежим",ИнформационнаяБаза.СерверныйРежим);
	СтруктураПодключения.Вставить("ИнформационнаяБаза",ИнформационнаяБаза.ИнформационнаяБаза);
	
	Возврат СтруктураПодключения;
	
КонецФункции	
#КонецОбласти 

//rarus+AleksT 21.09.2020 для Мясницкий ряд
// взял из ТаможеннаяДекларацияИмпорт.ПолучитьЕдиницуИзмеренияПоБазовой() и адаптировал
Функция ПолучитьЕдиницуИзмеренияПоБазовой(Номенклатура) Экспорт
	
	ТипНоменклатуры = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Номенклатура, "ТипНоменклатуры");
	ИспользованиеЕдиницИзмерения = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипНоменклатуры, "ИспользованиеЕдиницИзмерения");
	
	Если ИспользованиеЕдиницИзмерения = 1 Тогда
		Владелец = ТипНоменклатуры;
	Иначе
		Владелец = Номенклатура;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕдиницыИзмерения.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЕдиницыИзмерения КАК ЕдиницыИзмерения
	|ГДЕ
	|	ЕдиницыИзмерения.Владелец = &Владелец
	|	И ЕдиницыИзмерения.ЕдиницаПоКлассификатору = &ЕдиницаПоКлассификатору
	|	И ЕдиницыИзмерения.Коэффициент = 1");
	
	Запрос.УстановитьПараметр("Владелец", Владелец);
	Запрос.УстановитьПараметр("ЕдиницаПоКлассификатору",Номенклатура.БазоваяЕдиницаИзмерения);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ЕдиницыИзмерения.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции