////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен с системой маркировки".
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

#Область СлужебныеПроцедурыИФункции

// Отпечаток - строка HEX
Функция ПолучитьСертификатПоОтпечатку(Отпечаток)
	
	Рез = Неопределено; // Найденный сертификат (Com-объект)
	ОбъектХранилищеСертификатов = Новый COMОбъект("CAdESCOM.Store"); // Объект описывает хранилище
	
	ОбъектХранилищеСертификатов.Open(2, "My", 0); // Открыть хранилище сертификатов личное
	Сертификаты = ОбъектХранилищеСертификатов.Certificates.Find(0, Отпечаток);
	Рез = Сертификаты.Item(1);
	
	// На сервере иногда падает
	Попытка
		ОбъектХранилищеСертификатов.Close(); // Закрыть хранилище сертификатов и освободить объект 61
	Исключение
	КонецПопытки;
	
	Возврат Рез;
	
КонецФункции

// Подпись передаваемых данных
// 
// Параметры:
//   Данные - Строка - Подписываемые данные
//   СертификатКриптографии - Сертификат электронной подписи и шифрования
//   ПарольСертификата - Пароль сертификата
//   Открепленная - Булево - Открепленная.
//
// Возвращаемое значение:
//   Строка - Текст сообщения
// 
Функция ПодписатьДанные(Данные, Отпечаток, ПарольСертификата, Открепленная = Истина) Экспорт
	
	Попытка
		ДвоичныеДанныеОтпечатка = Base64Значение(Отпечаток);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		ПредставлениеОшибки = ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке);
		Возврат Неопределено;
	КонецПопытки;
	
	ОбъектПодписи = Новый COMОбъект("CAdESCOM.CPSigner");
	ОбъектПодписи.Certificate = ПолучитьСертификатПоОтпечатку(
		ПолучитьHexСтрокуИзДвоичныхДанных(ДвоичныеДанныеОтпечатка));
	
	АтрибутыВремени = Новый COMОбъект("CAdESCOM.CPAttribute");
	АтрибутыВремени.Name = 0; // Атрибут штампа времени
	#Если Клиент Тогда
		АтрибутыВремени.Value = ТекущаяДата();
	#Иначе
		АтрибутыВремени.Value = ТекущаяДатаСеанса();
	#КонецЕсли
	ОбъектПодписи.AuthenticatedAttributes2.Add(АтрибутыВремени);
	
	Если НЕ ПарольСертификата = Неопределено Тогда
		ОбъектПодписи.KeyPin = ПарольСертификата;
	КонецЕсли;
	
	ТекстДляПодписи = СокрЛП(Данные);
	oSignedData = Новый COMОбъект("CAdESCOM.CadesSignedData");
	oSignedData.ContentEncoding = 1;
	oSignedData.Content = ТекстДляПодписи;
	
	ТипКодировки = 0;
	sSignedMessage = oSignedData.SignCades(ОбъектПодписи, 1, Открепленная, ТипКодировки);
	
	Возврат sSignedMessage;
	
КонецФункции // ПодписатьДанные()

#КонецОбласти

