// Модуль основной формы документа "Инвентаризация"
&НаКлиенте
перем ШтрихКодДляПоиска;
 
////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СЛУЖЕБНОГО ПРОГРАММНОГО ИНТЕРФЕЙСА

// Производит настройку параметров выбора элементов управления диалога в зависимости от значений реквизитов объекта.
//
&НаСервере
Процедура НастроитьПараметрыВыбораЭлементовФормы()
	
	// Вызываем общий обработчик события настройки параметров выбора
	УправлениеДиалогомДокументаСервер.НастроитьПараметрыВыбораЭлементовФормы(ЭтотОбъект);
	
КонецПроцедуры // НастроитьПараметрыВыбораЭлементовФормы()

// Производит настройку параметров отображения элементов управления диалога в зависимости от значений реквизитов
// объекта.
//
&НаСервере
Процедура УправлениеДиалогомНаСервере()
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УправлениеДиалогомНаСервере(ЭтотОбъект);
	
	Если Объект.СпособПолученияЦены = Перечисления.СпособыПолученияЗакупочнойЦены.ПоСебестоимости ИЛИ Объект.СпособПолученияЦены = Перечисления.СпособыПолученияЗакупочнойЦены.ПоПоследнемуПоступлению Тогда
		Если НЕ Элементы.Найти("ТоварыЦена") = Неопределено Тогда
			Элементы.ТоварыЦена.Заголовок = НСтр("ru = 'Цена с НДС'");
		КонецЕсли;
		
		Если НЕ Элементы.Найти("ТоварыСумма") = Неопределено Тогда
			Элементы.ТоварыСумма.Заголовок = НСтр("ru = 'Сумма с НДС'");
		КонецЕсли;
	КонецЕсли;
	
	// Произведем установку видимости колонок розничной цены
	ЗащищенныеФункцииСервер.УстановитьВидимостьКолонкиЦенаРозничная(ЭтотОбъект, Объект.СкладКомпании);
	Элементы.ТоварыСуммаРозничнаяКнижн.Видимость = Элементы.ТоварыСуммаРозничная.Видимость;
	Элементы.ТоварыСуммаРозничнаяФакт.Видимость  = Элементы.ТоварыСуммаРозничная.Видимость;
	
	// Скроем лишние для текущей хоз.операции колонки
	Комиссия = (Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровОтданныхНаКомиссию);
	Элементы.СкладКомпании         .Видимость = (НЕ Комиссия);
	Элементы.Контрагент            .Видимость = Комиссия;
	Элементы.ДоговорВзаиморасчетов .Видимость = Комиссия;
	Элементы.ТоварыДокументПередачи.Видимость = Комиссия;
	Элементы.АвтоЗакрытиеСделок.Видимость = Комиссия;
	
	// Установим видимость реквизитов "Партия" и "ГТД"
	Элементы.ТоварыПартия.Видимость = ПравоПользователя("ВыборочноеСписаниеПартий", Объект) И (НЕ Комиссия) И Документы.Инвентаризация.ПолучитьФлагПолучатьКнижноеКоличествоИзПартий();
	Элементы.ТоварыГТД   .Видимость = Элементы.ТоварыПартия.Видимость;
	
КонецПроцедуры // УправлениеДиалогомНаСервере()

// Производит настройку условного оформления формы.
//
&НаСервере
Процедура УстановитьУсловноеОформление()
 
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформление(ЭтотОбъект);
	
	УправлениеДиалогомДокументаСервер.УстановитьУсловноеОформлениеРучногоСписанияХарактеристик(ЭтотОбъект);
	
	ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
		
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСуммаФакт.Имя);
	
	ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ТоварыСуммаРозничнаяФакт.Имя);
	
	ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.Количество");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = 0;
	
	ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
	//Мальцев А.Ю. +++
	ДобавлятьОформлениеПИ = Документы.Инвентаризация.ПоДокументуЕстьПредварительныеИнвентаризации(Объект.Ссылка);
	Если (Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваров ИЛИ Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровПредварительныйИтог)И ДобавлятьОформлениеПИ Тогда
	
		//Строка получена по данным остатка
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Товары");
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоФакт");
		ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = 0;
			
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Голубой);
		
		//Отличаются данные предварительно инвентаризации
		ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
			
		ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
		ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Товары");
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоФакт");
		ОтборЭлемента.ВидСравнения  = ВидСравненияКомпоновкиДанных.Больше;
		ОтборЭлемента.ПравоеЗначение = 0;
		
		ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоФакт");
		ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.НеРавно;
		ОтборЭлемента.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Товары.итКоличествоПи");
		
		ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Лосось);
		
		//Данные предварительных инвентаризаций не соответствуют фильтрам локальных инвентаризаций
		Если Объект.итЛокальнаяИнвентаризация Тогда
			ЭлементУсловногоОформления = УсловноеОформление.Элементы.Добавить();
				
			ПолеЭлемента = ЭлементУсловногоОформления.Поля.Элементы.Добавить();
			ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных("Товары");
			
			ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.КоличествоКнижн");
			ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = 0;
			
			ОтборЭлемента = ЭлементУсловногоОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ОтборЭлемента.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("Объект.Товары.итОтборЛокальныйФильтр");
			ОтборЭлемента.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ОтборЭлемента.ПравоеЗначение = Истина;
			
			Шрифт = Новый Шрифт(,,,,,Истина,);
			ЭлементУсловногоОформления.Оформление.УстановитьЗначениеПараметра("Шрифт", Шрифт);	
			
		 КонецЕсли;
	КонецЕсли;
	//Мальцев А.Ю. --- 

КонецПроцедуры // УстановитьУсловноеОформление()

// Производит настройку блокировки элементов формы.
//
&НаСервере
Процедура БлокироватьЭлементыФормы()
	
	// Составим список элементов для блокировки
	СписокРеквизитов = Новый СписокЗначений();
	
	// Заблокируем элементы формы
	УправлениеДиалогомСервер.БлокироватьЭлементыФормы(ЭтотОбъект,СписокРеквизитов);
	
КонецПроцедуры // БлокироватьЭлементыФормы()

// Обработчик события возникающего при нажатии программно добавленной кнопки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаКомандыФормыНаСервере(ИмяКоманды, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаКомандыФормы(ЭтотОбъект, ИмяКоманды, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаКомандыФормыНаСервере()

// Обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаКомандыФормы(Команда) Экспорт
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаКомандыФормы(ЭтотОбъект, Команда, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаКомандыФормыНаСервере(Команда.Имя, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // Подключаемый_ОбработкаКомандыФормы()

// Обработчик события возникающего на клиенте при изменении программно добавленного реквизита.
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	
	// Вызываем общий обработчик выполнения действия
	УправлениеДиалогомДокументаКлиент.ПриИзмененииДополнительногоРеквизита(ЭтотОбъект, Элемент);
	
КонецПроцедуры // Подключаемый_ПриИзмененииДополнительногоРеквизита()

// Обработчик события возникающего на клиенте при открытии программно добавленного реквизита.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура Подключаемый_НачалоВыбораДополнительногоРеквизита(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
КонецПроцедуры // Подключаемый_НачалоВыбораДополнительногоРеквизита()

// Обработчик события возникающего при оповещении данной формы о прекращении работы подчиненной в контексте сервера.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаСервере
Процедура ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаРезультатаОповещенияНаСервере()

// Обработчик события возникающего при выполнении оповещения данной формы о прекращении работы подчиненной.
//
// Параметры:
//  РезультатОповещения     - Произвольный - Результат выполнения операции в подчиненной форме.
//  ДополнительныеПараметры - Произвольный - Значение, которое было указано при создании объекта описания оповещения.
//
&НаКлиенте
Процедура Подключаемый_ОбработкаРезультатаОповещения(РезультатОповещения, ДополнительныеПараметры=Неопределено) Экспорт
	
	// Вызываем общий обработчик события в контексте клиента
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаОповещения(ЭтотОбъект, РезультатОповещения, ДополнительныеПараметры) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения, ДополнительныеПараметры);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(РезультатОповещения);
	
КонецПроцедуры // Подключаемый_ОбработкаРезультатаОповещения()

// Отображает результат выполнения действия.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ОбработкаРезультатаВыполненияДействия(ПараметрыДействия)
	
	// Вызываем общий обработчик проверки необходимости выполнения пересчета табличных частей объекта.
	ОбработкаРеквизитовДокументаКлиент.ПолучитьРазрешенияДляПересчета(ЭтотОбъект, ПараметрыДействия);
	
	// Вызываем общий обработчик результата выполнения действия
	УправлениеДиалогомДокументаКлиент.ОбработкаРезультатаВыполненияДействия(ЭтотОбъект, ПараметрыДействия);
	
	//Мальцев А.Ю. +++
	УстановитьУсловноеОформление();
	
	итУстановитьВидимость();
	
	ЗаполнитьОтветственныеЛицаИнвентаризации(ПараметрыДействия);
	//Мальцев А.Ю. ---
	
КонецПроцедуры // ОбработкаРезультатаВыполненияДействия()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ КОМАНД ФОРМЫ

// Обработчик события нажатия кнопки "Подбор номенклатуры".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ПодборНоменклатуры(Команда)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомКлиент.ОткрытьПодборНоменклатуры(ЭтотОбъект,,,"КоличествоФакт");
	
КонецПроцедуры // ПодборНоменклатуры()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ШАПКИ ФОРМЫ

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДатаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ДатаПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДатаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Дата".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	//Мальцев А.Ю. +++
	Объект.Дата = КонецДня(Объект.Дата);
	//Мальцев А.Ю. ---
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДатаПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
	
КонецПроцедуры // ДатаПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ХозОперацияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ХозОперацияПриИзменении(Объект, ПараметрыДействия);
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ХозОперацияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Хоз. операция".
//
// Параметры:
//  Команда - КомандаФормы - Команда, в которой возникло данное событие.
//
&НаКлиенте
Процедура ХозОперацияПриИзменении(Команда)
	
	// Вызываем общий обработчик события выбора одного из пунктов меню доступных хоз. операций.
	УправлениеДиалогомДокументаКлиент.ОбработатьВыборХозОперации(Объект, Элементы, Команда.Имя);
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ХозОперацияПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ХозОперацияПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Склад компании" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура СкладКомпанииПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	//Мальцев А.Ю. +++
	Объект.ПодразделениеКомпании =  Объект.СкладКомпании.ПодразделениеКомпании;
	ПараметрыДокумента = ""+?(ЗначениеЗаполнено(Объект.Организация), Строка(Объект.Организация)+"; ", "") + ?(ЗначениеЗаполнено(Объект.ПодразделениеКомпании), Строка(Объект.ПодразделениеКомпании)+"; ", "") + Строка(Объект.Автор);
	//Мальцев А.Ю. ---	

	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.СкладКомпанииПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // СкладКомпанииПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Склад компании".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СкладКомпанииПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	СкладКомпанииПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // СкладКомпанииПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура КонтрагентПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.КонтрагентПриИзменении(Объект, ПараметрыДействия);
	
	// настроим параметры выбора
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // КонтрагентПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Контрагент".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	КонтрагентПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // КонтрагентПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ДоговорВзаиморасчетов" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ДоговорВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ДоговорВзаиморасчетовПриИзменении(Объект, ПараметрыДействия);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ДоговорВзаиморасчетовПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ДоговорВзаиморасчетов".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ДоговорВзаиморасчетовПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ДоговорВзаиморасчетовПриИзмененииНаСервере(ПараметрыДействия);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ДоговорВзаиморасчетовПриИзменении()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Способ получения цены".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура СпособПолученияЦеныПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим добавление параметров расширяемых контекст обработки событий объекта
	ПараметрыДействия.Вставить("ТребуетсяУстановкаЦен", Объект.Товары.Количество() > 0);
	
	// Обработаем изменения требующие ответа от пользователя
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);

КонецПроцедуры //СпособПолученияЦеныПриИзменении()


///////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ПОЛЕЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего при изменении данных реквизита "Номенклатура" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыНоменклатураПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
	// Вызываем общий обработчик изменения реквизитов формы
	УправлениеДиалогомДокументаСервер.НоменклатураПриИзменении(ЭтотОбъект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыНоменклатураПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Номенклатура".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыНоменклатураПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ТоварыНоменклатураПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТоварыНоменклатураПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Характеристика номенклатуры" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыХарактеристикаНоменклатурыПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Характеристика номенклатуры".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыХарактеристикаНоменклатурыПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ТоварыХарактеристикаНоменклатурыПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТоварыХарактеристикаНоменклатурыПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Единица измерения" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЕдиницаИзмеренияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыЕдиницаИзмеренияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Единица измерения".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЕдиницаИзмеренияПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ТоварыЕдиницаИзмеренияПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТоварыЕдиницаИзмеренияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Документ передачи" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыДокументПередачиПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыДокументПередачиПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры

// Обработчик события возникающего на клиенте при изменении данных реквизита "Документ передачи".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыДокументПередачиПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ТоварыДокументПередачиПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТоварыДокументПередачиПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Партия" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыПартияПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыПартияПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыПартияПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Партия".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПартияПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ТоварыПартияПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры // ТоварыПартияПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "ГТД" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыГТДПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыГТДПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыГТДПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ГТД".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыГТДПриИзменении(Элемент)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Обработаем событие в контексте сервера
	ТоварыГТДПриИзмененииНаСервере(ПараметрыДействия);
	
КонецПроцедуры  // ТоварыГТДПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЦенаПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыЦенаПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Цена".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЦенаПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЦенаПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Количество факт" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыКоличествоФактПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыКоличествоФактПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыКоличествоФактПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Количество факт".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыКоличествоФактПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыКоличествоФактПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыКоличествоФактПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "сумма факт" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаФактПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыСуммаФактПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаФактПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "сумма факт".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаФактПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаФактПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаФактПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Цена (розничная)" в контексте сервера.
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыЦенаРозничнаяПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыЦенаРозничнаяПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыЦенаРозничнаяПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Цена (розничная)".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыЦенаРозничнаяПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыЦенаРозничнаяПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыЦенаРозничнаяПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Сумма розничная факт" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСуммаРозничнаяФактПриИзмененииНаСервере(ПараметрыДействия = Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыСуммаРозничнаяФактПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСуммаРозничнаяФактПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Сумма розничная факт".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСуммаРозничнаяФактПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСуммаРозничнаяФактПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСуммаРозничнаяФактПриИзменении()

// Обработчик события возникающего на клиенте  в момент нажатия кнопки выбора или клавиши F4 реквизита "Партия".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПартияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка=Ложь;
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ОткрытьПодборПартий(ЭтотОбъект,Элемент);
	
КонецПроцедуры // ТоварыПартияНачалоВыбора()

// Обработчик события возникающего на клиенте при изменении данных реквизита "ГТД излишков".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыГТДИзлишковПриИзменении(Элемент)
	
	Если Элементы.Товары.ТекущиеДанные.Количество <= 0 И ЗначениеЗаполнено(Элементы.Товары.ТекущиеДанные.ГТДИзлишков) Тогда
		ВывестиСообщение(НСтр("ru='Строка № %1 . ГТД используется для излишков.'"),,,,,Элементы.Товары.ТекущиеДанные.НомерСтроки);
		Элементы.Товары.ТекущиеДанные.ГТДИзлишков = ПредопределенноеЗначение("Справочник.ГТД.ПустаяСсылка");
	КонецЕсли;
	
КонецПроцедуры //ТоварыГТДИзлишковПриИзменении()

// Обработчик события возникающего при изменении данных реквизита "Ставка НДС" в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыСтавкаНДСПриИзмененииНаСервере(ПараметрыДействия=Неопределено)
	
	// Получим данные текущей строки табличной части
	ТекущиеДанные = Объект.Товары.НайтиПоИдентификатору(Элементы.Товары.ТекущаяСтрока);
	
	// Вызываем обработчик изменения данных объекта
	Документы.Инвентаризация.ТоварыСтавкаНДСПриИзменении(Объект, ТекущиеДанные, ПараметрыДействия);
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзмененииНаСервере()

// Обработчик события возникающего на клиенте при изменении данных реквизита "Ставка НДС".
//
// Параметры:
//  Элемент - ПолеФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыСтавкаНДСПриИзменении(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыСтавкаНДСПриИзмененииНаСервере();
	
КонецПроцедуры // ТоварыСтавкаНДСПриИзменении()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ТАБЛИЦЫ ФОРМЫ "ТОВАРЫ"

// Обработчик события возникающего на клиенте перед началом интерактивного добавления строки.
//
// Параметры:
//  Элемент     - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ       - Булево       - Признак отказа от создания формы.
//  Копирование - Булево       - Определяет режим копирования.
//  Родитель    - Ссылка       - Ссылка на элемент, который будет использован при добавлении в качестве родителя.
//  Группа      - Булево       - Признак добавления группы.
//  Параметр    - Произвольный - Параметр команды, выполняемой при добавлении строки в таблицу.
//
&НаКлиенте
Процедура ТоварыПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломДобавления(ЭтотОбъект, Элемент, Отказ, Копирование, Родитель, Группа, Параметр);
	
КонецПроцедуры // ТоварыПередНачаломДобавления()

// Обработчик события возникающего на клиенте перед началом интерактивного изменения строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередНачаломИзменения(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередНачаломИзменения(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередНачаломИзменения()

// Обработчик события возникающего на клиенте перед удалением строки или группы строк.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  Отказ   - Булево       - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ТоварыПередУдалением(Элемент, Отказ)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПередУдалением(ЭтотОбъект, Элемент, Отказ);
	
КонецПроцедуры // ТоварыПередУдалением()

// Обработчик события возникающего на клиенте при выходе из режима редактирования строки.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  НоваяСтрока          - Булево       - Истина, если строка была добавлена или скопирована.
//  ОтменаРедактирования - Булево       - Истина, если произошла отмена редактирования.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаКлиенте
Процедура ТоварыПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПриОкончанииРедактирования(ЭтотОбъект, Элемент, НоваяСтрока, ОтменаРедактирования);
	
КонецПроцедуры // ТоварыПриОкончанииРедактирования()

// Обработчик события возникающего на клиенте после удаления строки в контексте сервера.
//
// Параметры:
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ТоварыПослеУдаленияНаСервере(ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ТоварыПослеУдаления(ЭтотОбъект, Элементы.Товары);
	
КонецПроцедуры // ТоварыПослеУдаленияНаСервере()

// Обработчик события возникающего на клиенте после удаления строки.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура ТоварыПослеУдаления(Элемент)
	
	// Обработаем событие в контексте сервера
	ТоварыПослеУдаленияНаСервере();
	
КонецПроцедуры // ТоварыПослеУдаления()

// Обработчик события возникающего на клиенте при движении курсора в поле приемнике данных.
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  ПараметрыПеретаскивания - ПараметрыПеретаскивания - Параметры содержат тип действия, возможные действия и значение.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//  Строка                        - Строка таблицы, над которой находится курсор.
//  Поле                          - Элемент управляемой формы, с которым связана данная колонка таблицы.
//
&НаКлиенте
Процедура ТоварыПроверкаПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаКлиент.ТоварыПроверкаПеретаскивания(ЭтотОбъект, Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле);
	
КонецПроцедуры // ТоварыПроверкаПеретаскивания()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ УПРАВЛЕНИЯ ОБЩЕГО НАЗНАЧЕНИЯ

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы   - Элемент управления, в котором возникло данное событие.
//  ДанныеВыбора         - СписокЗначений - Список возможных значений для выбора, которые будет показан.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаНачалоВыбора()

// Обработчик события возникающего на клиенте при открытии параметров документа.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПараметрыДокументаОткрытие(Элемент, СтандартнаяОбработка)
	
	// Отказываемся от стандартной обработки события
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Открываем форму расширенного редактирования параметров документа
	УправлениеДиалогомДокументаКлиент.НастроитьПараметрыДокумента(ЭтотОбъект);
	
КонецПроцедуры // ПараметрыДокументаОткрытие()

// Обработчик события возникающего на клиенте при открытии комментария.
//
// Параметры:
//  Элемент              - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//  СтандартнаяОбработка - Булево       - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.РасширенноеРедактированиеПоляКомментарий(ЭтотОбъект, Элемент, СтандартнаяОбработка);
	
КонецПроцедуры // КомментарийОткрытие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Сумма документа".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьСуммаДокументаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.ПоказатьРасширенныеИтогиОперации(ЭтотОбъект, Элемент);
	
КонецПроцедуры // НадписьСуммаДокументаНажатие()

// Обработчик события возникающего на клиенте при нажатии на надпись "Взаиморасчеты".
//
// Параметры:
//  Элемент - ТаблицаФормы - Элемент управления, в котором возникло данное событие.
//
&НаКлиенте
Процедура НадписьВзаиморасчетыНажатие(Элемент)
	
	// Вызываем общий обработчик действия
	УправлениеДиалогомДокументаКлиент.НадписьВзаиморасчетыНажатие(ЭтотОбъект);
	
КонецПроцедуры // НадписьВзаиморасчетыНажатие()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ОСНОВНЫХ СОБЫТИЙ ФОРМЫ

// Обработчик события возникающего на сервере при создании формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриСозданииНаСервере(ЭтотОбъект, Параметры, Отказ, СтандартнаяОбработка,, Объект) Тогда
		Возврат;
	КонецЕсли;
	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// +Конов
	 СтрокиИнвентаризации.Параметры.УстановитьЗначениеПараметра("ИнвентаризацияТоваров", Объект.Ссылка);
	//-Конов
	
	//Мальцев А.Ю. +++
	итУстановитьВидимость();
	
	итЗаполнитьДеревоГруппНоменклатуры();	
	
	итЗаполнитьРеквизитТЧТоварыКоличествоПи();
	
	итОбработатьЗаполнениеОтветственныхЛиц(Объект.итОтветственныйЛица);
	
	//Мальцев А.Ю  ---
	
	// Дальнейшие операции выполняются только для новых объектов
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	// + Конов
	//Объект.СпособПолученияЦены = Перечисления.СпособыПолученияЗакупочнойЦены.ПоСебестоимости;
	Объект.СпособПолученияЦены = Перечисления.СпособыПолученияЗакупочнойЦены.ПоТипуЦен;
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Дата = КонецДня(ТекущаяДата());
	КонецЕсли;	
	// - Конов
	
	Объект.итПодборАналоговВыполнен = Ложь;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();

КонецПроцедуры // ПриСозданииНаСервере()

// Обработчик события возникающего на клиенте при открытии формы, до показа окна пользователю.
//
// Параметры:
//  Отказ - Булево - Признак отказа от создания формы.
//
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриОткрытии(ЭтотОбъект, Отказ) Тогда
		Возврат;
	КонецЕсли;
		
КонецПроцедуры // ПриОткрытии()

// Обработчик события возникающего на клиенте перед закрытием формы.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ЗавершениеРаботы     - Булево - Признак закрытия формы в процессе завершения работы приложения.
//  ТекстПредупреждения  - Булево - Сообщение пользователю не завершенной работе в данном окне.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗакрытием(ЭтотОбъект, Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПередЗакрытием()

// Обработчик события возникающего на клиенте при закрытии формы.
//
// Параметры:
//  ЗавершениеРаботы - Булево - Признак закрытия формы в процессе завершения работы приложения.
//
&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПриЗакрытии(ЭтотОбъект, ЗавершениеРаботы) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПриЗакрытии()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы в контексте сервера.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия=Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаВыбораНаСервере()

// Обработчик события возникающего на клиенте при выборе объекта без привязки к элементу формы.
//
// Параметры:
//  ВыбранноеЗначение - Произвольный - Результат выбора в подчиненной форме.
//  ИсточникВыбора    - Произвольный - Форма, в которой осуществлен выбор.
//
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаВыбора(ЭтотОбъект, ВыбранноеЗначение, Объект, ЭтотОбъект.Окно, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаВыбораНаСервере(ВыбранноеЗначение, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаВыбора()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить в контексте сервера.
//
// Параметры:
//  ИмяСобытия        - Строка    - Имя, идентифицирующее событие.
//  ПараметрыДействия - Структура - Набор параметров, использующихся при выполнения операции.
//
&НаСервере
Процедура ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия = Неопределено)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Если оповещение сводится к выбору значения, то переходим в обработчик другого события.
	Если ПараметрыДействия.Свойство("ВыбранноеЗначение") Тогда
		ОбработкаВыбораНаСервере(ПараметрыДействия.ВыбранноеЗначение, ПараметрыДействия);
		Возврат;
	КонецЕсли;
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ОбработкаОповещенияНаСервере()

// Обработчик события возникающего на клиенте во всех формах при вызове метода Оповестить.
//
// Параметры:
//  ИмяСобытия - Строка       - Имя, идентифицирующее событие.
//  Параметр   - Произвольный - Параметр сообщения.
//  Источник   - Произвольный - Источник события.
//
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// Определим структуру параметров обработки текущего события
	ПараметрыДействия = Новый Структура;
	
	// Производим подготовку параметров события для обработки в контексте сервера
	Если НЕ УправлениеДиалогомДокументаКлиент.ОбработкаОповещения(ЭтотОбъект, ИмяСобытия, Параметр, Источник, ПараметрыДействия) Тогда
		Возврат;
	КонецЕсли;
	
	// Обработаем событие в контексте сервера
	ОбработкаОповещенияНаСервере(ИмяСобытия, ПараметрыДействия);
	
	// Вызываем обработчик результата выполнения
	ОбработкаРезультатаВыполненияДействия(ПараметрыДействия);
	
КонецПроцедуры // ОбработкаОповещения()

// Обработчик события возникающего на сервере при чтении данных объекта.
//
// Параметры:
//  ТекущийОбъект - ДокументОбъект - Объект, который будет прочитан.
//
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект) Тогда
		Возврат;
	КонецЕсли;
	 	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЧтенииНаСервере()

// Обработчик события возникающего на клиенте перед выполнением записи объекта из формы.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от записи.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПередЗаписью(ЭтотОбъект, Отказ ,ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
	//Мальцев А.Ю. +++
	итПроверкаЗаполнения(Отказ);
	//Мальцев А.Ю. ---
	
КонецПроцедуры //ПередЗаписью()

// Обработчик события возникающего на сервере перед записью объекта.
//
// Параметры:
//  Отказ           - Булево         - Признак отказа от создания формы.
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПередЗаписьюНаСервере(ЭтотОбъект, Отказ, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
		
	// Взведем признак необходимости выполнить сохранение настроек формы при закрытии
	СохраняемыеВНастройкахДанныеМодифицированы = ИСТИНА;
	
КонецПроцедуры // ПередЗаписьюНаСервере()

// Обработчик события возникающего на сервере после записи объекта и после завершения транзакции.
//
// Параметры:
//  ТекущийОбъект   - ДокументОбъект - Записываемый объект.
//  ПараметрыЗаписи - Структура      - Структура, содержащая параметры записи.
//
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	  	
	// Настроим блокировку элементов формы
	БлокироватьЭлементыФормы();
	
	// Обновим параметры выбора элементов формы
	НастроитьПараметрыВыбораЭлементовФормы();
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
	//Мальцев А.Ю. +++
	итЗаполнитьРеквизитТЧТоварыКоличествоПи();
	//Мальцев А.Ю  ---
	
КонецПроцедуры // ПослеЗаписиНаСервере()

// Обработчик события возникающего на клиенте после записи объекта и после завершения транзакции.
//
// Параметры:
//  ПараметрыЗаписи - Структура - Структура, содержащая параметры записи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаКлиент.ПослеЗаписи(ЭтотОбъект, ПараметрыЗаписи) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ПослеЗаписи()

// Обработчик события возникающего на сервере при необходимости проверки заполнения реквизитов при записи в форме.
//
// Параметры:
//  Отказ                - Булево - Признак отказа от создания формы.
//  ПроверяемыеРеквизиты - Массив - Массив путей к реквизитам, для которых будет выполнена проверка заполнения.
//
&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// Вызываем общий обработчик события
	Если НЕ УправлениеДиалогомДокументаСервер.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты) Тогда
		Возврат;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаПроверкиЗаполненияНаСервере()

// Обработчик события возникающего на сервере при сохранении значений реквизитов и настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраняемых реквизитов и настроек формы.
//
&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры // ПриСохраненииДанныхВНастройкахНаСервере()

// Обработчик события возникающего на сервере при восстановлении значений реквизитов из сохраненных настроек формы.
//
// Параметры:
//  Настройки - Соответствие - Значения сохраненных реквизитов и настроек формы.
//
&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	// Вызываем общий обработчик события
	УправлениеДиалогомДокументаСервер.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
	// Обновляем отображение элементов формы
	УправлениеДиалогомНаСервере();
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура ПоискВТаблицеТовары(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ПоискВТаблицеТоварыРезультатОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ПоискВТаблицеТоварыРезультатОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ШтрихКодДляПоиска = РезультатОповещения;
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ПоискПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКоду(Команда)
	// Вставить содержимое обработчика.
	ПоказатьВводСтроки(Новый ОписаниеОповещения("ДобавлениеНовыхПозицийПоШтрихКодуОповещения",ЭтотОбъект),ШтрихКодДляПоиска,"Введите штрихкод для поиска"); 
КонецПроцедуры

&НаКлиенте
Процедура ДобавлениеНовыхПозицийПоШтрихКодуОповещения(РезультатОповещения, ДополнительныеПараметры) Экспорт
	ОбработкаРезультатаОповещенияНаСервере(РезультатОповещения,"ДобавлениеНовыхПозицийПоШтрихКоду");
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьОтборВТаблицеТовары(Команда)
	Элементы.Товары.ОтборСтрок = Неопределено;
КонецПроцедуры

//Мальцев А.Ю. +++
&НаКлиенте
Процедура итПроверкаЗаполнения(Отказ)
	
	//Контроль заполнения причины отклонения, если количество факт отличается от количество пи
	ПравоРедактированияКРО 	  = Элементы.итКонтрольКРО.Доступность;
	КонтрольПричиныОтклонения = итПоДокументуЕстьПредварительныеИнвентаризации(Объект.Ссылка);
	Если ПравоРедактированияКРО = Ложь И КонтрольПричиныОтклонения И Объект.ХозОперация = ПредопределенноеЗначение("Справочник.ХозОперации.ИнвентаризацияТоваров") Тогда
		
		Для Каждого стрТовар Из Объект.Товары Цикл
			
			Если стрТовар.КоличествоФакт > 0 И
					стрТовар.КоличествоФакт <> стрТовар.итКоличествоПи И 
							ПустаяСтрока(стрТовар.итПричинаОтклонения) Тогда
				Отказ 		= Истина;
				ТекстОшибки = "Строка "+ Строка(стрТовар.НомерСтроки) + ", не заполнена причина отклонения по позиции " + Строка(стрТовар.Номенклатура); 
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
КонецПроцедуры

&НаСервереБезКонтекста
Функция итПоДокументуЕстьПредварительныеИнвентаризации(Инвентаризация)
	
	Возврат Документы.Инвентаризация.ПоДокументуЕстьПредварительныеИнвентаризации(Инвентаризация);
	
КонецФункции

&НаСервере
Процедура итЗаполнитьРеквизитТЧТоварыКоличествоПи()
	
	Если Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваров ИЛИ Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровПредварительныйИтог Тогда
		Если Не Объект.Ссылка.Пустая() Тогда
			ДанныеПи = Документы.Инвентаризация.ПолучитьДанныеПредварительныхИнвентаризацийПоОтбору(Объект.Ссылка);
			Для Каждого стрПи Из ДанныеПи Цикл		
				строкиТовары = Объект.Товары.НайтиСтроки(Новый Структура("Номенклатура", стрПи.Номенклатура));
				Для Каждого стрНайденныйТовар Из строкиТовары Цикл
					стрНайденныйТовар.итКоличествоПи = стрПи.КоличествоФакт;
					Если  стрНайденныйТовар.итКоличествоПи <> стрНайденныйТовар.КоличествоФакт Тогда
						  стрНайденныйТовар.итОтборСтрокРасхождение = Истина; 	
					КонецЕсли;

				КонецЦикла;
			КонецЦикла;
			Если Объект.итЛокальнаяИнвентаризация Тогда
				ДанныеЛи = Документы.Инвентаризация.итЗаполнитьНоменклатуруЛокальныхФильтров(Объект);
				Для Каждого стрТовар Из Объект.Товары Цикл
					строкаЛи = ДанныеЛи.Найти(стрТовар.Номенклатура, "Номенклатура");
					Если строкаЛи = НЕОПРЕДЕЛЕНО Тогда
						стрТовар.итОтборЛокальныйФильтр = Истина;
					КонецЕсли;			
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
	Иначе
		Элементы.ТоварыитКоличествоПи.Видимость = Ложь;
		Элементы.КомандаЗаполненияТоварыЗаполнитьПоДаннымПредварительнойИнвентаризации.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры // ПриЗагрузкеДанныхИзНастроекНаСервере()

&НаКлиенте
Процедура итОтборРасхождения(Команда)
	итОтборРасхожденияНаСервере();
КонецПроцедуры

&НаСервере
Процедура итОтборРасхожденияНаСервере()
	
	итОтборРасхождения = Не итОтборРасхождения;
	Если итОтборРасхождения Тогда
		Элементы.ТоварыитОтборРасхождения.ЦветТекста = WebЦвета.Красный;
		Элементы.Товары.ОтборСтрок = Новый ФиксированнаяСтруктура("итОтборСтрокРасхождение", Истина);  
	Иначе		
		Элементы.ТоварыитОтборРасхождения.ЦветТекста = WebЦвета.Черный;
		Элементы.Товары.ОтборСтрок = НЕОПРЕДЕЛЕНО;  
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура итЛокальнаяИнвентаризацияПриИзменении(Элемент)
	
	Если Объект.итЛокальнаяИнвентаризация = Ложь 
			И Объект.Товары.Количество() > 0 Тогда
		
		Режим = РежимДиалогаВопрос.ДаНет;
		Оповещение = Новый ОписаниеОповещения("итПослеЗакрытияВопроса", ЭтотОбъект, Параметры);
		ПоказатьВопрос(Оповещение, "Значения в колонке Кол-во книжн. будет очищено. Продолжить?", Режим, 0);
				
	Иначе
		итУстановитьВидимость();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура итПослеЗакрытияВопроса(Результат, Параметры) Экспорт
	
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Объект.итЛокальнаяИнвентаризация = Истина;
		Возврат;
    КонецЕсли;
	
	итОбработатьОбнулениеФактКоличестваНаСервере();

	итУстановитьВидимость();
	
	итЗаполнитьРеквизитТЧТоварыКоличествоПи();
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура итОбработатьОбнулениеФактКоличестваНаСервере()
	
	ПараметрыДействия = Новый Структура;
	ПараметрыДействия.Вставить("ЗаполнитьПоказателиСтрокиПоДаннымУчета", ЛОЖЬ);	
	
	Об = РеквизитФормыВЗначение("Объект"); 
	КоличествоСтрокТоваров = Об.Товары.Количество();
	сч = КоличествоСтрокТоваров - 1;
	Пока сч >=0 Цикл
		
		стрТовар = Об.Товары[сч];
		
		Если стрТовар.КоличествоФакт = 0 Тогда
			Об.Товары.Удалить(сч);
		Иначе		
			стрТовар.КоличествоКнижн = 0;			
			Документы.Инвентаризация.ТоварыНоменклатураПриИзменении(Об, стрТовар, ПараметрыДействия);			
		КонецЕсли;
		
		сч = сч - 1;
		
	КонецЦикла;
		
	ЗначениеВРеквизитФормы(Об, "Объект");
	
КонецПроцедуры

&НаСервере
Процедура итУстановитьВидимость()
	
	ВидимостьЛокальнойИнвентаризации = Ложь;
	
	Если Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваров И Объект.итЛокальнаяИнвентаризация Тогда
		ВидимостьЛокальнойИнвентаризации = Истина;
	КонецЕсли;		
	
	Элементы.итСтраницаФильтрЛокальнойИнвентаризации.Видимость = ВидимостьЛокальнойИнвентаризации;
	
	ПравоРедактированияКРО 			   = ПравоПользователя("РазрешитьИзменениеИнвентаризацииКонтролемКРО");
	Элементы.итКонтрольКРО.Доступность = ПравоРедактированияКРО;
	Если Объект.итКонтрольКРО И Не ПравоРедактированияКРО Тогда	
		ЭтаФорма.ТолькоПросмотр 						 = Истина;
		Элементы.ПараметрыДокумента.Доступность			 = Ложь;
		Элементы.НастроитьПараметрыДокумента.Доступность = Ложь;
	КонецЕсли;
	
	итИтоговаяИнвентаризация = Документы.Инвентаризация.ПоДокументуЕстьИтоговаяИнвентаризации(Объект.Ссылка);	
	
	ПравоРедактированияЗакрытыхИнвентаризаций = ПравоПользователя("РазрешитьИзменениеИнвентаризацииБезДоступаНаРедактирование");
	
	Если Объект.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваровПредварительныйИтог Тогда
		
		Элементы.итСтраницаПересортица.Видимость = Истина;
		Если Объект.итЗакрытДляРедактирования Тогда
			Если НЕ ПравоРедактированияЗакрытыхИнвентаризаций Тогда
				ЭтаФорма.ТолькоПросмотр = Истина;
			КонецЕсли;
			
			Элементы.итВернутьВРаботу.Видимость = Истина;
			Элементы.итСформироватьДокументПересортицы.Видимость = Ложь;
			Элементы.ДекорацияЗакрыта.Видимость = Истина;
		Иначе
			Элементы.итВернутьВРаботу.Видимость = Ложь;
			Элементы.итСформироватьДокументПересортицы.Видимость = Истина;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.итПересортицаТоваров) Тогда
			итЗаполнитьТаблицуАналоговНаСервереПоДаннымДокумента();
			итЗаполнитьТаблицуРаспределенияПоДаннымПересортицы();
		КонецЕсли;	
		
		Элементы.ГруппаЛегенда.Видимость = Истина;
		
	Иначе
		
		Элементы.итСтраницаПересортица.Видимость = Ложь;
		Элементы.ГруппаЛегенда.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура итЗаполнитьДеревоГруппНоменклатуры()
	
	Если Объект.итФильтрыЛИ.Количество() Тогда
		ПерваяСтрочка = Объект.итФильтрыЛИ[0];
		Если ТипЗнч(ПерваяСтрочка.Группа) = Тип("СправочникСсылка.ИерархияАльтернативная") Тогда
			итПереключатель = 1;
		КонецЕсли;
	КонецЕсли;
	
	ОбДерево = РеквизитФормыВЗначение("итДеревоГруппНоменалатуры", Тип("ДеревоЗначений"));
	ОбДерево.Строки.Очистить();
	
	Запрос 		 = Новый Запрос;
	Запрос.Текст = итПолучитьТекстЗапросаЗаполнениеДерева();	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	ВыборкаСИерархией = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией, "Группа");
	
	итВыбратьЭлементыВИерархии(ВыборкаСИерархией,ОбДерево);
	
	ЗначениеВРеквизитФормы(ОбДерево, "итДеревоГруппНоменалатуры");
	
КонецПроцедуры

&НаСервере
Функция итПолучитьТекстЗапросаЗаполнениеДерева()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Группа
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ЭтоГруппа = ИСТИНА
	|	И Номенклатура.ПометкаУдаления = ЛОЖЬ
	|
	|УПОРЯДОЧИТЬ ПО
	|	Группа
	|ИТОГИ ПО
	|	Группа ИЕРАРХИЯ
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	Если итПереключатель = 1 Тогда
		ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ИерархияАльтернативная.Ссылка КАК Группа
		|ИЗ
		|	Справочник.ИерархияАльтернативная КАК ИерархияАльтернативная
		|ГДЕ
		|	ИерархияАльтернативная.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	ИерархияАльтернативная.Наименование
		|ИТОГИ ПО
		|	Группа ИЕРАРХИЯ
		|АВТОУПОРЯДОЧИВАНИЕ";
	КонецЕсли;
	
	Возврат ТекстЗапроса;
	
КонецФункции

&НаСервере
Процедура итВыбратьЭлементыВИерархии(ВыборкаСИерархией,Дерево)
	
	Пока ВыборкаСИерархией.Следующий() Цикл
        Если ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоИерархии Тогда
			
			счВыбора =  ОпределитьСтатусВыбораГруппы(ВыборкаСИерархией.Группа);
			Если итТолькоВыбранные и счВыбора = 0 Тогда
				//Продолжить;
				Строка = Дерево;
			Иначе		
				Строка 			= Дерево.Строки.Добавить();
            	Строка.Группа   = ВыборкаСИерархией.Группа;
				Строка.счВыбран = счВыбора;
			КонецЕсли;
			
            итВыбратьЭлементыВИерархии (ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией,"Группа"),Строка);
			
        ИначеЕсли ВыборкаСИерархией.ТипЗаписи()=ТипЗаписиЗапроса.ИтогПоГруппировке Тогда
            //Тут на самом деле есть еще один уровень, но нам он может потребоваться, 
            //только если нужно взять данные на уровне записи
            //Если это нужно, здесь обходим один элемент, забираем из него данные
            //Выборка=ВыборкаСИерархией.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам
            //Пока ВыборкаСледующий() Цикл
            //Строка=Дерево.Строки.Добавить();
            //Строка.Группа   = ВыборкаСИерархией.Группа;
            //Строка.счВыбран = ВыборкаСИерархией.счВыбран;

            //КонецЦикла;
			Попытка
				Если Дерево.Группа = ВыборкаСИерархией.Группа Тогда
					Продолжить;
				КонецЕсли;
			Исключение
			КонецПопытки;
			
			счВыбора =  ОпределитьСтатусВыбораГруппы(ВыборкаСИерархией.Группа);
			Если итТолькоВыбранные и счВыбора = 0 Тогда
				//Продолжить
			Иначе			
				Строка			= Дерево.Строки.Добавить();
				Строка.Группа   = ВыборкаСИерархией.Группа;
				Строка.счВыбран = счВыбора;
			КонецЕсли;

        КонецЕсли;   
    КонецЦикла;
КонецПроцедуры

&НаСервере
Функция ОпределитьСтатусВыбораГруппы(Группа)
	
	статусВыбора    	= 0;	
	строкиГруппы 		= Объект.итФильтрыЛИ.НайтиСтроки(Новый Структура("Группа", Группа));
	Если строкиГруппы.Количество() Тогда
		статусВыбора 	= 2
	КонецЕсли;
	
	Возврат статусВыбора;
	
КонецФункции

&НаКлиенте
Процедура итДеревоГруппНоменалатурыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	ТекСтрока = Элементы.итДеревоГруппНоменалатуры.ТекущиеДанные;
	Если ТекСтрока.счВыбран = 0 Тогда
		Элементы.итДеревоГруппНоменалатуры.ТекущиеДанные.счВыбран = 2;
	Иначе
		Элементы.итДеревоГруппНоменалатуры.ТекущиеДанные.счВыбран = 0;
	КонецЕсли;
	
	ДобавитьУдалитьЭлементГруппы(ТекСтрока.Группа, ТекСтрока.счВыбран);
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьУдалитьЭлементГруппы(Группа, ДобавитьУдалить)
	
	строкиПоиска = Объект.итФильтрыЛИ.НайтиСтроки(Новый Структура("Группа", Группа));
	Если ДобавитьУдалить = 2 Тогда
		//Добавление
		Если строкиПоиска.Количество() = 0 Тогда
			строкаИзменения = Объект.итФильтрыЛИ.Добавить();
			строкаИзменения.Группа = Группа;
		КонецЕсли;
	Иначе
		//Удаление
		Если строкиПоиска.Количество() Тогда
			строкаИзменения = строкиПоиска[0].НомерСтроки-1;
			Объект.итФильтрыЛИ.Удалить(строкаИзменения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура итРазвернутьДерево(Команда)
	
	итСвернутьРазвернутьДерево(1, итДеревоГруппНоменалатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура итСвернутьДерево(Команда)
		
	итСвернутьРазвернутьДерево(0, итДеревоГруппНоменалатуры);
	
КонецПроцедуры

&НаКлиенте
Процедура итСвернутьРазвернутьДерево(ОтметкаСвернутьРазвернуть, Дерево)
	
	Если ОтметкаСвернутьРазвернуть = 1 Тогда	
	    ЭлементыДерева = Дерево.ПолучитьЭлементы();
		Для каждого ЭлементДерева Из ЭлементыДерева Цикл
        	Элементы.итДеревоГруппНоменалатуры.Развернуть(ЭлементДерева.ПолучитьИдентификатор());			
			итСвернутьРазвернутьДерево(ОтметкаСвернутьРазвернуть, ЭлементДерева);
		КонецЦикла;			
	Иначе
	    ЭлементыДерева = итДеревоГруппНоменалатуры.ПолучитьЭлементы();
		Для каждого ЭлементДерева Из ЭлементыДерева Цикл
	       	Элементы.итДеревоГруппНоменалатуры.Свернуть(ЭлементДерева.ПолучитьИдентификатор());			
		КонецЦикла;			
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура итПереключательПриИзменении(Элемент)
	
	Объект.итФильтрыЛИ.Очистить();
	итЗаполнитьДеревоГруппНоменклатуры();
	
КонецПроцедуры

&НаКлиенте
Процедура итВыделитьСнятВсеНаКлиенте(счетчикВыбора, Дерево)
	ЭлементыДерева = Дерево.ПолучитьЭлементы();
	Для каждого ЭлементДерева Из ЭлементыДерева Цикл
       	ЭлементДерева.счВыбран = счетчикВыбора;	
		
		ДобавитьУдалитьЭлементГруппы(ЭлементДерева.Группа, ЭлементДерева.счВыбран);

		итВыделитьСнятВсеНаКлиенте(счетчикВыбора, ЭлементДерева);
	КонецЦикла;	
КонецПроцедуры

&НаКлиенте
Процедура итВыделитьВсе(Команда)
	итВыделитьСнятВсеНаКлиенте(2, итДеревоГруппНоменалатуры);
КонецПроцедуры

&НаКлиенте
Процедура итСнятьВсе(Команда)
	итВыделитьСнятВсеНаКлиенте(0, итДеревоГруппНоменалатуры);	
КонецПроцедуры

&НаКлиенте
Процедура итТолькоВыбранные(Команда)
	
	итТолькоВыбранные = Не итТолькоВыбранные;
	Если итТолькоВыбранные Тогда
		Элементы.итКомандаТолькоВыбранные.ЦветТекста = WebЦвета.Красный;
	Иначе		
		Элементы.итКомандаТолькоВыбранные.ЦветТекста = WebЦвета.Черный;
	КонецЕсли;
	
	итЗаполнитьДеревоГруппНоменклатуры();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьОтветственныеЛицаИнвентаризации(ПараметрыДействия)
	
	Если ТипЗнч(ПараметрыДействия) = Тип("Структура") Тогда		
		Если ПараметрыДействия.Свойство("ИзмененныеРеквизиты") И ПараметрыДействия.ИзмененныеРеквизиты.Свойство("ПодразделениеКомпании") Тогда
			Об = РеквизитФормыВЗначение("Объект");
			Об.итОтветственныйЛица.Загрузить(Об.ПодразделениеКомпании.итОтветственныйЛица.Выгрузить());	
			
			итОбработатьЗаполнениеОтветственныхЛиц(Об.итОтветственныйЛица);
			
			ЗначениеВРеквизитФормы(Об, "Объект");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура итОбработатьЗаполнениеОтветственныхЛиц(итОтветственныйЛица)

	СтрокиПредседательКомиссии = итОтветственныйЛица.НайтиСтроки(Новый Структура("ВидОтветственного",Перечисления.итВидыОтветвенныхИнвентаризация.ПредседательКомиссии));
	Если СтрокиПредседательКомиссии.Количество() = 0 Тогда
		
		ОрганизацияИнвентаризации = Объект.Организация;
		ЕРПМастерКлючОООфмр = "00000000150";
		ОрганизацияФМР 		= ОрганизацияИнвентаризации.ЕРПМастерКлюч = ЕРПМастерКлючОООфмр;
		Если ОрганизацияФМР Тогда
			СотрудникРябых  = Справочники.Сотрудники.НайтиПоНаименованию("Рябых Светлана Олеговна", Истина);
			НовСтр = итОтветственныйЛица.Добавить();			
			НовСтр.Ответственный     = СотрудникРябых;
			НовСтр.ВидОтветственного = Перечисления.итВидыОтветвенныхИнвентаризация.ПредседательКомиссии;				
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры	

&НаСервере
Функция итСформироватьДокументПересортицыНаСервере()
	
	Результат = Ложь;
	
	тзАналогиРаспределения = РеквизитФормыВЗначение("ТаблицаАналогиРаспределения", Тип("ТаблицаЗначений"));
	//Если тзАналогиРаспределения.Количество() = 0 Тогда
	Если НЕ Объект.итПодборАналоговВыполнен Тогда
		ВызватьИсключение("Не выполнена процедура подбора аналогов! Документы не сформированы");
	КонецЕсли;
		
	Инвентаризация = Объект;
	
	Если ЗначениеЗаполнено(Объект.итПересортицаТоваров) Тогда
	    ОбПересорт = Объект.итПересортицаТоваров.ПолучитьОбъект();
		ОбПересорт.Товары.Очистить();
	Иначе
		ОбПересорт = Документы.ПересортицаТоваров.СоздатьДокумент();
	КонецЕсли;
	
	ОбПересорт.Дата = Инвентаризация.Дата-1;
	ОбПересорт.Организация = Инвентаризация.Организация;
	ОбПересорт.ПодразделениеКомпании = Инвентаризация.ПодразделениеКомпании;
	ОбПересорт.СкладКомпании = Инвентаризация.СкладКомпании;
	ОбПересорт.Автор = ПараметрыСеанса.ТекущийПользователь;
	ОбПересорт.ДатаСоздания = ТекущаяДата();
	ОбПересорт.ТипЦен = Инвентаризация.ТипЦен;
	ОбПересорт.ВалютаДокумента = Инвентаризация.ВалютаДокумента;
	ОбПересорт.КурсДокумента = Инвентаризация.КурсДокумента;
	Если Не ЗначениеЗаполнено(Объект.итПересортицаТоваров) Тогда
		ОбПересорт.УстановитьНовыйНомер();
	КонецЕсли;
	
	Документы.ПересортицаТоваров.ПодразделениеКомпанииПриИзменении(ОбПересорт);
	
	Для Каждого стр Из тзАналогиРаспределения Цикл
		
		НовСтр = ОбПересорт.Товары.Добавить();
		//НовСтр.Номенклатура = стр.Аналог;
		//НовСтр.Количество   = стр.КоличествоРаспределения;
		//
		//НовСтр.НоменклатураПриход = стр.Номенклатура;
		//НовСтр.КоличествоПриход   = стр.КоличествоРаспределения;
		
		НовСтр.Номенклатура = стр.Номенклатура;
		НовСтр.Количество   = стр.КоличествоРаспределения;
		//
		НовСтр.НоменклатураПриход = стр.Аналог;
		НовСтр.КоличествоПриход   = стр.КоличествоРаспределения;
		
		Документы.ПересортицаТоваров.ТоварыНоменклатураПриИзменении(ОбПересорт, НовСтр);
		Документы.ПересортицаТоваров.ТоварыКоличествоПриИзменении(ОбПересорт, НовСтр);
		Документы.ПересортицаТоваров.ТоварыНоменклатураПриходПриИзменении(ОбПересорт, НовСтр);
		Документы.ПересортицаТоваров.ТоварыКоличествоПриходПриИзменении(ОбПересорт, НовСтр);
		
		
	КонецЦикла;
	
	ОбПересорт.ДополнительныеСвойства.Вставить("ЗаписьПриФормировании", Истина);
	
	Попытка
		ОбПересорт.Записать(РежимЗаписиДокумента.Проведение);
		Результат = Истина;
	Исключение
		
		ТекстОшики = ОписаниеОшибки();
		Сообщить("Не удалось сформировать документ пересортицы товаров:" + ТекстОшики);
		//ОбПересорт.Записать();
	КонецПопытки;
	
	Об = РеквизитФормыВЗначение("Объект");
	Об.итПересортицаТоваров = ОбПересорт.Ссылка;
	ЗначениеВРеквизитФормы(Об, "Объект");
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура итСформироватьДокументПересортицы(Команда)
	
	РезультатПересортицы 	= итСформироватьДокументПересортицыНаСервере();
	РезультатИнвентаризации = итСформироватьДокументИнвентаризацииНаСервере();
	
	Если РезультатПересортицы И РезультатИнвентаризации Тогда
		
		Объект.итЗакрытДляРедактирования = Истина;
		Элементы.итВернутьВРаботу.Видимость = Истина;
		Элементы.итСформироватьДокументПересортицы.Видимость = Ложь;
		
		Элементы.ДекорацияЗакрыта.Видимость = Истина;
		ЭтаФорма.ТолькоПросмотр = Истина;
		
	ИначеЕсли РезультатПересортицы И Не РезультатИнвентаризации Тогда
		ОтменитьПроведениеПересортицы();
	КонецЕсли;
	
	Записать();
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьПроведениеПересортицы()
	
	ОбПересортица = Объект.итПересортицаТоваров.ПолучитьОбъект();
	ОбПересортица.ДополнительныеСвойства.Вставить("ЗаписьПриФормировании", Истина);	
	ОбПересортица.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
КонецПроцедуры

&НаКлиенте
Процедура итЗаполнитьТаблицуАналогов(Команда)
	Записать();
	итЗаполнитьТаблицуАналоговНаСервере();
	Объект.итПодборАналоговВыполнен = Истина; 
КонецПроцедуры

&НаСервере
Процедура итЗаполнитьТаблицуАналоговНаСервере()
	
	ПроцентКоридора = 0;
	ЗначениеУчетнойПолитики = ПолучитьЗначениеУчетнойПолитики("итПроцентКоридораСоответствияЦенАналоговНоменклатуры", Объект.Организация, ТекущаяДата(), Ложь);
	Если ЗначениеЗаполнено(ЗначениеУчетнойПолитики) Тогда
		ПроцентКоридора = ЗначениеУчетнойПолитики;
	КонецЕсли;

	ОбДок    = РеквизитФормыВЗначение("Объект");
	ОбДок.итДанныеПодбораАналогов.Очистить();
	
	ОбДерево = РеквизитФормыВЗначение("ДеревоАнализа", Тип("ДеревоЗначений"));
	ОбДерево.Строки.Очистить();
		
	тзАналогиРаспределения = РеквизитФормыВЗначение("ТаблицаАналогиРаспределения", Тип("ТаблицаЗначений"));
	тзАналогиРаспределения.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ИнвентаризацияТовары.Номенклатура КАК Номенклатура,
	|	ИнвентаризацияТовары.Номенклатура.ТипНоменклатуры КАК ТипНоменклатуры,
	|	ИнвентаризацияТовары.ЦенаРозничная КАК ЦенаРозничная,
	|	ИнвентаризацияТовары.Номенклатура.ИерархияАльтернативная КАК ИерархияАльтернативная,
	|	ИнвентаризацияТовары.ЦенаРозничная - &ПроцентКоридора * ИнвентаризацияТовары.ЦенаРозничная / 100 КАК НижняяГраницаКоридора,
	|	ИнвентаризацияТовары.ЦенаРозничная + &ПроцентКоридора * ИнвентаризацияТовары.ЦенаРозничная / 100 КАК ВерхняяГраницаКоридора,
	|	ИнвентаризацияТовары.Количество КАК Количество,
	|	ИнвентаризацияТовары.Номенклатура.ИерархияАльтернативная.итБезАналогов КАК БезАналогов
	|ПОМЕСТИТЬ втДанныеИнвентаризации
	|ИЗ
	|	Документ.Инвентаризация.Товары КАК ИнвентаризацияТовары
	|ГДЕ
	|	ИнвентаризацияТовары.Ссылка = &Инвентаризация
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДанныеИнвентаризации.Номенклатура КАК Номенклатура,
	|	втДанныеИнвентаризации.ТипНоменклатуры КАК ТипНоменклатуры,
	|	втДанныеИнвентаризации.ЦенаРозничная КАК ЦенаРозничная,
	|	втДанныеИнвентаризации.ИерархияАльтернативная КАК ИерархияАльтернативная,
	|	втДанныеИнвентаризации.НижняяГраницаКоридора КАК НижняяГраницаКоридора,
	|	втДанныеИнвентаризации.ВерхняяГраницаКоридора КАК ВерхняяГраницаКоридора,
	|	втДанныеИнвентаризации.Количество КАК Количество
	|ПОМЕСТИТЬ втНедостачи
	|ИЗ
	|	втДанныеИнвентаризации КАК втДанныеИнвентаризации
	|ГДЕ
	|	втДанныеИнвентаризации.Количество < 0
	|	И втДанныеИнвентаризации.БезАналогов = ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втНедостачи.Номенклатура КАК Номенклатура,
	|	втНедостачи.ТипНоменклатуры КАК ТипНоменклатуры,
	|	втНедостачи.ЦенаРозничная КАК ЦенаРозничная,
	|	втНедостачи.ИерархияАльтернативная КАК ИерархияАльтернативная,
	|	втНедостачи.НижняяГраницаКоридора КАК НижняяГраницаКоридора,
	|	втНедостачи.ВерхняяГраницаКоридора КАК ВерхняяГраницаКоридора,
	|	втНедостачи.Количество КАК Количество,
	|	втДанныеИнвентаризации.Номенклатура КАК НоменклатураАналог,
	|	ЕСТЬNULL(втДанныеИнвентаризации.Количество, 0) КАК КоличествоАналог,
	|	ЕСТЬNULL(втДанныеИнвентаризации.ЦенаРозничная, 0) КАК ЦенаРозничнаяАналог
	|ИЗ
	|	втНедостачи КАК втНедостачи
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДанныеИнвентаризации КАК втДанныеИнвентаризации
	|		ПО втНедостачи.ТипНоменклатуры = втДанныеИнвентаризации.ТипНоменклатуры
	|			И втНедостачи.ИерархияАльтернативная = втДанныеИнвентаризации.ИерархияАльтернативная
	|			И втНедостачи.НижняяГраницаКоридора <= втДанныеИнвентаризации.ЦенаРозничная
	|			И втНедостачи.ВерхняяГраницаКоридора >= втДанныеИнвентаризации.ЦенаРозничная
	|			И втНедостачи.Номенклатура <> втДанныеИнвентаризации.Номенклатура
	|ИТОГИ
	|	МАКСИМУМ(ТипНоменклатуры),
	|	МАКСИМУМ(ЦенаРозничная),
	|	МАКСИМУМ(ИерархияАльтернативная),
	|	МАКСИМУМ(НижняяГраницаКоридора),
	|	МАКСИМУМ(ВерхняяГраницаКоридора),
	|	МАКСИМУМ(Количество)
	|ПО
	|	Номенклатура";
	
	Запрос.УстановитьПараметр("Инвентаризация",  Объект.Ссылка);
	Запрос.УстановитьПараметр("ПроцентКоридора", ПроцентКоридора);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		// Вставить обработку выборки ВыборкаНоменклатура
		
		ВерСтрока = ОбДерево.Строки.Добавить();
		ВерСтрока.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		ВерСтрока.Иерархия = ВыборкаНоменклатура.ИерархияАльтернативная;
		ВерСтрока.ТипНоменклатуры = ВыборкаНоменклатура.ТипНоменклатуры;
		ВерСтрока.Количество = ВыборкаНоменклатура.Количество;
		ВерСтрока.Цена = ВыборкаНоменклатура.ЦенаРозничная;
		ВерСтрока.ВерхняяГраница = ВыборкаНоменклатура.ВерхняяГраницаКоридора;
		ВерСтрока.НижняяГраница  = ВыборкаНоменклатура.НижняяГраницаКоридора;
		
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
		
		нужноРаспределить = ВыборкаНоменклатура.Количество*(-1);
		колРасп = 0;
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НижСтрока = ВерСтрока.Строки.Добавить();
			НижСтрока.Номенклатура = ВыборкаДетальныеЗаписи.НоменклатураАналог;
			НижСтрока.Иерархия = ВыборкаНоменклатура.ИерархияАльтернативная;
			НижСтрока.ТипНоменклатуры = ВыборкаНоменклатура.ТипНоменклатуры;
			НижСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоАналог;
			НижСтрока.Цена = ВыборкаДетальныеЗаписи.ЦенаРозничнаяАналог;
			
			НовСтрДок = ОбДок.итДанныеПодбораАналогов.Добавить();
			НовСтрДок.Номенклатура = ВыборкаНоменклатура.Номенклатура;
			НовСтрДок.ИерархияАльтернативная = ВыборкаНоменклатура.ИерархияАльтернативная;
			НовСтрДок.ТипНоменклатуры = ВыборкаНоменклатура.ТипНоменклатуры;
			НовСтрДок.Количество = ВыборкаНоменклатура.Количество;
			НовСтрДок.Цена = ВыборкаНоменклатура.ЦенаРозничная;
			НовСтрДок.ВерхняяГраница = ВыборкаНоменклатура.ВерхняяГраницаКоридора;
			НовСтрДок.НижняяГраница  = ВыборкаНоменклатура.НижняяГраницаКоридора;
			НовСтрДок.НоменклатураАналог = ВыборкаДетальныеЗаписи.НоменклатураАналог;
			НовСтрДок.КоличествоАналог = ВыборкаДетальныеЗаписи.КоличествоАналог;
			НовСтрДок.ЦенаАналог = ВыборкаДетальныеЗаписи.ЦенаРозничнаяАналог;
						
			Если ВыборкаДетальныеЗаписи.КоличествоАналог > 0 И нужноРаспределить > 0  Тогда
				
				колМожноРаспределить = ВыборкаДетальныеЗаписи.КоличествоАналог;
				строкиАналога = тзАналогиРаспределения.НайтиСтроки(Новый Структура("Аналог", ВыборкаДетальныеЗаписи.НоменклатураАналог));
				Для Каждого стр Из строкиАналога Цикл					
					колМожноРаспределить = колМожноРаспределить - стр.КоличествоРаспределения; 
				КонецЦикла;
				
				Если колМожноРаспределить > 0 Тогда
					
					КоличествоРаспределения = 0;
					Если нужноРаспределить >= колМожноРаспределить Тогда
						КоличествоРаспределения = колМожноРаспределить;	
					Иначе
						КоличествоРаспределения = нужноРаспределить;	
					КонецЕсли;
					колРасп = колРасп + КоличествоРаспределения;
					нужноРаспределить = нужноРаспределить - КоличествоРаспределения;
					
					новСтрАналоги = тзАналогиРаспределения.Добавить();
					новСтрАналоги.Номенклатура 			  = ВыборкаНоменклатура.Номенклатура;
					новСтрАналоги.Аналог 				  = ВыборкаДетальныеЗаписи.НоменклатураАналог;
					новСтрАналоги.КоличествоРаспределения = КоличествоРаспределения;
					
					
				КонецЕсли;
				
			КонецЕсли;
						
		КонецЦикла;
					
	КонецЦикла;
	
	ЗначениеВРеквизитФормы(ОбДок, "Объект");
	ЗначениеВРеквизитФормы(ОбДерево, "ДеревоАнализа");
	ЗначениеВРеквизитФормы(тзАналогиРаспределения, "ТаблицаАналогиРаспределения");
	
	
КонецПроцедуры

&НаСервере
Процедура итЗаполнитьТаблицуАналоговНаСервереПоДаннымДокумента()
	

	ОбДерево = РеквизитФормыВЗначение("ДеревоАнализа", Тип("ДеревоЗначений"));
	ОбДерево.Строки.Очистить();
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентаризацияитДанныеПодбораАналогов.Номенклатура КАК Номенклатура,
		|	ИнвентаризацияитДанныеПодбораАналогов.ТипНоменклатуры КАК ТипНоменклатуры,
		|	ИнвентаризацияитДанныеПодбораАналогов.Количество КАК Количество,
		|	ИнвентаризацияитДанныеПодбораАналогов.Цена КАК Цена,
		|	ИнвентаризацияитДанныеПодбораАналогов.ИерархияАльтернативная КАК ИерархияАльтернативная,
		|	ИнвентаризацияитДанныеПодбораАналогов.ВерхняяГраница КАК ВерхняяГраница,
		|	ИнвентаризацияитДанныеПодбораАналогов.НижняяГраница КАК НижняяГраница,
		|	ИнвентаризацияитДанныеПодбораАналогов.НоменклатураАналог КАК НоменклатураАналог,
		|	ИнвентаризацияитДанныеПодбораАналогов.КоличествоАналог КАК КоличествоАналог,
		|	ИнвентаризацияитДанныеПодбораАналогов.ЦенаАналог КАК ЦенаАналог
		|ИЗ
		|	Документ.Инвентаризация.итДанныеПодбораАналогов КАК ИнвентаризацияитДанныеПодбораАналогов
		|ГДЕ
		|	ИнвентаризацияитДанныеПодбораАналогов.Ссылка = &Ссылка
		|ИТОГИ
		|	МАКСИМУМ(ТипНоменклатуры),
		|	МАКСИМУМ(Количество),
		|	МАКСИМУМ(Цена),
		|	МАКСИМУМ(ИерархияАльтернативная),
		|	МАКСИМУМ(ВерхняяГраница),
		|	МАКСИМУМ(НижняяГраница)
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл
		// Вставить обработку выборки ВыборкаНоменклатура
		ВерСтрока = ОбДерево.Строки.Добавить();
		ВерСтрока.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		ВерСтрока.Иерархия = ВыборкаНоменклатура.ИерархияАльтернативная;
		ВерСтрока.ТипНоменклатуры = ВыборкаНоменклатура.ТипНоменклатуры;
		ВерСтрока.Количество = ВыборкаНоменклатура.Количество;
		ВерСтрока.Цена = ВыборкаНоменклатура.Цена;
		ВерСтрока.ВерхняяГраница = ВыборкаНоменклатура.ВерхняяГраница;
		ВерСтрока.НижняяГраница  = ВыборкаНоменклатура.НижняяГраница;
	
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			НижСтрока = ВерСтрока.Строки.Добавить();
			НижСтрока.Номенклатура = ВыборкаДетальныеЗаписи.НоменклатураАналог;
			НижСтрока.Иерархия = ВыборкаНоменклатура.ИерархияАльтернативная;
			НижСтрока.ТипНоменклатуры = ВыборкаНоменклатура.ТипНоменклатуры;
			НижСтрока.Количество = ВыборкаДетальныеЗаписи.КоличествоАналог;
			НижСтрока.Цена = ВыборкаДетальныеЗаписи.ЦенаАналог;

		КонецЦикла;
	КонецЦикла;
	
	
	ЗначениеВРеквизитФормы(ОбДерево, "ДеревоАнализа");
	
	
КонецПроцедуры


&НаСервере
Процедура итЗаполнитьТаблицуРаспределенияПоДаннымПересортицы()
	
	тзАналогиРаспределения = РеквизитФормыВЗначение("ТаблицаАналогиРаспределения", Тип("ТаблицаЗначений"));
	тзАналогиРаспределения.Очистить();
	
	Для Каждого стр Из Объект.итПересортицаТоваров.Товары Цикл
		
		новСтрАналоги = тзАналогиРаспределения.Добавить();
		новСтрАналоги.Номенклатура 			  = стр.НоменклатураПриход;
		новСтрАналоги.Аналог 				  = стр.Номенклатура;
		новСтрАналоги.КоличествоРаспределения = стр.Количество;

	КонецЦикла;
	
	ЗначениеВРеквизитФормы(тзАналогиРаспределения, "ТаблицаАналогиРаспределения");
	
	
КонецПроцедуры

&НаКлиенте
Процедура итСформироватьДокументИнвентаризации(Команда)
	
	итСформироватьДокументИнвентаризацииНаСервере();
		
КонецПроцедуры

&НаСервере
Функция итСформироватьДокументИнвентаризацииНаСервере()
	
	Результат = Ложь;
	
	Инвентаризация = Объект;
	
	Если ЗначениеЗаполнено(итИтоговаяИнвентаризация) Тогда
	    ОбИнвентаризация = итИтоговаяИнвентаризация.ПолучитьОбъект();
		ОбИнвентаризация.ДополнительныеСвойства.Вставить("ЗаписьПриФормировании", Истина);	
		ОбИнвентаризация.Записать(РежимЗаписиДокумента.ОтменаПроведения);
		ОбИнвентаризация.Товары.Очистить();
	Иначе
		ОбИнвентаризация = Документы.Инвентаризация.СоздатьДокумент();
	КонецЕсли;
	
	ОбИнвентаризация.ХозОперация = Справочники.ХозОперации.ИнвентаризацияТоваров;
	ОбИнвентаризация.Дата = КонецДня(Инвентаризация.Дата);
	ОбИнвентаризация.Организация = Инвентаризация.Организация;
	ОбИнвентаризация.ПодразделениеКомпании = Инвентаризация.ПодразделениеКомпании;
	ОбИнвентаризация.СкладКомпании = Инвентаризация.СкладКомпании;
	ОбИнвентаризация.Автор = ПараметрыСеанса.ТекущийПользователь;
	ОбИнвентаризация.ДатаСоздания = ТекущаяДата();
	ОбИнвентаризация.ТипЦен = Инвентаризация.ТипЦен;
	ОбИнвентаризация.ВалютаДокумента = Инвентаризация.ВалютаДокумента;
	ОбИнвентаризация.КурсДокумента = Инвентаризация.КурсДокумента;
	ОбИнвентаризация.ДокументОснование = Инвентаризация.Ссылка;
	ОбИнвентаризация.СтатьяОприходованияОбнаруженныхИзлишковТМЦ = Инвентаризация.СтатьяОприходованияОбнаруженныхИзлишковТМЦ;
	ОбИнвентаризация.СтатьяСписанияОбнаруженнойНедостачиТМЦ = Инвентаризация.СтатьяСписанияОбнаруженнойНедостачиТМЦ;
	ОбИнвентаризация.РежимКорректировкиКоличества = Инвентаризация.РежимКорректировкиКоличества;
	ОбИнвентаризация.Основание = Инвентаризация.Основание;
	
	Если Не ЗначениеЗаполнено(итИтоговаяИнвентаризация) Тогда
		ОбИнвентаризация.УстановитьНовыйНомер();
	КонецЕсли;
	ОбИнвентаризация.ДополнительныеСвойства.Вставить("ЗаписьПриФормировании", Истина);

	ОбИнвентаризация.Записать();
	
	Документы.Инвентаризация.ТоварыЗаполнитьПоДаннымПредварительногоИтога(ОбИнвентаризация, Инвентаризация.Ссылка);
	//ОбИнвентаризация.Дата = Инвентаризация.Дата;
	
	ОбИнвентаризация.ДополнительныеСвойства.Вставить("ЗаписьПриФормировании", Истина);
	
	Попытка
		ОбИнвентаризация.Записать(РежимЗаписиДокумента.Проведение);
		Результат = Истина;
	Исключение
		
		ТекстОшики = ОписаниеОшибки();
		Сообщить("Не удалось сформировать документ инвентаризации товаров:" + ТекстОшики);
		
		//ОбИнвентаризация.Записать();
	КонецПопытки;
	
	итИтоговаяИнвентаризация = ОбИнвентаризация.Ссылка;

	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура итВернутьВРаботуНаСервере()
	
	Пересортица = Объект.итПересортицаТоваров.ПолучитьОбъект();
	Пересортица.ДополнительныеСвойства.Вставить("ЗаписьПриФормировании", Истина);
	
	Пересортица.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	
	Инвентаризация = итИтоговаяИнвентаризация.ПолучитьОбъект();
	Инвентаризация.ДополнительныеСвойства.Вставить("ЗаписьПриФормировании", Истина);	
	Инвентаризация.Записать(РежимЗаписиДокумента.ОтменаПроведения);    
	
	ЭтаФорма.ТолькоПросмотр = Ложь;
	Элементы.итВернутьВРаботу.Видимость = Ложь;
	Элементы.итСформироватьДокументПересортицы.Видимость = Истина;
	Объект.итЗакрытДляРедактирования = Ложь;
	
	
КонецПроцедуры

&НаКлиенте
Процедура итВернутьВРаботу(Команда)
	итВернутьВРаботуНаСервере();
	Элементы.ДекорацияЗакрыта.Видимость = Ложь;	
	Записать();
КонецПроцедуры

&НаКлиенте
Процедура итОтобразитьЛегенду(Команда)
	Элементы.ГруппаШапкаЛегенда.Видимость = НЕ Элементы.ГруппаШапкаЛегенда.Видимость;
КонецПроцедуры


//Мальцев А.Ю. ---

////////////////////////////////////////////////////////////////////////////////
// ИСПОЛНЯЕМАЯ ЧАСТЬ МОДУЛЯ

ШтрихКодДляПоиска = "";
