Функция КонстантаАДО(Конст) Экспорт // ситников добавил Экспорт
  АдоКонст = НРег(Конст);
  Если АдоКонст = "adEmpty" Тогда Возврат(0);
  ИначеЕсли АдоКонст = "adtinyint" Тогда Возврат(16);
  ИначеЕсли АдоКонст = "adsmallint" Тогда Возврат(2);
  ИначеЕсли АдоКонст = "adinteger" Тогда Возврат(3);
  ИначеЕсли АдоКонст = "adbigint" Тогда Возврат(20);
  ИначеЕсли АдоКонст = "adunsignedtinyint" Тогда Возврат(17);
  ИначеЕсли АдоКонст = "adunsignedsmallint" Тогда Возврат(18);
  ИначеЕсли АдоКонст = "adunsignedint" Тогда Возврат(19);
  ИначеЕсли АдоКонст = "adunsignedbigint" Тогда Возврат(21);
  ИначеЕсли АдоКонст = "adsingle" Тогда Возврат(4);
  ИначеЕсли АдоКонст = "addouble" Тогда Возврат(5);
  ИначеЕсли АдоКонст = "adcurrency" Тогда Возврат(6);
  ИначеЕсли АдоКонст = "addecimal" Тогда Возврат(14);
  ИначеЕсли АдоКонст = "adnumeric" Тогда Возврат(131);
  ИначеЕсли АдоКонст = "adboolean" Тогда Возврат(11);
  ИначеЕсли АдоКонст = "aderror" Тогда Возврат(10);
  ИначеЕсли АдоКонст = "aduserdefined" Тогда Возврат(132);
  ИначеЕсли АдоКонст = "advariant" Тогда Возврат(12);
  ИначеЕсли АдоКонст = "adidispatch" Тогда Возврат(9);
  ИначеЕсли АдоКонст = "adiunknown" Тогда Возврат(13);
  ИначеЕсли АдоКонст = "adguid" Тогда Возврат(72);
  ИначеЕсли АдоКонст = "addate" Тогда Возврат(7);
  ИначеЕсли АдоКонст = "addbdate" Тогда Возврат(133);
  ИначеЕсли АдоКонст = "addbtime" Тогда Возврат(134);
  ИначеЕсли АдоКонст = "addbtimestamp" Тогда Возврат(135);
  ИначеЕсли АдоКонст = "adbstr" Тогда Возврат(8);
  ИначеЕсли АдоКонст = "adchar" Тогда Возврат(129);
  ИначеЕсли АдоКонст = "advarchar" Тогда Возврат(200);
  ИначеЕсли АдоКонст = "adlongvarchar" Тогда Возврат(201);
  ИначеЕсли АдоКонст = "adwchar" Тогда Возврат(130);
  ИначеЕсли АдоКонст = "advarwchar" Тогда Возврат(202);
  ИначеЕсли АдоКонст = "adlongvarwchar" Тогда Возврат(203);
  ИначеЕсли АдоКонст = "adbinary" Тогда Возврат(128);
  ИначеЕсли АдоКонст = "advarbinary" Тогда Возврат(204);
  ИначеЕсли АдоКонст = "adlongvarbinary" Тогда Возврат(205);
  Иначе Возврат(0);
  КонецЕсли;
КонецФункции
Функция ПодключитьсяКTPI(НастройкаПодключенияTPI) Экспорт // ситников добавил Экспорт
	COMОбъектSQL = Неопределено;
	Попытка
		COMОбъектSQL = Новый COMОбъект("ADODB.Connection");
		
		COMОбъектSQL.ConnectionTimeOut = 20; // по умолчанию
		COMОбъектSQL.CommandTimeOut = 0; 
		COMОбъектSQL.ConnectionString = "Provider=SQLOLEDB; SERVER=" + НастройкаПодключенияTPI.Сервер
			+ "; Database="+ НастройкаПодключенияTPI.БазаДанных
			+ "; UID=" + СокрЛП(НастройкаПодключенияTPI.Пользователь) 
			+ "; PWD=" + СокрЛП(НастройкаПодключенияTPI.Пароль) + ";";  
		COMОбъектSQL.Open();   
		Если COMОбъектSQL.State() = 0 Тогда 
			COMОбъектSQL = Неопределено;
			ТекстСообщения = НСтр("ru = 'Не удалось подключиться к SQL.'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
	Исключение
		COMОбъектSQL = Неопределено;
		ТекстСообщения = НСтр("ru = 'Не удалось подключиться к SQL.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	КонецПопытки;
	
	Возврат(COMОбъектSQL);
КонецФункции

Функция ПолучитьМаппингиДляЗагрузкиСправочников()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕРПМаппингДляЗагрузки.Ссылка,
	               |	ЕРПМаппингДляЗагрузки.Наименование,
	               |	ЕРПМаппингДляЗагрузки.ТекущееЗначениеСчетчика,
	               |	ЕРПМаппингДляЗагрузки.НастройкаПодключенияTPI,
	               |	ЕРПМаппингДляЗагрузки.НаименованиеТаблицыTPI,
	               |	ЕРПМаппингДляЗагрузки.ТипМетаданныхСправочника,
	               |	ЕРПМаппингДляЗагрузки.НеЗагружатьНовыеЭлементыВСправочник,
	               |	ЕРПМаппингДляЗагрузки.УсловиеОтбора
	               |ИЗ
	               |	Справочник.ЕРПМаппингДляЗагрузки КАК ЕРПМаппингДляЗагрузки
	               |ГДЕ
	               |	НЕ ЕРПМаппингДляЗагрузки.ПометкаУдаления
	               |	И ЕРПМаппингДляЗагрузки.ОбменНСИ
				   |	И НЕ ЕРПМаппингДляЗагрузки.ЭтоШК				   
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЕРПМаппингДляЗагрузки.ПорядокЗагрузки";
	ТаблицаДляВозврата = Запрос.Выполнить().Выгрузить();
	
	Возврат(ТаблицаДляВозврата);
КонецФункции
Функция ПолучитьСписокРеквизитовСправочников(ЕРПМаппингДляЗагрузкиСсылка, ПорядокЗагрузки)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕРПМаппингДляЗагрузки.Ссылка,
	               |	ЕРПМаппингДляЗагрузки.НаименованиеПоляTPI,
	               |	ЕРПМаппингДляЗагрузки.ИмяРеквизита,
	               |	ЕРПМаппингДляЗагрузки.ПроцедураМаппинга,
	               |	ЕРПМаппингДляЗагрузки.НеПерезаписыватьЗначение,
	               |	ЕРПМаппингДляЗагрузки.ПоискПоНаименованию,
	               |	ЕРПМаппингДляЗагрузки.ЗаполнятьДляГруппы
	               |ИЗ
	               |	Справочник.ЕРПМаппингДляЗагрузки.Маппинг КАК ЕРПМаппингДляЗагрузки
	               |ГДЕ
	               |	НЕ ЕРПМаппингДляЗагрузки.Ссылка.ПометкаУдаления
	               |	И ЕРПМаппингДляЗагрузки.Ссылка.ОбменНСИ
	               |	И ЕРПМаппингДляЗагрузки.Пометка
	               |	И ЕРПМаппингДляЗагрузки.ПорядокЗагрузки = &ПорядокЗагрузки
	               |	И ЕРПМаппингДляЗагрузки.Ссылка = &ЕРПМаппингДляЗагрузкиСсылка
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЕРПМаппингДляЗагрузки.Ссылка.ПорядокЗагрузки";
	Запрос.УстановитьПараметр("ЕРПМаппингДляЗагрузкиСсылка", ЕРПМаппингДляЗагрузкиСсылка);
	Запрос.УстановитьПараметр("ПорядокЗагрузки", ПорядокЗагрузки);
	ТаблицаДляВозврата = Запрос.Выполнить().Выгрузить();
	
	Возврат(ТаблицаДляВозврата);
КонецФункции
Функция ПолучитьМаксимальныйПорядокЗагрузкиСправочников()
	ЗначениеДляВозврата = 1;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(МАКСИМУМ(ЕРПМаппингДляЗагрузки.ПорядокЗагрузки), 0) КАК ПорядокЗагрузки
	               |ИЗ
	               |	Справочник.ЕРПМаппингДляЗагрузки.Маппинг КАК ЕРПМаппингДляЗагрузки
	               |ГДЕ
	               |	НЕ ЕРПМаппингДляЗагрузки.Ссылка.ПометкаУдаления
	               |	И ЕРПМаппингДляЗагрузки.Ссылка.ОбменНСИ
	               |	И ЕРПМаппингДляЗагрузки.Пометка";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗначениеДляВозврата = Выборка.ПорядокЗагрузки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат(ЗначениеДляВозврата);
КонецФункции
Функция ПолучитьСтруктуруТаблицыЗагруженныхСправочников()
	ТаблицаДляВозврата = Новый ТаблицаЗначений;
	
	ДопустимыеТипы = Новый ОписаниеТипов("СправочникСсылка.ЕРПМаппингДляЗагрузки");
	ТаблицаДляВозврата.Колонки.Добавить("ЕРПМаппингДляЗагрузки", ДопустимыеТипы);
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(15,0);
	ДопустимыеТипы = Новый ОписаниеТипов("Число", , ,КвалификаторЧисла);
	
	ТаблицаДляВозврата.Колонки.Добавить("НачальноеЗначениеСчетчика", ДопустимыеТипы);
	ТаблицаДляВозврата.Колонки.Добавить("КонечноеЗначениеСчетчика", ДопустимыеТипы);
	
	Возврат(ТаблицаДляВозврата);
КонецФункции	
Функция ПолучитьСтруктуруТаблицыЛогов()
	ТаблицаДляВозврата = Новый ТаблицаЗначений;
	
	КвалификаторДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	ДопустимыеТипы = Новый ОписаниеТипов("Дата", , ,КвалификаторДаты);
	ТаблицаДляВозврата.Колонки.Добавить("ДатаТранзакции", ДопустимыеТипы);
	ТаблицаДляВозврата.Колонки.Добавить("ДатаВставки", ДопустимыеТипы);
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(15);
	ДопустимыеТипы = Новый ОписаниеТипов("Строка", , ,КвалификаторСтроки);
	ТаблицаДляВозврата.Колонки.Добавить("ЕРПМастерКлюч", ДопустимыеТипы);
	
	КвалификаторЧисла = Новый КвалификаторыЧисла(15,0);
	ДопустимыеТипы = Новый ОписаниеТипов("Число", , ,КвалификаторЧисла);
	ТаблицаДляВозврата.Колонки.Добавить("ЕРПЗначениеСчетчика", ДопустимыеТипы);
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(100);
	ДопустимыеТипы = Новый ОписаниеТипов("Строка", , ,КвалификаторСтроки);
	ТаблицаДляВозврата.Колонки.Добавить("ИмяБазыДанных", ДопустимыеТипы);
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(150);
	ДопустимыеТипы = Новый ОписаниеТипов("Строка", , ,КвалификаторСтроки);
	ТаблицаДляВозврата.Колонки.Добавить("НаименованиеТаблицыTPI", ДопустимыеТипы);
	
	КвалификаторСтроки = Новый КвалификаторыСтроки(0);
	ДопустимыеТипы = Новый ОписаниеТипов("Строка", , ,КвалификаторСтроки);
	ТаблицаДляВозврата.Колонки.Добавить("ТекстОшибки", ДопустимыеТипы);
	
	ДопустимыеТипы = Новый ОписаниеТипов("Булево");
	ТаблицаДляВозврата.Колонки.Добавить("Загружен", ДопустимыеТипы);
	ТаблицаДляВозврата.Колонки.Добавить("Актуальность", ДопустимыеТипы);
	
	Возврат(ТаблицаДляВозврата);
КонецФункции	
Функция ОпределитьСправочникИерархический(RecordSet,ЗагружатьГруппыКакЭлементы)
	ПризнакИерархическийСправочник = ЛОЖЬ;
	
	Если ЗагружатьГруппыКакЭлементы Тогда
		Возврат(ПризнакИерархическийСправочник);
	КонецЕсли;	
		
	сч = 0;
	Пока сч <= RecordSet.Fields.Count - 1 Цикл
		Если RecordSet.Fields(сч).Name = "ItIsFolder" Тогда
			ПризнакИерархическийСправочник = ИСТИНА;
		КонецЕсли;	
		сч = сч + 1;
	КонецЦикла;	
	
	Возврат(ПризнакИерархическийСправочник);
КонецФункции	


Функция ПолучитьСсылкуНаЭлементСправочникаПоЕРПМастерКлючу(ИмяСправочника, ЕРПМастерКлюч)
	СсылкаДляВозврата = Справочники[ИмяСправочника].ПустаяСсылка();
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СписокЭлементовСправочника.Ссылка
	               |ИЗ
	               |	Справочник.#ИмяСправочника# КАК СписокЭлементовСправочника
	               |ГДЕ
	               |	СписокЭлементовСправочника.ЕРПМастерКлюч = &ЕРПМастерКлюч";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяСправочника#", ИмяСправочника);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЕРПМастерКлюч", ЕРПМастерКлюч);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			СсылкаДляВозврата = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат(СсылкаДляВозврата);
КонецФункции	
Функция ПолучитьСсылкуНаЭлементСправочникаПоНаименованию(ИмяСправочника, Наименование)
	СсылкаДляВозврата = Справочники[ИмяСправочника].ПустаяСсылка();
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СписокЭлементовСправочника.Ссылка
	               |ИЗ
	               |	Справочник.#ИмяСправочника# КАК СписокЭлементовСправочника
	               |ГДЕ
	               |	СписокЭлементовСправочника.Наименование = &Наименование";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ИмяСправочника#", ИмяСправочника);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("Наименование", Наименование);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			СсылкаДляВозврата = Выборка.Ссылка;
		КонецЕсли;
	КонецЕсли;
	
	Возврат(СсылкаДляВозврата);
КонецФункции	

Процедура ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования)
	ТаблицаЛогов = СтруктураПараметровЛогирования.ТаблицаЛогов;
	Если СтруктураПараметровЛогирования.Свойство("НаименованиеТаблицыTPI")
		И СтруктураПараметровЛогирования.Свойство("ЕРПМастерКлюч")
		И СтруктураПараметровЛогирования.Свойство("ЕРПЗначениеСчетчика") Тогда
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("НаименованиеТаблицыTPI", СтруктураПараметровЛогирования.НаименованиеТаблицыTPI);
		ПараметрыОтбора.Вставить("ЕРПМастерКлюч", СтруктураПараметровЛогирования.ЕРПМастерКлюч);
		ПараметрыОтбора.Вставить("ЕРПЗначениеСчетчика", СтруктураПараметровЛогирования.ЕРПЗначениеСчетчика);
		
		НайденныеСтроки = ТаблицаЛогов.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() = 0 Тогда
			НоваяСтрока = ТаблицаЛогов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПараметровЛогирования);
			НоваяСтрока.ИмяБазыДанных = ЕРПЗагрузкаНСИПерсональный.ПолучитьИмяБазыДанных();
			НоваяСтрока.Актуальность = ?(СтруктураПараметровЛогирования.Свойство("Актуальность"), СтруктураПараметровЛогирования.Актуальность, ИСТИНА);
			НоваяСтрока.ДатаВставки = ТекущаяДата();
		Иначе	
			НоваяСтрока = НайденныеСтроки[0];
			Если НоваяСтрока.Загружен Тогда
				ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПараметровЛогирования);
			КонецЕсли;	
		КонецЕсли;	
	Иначе	
		НоваяСтрока = ТаблицаЛогов.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтруктураПараметровЛогирования);
		НоваяСтрока.ИмяБазыДанных = ЕРПЗагрузкаНСИПерсональный.ПолучитьИмяБазыДанных();
		НоваяСтрока.Актуальность = ?(СтруктураПараметровЛогирования.Свойство("Актуальность"), СтруктураПараметровЛогирования.Актуальность, ИСТИНА);
		НоваяСтрока.ДатаВставки = ТекущаяДата();
	КонецЕсли;	
КонецПроцедуры	
Процедура ЗаписатьТаблицуЛогов(СтруктураПараметров)
	ТаблицаЛогов = 	СтруктураПараметров.ТаблицаЛогов;
	
	//ТекстЗапроса = "INSERT INTO dbo.LogTime WITH (TABLOCKX) (BD, MANUAL, IDMANUAL, LINESWITCHMANUAL, LOADED, ERRORTEXT, DATEINSERT, ACTUAL, DATETRANSACTION) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)";
	
	//ТекстЗапроса = "INSERT INTO dbo.LogTime (BD, MANUAL, IDMANUAL, LINESWITCHMANUAL, LOADED, ERRORTEXT, DATEINSERT, ACTUAL, DATETRANSACTION) VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)";
	//Command = Новый COMОбъект("ADODB.Command"); 
	//Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
	//Command.CommandText = ТекстЗапроса;
	//
	//Param1 = Command.CreateParameter("BD", КонстантаАДО("advarchar"), 1, 100);
	//Command.Parameters.Append(Param1);
	//Param2 = Command.CreateParameter("MANUAL", КонстантаАДО("advarchar"), 1, 150);
	//Command.Parameters.Append(Param2);
	//Param3 = Command.CreateParameter("IDMANUAL", КонстантаАДО("advarchar"), 1, 15);
	//Command.Parameters.Append(Param3);
	//Param4 = Command.CreateParameter("LINESWITCHMANUAL", КонстантаАДО("adbigint"), 1);
	//Command.Parameters.Append(Param4);
	//Param5 = Command.CreateParameter("LOADED", КонстантаАДО("adboolean"), 1);
	//Command.Parameters.Append(Param5);
	//Param6 = Command.CreateParameter("ERRORTEXT", КонстантаАДО("advarchar"), 1, 500);
	//Command.Parameters.Append(Param6);
	//Param7 = Command.CreateParameter("DATEINSERT", КонстантаАДО("addbtimestamp"), 1);
	//Command.Parameters.Append(Param7);
	//Param8 = Command.CreateParameter("ACTUAL", КонстантаАДО("adboolean"), 1);
	//Command.Parameters.Append(Param8);
	//Param9 = Command.CreateParameter("DATETRANSACTION", КонстантаАДО("addbtimestamp"), 1);
	//Command.Parameters.Append(Param9);
	//
	//Для Каждого Строка Из ТаблицаЛогов Цикл
	//	Param1.Value = Строка.ИмяБазыДанных;
	//	Param2.Value = Строка.НаименованиеТаблицыTPI;
	//	Param3.Value = Строка.ЕРПМастерКлюч;
	//	Param4.Value = Строка.ЕРПЗначениеСчетчика;
	//	Param5.Value = Строка.Загружен;
	//	Param6.Value = Строка.ТекстОшибки;
	//	Param7.Value = Строка.ДатаВставки;
	//	Param8.Value = Строка.Актуальность;
	//	Param9.Value = Строка.ДатаТранзакции;
	//	
	//	Попытка
	//		Command.Execute();
	//	Исключение
	//		ЗаписьЖурналаРегистрации("ЕРП Загрузка НСИ",УровеньЖурналаРегистрации.Ошибка,,,
	//		"["+Строка.ИмяБазыДанных+","+Строка.НаименованиеТаблицыTPI+","+Строка.ЕРПМастерКлюч+","+Строка.ЕРПЗначениеСчетчика+","+Строка.Загружен+","+Строка.ТекстОшибки+","+Строка.ДатаВставки+","+Строка.Актуальность+","+Строка.ДатаТранзакции+"] "+ОписаниеОшибки());
	//	КонецПопытки;
	//КонецЦикла;	
		Для Каждого Строка Из ТаблицаЛогов Цикл
			регЛогНСИ = РегистрыСведений.ит_ЛогНСИ.СоздатьМенеджерЗаписи();
			регЛогНСИ.ИмяБазыДанных = Строка.ИмяБазыДанных;
			регЛогНСИ.НаименованиеТаблицыTPI = Строка.НаименованиеТаблицыTPI;
			регЛогНСИ.ЕРПМастерКлюч = Строка.ЕРПМастерКлюч;
			регЛогНСИ.ЕРПЗначениеСчетчика = Строка.ЕРПЗначениеСчетчика;
			регЛогНСИ.Загружен = Строка.Загружен;
			регЛогНСИ.ТекстОшибки = Строка.ТекстОшибки;
			регЛогНСИ.ДатаВставки = Строка.ДатаВставки;
			регЛогНСИ.Актуальность = Строка.Актуальность;
			регЛогНСИ.ДатаТранзакции = Строка.ДатаТранзакции;
			
		Попытка
			регЛогНСИ.Записать(Истина);
		Исключение
			ЗаписьЖурналаРегистрации("ЕРП Загрузка НСИ",УровеньЖурналаРегистрации.Ошибка,,,
			"["+Строка.ИмяБазыДанных+","+Строка.НаименованиеТаблицыTPI+","+Строка.ЕРПМастерКлюч+","+Строка.ЕРПЗначениеСчетчика+","+Строка.Загружен+","+Строка.ТекстОшибки+","+Строка.ДатаВставки+","+Строка.Актуальность+","+Строка.ДатаТранзакции+"] "+ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;	

КонецПроцедуры	

Процедура ЗагрузитьНСИизTPI() Экспорт
	
	РегламентноеЗадание = Метаданные.РегламентныеЗадания.ЕРПОбменНСИ;
	
	ОбщегоНазначения.ПриНачалеВыполненияРегламентногоЗадания(РегламентноеЗадание);
	
	Если ОбщегоНазначенияПовтИсп.РазделениеВключено() Тогда
		Возврат;
	КонецЕсли;
	
	Отбор = Новый Структура;
	Отбор.Вставить("ИмяМетода", РегламентноеЗадание.ИмяМетода);
	Отбор.Вставить("Состояние", СостояниеФоновогоЗадания.Активно);
	ФоновыеЗаданияОбновлениеВыгрузки = ФоновыеЗадания.ПолучитьФоновыеЗадания(Отбор);
	Если ФоновыеЗаданияОбновлениеВыгрузки.Количество() > 1 Тогда
		Возврат;
	КонецЕсли;
	
	ДатаТранзакции = ТекущаяДата();
	
	НастрокаПодключенияTPI = Справочники.ЕРПНастрокиПодключенияTPI.TPItest;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕРПНастрокиПодключенияTPI.Ссылка
	               |ИЗ
	               |	Справочник.ЕРПНастрокиПодключенияTPI КАК ЕРПНастрокиПодключенияTPI
	               |ГДЕ
	               |	ЕРПНастрокиПодключенияTPI.ОсновноеПодключение";
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			НастрокаПодключенияTPI = Выборка.Ссылка;
		КонецЦикла;
	КонецЕсли;	
	
	COMОбъектSQL = ПодключитьсяКTPI(НастрокаПодключенияTPI);
	
	Если COMОбъектSQL <> Неопределено Тогда
		
		ТаблицаЗагруженныхСправочников = ПолучитьСтруктуруТаблицыЗагруженныхСправочников();
		
		//Мальцев А.Ю. 02.02.2021 +++
		//Перенос механизмов загрузки ШК в общее задание по загрузке НСИ
		//ТаблицаМаппингиДляЗагрузкиСправочников = ПолучитьМаппингиДляЗагрузкиСправочников();
		стТаблицМаппинга = ПолучитьТаблицыМаппингаДляЗагрузки();
		//Мальцев А.Ю. 02.02.2021 ---

		ТаблицаЛогов = ПолучитьСтруктуруТаблицыЛогов();
	
		СтруктураПараметров = Новый Структура();
		СтруктураПараметров.Вставить("ТаблицаЗагруженныхСправочников", ТаблицаЗагруженныхСправочников);
		
		//Мальцев А.Ю. 02.02.2021 +++
		//СтруктураПараметров.Вставить("ТаблицаМаппингиДляЗагрузкиСправочников", ТаблицаМаппингиДляЗагрузкиСправочников);
		СтруктураПараметров.Вставить("ТаблицаМаппингиДляЗагрузкиСправочников", стТаблицМаппинга.ТаблицаДляВозвратаСп);
		СтруктураПараметров.Вставить("ТаблицаМаппингиДляЗагрузкиШтрихкодов",   стТаблицМаппинга.ТаблицаДляВозвратаШк);
		//Мальцев А.Ю. 02.02.2021 ---
		
		СтруктураПараметров.Вставить("ТаблицаЛогов", ТаблицаЛогов);
		//СтруктураПараметров.Вставить("ДатаТранзакции", ДатаТранзакции);
		СтруктураПараметров.Вставить("COMОбъектSQL", COMОбъектSQL);
		ПолучитьДатуНачалаТранзакцииSQL(СтруктураПараметров);
	
		ВыполнитьЗагрузкуСправочников(СтруктураПараметров);
		
		COMОбъектSQL.Close(); 
	КонецЕсли;	
		
	COMОбъектSQL = Неопределено;
КонецПроцедуры	
Процедура ВыполнитьЗагрузкуСправочников(СтруктураПараметров)
	Попытка
		//Первый проход - простые типы
		ВыполнитьПервыйПроходЗагрузкиСправочников(СтруктураПараметров);
	Исключение
		СтруктураПараметровЛогирования = Новый Структура();
		СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
		СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
		СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
		СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Неизвестная ошибка. Проход - 1. " + ОписаниеОшибки());
		
		ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
	КонецПопытки;
	
	//Мальцев А.Ю. 02.02.2021 +++
	//Загрузка ШК
	Попытка
		ВыполнитьЗагрузкуШК(СтруктураПараметров);
	Исключение
		СтруктураПараметровЛогирования = Новый Структура();
		СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
		СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
		СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
		СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Неизвестная ошибка. Проход - 1. " + ОписаниеОшибки());
		
		ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
	КонецПопытки;
	ЗаполнитьЕдИзмеренияШтрихкодов();
	//Мальцев А.Ю. 02.02.2021 ---
	
	МаксимальныйПорядокЗагрузкиСправочников = ПолучитьМаксимальныйПорядокЗагрузкиСправочников();
	
	//Второй проход и последующие - ссылки на справочники (подчиненные и др. позже по порядку загрузки)
	сч = 2;
	Пока сч <= МаксимальныйПорядокЗагрузкиСправочников Цикл
		Попытка
			ВыполнитьПоследующиеПроходыЗагрузкиСправочников(СтруктураПараметров, сч);
		Исключение
			СтруктураПараметровЛогирования = Новый Структура();
			СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
			СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
			СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
			СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Неизвестная ошибка. Проход - " + сч + ". " + ОписаниеОшибки());
			
			ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
		КонецПопытки;
		
		сч = сч + 1;
	КонецЦикла;	
	
	Попытка
		ВыполнитьОбработкуЗагрузкиПометкиНаУдаления(СтруктураПараметров);
	Исключение
		СтруктураПараметровЛогирования = Новый Структура();
		СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
		СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
		СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
		СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Ошибка пометки на удаление. " + ОписаниеОшибки());
		
		ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
	КонецПопытки;
	
	Попытка
		ВыполнитьОбработкуЗагрузкиТабличныхЧастейСправочников(СтруктураПараметров);
	Исключение
		СтруктураПараметровЛогирования = Новый Структура();
		СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
		СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
		СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
		СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Ошибка пометки на удаление. " + ОписаниеОшибки());
		
		ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
	КонецПопытки;
	
	ЗаписатьТаблицуЛогов(СтруктураПараметров);
КонецПроцедуры	
Процедура ВыполнитьПервыйПроходЗагрузкиСправочников(СтруктураПараметров)
	Для Каждого СтрокаМаппинга Из СтруктураПараметров.ТаблицаМаппингиДляЗагрузкиСправочников Цикл
		
		НачальноеЗначениеСчетчика = СтрокаМаппинга.ТекущееЗначениеСчетчика;
		КонечноеЗначениеСчетчика = СтрокаМаппинга.ТекущееЗначениеСчетчика;
		
		ТаблицаРеквизитовСправочника = ПолучитьСписокРеквизитовСправочников(СтрокаМаппинга.Ссылка, 1);
		
		ТекстЗапроса = "SELECT * FROM
		| (SELECT ID, MAX(LineSwitch) AS MaxLineSwitch FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch > ? AND DATEINSERT <= ?
		|  GROUP BY ID) TableMaxLine 
		|  INNER JOIN " + СтрокаМаппинга.НаименованиеТаблицыTPI + " Dat ON TableMaxLine.ID = Dat.ID AND TableMaxLine.MaxLineSwitch = Dat.LineSwitch
		|  ORDER BY LineSwitch";
		
		
		//ТекстЗапроса = "SELECT * FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch > ? ORDER BY LineSwitch";
		Command = Новый COMОбъект("ADODB.Command"); 
		Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
		Command.CommandText = ТекстЗапроса;
		
		Param1 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
		Command.Parameters.Append(Param1);
		Param1.Value = СтрокаМаппинга.ТекущееЗначениеСчетчика;

		Param2 = Command.CreateParameter("DATEINSERT", КонстантаАДО("adbigint"), 1);
		Command.Parameters.Append(Param2);
		Param2.Value = СтруктураПараметров.ДатаТранзакции;
		
		RecordSet = Новый COMОбъект("ADODB.Recordset"); 
		RecordSet = Command.Execute();
		
		ПризнакИерархическийСправочник = ОпределитьСправочникИерархический(RecordSet, СтрокаМаппинга.Ссылка.ЗагружатьГруппыКакЭлементы);
 
		Пока НЕ RecordSet.EOF Цикл
			ЕРПМастерКлюч = Строка(СокрЛП(RecordSet.Fields("ID").Value));
			КонечноеЗначениеСчетчика = Число(СокрЛП(RecordSet.Fields("LineSwitch").Value));
			ТекущееЗначениеСчетчика = Число(СокрЛП(RecordSet.Fields("LineSwitch").Value));
			
			Если RecordSet.Fields("ID").Value = NULL Тогда
				СтруктураПараметровЛогирования = Новый Структура();
				СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
				СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
				СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", "");
				СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
				СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
				СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
				СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
				СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не указан Мастер-ключ!");
				ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
				RecordSet.MoveNext();
				
				Продолжить;
			КонецЕсли;	
			
			ЭтоГруппа = ПризнакИерархическийСправочник И RecordSet.Fields("ItIsFolder").Value <> NULL И RecordSet.Fields("ItIsFolder").Value = ИСТИНА;
			УстановленаПометкаУдаления = ЛОЖЬ;
			Если RecordSet.Fields("DeletedMark").Value <> NULL Тогда
				УстановленаПометкаУдаления = RecordSet.Fields("DeletedMark").Value;
			КонецЕсли;
			
			ЭтоНовый = ЛОЖЬ;
			МассивЭлементовСправочника = НайтиЭлементыСправочникаПоЕРПМастерКлючу(СтрокаМаппинга.ТипМетаданныхСправочника, ЕРПМастерКлюч, ЭтоНовый, ЭтоГруппа, УстановленаПометкаУдаления);
			
			Если Не ЭтоГруппа Тогда
				УдовлетворяетУсловиямОтбора = ИСТИНА;
				Если СтрокаМаппинга.УсловиеОтбора <> "" Тогда
					Выполнить(СтрокаМаппинга.УсловиеОтбора);
				КонецЕсли;	
				
				Если (ЭтоНовый И СтрокаМаппинга.НеЗагружатьНовыеЭлементыВСправочник) ИЛИ НЕ УдовлетворяетУсловиямОтбора Тогда
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("Актуальность", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", ?(НЕ УдовлетворяетУсловиямОтбора, "Не удовлетворяет условиям отбора!", "Установлен признак: не загружать новые элементы в справочник!"));
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					RecordSet.MoveNext();
					
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
				
			Если МассивЭлементовСправочника.Количество() <> 0 Тогда
				СтруктураПараметровЛогирования = Новый Структура();
				СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
				СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
				СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
				СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
				СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
				Попытка
					Для Каждого ЭлементМассива Из МассивЭлементовСправочника Цикл
						ЭлементОбъект = ЭлементМассива;
					
						Для Каждого Реквизит Из ТаблицаРеквизитовСправочника Цикл
							
							Если Не ЭтоГруппа ИЛИ (ЭтоГруппа И Реквизит.ЗаполнятьДляГруппы) Тогда
								Если Реквизит.ПроцедураМаппинга <> "" Тогда
									ВыполнитьПроцедуруМаппинга(СтруктураПараметров, ЭлементОбъект, Реквизит, RecordSet, ЭтоНовый);
								Иначе	
									КодОшибки = ЗаполнитьЗначениеРеквизитаСправочника(ЭлементОбъект, Реквизит, ?(Реквизит.НаименованиеПоляTPI = "", Неопределено, RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value), ЭтоНовый);
									Если КодОшибки <> 0 Тогда
										Если КодОшибки = 1 Тогда
											СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит. Значение не найдено в справочнике. Проход - 1. Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + Реквизит.ИмяРеквизита + ".");
										ИначеЕсли КодОшибки = 2 Тогда
											СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит. Неизвестный тип реквизита. Проход - 1. Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + Реквизит.ИмяРеквизита + ".");
										Иначе
											СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "");
										КонецЕсли;	
										СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
										ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
									КонецЕсли;	
								КонецЕсли;	
							КонецЕсли;	
							
						КонецЦикла;
						
						ОбъектЗаписан = Истина;
						
						Попытка
							ЭлементОбъект.ОбменДанными.Загрузка = Истина;
							ЭлементОбъект.Записать();
							
							СтруктураПараметровЛогирования.Вставить("Загружен", ИСТИНА);
							СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "");
							
							ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
						Исключение
							
							ОбъектЗаписан = Ложь;
							
							СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
							СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось записать. Проход - 1. Настройка - " + СтрокаМаппинга.Ссылка + ". " + ОписаниеОшибки());
							
							ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
						КонецПопытки;
						
						Если ОбъектЗаписан И ТипЗнч(ЭлементОбъект.Ссылка) = Тип("СправочникСсылка.Номенклатура") Тогда
							мНоменклатуры = Новый Массив;
							мНоменклатуры.Добавить(ЭлементОбъект.Ссылка);
							ОбменДаннымиСобытия.ЗарегистрироватьИзмененияРегистраТоварыВОборудовании(мНоменклатуры);
						КонецЕсли;
						
					КонецЦикла;	
				Исключение
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит. Проход - 1. Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + Реквизит.ИмяРеквизита + ". " + ОписаниеОшибки());
					
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
				КонецПопытки;
			Иначе	
				СтруктураПараметровЛогирования = Новый Структура();
				СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
				СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
				СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
				СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
				СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
				СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
				СтруктураПараметровЛогирования.Вставить("Актуальность", ЛОЖЬ);
				СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Новый элемент справочника с пометкой удаления!");
				ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
			КонецЕсли;
			
			RecordSet.MoveNext();
		КонецЦикла;	

		Если НачальноеЗначениеСчетчика <> КонечноеЗначениеСчетчика Тогда
			НоваяСтрокаЗагруженныйСправочник = СтруктураПараметров.ТаблицаЗагруженныхСправочников.Добавить();
			НоваяСтрокаЗагруженныйСправочник.НачальноеЗначениеСчетчика = СтрокаМаппинга.ТекущееЗначениеСчетчика;
			НоваяСтрокаЗагруженныйСправочник.ЕРПМаппингДляЗагрузки = СтрокаМаппинга.Ссылка;
			НоваяСтрокаЗагруженныйСправочник.КонечноеЗначениеСчетчика = КонечноеЗначениеСчетчика;
		
			СтрокаМаппингаОбъект = СтрокаМаппинга.Ссылка.ПолучитьОбъект();
			СтрокаМаппингаОбъект.ТекущееЗначениеСчетчика = КонечноеЗначениеСчетчика;
			СтрокаМаппингаОбъект.Записать();
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
Процедура ВыполнитьПоследующиеПроходыЗагрузкиСправочников(СтруктураПараметров, ТекущийПорядокЗагрузкиСправочников)
	Для Каждого СтрокаМаппинга Из СтруктураПараметров.ТаблицаМаппингиДляЗагрузкиСправочников Цикл
		ТаблицаРеквизитовСправочника = ПолучитьСписокРеквизитовСправочников(СтрокаМаппинга.Ссылка, ТекущийПорядокЗагрузкиСправочников);
		
		НачальноеЗначениеСчетчика = 0;
		КонечноеЗначениеСчетчика = 0;
			
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("ЕРПМаппингДляЗагрузки", СтрокаМаппинга.Ссылка);
		НайденныеСтроки = СтруктураПараметров.ТаблицаЗагруженныхСправочников.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			НачальноеЗначениеСчетчика = НайденныеСтроки[0].НачальноеЗначениеСчетчика;
			КонечноеЗначениеСчетчика = НайденныеСтроки[0].КонечноеЗначениеСчетчика;
		КонецЕсли;	
		
		Если НачальноеЗначениеСчетчика <> КонечноеЗначениеСчетчика Тогда
			//ТекстЗапроса = "SELECT * FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch > ? AND LineSwitch <= ? ORDER BY LineSwitch";
			
			ТекстЗапроса = "SELECT * FROM
			| (SELECT ID, MAX(LineSwitch) AS MaxLineSwitch FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch > ? AND LineSwitch <= ? AND DATEINSERT <= ?
			|  GROUP BY ID) TableMaxLine 
			|  INNER JOIN " + СтрокаМаппинга.НаименованиеТаблицыTPI + " Dat ON TableMaxLine.ID = Dat.ID AND TableMaxLine.MaxLineSwitch = Dat.LineSwitch
			|  ORDER BY LineSwitch";
			
			Command = Новый COMОбъект("ADODB.Command"); 
			Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
			Command.CommandText = ТекстЗапроса;
			
			Param1 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param1);
			Param1.Value = НачальноеЗначениеСчетчика;

			Param2 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param2);
			Param2.Value = КонечноеЗначениеСчетчика;
			
			Param3 = Command.CreateParameter("DATEINSERT", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param3);
			Param3.Value = СтруктураПараметров.ДатаТранзакции;
			
			RecordSet = Новый COMОбъект("ADODB.Recordset"); 
			RecordSet = Command.Execute();
			
			ПризнакИерархическийСправочник = ОпределитьСправочникИерархический(RecordSet, СтрокаМаппинга.Ссылка.ЗагружатьГруппыКакЭлементы);
			
			Пока НЕ RecordSet.EOF Цикл
				ЕРПМастерКлюч = Строка(СокрЛП(RecordSet.Fields("ID").Value));
				ТекущееЗначениеСчетчика = Число(СокрЛП(RecordSet.Fields("LineSwitch").Value));
				
				Если RecordSet.Fields("ID").Value = NULL Тогда
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", "");
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не указан Мастер-ключ!");
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					RecordSet.MoveNext();
					
					Продолжить;
				КонецЕсли;	
				
				ЭтоГруппа = ПризнакИерархическийСправочник И RecordSet.Fields("ItIsFolder").Value <> NULL И RecordSet.Fields("ItIsFolder").Value = ИСТИНА;
				УстановленаПометкаУдаления = ЛОЖЬ;
				Если RecordSet.Fields("DeletedMark").Value <> NULL Тогда
					УстановленаПометкаУдаления = RecordSet.Fields("DeletedMark").Value;
				КонецЕсли;
				
				ЭтоНовый = ЛОЖЬ;
				МассивЭлементовСправочника = НайтиЭлементыСправочникаПоЕРПМастерКлючу(СтрокаМаппинга.ТипМетаданныхСправочника, ЕРПМастерКлюч, ЭтоНовый, ЭтоГруппа, УстановленаПометкаУдаления);
				
				Если Не ЭтоГруппа Тогда
					УдовлетворяетУсловиямОтбора = ИСТИНА;
					Если СтрокаМаппинга.УсловиеОтбора <> "" Тогда
						Выполнить(СтрокаМаппинга.УсловиеОтбора);
					КонецЕсли;	
					
					Если (ЭтоНовый И СтрокаМаппинга.НеЗагружатьНовыеЭлементыВСправочник) ИЛИ НЕ УдовлетворяетУсловиямОтбора Тогда
						СтруктураПараметровЛогирования = Новый Структура();
						СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
						СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
						СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
						СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
						СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
						СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
						СтруктураПараметровЛогирования.Вставить("Актуальность", ЛОЖЬ);
						СтруктураПараметровЛогирования.Вставить("ТекстОшибки", ?(НЕ УдовлетворяетУсловиямОтбора, "Не удовлетворяет условиям отбора!", "Установлен признак: не загружать новые элементы в справочник!"));
						ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
						RecordSet.MoveNext();
						
						Продолжить;
					КонецЕсли;	
				КонецЕсли;	
					
				Если МассивЭлементовСправочника.Количество() <> 0 Тогда
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					Попытка
						Для Каждого ЭлементМассива Из МассивЭлементовСправочника Цикл
							ЭлементОбъект = ЭлементМассива;
							
							Для Каждого Реквизит Из ТаблицаРеквизитовСправочника Цикл
								Если Не ЭтоГруппа ИЛИ (ЭтоГруппа И Реквизит.ЗаполнятьДляГруппы) Тогда
									Если Реквизит.ПроцедураМаппинга <> "" Тогда
										ВыполнитьПроцедуруМаппинга(СтруктураПараметров, ЭлементОбъект, Реквизит, RecordSet, ЭтоНовый);
									Иначе	
										КодОшибки = ЗаполнитьЗначениеРеквизитаСправочника(ЭлементОбъект, Реквизит, ?(Реквизит.НаименованиеПоляTPI = "", Неопределено, RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value), ЭтоНовый);
										Если КодОшибки <> 0 Тогда
											Если КодОшибки = 1 Тогда
												СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит. Значение не найдено в справочнике. Проход - " + ТекущийПорядокЗагрузкиСправочников + ". Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + Реквизит.ИмяРеквизита + ".");
											ИначеЕсли КодОшибки = 2 Тогда
												СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит. Неизвестный тип реквизита. Проход - " + ТекущийПорядокЗагрузкиСправочников + ". Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + Реквизит.ИмяРеквизита + ".");
											Иначе
												СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "");
											КонецЕсли;	
											СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
											ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
										КонецЕсли;	
									КонецЕсли;	
								КонецЕсли;	
							КонецЦикла;
							
							Попытка
								ЭлементОбъект.ОбменДанными.Загрузка = Истина;
								ЭлементОбъект.Записать();
								
								СтруктураПараметровЛогирования.Вставить("Загружен", ИСТИНА);
								СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "");
								
								ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
							Исключение
								СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
								СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось записать. Проход - " + ТекущийПорядокЗагрузкиСправочников + ". Настройка - " + СтрокаМаппинга.Ссылка + ". " + ОписаниеОшибки());
								
								ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
							КонецПопытки;
						КонецЦикла;	
					Исключение
						СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
						СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит. Проход - " + ТекущийПорядокЗагрузкиСправочников + ". Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + Реквизит.ИмяРеквизита + ". " + ОписаниеОшибки());
						
						ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					КонецПопытки;
				Иначе	
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("Актуальность", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Новый элемент справочника с пометкой удаления!");
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
				КонецЕсли;	
				RecordSet.MoveNext();
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры
Процедура ВыполнитьОбработкуЗагрузкиПометкиНаУдаления(СтруктураПараметров)
	Для Каждого СтрокаМаппинга Из СтруктураПараметров.ТаблицаМаппингиДляЗагрузкиСправочников Цикл
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("ЕРПМаппингДляЗагрузки", СтрокаМаппинга.Ссылка);
		НайденныеСтроки = СтруктураПараметров.ТаблицаЗагруженныхСправочников.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			НачальноеЗначениеСчетчика = НайденныеСтроки[0].НачальноеЗначениеСчетчика;
			КонечноеЗначениеСчетчика = НайденныеСтроки[0].КонечноеЗначениеСчетчика;
		КонецЕсли;	
		
		Если НачальноеЗначениеСчетчика <> КонечноеЗначениеСчетчика Тогда
			//ТекстЗапроса = "SELECT LineSwitch, ID, DeletedMark FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch > ? AND LineSwitch <= ? ORDER BY LineSwitch";
			
			ТекстЗапроса = "SELECT LineSwitch, TableMaxLine.ID AS ID, DeletedMark FROM
			| (SELECT ID, MAX(LineSwitch) AS MaxLineSwitch FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch > ? AND LineSwitch <= ?
			|  GROUP BY ID) TableMaxLine 
			|  INNER JOIN " + СтрокаМаппинга.НаименованиеТаблицыTPI + " Dat ON TableMaxLine.ID = Dat.ID AND TableMaxLine.MaxLineSwitch = Dat.LineSwitch
			|  ORDER BY LineSwitch";

			Command = Новый COMОбъект("ADODB.Command"); 
			Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
			Command.CommandText = ТекстЗапроса;
			
			Param1 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param1);
			Param1.Value = НачальноеЗначениеСчетчика;

			Param2 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param2);
			Param2.Value = КонечноеЗначениеСчетчика;
						
			RecordSet = Новый COMОбъект("ADODB.Recordset"); 
			RecordSet = Command.Execute();
			
			ПризнакИерархическийСправочник = ОпределитьСправочникИерархический(RecordSet, СтрокаМаппинга.Ссылка.ЗагружатьГруппыКакЭлементы);
			
			Пока НЕ RecordSet.EOF Цикл
				ЕРПМастерКлюч = Строка(СокрЛП(RecordSet.Fields("ID").Value));
				ТекущееЗначениеСчетчика = Число(СокрЛП(RecordSet.Fields("LineSwitch").Value));
				ЭтоНовый = ЛОЖЬ;
				
				ЭтоГруппа = ПризнакИерархическийСправочник И RecordSet.Fields("ItIsFolder").Value <> NULL И RecordSet.Fields("ItIsFolder").Value = ИСТИНА;
				УстановленаПометкаУдаления = ЛОЖЬ;
				Если RecordSet.Fields("DeletedMark").Value <> NULL Тогда
					УстановленаПометкаУдаления = RecordSet.Fields("DeletedMark").Value;
				КонецЕсли;
				
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
				ПараметрыОтбора.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
				ПараметрыОтбора.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
				
				НайденныеСтроки = СтруктураПараметров.ТаблицаЛогов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() <> 0 Тогда
					МассивЭлементовСправочника = НайтиЭлементыСправочникаПоЕРПМастерКлючу(СтрокаМаппинга.ТипМетаданныхСправочника, ЕРПМастерКлюч, ЭтоНовый, ЭтоГруппа, УстановленаПометкаУдаления);
					Если НЕ ЭтоНовый Тогда
						Если МассивЭлементовСправочника.Количество() <> 0 Тогда
							СтруктураПараметровЛогирования = Новый Структура();
							СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
							СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
							СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
							СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
							СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
							Попытка
								Для Каждого ЭлементМассива Из МассивЭлементовСправочника Цикл
									ЭлементОбъект = ЭлементМассива;
									Если RecordSet.Fields("DeletedMark").Value = NULL ИЛИ НЕ RecordSet.Fields("DeletedMark").Value И ЭлементОбъект.ПометкаУдаления Тогда
										ЭлементОбъект.ОбменДанными.Загрузка = Истина;
										ЭлементОбъект.УстановитьПометкуУдаления(ЛОЖЬ);
									ИначеЕсли RecordSet.Fields("DeletedMark").Value И НЕ ЭлементОбъект.ПометкаУдаления Тогда
										ЭлементОбъект.ОбменДанными.Загрузка = Истина;
										ЭлементОбъект.УстановитьПометкуУдаления(ИСТИНА);
									КонецЕсли;	
								КонецЦикла;	
							Исключение
								СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
								СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось установить/снять пометку удаления. Настройка - " + СтрокаМаппинга.Ссылка + ". " + ОписаниеОшибки());
								
								ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
							КонецПопытки;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				RecordSet.MoveNext();
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры	

Процедура ПолучитьДатуНачалаТранзакцииSQL(СтруктураПараметров) Экспорт
	
	ДатаТранзакции = ТекущаяДата();
	
	ТекстЗапроса =	
	"SELECT TOP 1 GETDATE() AS CurrentDate";

	Command = Новый COMОбъект("ADODB.Command"); 
	Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
	Command.CommandText = ТекстЗапроса;
	
	RecordSet = Новый COMОбъект("ADODB.Recordset"); 
	RecordSet = Command.Execute();
	
	Если НЕ RecordSet.EOF Тогда
		ДатаТранзакции = RecordSet.Fields("CurrentDate").Value;
	КонецЕсли;
	
	СтруктураПараметров.Вставить("ДатаТранзакции", ДатаТранзакции);
	
КонецПроцедуры

Процедура ВыполнитьОбработкуЗагрузкиТабличныхЧастейСправочников(СтруктураПараметров)
	Для Каждого СтрокаМаппинга Из СтруктураПараметров.ТаблицаМаппингиДляЗагрузкиСправочников Цикл
		ПараметрыОтбора = Новый Структура();
		ПараметрыОтбора.Вставить("ЕРПМаппингДляЗагрузки", СтрокаМаппинга.Ссылка);
		НайденныеСтроки = СтруктураПараметров.ТаблицаЗагруженныхСправочников.НайтиСтроки(ПараметрыОтбора);
		Если НайденныеСтроки.Количество() <> 0 Тогда
			НачальноеЗначениеСчетчика = НайденныеСтроки[0].НачальноеЗначениеСчетчика;
			КонечноеЗначениеСчетчика = НайденныеСтроки[0].КонечноеЗначениеСчетчика;
		КонецЕсли;	
		
		Если НачальноеЗначениеСчетчика <> КонечноеЗначениеСчетчика Тогда
			ТекстЗапроса = "SELECT LineSwitch, ID FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch > ? AND LineSwitch <= ? ORDER BY LineSwitch";
			Command = Новый COMОбъект("ADODB.Command"); 
			Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
			Command.CommandText = ТекстЗапроса;
			
			Param1 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param1);
			Param1.Value = НачальноеЗначениеСчетчика;

			Param2 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param2);
			Param2.Value = КонечноеЗначениеСчетчика;
			
			RecordSet = Новый COMОбъект("ADODB.Recordset"); 
			RecordSet = Command.Execute();
			
			ПризнакИерархическийСправочник = ОпределитьСправочникИерархический(RecordSet, СтрокаМаппинга.Ссылка.ЗагружатьГруппыКакЭлементы);
			
			Пока НЕ RecordSet.EOF Цикл
				ЕРПМастерКлюч = Строка(СокрЛП(RecordSet.Fields("ID").Value));
				ТекущееЗначениеСчетчика = Число(СокрЛП(RecordSet.Fields("LineSwitch").Value));
				ЭтоНовый = ЛОЖЬ;
				
				ЭтоГруппа = ПризнакИерархическийСправочник И RecordSet.Fields("ItIsFolder").Value <> NULL И RecordSet.Fields("ItIsFolder").Value = ИСТИНА;
				УстановленаПометкаУдаления = ЛОЖЬ;
				
				ПараметрыОтбора = Новый Структура();
				ПараметрыОтбора.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
				ПараметрыОтбора.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
				ПараметрыОтбора.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
				
				НайденныеСтроки = СтруктураПараметров.ТаблицаЛогов.НайтиСтроки(ПараметрыОтбора);
				Если НайденныеСтроки.Количество() <> 0 Тогда
					МассивЭлементовСправочника = НайтиЭлементыСправочникаПоЕРПМастерКлючу(СтрокаМаппинга.ТипМетаданныхСправочника, ЕРПМастерКлюч, ЭтоНовый, ЭтоГруппа, УстановленаПометкаУдаления);
					Если НЕ ЭтоНовый Тогда
						Если МассивЭлементовСправочника.Количество() <> 0 Тогда
							СтруктураПараметровЛогирования = Новый Структура();
							СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
							СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
							СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
							СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
							СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
							Попытка
								Для Каждого ЭлементМассива Из МассивЭлементовСправочника Цикл
									ЭлементОбъект = ЭлементМассива;
									
									Запрос = Новый Запрос();
									Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
									               |	ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.ИмяТабличнойЧасти,
									               |	ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.НаименованиеТаблицыTPI
									               |ИЗ
									               |	Справочник.ЕРПМаппингДляЗагрузки.МаппингТабличнаяЧасть КАК ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть
												   |ГДЕ ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.Ссылка = &Ссылка И ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.Пометка
												   |УПОРЯДОЧИТЬ ПО ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.ИмяТабличнойЧасти";
									Запрос.УстановитьПараметр("Ссылка", СтрокаМаппинга.Ссылка);
									ТаблицаСписокТабличныхЧастей = Запрос.Выполнить().Выгрузить();
									
									ТекущееИмяТабличнойЧасти = "";
									Для Каждого СтрокаСписокТабличныхЧастей Из ТаблицаСписокТабличныхЧастей Цикл
										ТекстЗапроса = "SELECT * FROM " + СтрокаСписокТабличныхЧастей.НаименованиеТаблицыTPI + " WHERE LineSwitch = ?";
										Command = Новый COMОбъект("ADODB.Command"); 
										Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
										Command.CommandText = ТекстЗапроса;
										
										Param1 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
										Command.Parameters.Append(Param1);
										Param1.Value = ТекущееЗначениеСчетчика;

										RecordSetTable = Новый COMОбъект("ADODB.Recordset"); 
										RecordSetTable = Command.Execute();
										
										Если НЕ ЭлементОбъект.ЭтоГруппа Тогда
										ЭлементОбъект[СтрокаСписокТабличныхЧастей.ИмяТабличнойЧасти].Очистить();
										ТекущееИмяТабличнойЧасти = СтрокаСписокТабличныхЧастей.ИмяТабличнойЧасти;
										ТекущееНаименованиеТаблицыTPI = СтрокаСписокТабличныхЧастей.НаименованиеТаблицыTPI;
										
										Запрос = Новый Запрос();
										Запрос.Текст = "ВЫБРАТЬ
										               |	ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.НаименованиеТаблицыTPI,
										               |	ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.ИмяТабличнойЧасти,
										               |	ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.НаименованиеПоляTPI,
										               |	ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.ИмяРеквизита,
										               |	ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.ПоискПоНаименованию,
										               |	ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.ПроцедураМаппинга
										               |ИЗ
										               |	Справочник.ЕРПМаппингДляЗагрузки.МаппингТабличнаяЧасть КАК ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть
										               |ГДЕ
										               |	ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.Ссылка = &Ссылка
										               |	И ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.Пометка
										               |	И ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.ИмяТабличнойЧасти = &ИмяТабличнойЧасти
										               |	И ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.НаименованиеТаблицыTPI = &НаименованиеТаблицыTPI
										               |
										               |УПОРЯДОЧИТЬ ПО
										               |	ЕРПМаппингДляЗагрузкиМаппингТабличнаяЧасть.ИмяТабличнойЧасти";
										Запрос.УстановитьПараметр("Ссылка", СтрокаМаппинга.Ссылка);
										Запрос.УстановитьПараметр("ИмяТабличнойЧасти", ТекущееИмяТабличнойЧасти);
										Запрос.УстановитьПараметр("НаименованиеТаблицыTPI", ТекущееНаименованиеТаблицыTPI);
										ТаблицаРеквизитовТабличнойЧасти = Запрос.Выполнить().Выгрузить();
										
										Пока НЕ RecordSetTable.EOF Цикл
											НоваяСтрокаТабличнойЧасти = ЭлементОбъект[СтрокаСписокТабличныхЧастей.ИмяТабличнойЧасти].Добавить();
											
											Для Каждого РеквизитТабличнойЧасти Из ТаблицаРеквизитовТабличнойЧасти Цикл
												Если РеквизитТабличнойЧасти.ПроцедураМаппинга <> "" Тогда
													ВыполнитьПроцедуруМаппингаТабличнойЧасти(НоваяСтрокаТабличнойЧасти, СтрокаМаппинга, СтруктураПараметров, ЭлементОбъект, РеквизитТабличнойЧасти, RecordSetTable, ЭтоНовый);
												Иначе	
													КодОшибки = ЗаполнитьЗначениеРеквизитаТабличнойЧастиСправочника(ЭлементОбъект, НоваяСтрокаТабличнойЧасти, СтрокаСписокТабличныхЧастей.ИмяТабличнойЧасти, РеквизитТабличнойЧасти, ?(РеквизитТабличнойЧасти.НаименованиеПоляTPI = "", Неопределено, RecordSetTable.Fields(РеквизитТабличнойЧасти.НаименованиеПоляTPI).Value));
													Если КодОшибки <> 0 Тогда
														Если КодОшибки = 1 Тогда
															СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит табличной части " + СтрокаСписокТабличныхЧастей.ИмяТабличнойЧасти + ". Значение не найдено в справочнике. Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + РеквизитТабличнойЧасти.ИмяРеквизита + ".");
														ИначеЕсли КодОшибки = 2 Тогда
															СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит. Неизвестный тип реквизита табличной части " + СтрокаСписокТабличныхЧастей.ИмяТабличнойЧасти + ". Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + РеквизитТабличнойЧасти.ИмяРеквизита + ".");
														Иначе
															СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "");
														КонецЕсли;	
														СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
														ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
													КонецЕсли;	
												КонецЕсли;	
											КонецЦикла;
											
											RecordSetTable.MoveNext();
										КонецЦикла;
										КонецЕсли;
									КонецЦикла;
									
									Попытка
										ЭлементОбъект.ОбменДанными.Загрузка = Истина;
										ЭлементОбъект.Записать();
										
										СтруктураПараметровЛогирования.Вставить("Загружен", ИСТИНА);
										СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "");
										
										ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
									Исключение
										СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
										СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось записать. Настройка - " + СтрокаМаппинга.Ссылка + ". " + ОписаниеОшибки());
										
										ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
									КонецПопытки;
									
								КонецЦикла;	
							Исключение
								СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
								СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось установить/снять пометку удаления. Настройка - " + СтрокаМаппинга.Ссылка + ". " + ОписаниеОшибки());
								
								ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
							КонецПопытки;
						КонецЕсли;
					КонецЕсли;
				КонецЕсли;
				RecordSet.MoveNext();
			КонецЦикла;	
		КонецЕсли;	
	КонецЦикла;
КонецПроцедуры

Функция НайтиЭлементыСправочникаПоЕРПМастерКлючу(ТипМетаданныхСправочника, ЕРПМастерКлюч, ЭтоНовый, ЭтоГруппа, УстановленаПометкаУдаления = ЛОЖЬ)
	МассивЭлементовСправочника = Неопределено;
	
	Запрос = Новый Запрос();
	ТекстЗапроса = "ВЫБРАТЬ
	               |	СписокЭлементовСправочника.Ссылка
	               |ИЗ
	               |	Справочник.#ТипМетаданныхСправочника# КАК СписокЭлементовСправочника
	               |ГДЕ
	               |	СписокЭлементовСправочника.ЕРПМастерКлюч = &ЕРПМастерКлюч";
	ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "#ТипМетаданныхСправочника#", ТипМетаданныхСправочника);
	Запрос.Текст = ТекстЗапроса;
	Запрос.УстановитьПараметр("ЕРПМастерКлюч", ЕРПМастерКлюч);
				   
	МассивЭлементовСправочника = Новый Массив();
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Если НЕ УстановленаПометкаУдаления Тогда
			Если НЕ ЭтоГруппа Тогда 
				ЭлементОбъект = Справочники[ТипМетаданныхСправочника].СоздатьЭлемент(); 	
			Иначе	                                                  
				ЭлементОбъект = Справочники[ТипМетаданныхСправочника].СоздатьГруппу();
			КонецЕсли;	
			ID = Новый УникальныйИдентификатор();
			ЭлементОбъект.УстановитьСсылкуНового(Справочники[ТипМетаданныхСправочника].ПолучитьСсылку(ID));
			ЭлементОбъект.УстановитьНовыйКод();
			МассивЭлементовСправочника.Добавить(ЭлементОбъект);
		КонецЕсли;
		ЭтоНовый = ИСТИНА;
	Иначе
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			МассивЭлементовСправочника.Добавить(Выборка.Ссылка.ПолучитьОбъект());
		КонецЦикла;
	КонецЕсли;	
	
	Возврат(МассивЭлементовСправочника);
КонецФункции			

Процедура ВыполнитьПроцедуруМаппинга(СтруктураПараметров, ЭлементОбъект, Реквизит, RecordSet, ЭтоНовый)
	Попытка 		
		СтрокаБезПробелов = СтрЗаменить(Реквизит.ПроцедураМаппинга," ","");
		
		Если Найти(СтрокаБезПробелов,"ЭлементОбъект." + Реквизит.ИмяРеквизита + "=") = 0 Тогда
			Попытка
				Выполнить("ЭлементОбъект." + Реквизит.ИмяРеквизита + " = " + Реквизит.ПроцедураМаппинга);
			Исключение
				Выполнить(Реквизит.ПроцедураМаппинга);
			КонецПопытки;
		Иначе	
			Выполнить(Реквизит.ПроцедураМаппинга);
		КонецЕсли;
	Исключение       
		ОписаниеОшибки = ОписаниеОшибки();
		Выполнить("ЭлементОбъект." + Реквизит.ИмяРеквизита + " = " + Реквизит.ПроцедураМаппинга);
	КонецПопытки;
КонецПроцедуры
Процедура ВыполнитьПроцедуруМаппингаТабличнойЧасти(НоваяСтрокаТабличнойЧасти, СтрокаМаппинга, СтруктураПараметров, ЭлементОбъект, РеквизитТабличнойЧасти, RecordSetTable, ЭтоНовый)
	Выполнить(РеквизитТабличнойЧасти.ПроцедураМаппинга);
КонецПроцедуры

Функция ЗаполнитьЗначениеРеквизитаСправочника(ЭлементОбъект, Реквизит, ЗначениеTPI, ЭтоНовый)
	
	КодОшибки = 0;
	
	Если ЗначениеTPI = NUll Тогда
		Если НЕ Реквизит.ИмяРеквизита = "ОсновнойДоговорВзаиморасчетов" Тогда // dmboro - Надо разобраться с настройками, такого реквизита нет. Временно исключим из установки.
			ЭлементОбъект[Реквизит.ИмяРеквизита] = Неопределено;
		КонецЕсли;
		Возврат(КодОшибки);
	КонецЕсли;	
	
	//Проверки на пустое значение ЗначениеTPI
	РеквизитМетаданных = ЭлементОбъект.Метаданные().Реквизиты.Найти(Реквизит.ИмяРеквизита);
	Если РеквизитМетаданных = Неопределено Тогда
		Для Каждого СтандартныйРеквизитМетаданных Из ЭлементОбъект.Метаданные().СтандартныеРеквизиты Цикл
			Если СтандартныйРеквизитМетаданных.Имя = Реквизит.ИмяРеквизита Тогда
				РеквизитМетаданных = СтандартныйРеквизитМетаданных;
			КонецЕсли;	
		КонецЦикла;	
	КонецЕсли;	
	
	Если РеквизитМетаданных = Неопределено Тогда
		РеквизитМетаданных = ЭлементОбъект.Метаданные().Реквизиты.Найти(Реквизит.ИмяРеквизита);
	КонецЕсли;	
	
	Если РеквизитМетаданных = Неопределено Тогда
		РеквизитМетаданных = ЭлементОбъект.Метаданные().Реквизиты.Найти(Реквизит.ИмяРеквизита);
	КонецЕсли;		
	
	Если РеквизитМетаданных = Неопределено Тогда
		РеквизитМетаданных = Метаданные.ОбщиеРеквизиты.найти(Реквизит.ИмяРеквизита);
	КонецЕсли;
	
	Если НЕ ЭтоНовый И Реквизит.НеПерезаписыватьЗначение Тогда
		Отказ = ЗначениеЗаполнено(ЭлементОбъект[Реквизит.ИмяРеквизита]); 
		Если Отказ Тогда
			Возврат(КодОшибки);
		КонецЕсли;
	КонецЕсли;	
	
	Если РеквизитМетаданных = Неопределено Тогда
		// dmboro - Не найден реквизит. Сейчас пропустим.
	ИначеЕсли РеквизитМетаданных.Тип.СодержитТип(Тип("Число")) Тогда
		ЭлементОбъект[Реквизит.ИмяРеквизита] = Число(СокрЛП(ЗначениеTPI)); 
		// проверить на дробные
	ИначеЕсли РеквизитМетаданных.Тип.СодержитТип(Тип("Строка")) Тогда
		ЭлементОбъект[Реквизит.ИмяРеквизита] = Строка(СокрЛП(ЗначениеTPI)); 
	ИначеЕсли РеквизитМетаданных.Тип.СодержитТип(Тип("Дата")) Тогда
		ЭлементОбъект[Реквизит.ИмяРеквизита] = ЗначениеTPI; 
	ИначеЕсли РеквизитМетаданных.Тип.СодержитТип(Тип("Булево")) Тогда
		ЭлементОбъект[Реквизит.ИмяРеквизита] = ЗначениеTPI; 
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(ЭлементОбъект[Реквизит.ИмяРеквизита])) Тогда
		ОбъектМетаданныхЗначениеПеречисления = Метаданные.Перечисления[ЭлементОбъект[Реквизит.ИмяРеквизита].Метаданные().Имя].ЗначенияПеречисления.Найти(СокрЛП(ЗначениеTPI));
		Если ОбъектМетаданныхЗначениеПеречисления = Неопределено Тогда
			ОбъектМетаданныхЗначениеПеречисления = НайтиПоСинонимомуЗначениеПеречисления(ЭлементОбъект[Реквизит.ИмяРеквизита].Метаданные().Имя, СокрЛП(ЗначениеTPI));
			ЭлементОбъект[Реквизит.ИмяРеквизита] = ОбъектМетаданныхЗначениеПеречисления;
		Иначе	
			Если Строка(СокрЛП(ЗначениеTPI)) <> "" Тогда
				ЭлементОбъект[Реквизит.ИмяРеквизита] = Перечисления[ОбъектМетаданныхЗначениеПеречисления.Родитель().Имя][ОбъектМетаданныхЗначениеПеречисления.Имя];
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(ЭлементОбъект[Реквизит.ИмяРеквизита])) Тогда
		Если Строка(СокрЛП(ЗначениеTPI)) <> "" Тогда
			Если НЕ Реквизит.ПоискПоНаименованию Тогда
				ЭлементОбъект[Реквизит.ИмяРеквизита] = ПолучитьСсылкуНаЭлементСправочникаПоЕРПМастерКлючу(ЭлементОбъект[Реквизит.ИмяРеквизита].Метаданные().Имя, Строка(СокрЛП(ЗначениеTPI)));
			Иначе	
				ЭлементОбъект[Реквизит.ИмяРеквизита] = ПолучитьСсылкуНаЭлементСправочникаПоНаименованию(ЭлементОбъект[Реквизит.ИмяРеквизита].Метаданные().Имя, Строка(СокрЛП(ЗначениеTPI)));
			КонецЕсли;	
			
			Если ЭлементОбъект[Реквизит.ИмяРеквизита] = Справочники[ЭлементОбъект[Реквизит.ИмяРеквизита].Метаданные().Имя].ПустаяСсылка() Тогда
    			КодОшибки = 1;
			КонецЕсли;	
		КонецЕсли;	
	Иначе
    	КодОшибки = 2;
	КонецЕсли;
	
	Возврат(КодОшибки);
КонецФункции
Функция ЗаполнитьЗначениеРеквизитаТабличнойЧастиСправочника(ЭлементОбъект, СтрокаТабличнойЧасти, ИмяТабличнойЧасти, Реквизит, ЗначениеTPI)
	
	КодОшибки = 0;
	
	Если ЗначениеTPI = NUll Тогда
		СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита] = Неопределено;
		Возврат(КодОшибки);
	КонецЕсли;	
	
	//Проверки на пустое значение ЗначениеTPI
	РеквизитМетаданных = ЭлементОбъект.Метаданные().ТабличныеЧасти.Найти(ИмяТабличнойЧасти).Реквизиты.Найти(Реквизит.ИмяРеквизита);
	
	Если РеквизитМетаданных.Тип.СодержитТип(Тип("Число")) Тогда
		СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита] = Число(СокрЛП(ЗначениеTPI)); 
		// проверить на дробные
	ИначеЕсли РеквизитМетаданных.Тип.СодержитТип(Тип("Строка")) Тогда
		СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита] = Строка(СокрЛП(ЗначениеTPI)); 
	ИначеЕсли РеквизитМетаданных.Тип.СодержитТип(Тип("Дата")) Тогда
		СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита] = ЗначениеTPI; 
	ИначеЕсли РеквизитМетаданных.Тип.СодержитТип(Тип("Булево")) Тогда
		СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита] = ЗначениеTPI; 
	ИначеЕсли Перечисления.ТипВсеСсылки().СодержитТип(ТипЗнч(СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита])) Тогда
		ОбъектМетаданныхЗначениеПеречисления = Метаданные.Перечисления[СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита].Метаданные().Имя].ЗначенияПеречисления.Найти(СокрЛП(ЗначениеTPI));
		Если ОбъектМетаданныхЗначениеПеречисления = Неопределено Тогда
			ОбъектМетаданныхЗначениеПеречисления = НайтиПоСинонимомуЗначениеПеречисления(СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита].Метаданные().Имя, СокрЛП(ЗначениеTPI));
			СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита] = ОбъектМетаданныхЗначениеПеречисления;
		Иначе	
			Если Строка(СокрЛП(ЗначениеTPI)) <> "" Тогда
				СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита] = Перечисления[ОбъектМетаданныхЗначениеПеречисления.Родитель().Имя][ОбъектМетаданныхЗначениеПеречисления.Имя];
			КонецЕсли;	
		КонецЕсли;	
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипЗнч(СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита])) Тогда
		Если Строка(СокрЛП(ЗначениеTPI)) <> "" Тогда
			Если НЕ Реквизит.ПоискПоНаименованию Тогда
				СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита] = ПолучитьСсылкуНаЭлементСправочникаПоЕРПМастерКлючу(СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита].Метаданные().Имя, Строка(СокрЛП(ЗначениеTPI)));
			Иначе	
				СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита] = ПолучитьСсылкуНаЭлементСправочникаПоНаименованию(СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита].Метаданные().Имя, Строка(СокрЛП(ЗначениеTPI)));
			КонецЕсли;	
			
			Если СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита] = Справочники[СтрокаТабличнойЧасти[Реквизит.ИмяРеквизита].Метаданные().Имя].ПустаяСсылка() Тогда
    			КодОшибки = 1;
			КонецЕсли;	
		КонецЕсли;	
	Иначе
    	КодОшибки = 2;
	КонецЕсли;
	
	Возврат(КодОшибки);
КонецФункции

Функция НайтиПоСинонимомуЗначениеПеречисления(ИмяПеречисления, ИмяСинонима)    
    СсылкаНаПеречисление = Неопределено;
    
    КолекцияЗначенийПеречисления = Метаданные.Перечисления[ИмяПеречисления].ЗначенияПеречисления;
    Для каждого ЗначПерем из КолекцияЗначенийПеречисления Цикл
        Если ИмяСинонима = ЗначПерем.Синоним Тогда
            СсылкаНаПеречисление = Перечисления[ИмяПеречисления][ЗначПерем.Имя];
			Возврат(СсылкаНаПеречисление);
        КонецЕсли; 
    КонецЦикла;        

	Возврат(СсылкаНаПеречисление);
КонецФункции



Процедура ЗагрузитьПозициюНСИизTPI(СтруктураПараметров) Экспорт
	ДатаТранзакции = ТекущаяДата();
	
	COMОбъектSQL = ПодключитьсяКTPI(СтруктураПараметров.НастрокаПодключенияTPI);
	
	Если COMОбъектSQL <> Неопределено Тогда
		ТаблицаМаппингиДляЗагрузкиСправочников = ПолучитьМаппингиДляЗагрузкиПозицииСправочника(СтруктураПараметров);
		ТаблицаЛогов = ПолучитьСтруктуруТаблицыЛогов();
	
		СтруктураПараметров.Вставить("ТаблицаМаппингиДляЗагрузкиСправочников", ТаблицаМаппингиДляЗагрузкиСправочников);
		СтруктураПараметров.Вставить("ТаблицаЛогов", ТаблицаЛогов);
		//СтруктураПараметров.Вставить("ДатаТранзакции", ДатаТранзакции);
		СтруктураПараметров.Вставить("COMОбъектSQL", COMОбъектSQL);
		ПолучитьДатуНачалаТранзакцииSQL(СтруктураПараметров);
	
		ВыполнитьЗагрузкуПозицииСправочника(СтруктураПараметров);
		
		COMОбъектSQL.Close(); 
	КонецЕсли;	
	
	СтруктураПараметров = Неопределено;
	COMОбъектSQL = Неопределено;
КонецПроцедуры	
Функция ПолучитьМаппингиДляЗагрузкиПозицииСправочника(СтруктураПараметров)
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ЕРПМаппингДляЗагрузки.Ссылка,
	               |	ЕРПМаппингДляЗагрузки.Наименование,
	               |	ЕРПМаппингДляЗагрузки.ТекущееЗначениеСчетчика,
	               |	ЕРПМаппингДляЗагрузки.НастройкаПодключенияTPI,
	               |	ЕРПМаппингДляЗагрузки.НаименованиеТаблицыTPI,
	               |	ЕРПМаппингДляЗагрузки.ТипМетаданныхСправочника,
	               |	ЕРПМаппингДляЗагрузки.НеЗагружатьНовыеЭлементыВСправочник,
	               |	ЕРПМаппингДляЗагрузки.УсловиеОтбора
	               |ИЗ
	               |	Справочник.ЕРПМаппингДляЗагрузки КАК ЕРПМаппингДляЗагрузки
	               |ГДЕ
	               |	НЕ ЕРПМаппингДляЗагрузки.ПометкаУдаления
	               |	И ЕРПМаппингДляЗагрузки.ОбменНСИ
	               |    И ЕРПМаппингДляЗагрузки.НаименованиеТаблицыTPI = &НаименованиеТаблицыTPI
	               |УПОРЯДОЧИТЬ ПО
	               |	ЕРПМаппингДляЗагрузки.ПорядокЗагрузки";
	Запрос.УстановитьПараметр("НаименованиеТаблицыTPI", СтруктураПараметров.НаименованиеТаблицыTPI);
	ТаблицаДляВозврата = Запрос.Выполнить().Выгрузить();
	
	Возврат(ТаблицаДляВозврата);
КонецФункции
Функция ПолучитьМаксимальныйПорядокЗагрузкиПозицииСправочника(СтруктураПараметров)
	ЗначениеДляВозврата = 1;
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕСТЬNULL(МАКСИМУМ(ЕРПМаппингДляЗагрузки.ПорядокЗагрузки), 0) КАК ПорядокЗагрузки
	               |ИЗ
	               |	Справочник.ЕРПМаппингДляЗагрузки.Маппинг КАК ЕРПМаппингДляЗагрузки
	               |ГДЕ
	               |	НЕ ЕРПМаппингДляЗагрузки.Ссылка.ПометкаУдаления
	               |	И ЕРПМаппингДляЗагрузки.Ссылка.ОбменНСИ
				   |	И ЕРПМаппингДляЗагрузки.Ссылка.НаименованиеТаблицыTPI = &НаименованиеТаблицыTPI
	               |	И ЕРПМаппингДляЗагрузки.Пометка";
	Запрос.УстановитьПараметр("НаименованиеТаблицыTPI", СтруктураПараметров.НаименованиеТаблицыTPI);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Если Выборка.Следующий() Тогда
			ЗначениеДляВозврата = Выборка.ПорядокЗагрузки;
		КонецЕсли;
	КонецЕсли;
	
	Возврат(ЗначениеДляВозврата);
КонецФункции
Процедура ВыполнитьЗагрузкуПозицииСправочника(СтруктураПараметров)
	МаксимальныйПорядокЗагрузкиСправочников = ПолучитьМаксимальныйПорядокЗагрузкиПозицииСправочника(СтруктураПараметров);
	сч = 1;
	Пока сч <= МаксимальныйПорядокЗагрузкиСправочников Цикл
		Попытка
			ВыполнитьПроходЗагрузкиПозицииСправочника(СтруктураПараметров, сч);
		Исключение
			СтруктураПараметровЛогирования = Новый Структура();
			СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
			СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
			СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
			СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Неизвестная ошибка. Проход - " + сч + ". " + ОписаниеОшибки());
			
			ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
		КонецПопытки;
		
		сч = сч + 1;
	КонецЦикла;	
	
	Попытка
		ВыполнитьОбработкуЗагрузкиПометкиНаУдаленияПозицииСправочника(СтруктураПараметров);
	Исключение
		СтруктураПараметровЛогирования = Новый Структура();
		СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
		СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
		СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
		СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Ошибка пометки на удаление. " + ОписаниеОшибки());
		
		ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
	КонецПопытки;
	
	ЗаписатьТаблицуЛогов(СтруктураПараметров);
КонецПроцедуры	
Процедура ВыполнитьПроходЗагрузкиПозицииСправочника(СтруктураПараметров, ТекущийПорядокЗагрузкиСправочников)
	Для Каждого СтрокаМаппинга Из СтруктураПараметров.ТаблицаМаппингиДляЗагрузкиСправочников Цикл
		ТаблицаРеквизитовСправочника = ПолучитьСписокРеквизитовСправочников(СтрокаМаппинга.Ссылка, ТекущийПорядокЗагрузкиСправочников);
		ТекущееЗначениеСчетчика = СтруктураПараметров.Счетчик;
		
		ТекстЗапроса = "SELECT * FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch = ? ORDER BY LineSwitch";
		Command = Новый COMОбъект("ADODB.Command"); 
		Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
		Command.CommandText = ТекстЗапроса;
		
		Param1 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
		Command.Parameters.Append(Param1);
		Param1.Value = ТекущееЗначениеСчетчика;

		RecordSet = Новый COMОбъект("ADODB.Recordset"); 
		RecordSet = Command.Execute();
		
		ПризнакИерархическийСправочник = ОпределитьСправочникИерархический(RecordSet, СтрокаМаппинга.Ссылка.ЗагружатьГруппыКакЭлементы);
		
		Пока НЕ RecordSet.EOF Цикл
			ЕРПМастерКлюч = Строка(СокрЛП(RecordSet.Fields("ID").Value));
			
			Если RecordSet.Fields("ID").Value = NULL Тогда
				СтруктураПараметровЛогирования = Новый Структура();
				СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
				СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
				СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", "");
				СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
				СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
				СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
				СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
				СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не указан Мастер-ключ!");
				ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
				RecordSet.MoveNext();
				
				Продолжить;
			КонецЕсли;	
			
			ЭтоГруппа = ПризнакИерархическийСправочник И RecordSet.Fields("ItIsFolder").Value <> NULL И RecordSet.Fields("ItIsFolder").Value = ИСТИНА;
			
			ЭтоНовый = ЛОЖЬ;
			МассивЭлементовСправочника = НайтиЭлементыСправочникаПоЕРПМастерКлючу(СтрокаМаппинга.ТипМетаданныхСправочника, ЕРПМастерКлюч, ЭтоНовый, ЭтоГруппа);
			
			Если Не ЭтоГруппа Тогда
				УдовлетворяетУсловиямОтбора = ИСТИНА;
				Если СтрокаМаппинга.УсловиеОтбора <> "" Тогда
					Выполнить(СтрокаМаппинга.УсловиеОтбора);
				КонецЕсли;	
				
				Если (ЭтоНовый И СтрокаМаппинга.НеЗагружатьНовыеЭлементыВСправочник) ИЛИ НЕ УдовлетворяетУсловиямОтбора Тогда
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("Актуальность", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", ?(НЕ УдовлетворяетУсловиямОтбора, "Не удовлетворяет условиям отбора!", "Установлен признак: не загружать новые элементы в справочник!"));
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					RecordSet.MoveNext();
					
					Продолжить;
				КонецЕсли;	
			КонецЕсли;	
				
			Если МассивЭлементовСправочника.Количество() <> 0 Тогда
				СтруктураПараметровЛогирования = Новый Структура();
				СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
				СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
				СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
				СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
				СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
				Попытка
					Для Каждого ЭлементМассива Из МассивЭлементовСправочника Цикл
						ЭлементОбъект = ЭлементМассива;
						
						Для Каждого Реквизит Из ТаблицаРеквизитовСправочника Цикл
							Если Не ЭтоГруппа ИЛИ (ЭтоГруппа И Реквизит.ЗаполнятьДляГруппы) Тогда
								Если Реквизит.ПроцедураМаппинга <> "" Тогда
									ВыполнитьПроцедуруМаппинга(СтруктураПараметров, ЭлементОбъект, Реквизит, RecordSet, ЭтоНовый);
								Иначе	
									КодОшибки = ЗаполнитьЗначениеРеквизитаСправочника(ЭлементОбъект, Реквизит, ?(Реквизит.НаименованиеПоляTPI = "", Неопределено, RecordSet.Fields(Реквизит.НаименованиеПоляTPI).Value), ЭтоНовый);
									Если КодОшибки <> 0 Тогда
										Если КодОшибки = 1 Тогда
											СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит. Значение не найдено в справочнике. Проход - " + ТекущийПорядокЗагрузкиСправочников + ". Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + Реквизит.ИмяРеквизита + ".");
										ИначеЕсли КодОшибки = 2 Тогда
											СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит. Неизвестный тип реквизита. Проход - " + ТекущийПорядокЗагрузкиСправочников + ". Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + Реквизит.ИмяРеквизита + ".");
										Иначе
											СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "");
										КонецЕсли;	
										СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
										ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
									КонецЕсли;	
								КонецЕсли;	
							КонецЕсли;	
						КонецЦикла;
						
						Попытка
							ЭлементОбъект.ОбменДанными.Загрузка = Истина;
							ЭлементОбъект.Записать();
							
							СтруктураПараметровЛогирования.Вставить("Загружен", ИСТИНА);
							СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "");
							
							ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
						Исключение
							СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
							СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось записать. Проход - " + ТекущийПорядокЗагрузкиСправочников + ". Настройка - " + СтрокаМаппинга.Ссылка + ". " + ОписаниеОшибки());
							
							ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
						КонецПопытки;
					КонецЦикла;	
				Исключение
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось распарсить реквизит. Проход - " + ТекущийПорядокЗагрузкиСправочников + ". Настройка - " + СтрокаМаппинга.Ссылка + "; Реквизит - " + Реквизит.ИмяРеквизита + ". " + ОписаниеОшибки());
					
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
				КонецПопытки;
			КонецЕсли;	
			RecordSet.MoveNext();
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры
Процедура ВыполнитьОбработкуЗагрузкиПометкиНаУдаленияПозицииСправочника(СтруктураПараметров)
	Для Каждого СтрокаМаппинга Из СтруктураПараметров.ТаблицаМаппингиДляЗагрузкиСправочников Цикл
		ТекущееЗначениеСчетчика = СтруктураПараметров.Счетчик;
		
		ТекстЗапроса = "SELECT LineSwitch, ID, DeletedMark FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch = ? ORDER BY LineSwitch";
		Command = Новый COMОбъект("ADODB.Command"); 
		Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
		Command.CommandText = ТекстЗапроса;
		
		Param1 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
		Command.Parameters.Append(Param1);
		Param1.Value = ТекущееЗначениеСчетчика;

		RecordSet = Новый COMОбъект("ADODB.Recordset"); 
		RecordSet = Command.Execute();
		
		ПризнакИерархическийСправочник = ОпределитьСправочникИерархический(RecordSet, СтрокаМаппинга.Ссылка.ЗагружатьГруппыКакЭлементы);
		
		Пока НЕ RecordSet.EOF Цикл
			ЕРПМастерКлюч = Строка(СокрЛП(RecordSet.Fields("ID").Value));
			
			ЭтоГруппа = ПризнакИерархическийСправочник И RecordSet.Fields("ItIsFolder").Value <> NULL И RecordSet.Fields("ItIsFolder").Value = ИСТИНА;
			ЭтоНовый = ЛОЖЬ;
			
			ПараметрыОтбора = Новый Структура();
			ПараметрыОтбора.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
			ПараметрыОтбора.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
			ПараметрыОтбора.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
			
			НайденныеСтроки = СтруктураПараметров.ТаблицаЛогов.НайтиСтроки(ПараметрыОтбора);
			Если НайденныеСтроки.Количество() <> 0 И НайденныеСтроки[0].Загружен Тогда
				МассивЭлементовСправочника = НайтиЭлементыСправочникаПоЕРПМастерКлючу(СтрокаМаппинга.ТипМетаданныхСправочника, ЕРПМастерКлюч, ЭтоНовый, ЭтоГруппа);
				Если МассивЭлементовСправочника.Количество() <> 0 Тогда
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					Попытка
						Для Каждого ЭлементМассива Из МассивЭлементовСправочника Цикл
							ЭлементОбъект = ЭлементМассива;
							Если RecordSet.Fields("DeletedMark").Value = NULL ИЛИ НЕ RecordSet.Fields("DeletedMark").Value И ЭлементОбъект.ПометкаУдаления Тогда
								ЭлементОбъект.ОбменДанными.Загрузка = Истина;
								ЭлементОбъект.УстановитьПометкуУдаления(ЛОЖЬ);
							ИначеЕсли RecordSet.Fields("DeletedMark").Value И НЕ ЭлементОбъект.ПометкаУдаления Тогда
								ЭлементОбъект.ОбменДанными.Загрузка = Истина;
								ЭлементОбъект.УстановитьПометкуУдаления(ИСТИНА);
							КонецЕсли;	
						КонецЦикла;	
					Исключение
						СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
						СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось установить/снять пометку удаления. Настройка - " + СтрокаМаппинга.Ссылка + ". " + ОписаниеОшибки());
						
						ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					КонецПопытки;
				КонецЕсли;
			КонецЕсли;
			RecordSet.MoveNext();
		КонецЦикла;	
	КонецЦикла;
КонецПроцедуры	

Процедура КомандаНаВыгрузкуИзНСИ(ТипСправочника,РеквизитПоиска,ЗначениеПоиска) Экспорт
	
	СтруктураПараметровПодключения = Новый Структура();
	СтруктураПараметровПодключения.Вставить("Пользователь", "ws");
	СтруктураПараметровПодключения.Вставить("Пароль", "ws");
	СтруктураПараметровПодключения.Вставить("URIПространстваИменСервиса","UniversalDataTransfer");
	СтруктураПараметровПодключения.Вставить("ИмяСервиса","UniversalDataTransfer");
	СтруктураПараметровПодключения.Вставить("Адрес","http://wwwserv.work.local/erp/ws/UniversalDataTransfer?wsdl");
	СтруктураПараметровПодключения.Вставить("ИмяФункции","UnloadData");  
	
	ВСОпределение = Новый WSОпределения(СтруктураПараметровПодключения.Адрес, СтруктураПараметровПодключения.Пользователь, СтруктураПараметровПодключения.Пароль);
	ВСПрокси = Новый WSПрокси(ВСОпределение, СтруктураПараметровПодключения.URIПространстваИменСервиса,СтруктураПараметровПодключения.ИмяСервиса,СтруктураПараметровПодключения.ИмяСервиса + "Soap", 900); 
	ВСПрокси.Пользователь = СтруктураПараметровПодключения.Пользователь;
	ВСПрокси.Пароль = СтруктураПараметровПодключения.Пароль;

	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("ТипСправочника", ТипСправочника);	
	СтруктураПараметров.Вставить("РеквизитПоиска", РеквизитПоиска);	
	СтруктураПараметров.Вставить("ЗначениеПоиска", ЗначениеПоиска);	
	
	СтруктураПараметров.Вставить("ИмяОбработки", "Управление обменом ТПИ");
	
	ХранилищеЗначения = СериализаторXDTO.ЗаписатьXDTO(СтруктураПараметров);	
	
	Ответ = ВСПрокси.UnloadData("ВыгрузитьВТПИ",ХранилищеЗначения);
		
КонецПроцедуры	

Функция КомандаНаВыгрузкуИзНСИКонтрольЕИиПолучитьКодОбмена(КодНоменклатуры,КодКлассификатора, Номенклатура) Экспорт
	
	СтруктураПараметровПодключения = Новый Структура();
	СтруктураПараметровПодключения.Вставить("Пользователь", "ws");
	СтруктураПараметровПодключения.Вставить("Пароль", "ws");
	СтруктураПараметровПодключения.Вставить("URIПространстваИменСервиса","UniversalDataTransfer");
	СтруктураПараметровПодключения.Вставить("ИмяСервиса","UniversalDataTransfer");
	СтруктураПараметровПодключения.Вставить("Адрес","http://wwwserv.work.local/erp/ws/UniversalDataTransfer?wsdl");
	СтруктураПараметровПодключения.Вставить("ИмяФункции","UnloadData");  
	
	ВСОпределение = Новый WSОпределения(СтруктураПараметровПодключения.Адрес, СтруктураПараметровПодключения.Пользователь, СтруктураПараметровПодключения.Пароль);
	ВСПрокси = Новый WSПрокси(ВСОпределение, СтруктураПараметровПодключения.URIПространстваИменСервиса,СтруктураПараметровПодключения.ИмяСервиса,СтруктураПараметровПодключения.ИмяСервиса + "Soap", 900); 
	ВСПрокси.Пользователь = СтруктураПараметровПодключения.Пользователь;
	ВСПрокси.Пароль = СтруктураПараметровПодключения.Пароль;

	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("КодКлассификатора", КодКлассификатора);	
	СтруктураПараметров.Вставить("КодНоменклатуры", КодНоменклатуры);	
	
	СтруктураПараметров.Вставить("ИмяОбработки", "Управление обменом ТПИ");
	
	ХранилищеЗначения = СериализаторXDTO.ЗаписатьXDTO(СтруктураПараметров);	
	
	Ответ = ВСПрокси.UnloadData("КонтрольЕИиПолучитьКодОбмена",ХранилищеЗначения);
	
	СтруктураОтвета = СериализаторXDTO.ПрочитатьXDTO(Ответ);
	
	Если НЕ СтруктураОтвета.ЕстьОшибки Тогда
		ЕРПМастерКлюч = СтруктураОтвета.ЕРПМастерКлюч;
		Если ЗначениеЗаполнено(ЕРПМастерКлюч) Тогда
			ТекЕдиница = Номенклатура.ОсновнаяЕдиницаИзмерения;
			Если ЗначениеЗаполнено(ТекЕдиница) Тогда
				НайденнаяЕдиница = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту("ЕРПМастерКлюч",ЕРПМастерКлюч,, Номенклатура); 
				Если НЕ НайденнаяЕдиница = ТекЕдиница и НЕ НайденнаяЕдиница.Пустая() Тогда 
					НоменклатураОбъект = Номенклатура.ПолучитьОбъект();
					НоменклатураОбъект.ОсновнаяЕдиницаИзмерения = НайденнаяЕдиница;
					НоменклатураОбъект.ОбменДанными.Загрузка = Истина;
					НоменклатураОбъект.Записать();
					Возврат 0;
				КонецЕсли;
				
				ТекЕдиницаОбъект = ТекЕдиница.ПолучитьОбъект();
				ТекЕдиницаОбъект.ЕдиницаПоКлассификатору = Номенклатура.БазоваяЕдиницаИзмерения;
				ТекЕдиницаОбъект.Наименование = ТекЕдиницаОбъект.ЕдиницаПоКлассификатору.Наименование;
				ТекЕдиницаОбъект.Коэффициент = 1;
				ТекЕдиницаОбъект.ЕРПМастерКлюч = ЕРПМастерКлюч;
				ТекЕдиницаОбъект.ОбменДанными.Загрузка = Истина;
				ТекЕдиницаОбъект.Записать();
			КонецЕсли;	
		КонецЕСли;	
	КонецЕсли;	
		
КонецФункции	

//Мальцев А.Ю. 02.02.2021 +++
//Перенос механизмов загрузки ШК в общее задание по загрузке НСИ
Функция ПолучитьТаблицыМаппингаДляЗагрузки()
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЕРПМаппингДляЗагрузки.Ссылка КАК Ссылка,
	               |	ЕРПМаппингДляЗагрузки.Наименование КАК Наименование,
	               |	ЕРПМаппингДляЗагрузки.ТекущееЗначениеСчетчика КАК ТекущееЗначениеСчетчика,
	               |	ЕРПМаппингДляЗагрузки.НастройкаПодключенияTPI КАК НастройкаПодключенияTPI,
	               |	ЕРПМаппингДляЗагрузки.НаименованиеТаблицыTPI КАК НаименованиеТаблицыTPI,
	               |	ЕРПМаппингДляЗагрузки.ТипМетаданныхСправочника КАК ТипМетаданныхСправочника,
	               |	ЕРПМаппингДляЗагрузки.НеЗагружатьНовыеЭлементыВСправочник КАК НеЗагружатьНовыеЭлементыВСправочник,
	               |	ЕРПМаппингДляЗагрузки.УсловиеОтбора КАК УсловиеОтбора
	               |ИЗ
	               |	Справочник.ЕРПМаппингДляЗагрузки КАК ЕРПМаппингДляЗагрузки
	               |ГДЕ
	               |	НЕ ЕРПМаппингДляЗагрузки.ПометкаУдаления
	               |	И ЕРПМаппингДляЗагрузки.ОбменНСИ
	               |	И НЕ ЕРПМаппингДляЗагрузки.ЭтоРегистрСведений
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЕРПМаппингДляЗагрузки.ПорядокЗагрузки
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕРПМаппингДляЗагрузки.Ссылка КАК Ссылка,
	               |	ЕРПМаппингДляЗагрузки.Наименование КАК Наименование,
	               |	ЕРПМаппингДляЗагрузки.ТекущееЗначениеСчетчика КАК ТекущееЗначениеСчетчика,
	               |	ЕРПМаппингДляЗагрузки.НастройкаПодключенияTPI КАК НастройкаПодключенияTPI,
	               |	ЕРПМаппингДляЗагрузки.НаименованиеТаблицыTPI КАК НаименованиеТаблицыTPI,
	               |	ЕРПМаппингДляЗагрузки.ТипМетаданныхСправочника КАК ТипМетаданныхСправочника,
	               |	ЕРПМаппингДляЗагрузки.НеЗагружатьНовыеЭлементыВСправочник КАК НеЗагружатьНовыеЭлементыВСправочник,
	               |	ЕРПМаппингДляЗагрузки.УсловиеОтбора КАК УсловиеОтбора
	               |ИЗ
	               |	Справочник.ЕРПМаппингДляЗагрузки КАК ЕРПМаппингДляЗагрузки
	               |ГДЕ
	               |	НЕ ЕРПМаппингДляЗагрузки.ПометкаУдаления
	               |	И ЕРПМаппингДляЗагрузки.ОбменНСИ
	               |	И ЕРПМаппингДляЗагрузки.ЭтоРегистрСведений
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ЕРПМаппингДляЗагрузки.ПорядокЗагрузки";
	
	РезультатЗапроса   = Запрос.ВыполнитьПакет();
	
	ТаблицаДляВозвратаСп = РезультатЗапроса[0].Выгрузить();
	ТаблицаДляВозвратаШк = РезультатЗапроса[1].Выгрузить();

	стТаблиц = Новый Структура;
	стТаблиц.Вставить("ТаблицаДляВозвратаСп", ТаблицаДляВозвратаСп);
	стТаблиц.Вставить("ТаблицаДляВозвратаШк", ТаблицаДляВозвратаШк);

	Возврат стТаблиц;
	
КонецФункции

Процедура ВыполнитьЗагрузкуШК(СтруктураПараметров)
	Для Каждого СтрокаМаппинга Из СтруктураПараметров.ТаблицаМаппингиДляЗагрузкиШтрихкодов Цикл
		
		Если СтрокаМаппинга.ТипМетаданныхСправочника = "Штрихкоды" Тогда
			#Область Штирхкоды
			НачальноеЗначениеСчетчика = СтрокаМаппинга.ТекущееЗначениеСчетчика;
			КонечноеЗначениеСчетчика = СтрокаМаппинга.ТекущееЗначениеСчетчика;
			
			ТаблицаРеквизитовСправочника = ПолучитьСписокРеквизитовСправочников(СтрокаМаппинга.Ссылка, 1);
			
			ТекстЗапроса = "SELECT * FROM
			| (SELECT Barcode,Nomenclature, MAX(LineSwitch) AS MaxLineSwitch FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch > ? AND DATEINSERT <= ?
			|  GROUP BY Barcode, Nomenclature) TableMaxLine 
			|  INNER JOIN " + СтрокаМаппинга.НаименованиеТаблицыTPI + " Dat ON TableMaxLine.Barcode = Dat.Barcode AND TableMaxLine.Nomenclature = Dat.Nomenclature AND TableMaxLine.MaxLineSwitch = Dat.LineSwitch
			|  ORDER BY LineSwitch";
			
			
			Command = Новый COMОбъект("ADODB.Command"); 
			Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
			Command.CommandText = ТекстЗапроса;
			
			Param1 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param1);
			Param1.Value = СтрокаМаппинга.ТекущееЗначениеСчетчика;

			Param2 = Command.CreateParameter("DATEINSERT", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param2);
			Param2.Value = СтруктураПараметров.ДатаТранзакции;
			
			RecordSet = Новый COMОбъект("ADODB.Recordset"); 
			RecordSet = Command.Execute();
			
			ПризнакИерархическийСправочник = Ложь;
	 
			Пока НЕ RecordSet.EOF Цикл
				ЕРПМастерКлюч = Строка(СокрЛП(RecordSet.Fields("Nomenclature").Value));
				КонечноеЗначениеСчетчика = Число(СокрЛП(RecordSet.Fields("LineSwitch").Value));
				ТекущееЗначениеСчетчика = Число(СокрЛП(RecordSet.Fields("LineSwitch").Value));
				
				Если RecordSet.Fields("Barcode").Value = NULL Тогда
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", "");
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не указан ШК для номенклатуры - " + RecordSet.Fields("Nomenclature").Value + "!");
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					RecordSet.MoveNext();
					
					Продолжить;
				КонецЕсли;	
				
				УстановленаПометкаУдаления = ЛОЖЬ;
				Если RecordSet.Fields("DeletedMark").Value <> NULL Тогда
					УстановленаПометкаУдаления = RecordSet.Fields("DeletedMark").Value;
				КонецЕсли;
				
				ЭтоНовый = ЛОЖЬ;
				//МассивЭлементовСправочника = НайтиЭлементыСправочникаПоЕРПМастерКлючу(СтрокаМаппинга.ТипМетаданныхСправочника, ЕРПМастерКлюч, ЭтоНовый, ЭтоГруппа, УстановленаПометкаУдаления);
				МассивЭлементовСправочника = Новый Массив();
				спрНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("ЕРПМастерКлюч", ЕРПМастерКлюч);
				
				Если НЕ спрНоменклатура.Пустая() Тогда
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					
					Barcode = СокрЛП(RecordSet.Fields("Barcode").Value);
					
					Если Не ЗначениеЗаполнено(Barcode) Тогда
						СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
						СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
						СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Пустой ШК! Загрузка не возможна!");
						ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					КонецЕсли;	
					
					Запрос = Новый Запрос("ВЫБРАТЬ
					|	Штрихкоды.Штрихкод КАК Штрихкод,
					|	Штрихкоды.Объект КАК Объект,
					|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
					|	Штрихкоды.ОсновнойШтрихкод КАК ОсновнойШтрихкод
					|ИЗ
					|	РегистрСведений.Штрихкоды КАК Штрихкоды
					|ГДЕ
					|	Штрихкоды.Штрихкод = &Штрихкод
					|	И НЕ Штрихкоды.Объект = &Объект");
					
					Запрос.УстановитьПараметр("Штрихкод",Barcode);
					Запрос.УстановитьПараметр("Объект",спрНоменклатура);
					ВыборкаШК = Запрос.Выполнить().Выбрать();
					
					Если ВыборкаШК.Следующий() Тогда
						СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
						СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
						СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "ШК - " + Barcode + " уже установлен у номенклатуры -" +  ВыборкаШК.Объект.ЕРПМастерКлюч);
						ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
						
						RecordSet.MoveNext();
						Продолжить;
					КонецЕсли;					
					
					УникальныйШК = ПроверитьУникальностьШК(Barcode, спрНоменклатура);
					Если Не УникальныйШК И Не УстановленаПометкаУдаления Тогда						
						СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
						СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
						СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "ШК - " + Barcode + " попытка добавления существующего штрихкода для номенклатуры " +  спрНоменклатура.ЕРПМастерКлюч);
						ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
						
						RecordSet.MoveNext();
						Продолжить;										
					КонецЕсли;
					
					Попытка
						Если УстановленаПометкаУдаления Тогда
							
							ОсновнойШК = Ложь;
							
							Запрос = Новый Запрос("ВЫБРАТЬ
							|	Штрихкоды.Штрихкод КАК Штрихкод,
							|	Штрихкоды.Объект КАК Объект,
							|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
							|	Штрихкоды.ОсновнойШтрихкод КАК ОсновнойШтрихкод
							|ИЗ
							|	РегистрСведений.Штрихкоды КАК Штрихкоды
							|ГДЕ
							|	НЕ Штрихкоды.Штрихкод = &Штрихкод
							|	И Штрихкоды.Объект = &Объект");
							
							Запрос.УстановитьПараметр("Штрихкод",Barcode);
							Запрос.УстановитьПараметр("Объект",спрНоменклатура);
							ВыборкаШК = Запрос.Выполнить().Выбрать();
							
							Если ВыборкаШК.Следующий() Тогда
								
								Запрос = Новый Запрос("ВЫБРАТЬ
								|	Штрихкоды.Штрихкод КАК Штрихкод,
								|	Штрихкоды.Объект КАК Объект,
								|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
								|	Штрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,						
								|	Штрихкоды.ОсновнойШтрихкод КАК ОсновнойШтрихкод
								
								|ИЗ
								|	РегистрСведений.Штрихкоды КАК Штрихкоды
								|ГДЕ
								|	Штрихкоды.Штрихкод = &Штрихкод
								|	И Штрихкоды.Объект = &Объект");
								
								Запрос.УстановитьПараметр("Штрихкод",Barcode);
								Запрос.УстановитьПараметр("Объект",спрНоменклатура);
								ВыборкаШК = Запрос.Выполнить().Выбрать();
							
								Если ВыборкаШК.Следующий() Тогда	
									
									ОсновнойШК = ВыборкаШК.ОсновнойШтрихкод;
									
									регШК = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
									регШК.Отбор.Объект.Установить(спрНоменклатура);
									регШК.Отбор.ЕдиницаИзмерения.Установить(ВыборкаШК.ЕдиницаИзмерения);
									регШК.Отбор.Штрихкод.Установить(Barcode);
									регШК.Отбор.ХарактеристикаНоменклатуры.Установить(ВыборкаШК.ХарактеристикаНоменклатуры);
									регШК.Записать();
								КонецЕсли;
								
							Иначе
								
								ОсновнойШК = Истина;

								регШК = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
								регШК.Отбор.Объект.Установить(спрНоменклатура);
								регШК.Отбор.Штрихкод.Установить(Barcode);
								регШК.Прочитать();
								Для каждого стррегШК из регШК Цикл
									регШК.Удалить(стррегШК);
									//стррегШК = "";
								КонецЦикла;	
								регШК.Записать();
								
							КонецЕсли;	
							
							
							//Если удаляем основной ШК, то нужно проверить остались ли ШК с признаком
							Если ОсновнойШК Тогда							
								ПроверитьУстановитьОсновнойШтрихкодПриУдалении(спрНоменклатура);
							КонецЕсли;
							
						Иначе
							
							ЕдиницаИзмерения = спрНоменклатура.ОсновнаяЕдиницаИзмерения;
							Если RecordSet.Fields("Package").Value <> NULL Тогда
								МастерКлючЕД_Изм = СокрЛП(RecordSet.Fields("Package").Value);
								ЕдиницаИзмерения = Справочники.ЕдиницыИзмерения.НайтиПоРеквизиту("ЕРПМастерКлюч", МастерКлючЕД_Изм);
							КонецЕсли;
							
							ОсновнойШтрихкод = ПолучитьПризнакОсновногоШтрихКода(спрНоменклатура, Barcode, RecordSet.Fields("BarcodeType").Value);
							
							регШК = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
							регШК.Отбор.Объект.Установить(спрНоменклатура);
							регШК.Отбор.Штрихкод.Установить("");
							регШК.Записать();
													
							регШК = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
							регШК.Объект 			  = спрНоменклатура;
							регШК.Штрихкод 			  = Barcode;
							регШК.ОсновнойШтрихкод 	  = ОсновнойШтрихкод;
							регШК.ЕдиницаИзмерения 	  = ЕдиницаИзмерения;
							
							регШК.ЕРПЗначениеСчетчика = ТекущееЗначениеСчетчика;
							
							регШК.Записать(Истина);
							
							мНоменклатуры = Новый Массив;
							мНоменклатуры.Добавить(спрНоменклатура);
							ОбменДаннымиСобытия.ЗарегистрироватьИзмененияРегистраТоварыВОборудовании(мНоменклатуры);
							
							Если ОсновнойШтрихкод Тогда
								регШК = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
								регШК.Отбор.Объект.Установить(спрНоменклатура);
								регШК.Прочитать();
								Если регШК.Количество() > 1 Тогда
									Для Каждого стрШК Из регШК Цикл
										Если стрШК.Штрихкод <> Barcode Тогда
											стрШК.ОсновнойШтрихкод = Ложь;
										КонецЕсли;	
									КонецЦикла;
									регШК.Записать();
								КонецЕсли;
							КонецЕсли;
						КонецЕсли;	
						
						СтруктураПараметровЛогирования.Вставить("Загружен", ИСТИНА);
						СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "");
						
						ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
						
					Исключение
						СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
						СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
						СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось записать ШК. Проход - 1. Настройка - " + СтрокаМаппинга.Ссылка + ". " + ОписаниеОшибки());
						ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					КонецПопытки;
					
				Иначе	
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", ЕРПМастерКлюч);
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("Актуальность", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Номенклатура не найдена!");
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
				КонецЕсли;
				
				RecordSet.MoveNext();
			КонецЦикла;	
			
			//ЗаполнитьЕдИзмеренияШтрихкодов();

			Если НачальноеЗначениеСчетчика <> КонечноеЗначениеСчетчика Тогда
				НоваяСтрокаЗагруженныйСправочник = СтруктураПараметров.ТаблицаЗагруженныхСправочников.Добавить();
				НоваяСтрокаЗагруженныйСправочник.НачальноеЗначениеСчетчика = СтрокаМаппинга.ТекущееЗначениеСчетчика;
				НоваяСтрокаЗагруженныйСправочник.ЕРПМаппингДляЗагрузки = СтрокаМаппинга.Ссылка;
				НоваяСтрокаЗагруженныйСправочник.КонечноеЗначениеСчетчика = КонечноеЗначениеСчетчика;
			
				СтрокаМаппингаОбъект = СтрокаМаппинга.Ссылка.ПолучитьОбъект();
				СтрокаМаппингаОбъект.ТекущееЗначениеСчетчика = КонечноеЗначениеСчетчика;
				СтрокаМаппингаОбъект.Записать();
			КонецЕсли;	
			#КонецОбласти
		ИначеЕсли СтрокаМаппинга.ТипМетаданныхСправочника = "ит_НоменклатураПоставщиковСтавкиНДС" Тогда
		#Область НоменклатураПоставщиковСтавкиНДС
			НачальноеЗначениеСчетчика = СтрокаМаппинга.ТекущееЗначениеСчетчика;
			КонечноеЗначениеСчетчика = СтрокаМаппинга.ТекущееЗначениеСчетчика;
			
			ТаблицаРеквизитовСправочника = ПолучитьСписокРеквизитовСправочников(СтрокаМаппинга.Ссылка, 1);
			
			ТекстЗапроса = "SELECT * FROM
			| (SELECT Date,Nomenclature,Supplier,VATRate,DateStart,DeletedMark, MAX(LineSwitch) AS MaxLineSwitch FROM " + СтрокаМаппинга.НаименованиеТаблицыTPI + " WHERE LineSwitch > ? AND DATEINSERT <= ?
			|  GROUP BY Date,Nomenclature,Supplier,VATRate,DateStart,DeletedMark) TableMaxLine 
			|  INNER JOIN " + СтрокаМаппинга.НаименованиеТаблицыTPI + " Dat ON TableMaxLine.Date = Dat.Date AND TableMaxLine.Nomenclature = Dat.Nomenclature AND TableMaxLine.Supplier = Dat.Supplier  AND TableMaxLine.VATRate = Dat.VATRate AND TableMaxLine.MaxLineSwitch = Dat.LineSwitch
			|  ORDER BY LineSwitch";
			
			
			Command = Новый COMОбъект("ADODB.Command"); 
			Command.ActiveConnection = СтруктураПараметров.COMОбъектSQL;
			Command.CommandText = ТекстЗапроса;
			
			Param1 = Command.CreateParameter("LineSwitch", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param1);
			Param1.Value = СтрокаМаппинга.ТекущееЗначениеСчетчика;

			Param2 = Command.CreateParameter("DATEINSERT", КонстантаАДО("adbigint"), 1);
			Command.Parameters.Append(Param2);
			Param2.Value = СтруктураПараметров.ДатаТранзакции;
			
			RecordSet = Новый COMОбъект("ADODB.Recordset"); 
			RecordSet = Command.Execute();
			
			ПризнакИерархическийСправочник = Ложь;
	 
			Пока НЕ RecordSet.EOF Цикл
				
				Попытка
					
				ЕРПМастерКлючНоменклатура = Строка(СокрЛП(RecordSet.Fields("Nomenclature").Value));
				ЕРПМастерКлючКонтрагент   = Строка(СокрЛП(RecordSet.Fields("Supplier").Value));
				
				спрНоменклатура = Справочники.Номенклатура.НайтиПоРеквизиту("ЕРПМастерКлюч", ЕРПМастерКлючНоменклатура);
				спрКонтрагент	= Справочники.Контрагенты.НайтиПоРеквизиту("ЕРПМастерКлюч", ЕРПМастерКлючКонтрагент);
				
				
				ДанныеСтавки = Новый Структура;
				ДанныеСтавки.Вставить("СтавкаНДС", Справочники.СтавкиНДС.ПустаяСсылка());
				Реквизит = Новый Структура;
				Реквизит.Вставить("НаименованиеПоляTPI", "VATRate");
				ЕРПЗагрузкаНСИПерсональный.МаппингСтавокНДС(ДанныеСтавки, Реквизит, RecordSet);
				спрСтавкаНДС = ДанныеСтавки.СтавкаНДС;
				
				КонечноеЗначениеСчетчика = Число(СокрЛП(RecordSet.Fields("LineSwitch").Value));
				ТекущееЗначениеСчетчика = Число(СокрЛП(RecordSet.Fields("LineSwitch").Value));
				
				Если Не ЗначениеЗаполнено(спрНоменклатура) Тогда
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", "");
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось определить номенклатуру - " + RecordSet.Fields("Nomenclature").Value + "!");
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					RecordSet.MoveNext();
					
					Продолжить;
				КонецЕсли;	
				
				Если Не ЗначениеЗаполнено(спрКонтрагент) Тогда
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", "");
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось определить контрагента - " + RecordSet.Fields("Supplier").Value + "!");
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					RecordSet.MoveNext();
					
					Продолжить;
				КонецЕсли;	

				Если Не ЗначениеЗаполнено(спрСтавкаНДС) Тогда
					СтруктураПараметровЛогирования = Новый Структура();
					СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
					СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
					СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", "");
					СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
					СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);
					СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
					СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
					СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось определить ставку - " + RecordSet.Fields("VATRate").Value + "!");
					ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
					RecordSet.MoveNext();
					
					Продолжить;
				КонецЕсли;	

				МЗ = РегистрыСведений.ит_НоменклатураПоставщиковСтавкиНДС.СоздатьМенеджерЗаписи();
				МЗ.Период = RecordSet.Fields("Date").Value;
				МЗ.Номенклатура = спрНоменклатура;
				МЗ.Контрагент 	= спрКонтрагент;
				МЗ.СтавкаНДС 	= спрСтавкаНДС;
				МЗ.НачалоДействия 		= RecordSet.Fields("DateStart").Value;
				МЗ.УдалитьЗапись 		= RecordSet.Fields("DeletedMark").Value;
				МЗ.ЕРПЗначениеСчетчика 	= ТекущееЗначениеСчетчика;
				МЗ.Записать();
				
				СтруктураПараметровЛогирования = Новый Структура();				
				СтруктураПараметровЛогирования.Вставить("ТаблицаЛогов", СтруктураПараметров.ТаблицаЛогов);
				СтруктураПараметровЛогирования.Вставить("ДатаТранзакции", СтруктураПараметров.ДатаТранзакции);
				СтруктураПараметровЛогирования.Вставить("ЕРПМастерКлюч", "");
				СтруктураПараметровЛогирования.Вставить("ЕРПЗначениеСчетчика", ТекущееЗначениеСчетчика);
				СтруктураПараметровЛогирования.Вставить("НаименованиеТаблицыTPI", СтрокаМаппинга.НаименованиеТаблицыTPI);						
				СтруктураПараметровЛогирования.Вставить("Загружен", ИСТИНА);
				СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "");
						
				ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
						
				Исключение
						СтруктураПараметровЛогирования.Вставить("Загружен", ЛОЖЬ);
						СтруктураПараметровЛогирования.Вставить("Актуальность", ИСТИНА);
						СтруктураПараметровЛогирования.Вставить("ТекстОшибки", "Не удалось записать ит_НоменклатураПоставщиковСтавкиНДС. Проход - 1. Настройка - " + СтрокаМаппинга.Ссылка + ". " + ОписаниеОшибки());
						ЗаполнитьТаблицуЛогов(СтруктураПараметровЛогирования);
				КонецПопытки;
				
				RecordSet.MoveNext();
			КонецЦикла;	
			

			Если НачальноеЗначениеСчетчика <> КонечноеЗначениеСчетчика Тогда
				НоваяСтрокаЗагруженныйСправочник = СтруктураПараметров.ТаблицаЗагруженныхСправочников.Добавить();
				НоваяСтрокаЗагруженныйСправочник.НачальноеЗначениеСчетчика = СтрокаМаппинга.ТекущееЗначениеСчетчика;
				НоваяСтрокаЗагруженныйСправочник.ЕРПМаппингДляЗагрузки = СтрокаМаппинга.Ссылка;
				НоваяСтрокаЗагруженныйСправочник.КонечноеЗначениеСчетчика = КонечноеЗначениеСчетчика;
			
				СтрокаМаппингаОбъект = СтрокаМаппинга.Ссылка.ПолучитьОбъект();
				СтрокаМаппингаОбъект.ТекущееЗначениеСчетчика = КонечноеЗначениеСчетчика;
				СтрокаМаппингаОбъект.Записать();
			КонецЕсли;	
			#КонецОбласти
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

Процедура ПроверитьУстановитьОсновнойШтрихкодПриУдалении(Номенклатура)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект = &Номенклатура
	|	И Штрихкоды.ОсновнойШтрихкод = Истина";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
	
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	Штрихкоды.Штрихкод КАК Штрихкод,
			|	Штрихкоды.Объект КАК Объект,
			|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
			|	Штрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
			|	Штрихкоды.ЕРПЗначениеСчетчика КАК ЕРПЗначениеСчетчика
			|ИЗ
			|	РегистрСведений.Штрихкоды КАК Штрихкоды
			|ГДЕ
			|	Штрихкоды.Объект = &Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЕРПЗначениеСчетчика УБЫВ";
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Если ВыборкаДетальныеЗаписи.Следующий() Тогда
			
			МЗ = РегистрыСведений.Штрихкоды.СоздатьМенеджерЗаписи();
			МЗ.Штрихкод 				  = ВыборкаДетальныеЗаписи.Штрихкод;
			МЗ.Объект 					  = ВыборкаДетальныеЗаписи.Объект;
			МЗ.ЕдиницаИзмерения 		  = ВыборкаДетальныеЗаписи.ЕдиницаИзмерения;
			МЗ.ХарактеристикаНоменклатуры = ВыборкаДетальныеЗаписи.ХарактеристикаНоменклатуры;
			
			МЗ.Прочитать();
			
			Если МЗ.Выбран() Тогда
				МЗ.ОсновнойШтрихкод = Истина;
				МЗ.Записать();
			КонецЕсли;
			
		КонецЕсли;
	

	КонецЕсли;

	
КонецПроцедуры

Функция ПолучитьПризнакОсновногоШтрихКода(Номенклатура, ШК, ПризнакВесовогоШК = "")
	
	ОсновнойШтрихкод = Истина;
	
	Если ПризнакВесовогоШК = "Весовой EAN Срез" Тогда
		Возврат ОсновнойШтрихкод;
	КонецЕсли;
	
	Если ПризнакВесовогоШК = "ВесовойEAN" Тогда
		Возврат ОсновнойШтрихкод;
	КонецЕсли;	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Объект = &Номенклатура
	|	И Штрихкоды.Штрихкод <> &ШК";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("ШК", ШК);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		ОсновнойШтрихкод = Ложь;
	КонецЕсли;
	
	Возврат ОсновнойШтрихкод;
	
КонецФункции

Функция ПроверитьУникальностьШК(ШК, Номенклатура)
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Штрихкоды.Объект КАК Объект,
	|	Штрихкоды.Штрихкод КАК Штрихкод
	|ИЗ
	|	РегистрСведений.Штрихкоды КАК Штрихкоды
	|ГДЕ
	|	Штрихкоды.Штрихкод = &ШК
	|	И Штрихкоды.Объект <> &Номенклатура";
	
	Запрос.УстановитьПараметр("ШК", 		  ШК);	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);	

	РезультатЗапроса = Запрос.Выполнить();
	
	Возврат РезультатЗапроса.Пустой();
	
КонецФункции

Процедура ЗаполнитьЕдИзмеренияШтрихкодов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Штрихкоды.Штрихкод КАК Штрихкод,
		|	Штрихкоды.Объект КАК Объект,
		|	Штрихкоды.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
		|	Штрихкоды.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
		|	Штрихкоды.ОсновнойШтрихкод КАК ОсновнойШтрихкод,
		|	Штрихкоды.Объект.ОсновнаяЕдиницаИзмерения КАК ОсновнаяЕдиницаИзмерения
		|ИЗ
		|	РегистрСведений.Штрихкоды КАК Штрихкоды
		|ГДЕ
		|	Штрихкоды.ЕдиницаИзмерения = &Ед
		|	И Штрихкоды.Объект ССЫЛКА Справочник.Номенклатура";
	
	Запрос.УстановитьПараметр("Ед", Справочники.ЕдиницыИзмерения.ПустаяСсылка());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		регШК = РегистрыСведений.Штрихкоды.СоздатьНаборЗаписей();
		регШК.Отбор.Объект.Установить(ВыборкаДетальныеЗаписи.Объект);
		регШК.Отбор.Штрихкод.Установить(ВыборкаДетальныеЗаписи.Штрихкод);
		регШК.Прочитать();
		Для каждого стррегШК из регШК Цикл	
		 	Если Не ЗначениеЗаполнено(стррегШК.ЕдиницаИзмерения) Тогда
				стррегШК.ЕдиницаИзмерения = ВыборкаДетальныеЗаписи.ОсновнаяЕдиницаИзмерения;
			КонецЕсли;
		КонецЦикла;	
		
		Попытка
			регШК.Записать();
		Исключение
		КонецПопытки;

	КонецЦикла;
	
КонецПроцедуры

//Мальцев А.Ю. 02.02.2021 ---
