#Область ПрограммныйИнтерфейс

Процедура ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, Сообщение)
	
	#Если Клиент Тогда
	Прогресс = Новый Структура;
	Прогресс.Вставить("Статус",    "Выполняется");
	Прогресс.Вставить("Сообщение", Сообщение);
	ВыполнитьОбработкуОповещения(ОповещениеОПрогрессеВыполнения, Прогресс);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗавершениеЗадания(Результат, Параметры) Экспорт
	
	ВыходныеПараметры = Новый Массив();
	Если Результат.Статус = "Выполнено" Тогда
		
		РезультатыОтправки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		//РезультатыОтправки.Записать(ИмяФайла);
		Отказ       = РезультатыОтправки.Отказ;
		ТекстОшибки = РезультатыОтправки.ТекстОшибки;
		
		ОтправитьСообщениеПрогресса(Параметры.ОповещениеОПрогрессеВыполнения, "Завершение выполнения обработки данных");
		ЗафиксироватьВыполненныйОбмен(Параметры.ПараметрыОборудования, РезультатыОтправки.ДиапазоныЧеков, РезультатыОтправки.ЗакрытыеСмены, Отказ, ТекстОшибки);
		Если Отказ Тогда
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(ТекстОшибки);
			РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Ложь, ВыходныеПараметры);
		Иначе
			РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Истина, ВыходныеПараметры);
		КонецЕсли;
		
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатВыполнения);
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(Результат.ПодробноеПредставлениеОшибки);
		РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Ложь, ВыходныеПараметры);
		
		ВыполнитьОбработкуОповещения(Параметры.ОповещениеПриЗавершении, РезультатВыполнения);
	КонецЕсли;
	
КонецПроцедуры

// RADV нужно доработать проверку параметров устройства
Функция ПодключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат         = Истина;
	ВыходныеПараметры = Новый Массив();
	ОбъектДрайвера    = Неопределено;
	Сервер            = Неопределено;
	Пользователь      = Неопределено;
	Пароль            = Неопределено;
	
	Параметры.Свойство("Сервер",       Сервер);
	Параметры.Свойство("Пользователь", Пользователь);
	Параметры.Свойство("Пароль",       Пароль);
	
	Если Сервер = Неопределено
		Или Пользователь = Неопределено
		Или Пароль = Неопределено Тогда
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Не настроены параметры устройства.
		|Для корректной работы устройства необходимо задать параметры его работы.'"));
		Результат = Ложь;
	Иначе
		ОбъектДрайвера = Новый Структура("Параметры", Параметры);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

// Процедура начинает отключение устройства.
//
&НаКлиенте
Процедура НачатьОтключениеУстройства(ОповещениеПриЗавершении, ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт
	
	Результат = ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры);
	
	РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Результат, ВыходныеПараметры);
	ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
	
КонецПроцедуры

// Функция осуществляет отключение устройства.
//
&НаКлиенте
Функция ОтключитьУстройство(ОбъектДрайвера, Параметры, ПараметрыПодключения, ВыходныеПараметры) Экспорт

	Результат = Истина;
	Возврат Результат;

КонецФункции

// Функция возвращает возможность работы модуля в асинхронном режиме.
// Стандартные команды модуля:
// - ПодключитьУстройство
// - ОтключитьУстройство
// - ВыполнитьКоманду
// Команды модуля для работы асинхронном режиме (должны быть определены):
// - НачатьПодключениеУстройства
// - НачатьОтключениеУстройства
// - НачатьВыполнениеКоманды.
//
Функция ПоддержкаАсинхронногоРежима() Экспорт
	
	Возврат Истина;
	
КонецФункции

// Процедура начинает выполнение команды, обрабатывает и перенаправляет на исполнение команду к драйверу.
//
Функция НачатьВыполнениеКоманды(ОповещениеПриЗавершении = Неопределено, Команда, ВходныеПараметры = Неопределено, ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт
	
	ВыходныеПараметры = Новый Массив();
	// Выгрузка данных
	Если Команда = "ВыгрузитьДанные" Тогда
		
		ВыгружатьФото = Истина;
		Если ВходныеПараметры.Свойство("ВыгружатьФото") Тогда
			ВыгружатьФото = ВходныеПараметры.ВыгружатьФото;				
		КонецЕсли;
		РезультатВыполнения = НачатьВыгрузкуДанных(ОповещениеПриЗавершении, ОбъектДрайвера.Параметры, ВходныеПараметры.ПолнаяВыгрузка, ВходныеПараметры.ВыгружатьТовары, ВходныеПараметры.ВыгружатьСкидки, ВходныеПараметры.ВыгружатьПерсонал, ВыходныеПараметры, ВыгружатьФото);
		Если РезультатВыполнения.Успешно Тогда
			ТекстОшибки = "";
			РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Истина, ВыходныеПараметры);
		Иначе
			Результат = Ложь;
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(РезультатВыполнения.ТекстОшибки);
			РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Результат, ВыходныеПараметры);
		КонецЕсли;
		
	// Загрузка данных
	ИначеЕсли Команда = "ЗагрузитьДанные" Тогда
		
		#Если Клиент Тогда
			ПараметрыОжидания = ВходныеПараметры.ПараметрыОжидания;
			РезультатПродаж = ПолучитьДанныеПродажVRM(Параметры, ПараметрыОжидания.ОповещениеОПрогрессеВыполнения);
		#Иначе
			РезультатПродаж = ПолучитьДанныеПродажVRM(Параметры);
		#КонецЕсли
		Если РезультатПродаж.Успешно Тогда
			#Если Клиент Тогда
				//ОфлайнОборудованиеPOSСуперМАГВызовСервера.ОбработатьЗагружаемыеДанныеПродаж(РезультатПродаж, Параметры.Идентификатор, ДиапазоныЧеков, ЗакрытыеСмены, Отказ, ТекстОшибки, Истина, ВходныеПараметры.ПараметрыОжидания);
				Задание = ОфлайнОборудованиеPOSСуперМАГВызовСервера.СоздатьЗаданиеОбработкиПродаж(ПараметрыОжидания.ФормаВладелец.УникальныйИдентификатор, РезультатПродаж, Параметры.Идентификатор);
				
				ДополнительныеПараметры = Новый Структура;
				ДополнительныеПараметры.Вставить("ПараметрыОборудования",          Параметры);
				ДополнительныеПараметры.Вставить("ОповещениеОПрогрессеВыполнения", ПараметрыОжидания.ОповещениеОПрогрессеВыполнения);
				//ДополнительныеПараметры.Вставить("ДиапазоныЧеков",          ДиапазоныЧеков);
				//ДополнительныеПараметры.Вставить("ЗакрытыеСмены",           ЗакрытыеСмены);
				ДополнительныеПараметры.Вставить("ОповещениеПриЗавершении",        ОповещениеПриЗавершении);
				
				ДлительныеОперацииКлиент.ОжидатьЗавершение(
				Задание,
				Новый ОписаниеОповещения("ОбработатьЗавершениеЗадания", ЭтотОбъект, ДополнительныеПараметры),
				ПараметрыОжидания);
				
				Возврат РезультатВыполнения;
				
			#Иначе
				Отказ       = Ложь;
				ТекстОшибки = "";
				ДиапазоныЧеков = Новый Массив;
				ЗакрытыеСмены  = Новый Массив;
				ОфлайнОборудованиеPOSСуперМАГВызовСервера.ОбработатьЗагружаемыеДанныеПродаж(РезультатПродаж, Параметры.Идентификатор, ДиапазоныЧеков, ЗакрытыеСмены, Отказ, ТекстОшибки);
				Если Отказ Тогда
					ВыходныеПараметры.Добавить(999);
					ВыходныеПараметры.Добавить(ТекстОшибки);
					РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Ложь, ВыходныеПараметры);
					Возврат РезультатВыполнения;
				КонецЕсли;
				//ОтправитьСообщениеПрогресса(ПараметрыОжидания.ОповещениеОПрогрессеВыполнения, "Завершение выполнения обработки данных");
				ЗафиксироватьВыполненныйОбмен(Параметры, ДиапазоныЧеков, ЗакрытыеСмены, Отказ, ТекстОшибки);
				Если Отказ Тогда
					ВыходныеПараметры.Добавить(999);
					ВыходныеПараметры.Добавить(ТекстОшибки);
					РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Ложь, ВыходныеПараметры);
					Возврат РезультатВыполнения;
				Иначе
					РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Истина, ВыходныеПараметры);
				КонецЕсли;
			#КонецЕсли
		Иначе
			Результат = Ложь;
			ВыходныеПараметры.Добавить(999);
			ВыходныеПараметры.Добавить(РезультатПродаж.ТекстОшибки);
			РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Результат, ВыходныеПараметры);
		КонецЕсли;
			
		//// Определяет результат загрузки отчета.
		//ИначеЕсли Команда = "УстановитьФлагДанныеЗагружены" Тогда
		//	РезультатВыполнения = НачатьОтчетЗагружен(Параметры, ВыходныеПараметры);
		//	
		//// Очистить базу ККМ Offline.
		//ИначеЕсли Команда = "ОчиститьБазу" Тогда
		//	РезультатВыполнения = НачатьОчисткуТоваровНаККМ(Параметры, ВыходныеПараметры);
		//	
	// Тестирование устройства
	ИначеЕсли Команда = "ТестУстройства" ИЛИ Команда = "CheckHealth" Тогда
		
		РезультатВыполнения = ТестУстройства(Параметры, ВыходныеПараметры);
		
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Команда ""%Команда%"" не поддерживается данным драйвером.'"));
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Ложь, ВыходныеПараметры);
		
	КонецЕсли;
	
	#Если Клиент Тогда
		Если ОповещениеПриЗавершении <> Неопределено Тогда
			ВыполнитьОбработкуОповещения(ОповещениеПриЗавершении, РезультатВыполнения);
		КонецЕсли;
	#КонецЕсли
	
	Возврат РезультатВыполнения;
	
КонецФункции

// Функция получает, обрабатывает и перенаправляет на исполнение команду к драйверу.
//
Функция ВыполнитьКоманду(Команда, ВходныеПараметры = Неопределено, ВыходныеПараметры = Неопределено,
                         ОбъектДрайвера, Параметры, ПараметрыПодключения) Экспорт
	
	Результат = Истина;
	ВыходныеПараметры = Новый Массив();
	
	// Тестирование устройства.
	Если Команда = "ТестУстройства" ИЛИ Команда = "CheckHealth" Тогда
		Результат = ТестУстройства(Параметры, ВыходныеПараметры);
		
	// Указанная команда не поддерживается данным драйвером.
	Иначе
		ВыходныеПараметры.Добавить(999);
		ВыходныеПараметры.Добавить(НСтр("ru='Команда ""%Команда%"" не поддерживается данным драйвером.'"));
		ВыходныеПараметры[1] = СтрЗаменить(ВыходныеПараметры[1], "%Команда%", Команда);
		Результат = Ложь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ВыгрузкаТоваров

// Процедура осуществляет выгрузку таблицы товаров в ККМ, подключенную в режиме Offline.
//
Функция НачатьВыгрузкуДанных(ОповещениеПриЗавершении, Параметры, ПолнаяВыгрузка, ВыгружатьТовары, ВыгружатьСкидки, ВыгружатьПерсонал, ВыходныеПараметры, ВыгружатьФото = Истина) Экспорт
	МоментВыгрузкиДанных = ТекущаяДата();
	Результат = Истина;
	ТекстОшибки = "";
	ИндексМагазина = ?(ЗначениеЗаполнено(Параметры.ПрайслистИД),Параметры.ИндексМагазина,1);
	ПрайслистИД = ?(ЗначениеЗаполнено(Параметры.ПрайслистИД),Параметры.ПрайслистИД,1);
	ПрайслистИД = Формат(ПрайслистИД, "ЧГ=");
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(ИндексМагазина,"ЧГ=0"),"Начало выгрузки");
	
	//Проверим есть ли хоть один каталог свободный, что бы зря не собирать данные
	//По умолчанию все заняты
	// проверим флаг занятости
	БД = Новый COMОбъект("ADODB.Connection");
	СтрокаУКМ = ПолучитьСтрокуПодключения(Параметры, Параметры.БазаИмпорт);
	
	ЕстьДанные = Ложь;
	
	Попытка
		БД.ConnectionString = СтрокаУКМ;
		БД.Open();
		ПодключениеОткрыто = Истина;
	Исключение
		Результат = Ложь;
		ОписаниеОшибки = НСтр("ru='Ошибка соединения с БД по причине: %1%'");		
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, СтрЗаменить(ОписаниеОшибки, "%1%", ОписаниеОшибки()));
		Возврат РезультатВыполнения;
	КонецПопытки;
	
	
	#Область ВерсионированииЗапросов
	
	//ВерсияПакета = Формат(ТекущаяУниверсальнаяДатаВМиллисекундах(), "ЧГ="); //dmboro

	//Запрос=Новый COMОбъект("ADODB.Recordset");
	//Запрос.CursorLocation=3;
	//Попытка
	//	Запрос.Open("select * from `signal` WHERE `version` = "+ВерсияПакета+";",БД,2,3,1);
	//Исключение
	//	ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка соединения с БД: '"));
	//	БД.Close();
	//	Результат = Ложь;
	//	РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
	//	Возврат РезультатВыполнения;
	//КонецПопытки;

	//КаталогСвободен = Запрос.RecordCount()=0;
	//
	//Запрос.Close();
	//БД.Close();
	//
	//Если НЕ КаталогСвободен Тогда
	//	Результат = Ложь;
	//	ТекстОшибки = НСтр("ru='Таблица для выгрузки данных занята'");
	//	РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
	//	Возврат РезультатВыполнения;
	//КонецЕсли;
	//
	//Попытка
	//	БД.Open(СтрокаУКМ);
	//Исключение
	//	Результат = Ложь;
	//	ОписаниеОшибки = НСтр("ru='Ошибка соединения с БД по причине: %1%'");
	//	ТекстОшибки = СтрЗаменить(ОписаниеОшибки, "%1%", ОписаниеОшибки());
	//	
	//	РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
	//	Возврат РезультатВыполнения;
	//КонецПопытки;
	//
	//Сервер2 = Параметры.Сервер;
	//Пользователь2 = Параметры.Пользователь;
	//Пароль2 = Параметры.Пароль;
	//БазаДанных2 = Параметры.БазаТерминала;
	//СтрокаПодключения2 = "driver={MySQL ODBC 8.0 ANSI Driver}; server="+Сервер2+"; uid="+Пользователь2+"; Pwd="+Пароль2+"; Database="+БазаДанных2;
	//БД2 = Новый COMОбъект("ADODB.Connection");
	//БД2.CommandTimeout = 0;
	//СтруктураСтавок = Новый Структура;
	////ТаблСтавок = ОфлайнОборудованиеPOSСуперМАГВызовСервера.ПолучитьСтавкиНДС();
	//Попытка
	//	БД2.Open(СтрокаПодключения2);
	//	Запрос=Новый COMОбъект("ADODB.Recordset");
	//	Запрос.CursorLocation=3;
	//	Запрос.Open("SELECT trm_in_taxgroup.id, trm_in_taxgroup.percent FROM trm_in_taxgroup",БД2,2,3,1);
	//	Пока НЕ Запрос.EOF Цикл
	//		ИДСтавки = Запрос.Fields("id").Value;
	//		ПроцентСтавки = Запрос.Fields("percent").Value;
	//		СтавкаНДС = ОфлайнОборудованиеPOSСуперМАГВызовСервера.ПолучитьСтавкуНДСПОНаименованию(ПроцентСтавки);
	//		СтруктураСтавок.Вставить(СтрЗаменить(СтрЗаменить("Ставка"+(СтавкаНДС),"%","")," ",""),ИДСтавки);
	//		Запрос.MoveNext();
	//	КонецЦикла;
	//	Запрос.Close();
	//	БД2.Close();
	//Исключение
	//	СообщениеОбОшибке = ОписаниеОшибки();
	//КонецПопытки;
	
	#КонецОбласти

	
	Команда=Новый COMОбъект("ADODB.Command");
	Команда.ActiveConnection=БД;
	
	//Команда.CommandText =   "TRUNCATE Tp_Add_item;";
	//Команда.Execute(); 
	//Команда.CommandText =   "TRUNCATE Tp_Add_ItemPrice;";
	//Команда.Execute(); 
	//Команда.CommandText =   "TRUNCATE Tp_Add_itembar;";
	//Команда.Execute(); 
	//Команда.CommandText =   "TRUNCATE tp_add_shtmnut;";
	//Команда.Execute(); 
	//Команда.CommandText =   "TRUNCATE Tp_Add_ShtMnuAcl;";
	//Команда.Execute(); 
	//Команда.CommandText =   "TRUNCATE Tp_Add_ShtMnuG;";
	//Команда.Execute(); 
	//
	
	МассивКасс = Новый Массив;
	Касса = Новый Структура;
	Касса.Вставить("НомерPOS", 0);
	МассивКасс.Добавить(Касса);

	Если ВыгружатьТовары Тогда
		ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(ИндексМагазина,"ЧГ=0"),"Выгрузка товаров. Начало.");
		
		МоментыПоследнейВыгрузки = МенеджерОборудованияРарусСервер.ПолучитьМоментыПоследнейВыгрузки(Параметры.Идентификатор,МассивКасс,"Товары",ПолнаяВыгрузка);
		
		Для каждого СтруктураМомента из МоментыПоследнейВыгрузки Цикл
			#Если Клиент Тогда
				Товары = МенеджерОборудованияРарусСервер.ПолучитьТаблицуТоваров(Параметры.Идентификатор, ПолнаяВыгрузка, Истина, СтруктураМомента.МоментПоследнейВыгрузки, Параметры.ВыгружатьГруппыПоКоду);
			#Иначе
				Товары = МенеджерОборудованияРарусСервер.ПолучитьТаблицуТоваров(Параметры.Идентификатор, ПолнаяВыгрузка, Ложь,   СтруктураМомента.МоментПоследнейВыгрузки, Параметры.ВыгружатьГруппыПоКоду);
			#КонецЕсли
			
			Если Товары.Количество()=0 Тогда
				Продолжить;
			КонецЕсли;
						
			ГруппыКСО = МенеджерОборудованияРарусСервер.ПолучитьВсеГруппыКСО();
			Для Каждого СтрокаГруппаКСО Из ГруппыКСО Цикл
				Картинка64 = "";
				МД5        = "";
				
				Если Не ПустаяСтрока(СтрокаГруппаКСО.КартинкаГруппы) Тогда

					Файл = Новый Файл(СтрокаГруппаКСО.КартинкаГруппы);
					Если Файл.Существует() Тогда
						Попытка
							ДД = Новый ДвоичныеДанные(СтрокаГруппаКСО.КартинкаГруппы);
							
							Картинка64 = Base64Строка(ДД);
														 
							МД5 = МенеджерОборудованияРарусСервер.MD5ХешСтрока(Картинка64); 
						Исключение
						КонецПопытки;
					КонецЕсли;// Вставить содержимое обработчика.	
				КонецЕсли;
				
				Команда.CommandText =   "INSERT INTO Tp_Add_ShtMnuG
									|		(id,
						  			|        grp,												
						  			|        img,
									|        icrc,
									|        ord)
									|VALUES ('"+СтрокаГруппаКСО.ИДГруппы+"',
									|		'"+СтрокаГруппаКСО.ГруппаКСО+"',													
									|		'"+Картинка64+"',	
									|		'"+МД5+"',												
									|		'"+СтрокаГруппаКСО.ПорядокГруппы+"');";
				Попытка 
					Команда.Execute(); 
					ЕстьДанные = Истина;
				Исключение 
					ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка заполенения БД: '"));
					БД.Close();
					Результат = Ложь;
					РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
					Возврат РезультатВыполнения;
				КонецПопытки;						
			КонецЦикла;
			
			мШтрихкоды   = Новый Массив;
			мМассивГрупп = Новый Массив;
			//Выгрузка товаров
			Для Каждого СтрокаДанных Из Товары Цикл
				
				Если СтрокаДанных.ЭтоГруппа Тогда
					Продолжить;
				КонецЕсли;
				
				Артикул = СтрокаДанных.Артикул;
				Если Не ЗначениеЗаполнено(Артикул) Тогда
					Продолжить;
				КонецЕсли;
				
				Цена = СтрокаДанных.Цена;
				МинЦена = СтрокаДанных.МРЦ;
				
				Картинка64 = "";
				МД5      = "";
				Картинка = ?(ПустаяСтрока(СтрокаДанных.КартинкаКСО),СтрокаДанных.Картинка,СтрокаДанных.КартинкаКСО);
				
				Если Не ПустаяСтрока(Картинка) И ВыгружатьФото Тогда
					Картинка64 = "";
					Файл = Новый Файл(Картинка);
					Если Файл.Существует() Тогда
												
						Попытка
							ДД = Новый ДвоичныеДанные(Картинка);
							
							Картинка64 = Base64Строка(ДД);
														 
							МД5 = МенеджерОборудованияРарусСервер.MD5ХешСтрока(Картинка64); 
						Исключение
							Картинка64 = "";
							МД5 = "";

						КонецПопытки;
						
						Команда.CommandText =   "INSERT INTO tp_add_shtmnut
											|		(barcod,
								  			|        img,
											|        icrc)
											|VALUES ('"+Артикул+"',
											|		'"+Картинка64+"',										
											|		'"+МД5+"');";
						Попытка 
							Команда.Execute(); 
							ЕстьДанные = Истина;
						Исключение 
							ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка заполенения БД: '"));
							БД.Close();
							Результат = Ложь;
							РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
							Возврат РезультатВыполнения;
						КонецПопытки;
							
						
					КонецЕсли;// Вставить содержимое обработчика.	
				КонецЕсли;
				
				ГруппыУдаленияКСО = МенеджерОборудованияРарусСервер.ПолучитьГруппыКСО_ДляУдаления(СтруктураМомента.МоментПоследнейВыгрузки, Артикул, ?(ПустаяСтрока(СтрокаДанных.ГруппаКСО),0,СтрокаДанных.ИДГруппаКСО));
				Для Каждого стрИД Из ГруппыУдаленияКСО Цикл
					
					Команда.CommandText =   "INSERT INTO Tp_Add_ShtMnuAcl
											|		(barcod,
								  			|        Id_grp,
								  			|        ord,
											|		 Kodbo)
											|VALUES ('"+Артикул+"',
											|		'"+Строка(стрИД)+"',
											|		-1,
											|		'ALL');";
					Попытка 
						Команда.Execute(); 
						ЕстьДанные = Истина;
					Исключение 
						ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка заполенения БД: '"));
						БД.Close();
						Результат = Ложь;
						РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
						Возврат РезультатВыполнения;
					КонецПопытки;
					
				КонецЦикла;
				
				Если Не ПустаяСтрока(СтрокаДанных.ГруппаКСО) Тогда
					                                                      
					Команда.CommandText =   "INSERT INTO Tp_Add_ShtMnuAcl
											|		(barcod,
								  			|        Id_grp,
								  			|        ord,
											|		 Kodbo)
											|VALUES ('"+Артикул+"',
											|		'"+СтрокаДанных.ИДГруппаКСО+"',
											|		"+Формат(СтрокаДанных.ПорядокВГруппеКСО,"ЧРД=.; ЧН=0; ЧГ=0")+",
											|		'ALL');";
					Попытка 
						Команда.Execute(); 
						ЕстьДанные = Истина;
					Исключение 
						ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка заполенения БД: '"));
						БД.Close();
						Результат = Ложь;
						РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
						Возврат РезультатВыполнения;
					КонецПопытки;
					
				КонецЕсли;
				
				
				Для каждого ШтрихКод из СтрокаДанных.Штрихкоды Цикл
					
					стШтрихкоды  = Новый Структура;
					стШтрихкоды.Вставить("Штрихкод",ШтрихКод.ШтрихКод);
					стШтрихкоды.Вставить("Артикул", Артикул);
					
					
					//стШтрихкоды.Вставить("Картинка64",Картинка64);
					//стШтрихкоды.Вставить("МД5",		  МД5);
					
				    мШтрихкоды.Добавить(стШтрихкоды);
					
					Цена = ШтрихКод.Цена;
					
				КонецЦикла;
				
				//Признак  Fsrl
				
				Fsrl = ОфлайнОборудованиеPOSСуперМАГВызовСервера.ПолучитьПризнакФСРЛдляПозиции(СтрокаДанных);
				Если СтрокаДанных.БлокироватьКПродаже Тогда
					Fsrl = 0;
				КонецЕсли;	
				
				// товар
				Команда.CommandText =   "INSERT INTO Tp_Add_item
										|	(Tip,
										|	 Item,
										|	 ShortName,
										|	 Otdel,
										|	 fullname,										
										|	 NDS,
										|	 NSP,
										|	 Price,
										|	 MinPrice,
										|	 Fsrl,										
										|	 ED)
								//		|VALUES (" + ?(СтрокаДанных.БлокироватьКПродаже = Истина, "3","0") + ",
										|VALUES (" + ?(СтрокаДанных.БлокироватьКПродаже = Истина, "0","0") + ",
										|		'"+Артикул+"',
										|		'"+Лев(СтрокаДанных.Наименование, 40)+"',
										|		1,
										|		'"+Лев(СтрокаДанных.Наименование, 70)+"',										
										|		"+Формат(?(СтрокаДанных.СтавкаНДС = "none",0,СтрокаДанных.СтавкаНДС),"ЧРД=.; ЧН=0; ЧГ=0")+",
										|		0,
										|		"+Формат(Цена,"ЧРД=.; ЧН=0; ЧГ=0")+",
										|		"+Формат(МинЦена,"ЧРД=.; ЧН=0; ЧГ=0")+",
										|		"+Формат(Fsrl,"ЧРД=.; ЧН=0; ЧГ=0")+",
										|		'"+Лев(СтрокаДанных.ЕдиницаИзмерения,2)+"');";
				Попытка 
					Команда.Execute(); 
					
					итВыгрузкаВУКМЛОГ_Items = Новый Структура;
					итВыгрузкаВУКМЛОГ_Items.Вставить("Период", ТекущаяДата());
					итВыгрузкаВУКМЛОГ_Items.Вставить("id",Артикул);
					итВыгрузкаВУКМЛОГ_Items.Вставить("name",СтрокаДанных.Наименование);
					итВыгрузкаВУКМЛОГ_Items.Вставить("measure",СтрокаДанных.ЕдиницаИзмерения);
					итВыгрузкаВУКМЛОГ_Items.Вставить("tax",Формат(СтрокаДанных.СтавкаНДС,"ЧРД=.; ЧН=0; ЧГ=0"));
					итВыгрузкаВУКМЛОГ_Items.Вставить("classif",Строка(СтрокаДанных.ГруппаКСО));
					итВыгрузкаВУКМЛОГ_Items.Вставить("alcohol",Формат(Fsrl,"ЧРД=.; ЧН=0; ЧГ=0"));
					итВыгрузкаВУКМЛОГ_Items.Вставить("deleted",?(СтрокаДанных.БлокироватьКПродаже = Истина, "3","0"));
					итВыгрузкаВУКМЛОГ_Items.Вставить("Оборудование",Параметры.Идентификатор);
					
					МенеджерОборудованияРарусСервер.ЗаписатьЛог("итВыгрузкаВУКМЛОГ_Items",итВыгрузкаВУКМЛОГ_Items);
					ЕстьДанные = Истина;
				Исключение 
					ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка заполенения БД: '"));
					БД.Close();
					Результат = Ложь;
					РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
					Возврат РезультатВыполнения;
				КонецПопытки;
				
				//Цена
				Команда.CommandText =   "INSERT INTO Tp_Add_ItemPrice
										|		(Tip,
										|		 Item,
										|		 Price,
										|		 MinPrice,
										|		 KodBOMag)
										|VALUES (0,
										|		'"+Артикул+"',
										|		"+Формат(Цена,"ЧРД=.; ЧН=0; ЧГ=0")+",
										|		"+Формат(МинЦена,"ЧРД=.; ЧН=0; ЧГ=0")+",
										|		"+ПрайслистИД+");";
				Попытка 
					Команда.Execute(); 
											
					итВыгрузкаВУКМЛОГ_pricelist_items = Новый Структура;
					итВыгрузкаВУКМЛОГ_pricelist_items.Вставить("Период",ТекущаяДата());
					итВыгрузкаВУКМЛОГ_pricelist_items.Вставить("pricelist",ПрайслистИД);
					итВыгрузкаВУКМЛОГ_pricelist_items.Вставить("item",Артикул);
					итВыгрузкаВУКМЛОГ_pricelist_items.Вставить("price",Формат(Цена,"ЧРД=.; ЧН=0; ЧГ=0"));
					итВыгрузкаВУКМЛОГ_pricelist_items.Вставить("minprice",Формат(МинЦена,"ЧРД=.; ЧН=0; ЧГ=0"));
					итВыгрузкаВУКМЛОГ_pricelist_items.Вставить("is_promo_price","0");
					итВыгрузкаВУКМЛОГ_pricelist_items.Вставить("deleted","0");

					МенеджерОборудованияРарусСервер.ЗаписатьЛог("итВыгрузкаВУКМЛОГ_pricelist_items",итВыгрузкаВУКМЛОГ_pricelist_items);					
					
					ЕстьДанные = Истина;
				Исключение 
					ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка заполенения БД: '"));
					БД.Close();
					Результат = Ложь;
					РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
					Возврат РезультатВыполнения;
				КонецПопытки;
				
			КонецЦикла;
			
			//Выгрузка штрихкодов
			массСтрокПроверки = Новый Массив;
			Для Каждого СтрокаДанных Из мШтрихкоды Цикл
			
					Команда.CommandText =   "INSERT INTO Tp_Add_itembar
										|		(Tip,
										|		 Item,
							  			|        Barcode)
										|VALUES (0,
										|		'"+СтрокаДанных.Артикул+"',
										|		'"+СтрокаДанных.ШтрихКод+"');";
					Попытка 
						Команда.Execute(); 
						ЕстьДанные = Истина;
					Исключение 
						ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка заполенения БД: '"));
						БД.Close();
						Результат = Ложь;
						РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
						Возврат РезультатВыполнения;
					КонецПопытки;
					
			КонецЦикла;
			
		КонецЦикла;
		
		ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(ИндексМагазина,"ЧГ=0"),"Выгрузка товаров. Конец.");
	КонецЕсли;
	
	//Пошла выкладка
	Если Результат И ЕстьДанные Тогда
		
		
		//Команда.CommandText =   "INSERT INTO Tp_v_flag
		//							|		(Flag)
		//							|VALUES (1);";
		
		Команда.CommandText = "UPDATE Tp_v_flag
			|SET
			|	Flag=1,
			|	Flagsht=1
			|WHERE
			|	Flag = 0 or Flagsht=0";
		//
		Попытка 
			Команда.Execute(); 
		Исключение 
			ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Флаг выгрузки: '"));
			БД.Close();
			Результат = Ложь;
			РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
			Возврат РезультатВыполнения;
		КонецПопытки;
		
		Если ВыгружатьТовары Тогда
			МенеджерОборудованияРарусСервер.УстановитьМоментЗагрузки(Параметры.Идентификатор,"Товары",  0,МоментВыгрузкиДанных);
		КонецЕсли;
		Если ВыгружатьСкидки Тогда
			МенеджерОборудованияРарусСервер.УстановитьМоментЗагрузки(Параметры.Идентификатор,"Скидки",  0,МоментВыгрузкиДанных);
		КонецЕсли;
		Если ВыгружатьПерсонал Тогда
			МенеджерОборудованияРарусСервер.УстановитьМоментЗагрузки(Параметры.Идентификатор,"Персонал",0,МоментВыгрузкиДанных);
		КонецЕсли;
		
		
	КонецЕсли;
	БД.Close();
	
	РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Результат, ТекстОшибки);
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция НачатьПроверкуОбработанностиФайла(ДополнительныеПараметры, ИмяФайла) 
	
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		РезультатЧтенияФайлов = Неопределено;
		МенеджерОборудованияРарусСервер.ПолучитьСодержаниеТекстовыхФайлов(ИмяФайла, РезультатЧтенияФайлов, КодировкаТекста.ANSI);
		
		РезультатВыполнения = ПроверкаОбработанностиФайлаЗавершение(РезультатЧтенияФайлов, ДополнительныеПараметры);
	Иначе
		РезультатВыполнения = ВыгрузкаТоваровЗавершение(Истина, ДополнительныеПараметры); // Файла не существует.
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПроверкаОбработанностиФайлаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Успешно Тогда
		Файл = Новый ТекстовыйДокумент;
		Файл.УстановитьТекст(Результат.СодержаниеФайлов[0].ТекстСодержания);
		
		Строка = Файл.ПолучитьСтроку(2);
		
		Если СтрДлина(Строка) = 1 И Найти(Строка,"#") > 0 Тогда
			ДополнительныеПараметры.ВыходныеПараметры.Добавить(999);
			ДополнительныеПараметры.ВыходныеПараметры.Добавить(НСтр("ru='Нельзя сделать выгрузку. Товары предыдущей выгрузки еще не были получены ККМ-offline'"));
			РезультатВыполнения = ВыгрузкаТоваровЗавершение(Ложь, ДополнительныеПараметры); // Нельзя если символ во второй строке "#".
		Иначе
			РезультатВыполнения = ВыгрузкаТоваровЗавершение(Истина, ДополнительныеПараметры); // Можно если символ во второй строке не "#" (если загрузка произошла, там стоит "@").
		КонецЕсли;
	Иначе
		ДополнительныеПараметры.ВыходныеПараметры.Добавить(999);
		ДополнительныеПараметры.ВыходныеПараметры.Добавить(Результат.ТекстОшибки);
		РезультатВыполнения = ВыгрузкаТоваровЗавершение(Ложь, ДополнительныеПараметры); // Файл не прочитан, следовательно гарантировать обработанность файла нельзя.
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ВыгрузкаТоваровЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ВыходныеПараметры = ДополнительныеПараметры.ВыходныеПараметры;
	
	Если Результат Тогда
		
		Разделитель = ПолучитьРазделитель();
		ЧастичнаяВыгрузка = ДополнительныеПараметры.ЧастичнаяВыгрузка;
		РасширеннаяВыгрузка = ДополнительныеПараметры.РасширеннаяВыгрузка;
		Товары = ДополнительныеПараметры.Товары;
		ГруппыТоваров = ДополнительныеПараметры.ГруппыТоваров;
		ИмяФайла = ДополнительныеПараметры.ИмяФайла;
		ИмяФайлаФлага = ДополнительныеПараметры.ИмяФайлаФлага;
		ФорматОбмена = ДополнительныеПараметры.ФорматОбмена;
		
		Файл = Новый ТекстовыйДокумент();
		
		Результат = СформироватьФайлТоваров(Файл, НЕ ЧастичнаяВыгрузка, ФорматОбмена, Разделитель, Товары,ГруппыТоваров, ВыходныеПараметры);
		
		тКодировка=КодировкаXBase.OEM;
		
		СформироватьСтавкиНДС(Файл, тКодировка, Товары);
		
		Если Результат Тогда
			
			Попытка
				
				Файл.Записать(ИмяФайла, "windows-1251");
				
				Если Не ПустаяСтрока(ИмяФайлаФлага) Тогда
					Файл.Очистить();
					Файл.Записать(ИмяФайлаФлага, "windows-1251");
				КонецЕсли;
				
			Исключение
				т = ОписаниеОшибки();
				к = ИнформацияОбОшибке();
				ВыходныеПараметры.Добавить(999);
				ОписаниеОшибки = НСтр("ru='Не удалось записать файл товаров по адресу: %Адрес%'");
				ВыходныеПараметры.Добавить(СтрЗаменить(ОписаниеОшибки, "%Адрес%", ИмяФайла));
				Результат = Ложь;
				
			КонецПопытки;
			
		КонецЕсли;
		
		РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Результат, ВыходныеПараметры);
	Иначе
		РезультатВыполнения = Новый Структура("Результат, ВыходныеПараметры", Ложь, ВыходныеПараметры);
	КонецЕсли;
	
	Возврат РезультатВыполнения;
	
КонецФункции

#КонецОбласти

#Область ЗагрузкаРасширенногоОтчета

// выводит ошибки возникающие при работе с базой ADO
// БД - "ADODB.Connection" в котором все ошибки случились.
// НачСтроки - строка. Начало строки ошибки.
Функция ОшибкаАДО(БД, НачСтроки="") Экспорт
	
	ТекстОшибки = "";
	//выводит сообщение об ощибке
	// Если даже базу создать не удалось....
	Если ТипЗнч(БД)<>Тип("COMОбъект") Тогда
		ТекстОшибки = НСтр("ru = 'ADO Error: Ошибка открытия соединения!'");
		Возврат ТекстОшибки;
	КонецЕсли;
	
	// Если удалось, но ошибка есть таки...
	Если БД.Errors.Count()<>0 Тогда
		Для Сч=0 По БД.Errors.Count()-1 Цикл
			ТекстСообщения =  НСтр("ru = 'ADO Error: %1 {%2, %3} %4'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1", БД.Errors(Сч).Number());
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%2", БД.Errors(Сч).Source());
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%3", НачСтроки);
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%4", БД.Errors(Сч).Description());
			
			ТекстОшибки = ТекстОшибки + Символы.ПС + ТекстСообщения;
			
		КонецЦикла;
		БД.Errors.Clear();
	Иначе
		ТекстСообщения =  НСтр("ru = 'Ошибка: %1'");
		ТекстОшибки = СтрЗаменить(ТекстСообщения, "%1", ОписаниеОшибки());
	КонецЕсли;
	
	Возврат ТекстОшибки;
	
КонецФункции

Функция ПолучитьСмену()
	
	Смена = Новый Структура;
	Смена.Вставить("НомерКассы");
	Смена.Вставить("НомерСмены");
	Смена.Вставить("ИдСмены");
	Смена.Вставить("ДатаОткрытияСмены");
	Смена.Вставить("ДатаЗакрытияСмены");
	Смена.Вставить("КассирОткрыл");
	Смена.Вставить("КассирЗакрыл");
	Смена.Вставить("Идентификатор");
	Смена.Вставить("КлючСмены");
	Смена.Вставить("СтатусСмены");
	Смена.Вставить("Загружен");
	
	Возврат Смена;
	
КонецФункции

Функция ПолучитьЧек()
	
	Чек = Новый Структура;
	Чек.Вставить("НомерКассы");
	Чек.Вставить("НомерСмены");
	Чек.Вставить("ДатаСмены");
	Чек.Вставить("ИдСмены");
	Чек.Вставить("НомерЧека");
	Чек.Вставить("НомерДокумента");
	Чек.Вставить("ДатаЧека");
	Чек.Вставить("ТипЧека");
	Чек.Вставить("НомерКартыКлиента");
	Чек.Вставить("КлючСмены");
	Чек.Вставить("СуммаСкидки");
	Чек.Вставить("Кассир");
	Чек.Вставить("Загружен");
	
	Возврат Чек;
	
КонецФункции

Функция ПолучитьДиапазонЧеков()
	
	ДиапазонЧеков = Новый Структура;
	ДиапазонЧеков.Вставить("НомерКассы");
	ДиапазонЧеков.Вставить("НомерСмены");
	ДиапазонЧеков.Вставить("ИдСмены");
	ДиапазонЧеков.Вставить("МинНомерЧека");
	ДиапазонЧеков.Вставить("МаксНомерЧека");
	ДиапазонЧеков.Вставить("МинДатаЧека");
	ДиапазонЧеков.Вставить("МаксДатаЧека");
	ДиапазонЧеков.Вставить("КлючСмены");
	
	Возврат ДиапазонЧеков;
	
КонецФункции

Функция ПолучитьСтрокуПродажи()
	
	СтрокаПродажи = Новый Структура;
	СтрокаПродажи.Вставить("НомерКассы");
	СтрокаПродажи.Вставить("НомерСмены");
	СтрокаПродажи.Вставить("ИдСмены");
	СтрокаПродажи.Вставить("НомерЧека");
	СтрокаПродажи.Вставить("КодКассира");
	СтрокаПродажи.Вставить("Артикул");
	СтрокаПродажи.Вставить("ИДСтроки");
	СтрокаПродажи.Вставить("НомерСтроки");
	СтрокаПродажи.Вставить("Цена");
	//СтрокаПродажи.Вставить("ЦенаПоПрайсу");
	СтрокаПродажи.Вставить("Количество");
	СтрокаПродажи.Вставить("Единица");
	СтрокаПродажи.Вставить("Коэффициент");
	СтрокаПродажи.Вставить("Сумма");
	СтрокаПродажи.Вставить("СуммаВсего");
	СтрокаПродажи.Вставить("СтавкаНДС");
	//СтрокаПродажи.Вставить("ГруппаНДС");
	//СтрокаПродажи.Вставить("СуммаНДС");
	СтрокаПродажи.Вставить("ПорядокСкидки");
	СтрокаПродажи.Вставить("ИмяСкидки");
	СтрокаПродажи.Вставить("Скидка");
	СтрокаПродажи.Вставить("СуммаСкидки");
	//СтрокаПродажи.Вставить("НомерСтроки");
	
	Возврат СтрокаПродажи;
	
КонецФункции

Функция ПолучитьСтрокуСкидкиПоКарте()
	
	СтрокаСкидки = Новый Структура;
	СтрокаСкидки.Вставить("НомерКассы");
	СтрокаСкидки.Вставить("НомерСмены");
	СтрокаСкидки.Вставить("ИдСмены");
	СтрокаСкидки.Вставить("НомерЧека");
	СтрокаСкидки.Вставить("НомерКарты");
	СтрокаСкидки.Вставить("ТипКарты");
	
	Возврат СтрокаСкидки;
	
КонецФункции

Функция ПолучитьСтрокуОплаты()
	
	СтрокаОплаты = Новый Структура;
	СтрокаОплаты.Вставить("НомерКассы");
	СтрокаОплаты.Вставить("НомерЧека");
	СтрокаОплаты.Вставить("НомерСмены");
	СтрокаОплаты.Вставить("ИдСмены");
	СтрокаОплаты.Вставить("ТипПлатежа");
	СтрокаОплаты.Вставить("ИДУстройства");
	СтрокаОплаты.Вставить("СуммаПлатежа");
	СтрокаОплаты.Вставить("НомерКарты");
	
	Возврат СтрокаОплаты;
	
КонецФункции

Функция ПолучитьСводнуюСтрокуПродажи()
	
	СтрокаПродажи = Новый Структура;
	СтрокаПродажи.Вставить("НомерКассы");
	СтрокаПродажи.Вставить("ИдСмены");
	СтрокаПродажи.Вставить("Артикул");
	СтрокаПродажи.Вставить("Единица");
	СтрокаПродажи.Вставить("Коэффициент");
	СтрокаПродажи.Вставить("СтавкаНДС");
	СтрокаПродажи.Вставить("Цена");
	СтрокаПродажи.Вставить("КоличествоЧеков");
	СтрокаПродажи.Вставить("КоличествоЧековВозврат");
	СтрокаПродажи.Вставить("Количество");
	СтрокаПродажи.Вставить("КоличествоВозврат");
	СтрокаПродажи.Вставить("Сумма");
	СтрокаПродажи.Вставить("СуммаВозврат");
	СтрокаПродажи.Вставить("СуммаВсего");
	СтрокаПродажи.Вставить("СуммаВсегоВозврат");
	СтрокаПродажи.Вставить("СуммаСкидки");
	СтрокаПродажи.Вставить("СуммаСкидкиВозврат");
	
	Возврат СтрокаПродажи;
	
КонецФункции

Функция ПолучитьСводнуюСтрокуВозвратов()
	
	СтрокаВозврата = Новый Структура;
	СтрокаВозврата.Вставить("НомерКассы");
	СтрокаВозврата.Вставить("ИдСмены");
	СтрокаВозврата.Вставить("Артикул");
	СтрокаВозврата.Вставить("Единица");
	СтрокаВозврата.Вставить("Коэффициент");
	СтрокаВозврата.Вставить("СтавкаНДС");
	СтрокаВозврата.Вставить("Цена");
	СтрокаВозврата.Вставить("КоличествоЧеков");
	СтрокаВозврата.Вставить("Количество");
	СтрокаВозврата.Вставить("Сумма");
	СтрокаВозврата.Вставить("СуммаВсего");
	СтрокаВозврата.Вставить("СуммаСкидки");
	
	Возврат СтрокаВозврата;
	
КонецФункции

Функция ПолучитьСводнуюСтрокуСкидки()
	
	СтрокаСкидки = Новый Структура;
	СтрокаСкидки.Вставить("НомерКассы");
	СтрокаСкидки.Вставить("ИдСмены");
	СтрокаСкидки.Вставить("КоличествоЧеков");
	СтрокаСкидки.Вставить("СуммаВсего");
	СтрокаСкидки.Вставить("СуммаСкидки");
	СтрокаСкидки.Вставить("Скидка");
	СтрокаСкидки.Вставить("ИмяCкидки");
	СтрокаСкидки.Вставить("НомерКарты");
	СтрокаСкидки.Вставить("ТипКарты");
	
	Возврат СтрокаСкидки;
	
КонецФункции

Функция ПолучитьСводнуюСтрокуОплаты()
	
	СтрокаОплаты = Новый Структура;
	СтрокаОплаты.Вставить("НомерКассы");
	СтрокаОплаты.Вставить("ИдСмены");
	СтрокаОплаты.Вставить("КоличествоЧеков");
	СтрокаОплаты.Вставить("ИДУстройства");
	СтрокаОплаты.Вставить("ИмяУстройства");
	СтрокаОплаты.Вставить("НомерКарты");
	СтрокаОплаты.Вставить("СуммаВсего");
	СтрокаОплаты.Вставить("СуммаВсегоВозврат");
	СтрокаОплаты.Вставить("СуммаПлатежа");
	СтрокаОплаты.Вставить("СуммаПлатежаВозврат");
	
	Возврат СтрокаОплаты;
	
КонецФункции

Функция ПолучитьСводнуюСтрокуВозвратаОплаты()
	
	СтрокаОплаты = Новый Структура;
	СтрокаОплаты.Вставить("НомерКассы");
	СтрокаОплаты.Вставить("ИдСмены");
	СтрокаОплаты.Вставить("КоличествоЧеков");
	СтрокаОплаты.Вставить("ИДУстройства");
	СтрокаОплаты.Вставить("ИмяУстройства");
	СтрокаОплаты.Вставить("НомерКарты");
	СтрокаОплаты.Вставить("СуммаВсего");
	СтрокаОплаты.Вставить("СуммаПлатежа");
	
	Возврат СтрокаОплаты;
	
КонецФункции

Функция ПроверитьКорректностьЗагружаемыхСмен(НомерМагазина, БД, СтрокаУсловияКасс, ТаблицаСмен)
	
	Возврат Истина;
	
	Если ТаблицаСмен.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	#Если Клиент Тогда
		ДатаПервойСмены = ТекущаяДата();
	#Иначе
		ДатаПервойСмены = ТекущаяДатаСеанса();
	#КонецЕсли
	
	СтрокаУсловияСмен = "";
	Для Каждого ТекущаяСмена Из ТаблицаСмен Цикл
		СтрокаУсловияСмен = СтрокаУсловияСмен + """" + ТекущаяСмена.КлючСмены + """" + ",";
		ДатаПервойСмены = Мин(ДатаПервойСмены, ТекущаяСмена.ДатаОткрытияСмены);
	КонецЦикла;
	СтрокаУсловияСмен = Лев(СтрокаУсловияСмен,СтрДлина(СтрокаУсловияСмен)-1);
	
	МассивКлючейОшибочныхСмен = Новый Массив;
	НоваяТаблицаСмен = Новый Массив;
	
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	Попытка
		Запрос.Open("select
		|	shift_result.cash_number,
		|	shift_result.cash_id,
		|	shift_result.id,
		|	shift_result.fiscal_sale_ukm+shift_result.nonfiscal_sale_ukm AS sale_sum,
		|	shift_result.fiscal_return_ukm+shift_result.nonfiscal_return_ukm AS return_sum,
		|	InnerTable.receipt_return_sum,
		|	InnerTable.receipt_sale_sum
		|FROM
		|	`shift_result`
		|LEFT JOIN
		|	(SELECT
		|		Sum(IF(receipt.TYPE IN (1,4,9,10), receipt.amount, 0)) AS receipt_return_sum,
		|		Sum(IF(receipt.TYPE IN (1,4,9,10), 0, receipt.amount)) AS receipt_sale_sum,
		|		receipt.cash_number AS cash_number,
		|		receipt.cash_id AS cash_id,
		|		receipt.shift_open AS shift_open
		|	FROM
		|		`receipt`
		|	WHERE
		|		receipt.date >= '"+Формат(ДатаПервойСмены,"ДФ=yyyy-MM-dd")+"' AND 
		|		receipt.store="+НомерМагазина+" AND
		|		receipt.result=0 AND
		|		CONCAT(receipt.cash_number,""-"",receipt.shift_open) IN ("+СтрокаУсловияСмен+")
		|	GROUP BY
		|		receipt.cash_number,
		|		receipt.cash_id,
		|		receipt.shift_open) AS InnerTable
		|	ON
		|		shift_result.cash_number = InnerTable.cash_number AND 
		|		shift_result.cash_id = InnerTable.cash_id AND 
		|		shift_result.id = InnerTable.shift_open
		|WHERE
		|	shift_result.store="+НомерМагазина+" AND
		|	shift_result.cash_number IN ("+СтрокаУсловияКасс+") AND
		|	CONCAT(shift_result.cash_number,""-"",shift_result.id) IN ("+СтрокаУсловияСмен+")
		|ORDER BY
		|	cash_number,
		|	id
		|",БД,2,3,1);
	Исключение
		Возврат Ложь;
	КонецПопытки;
	
	Пока НЕ Запрос.EOF Цикл
		
		СуммаПродажПоСмене = Запрос.Fields("sale_sum").Value;
		СуммаВозвратовПоСмене = Запрос.Fields("return_sum").Value;
		Если Запрос.Fields("receipt_sale_sum").Value = null Тогда
			СуммаПродажПоЧекам = 0;
		Иначе
			СуммаПродажПоЧекам = Запрос.Fields("receipt_sale_sum").Value;
		КонецЕсли;
		Если Запрос.Fields("receipt_return_sum").Value = null Тогда
			СуммаВозвратовПоЧекам = 0;
		Иначе
			СуммаВозвратовПоЧекам = Запрос.Fields("receipt_return_sum").Value;
		КонецЕсли;
		
		Если СуммаПродажПоСмене<>СуммаПродажПоЧекам ИЛИ СуммаВозвратовПоСмене<>СуммаВозвратовПоЧекам Тогда
			КлючСмены = Формат(Запрос.Fields("cash_number").Value, "ЧН=0; ЧГ=0")+"-"+Формат(Запрос.Fields("id").Value,"ЧН=0; ЧГ=0");
			МассивКлючейОшибочныхСмен.Добавить(КлючСмены);
		КонецЕсли;
		
		Запрос.MoveNext();
		
	КонецЦикла;
	
	Запрос.Close();
	
	Если МассивКлючейОшибочныхСмен.Количество()=0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	Для Каждого ТекущаяСмена Из ТаблицаСмен Цикл
		Если МассивКлючейОшибочныхСмен.Найти(ТекущаяСмена.КлючСмены)<>Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НоваяТаблицаСмен.Добавить(ТекущаяСмена);
	КонецЦикла;
	
	тмпСписок = Новый СписокЗначений;
	тмпСписок.ЗагрузитьЗначения(НоваяТаблицаСмен);
	ТаблицаСмен = тмпСписок.ВыгрузитьЗначения();
	
	Возврат Истина;
	
КонецФункции

// Формирует список выгруженных, но не загруженных смен
//
Функция ПолучитьСписокСмен(НомерМагазина, БД, СтрокаУсловияКасс, ТолькоЗакрытые = Ложь, СЗагруженными = Ложь,ДатаНачалаЗагрузкиЧековИКассовыхСмен = Неопределено) Экспорт
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка смен. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаСмен", Неопределено);
	РезультатВыполнения.Вставить("Успешно",     Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки", "");

	ДатаНачалаЗагрузки = Неопределено;
	Если ЗначениеЗаполнено(ДатаНачалаЗагрузкиЧековИКассовыхСмен) Тогда
		ДатаНачалаЗагрузки = ДатаНачалаЗагрузкиЧековИКассовыхСмен;
	КонецЕсли;	
	
	ТаблицаСмен = Новый Массив;
	
#Область ЗапросУКМ

	//Запрос = Новый COMОбъект("ADODB.Recordset");
	//Запрос.CursorLocation = 3;
	//Попытка
	//	Запрос.Open("select
	//	|	shift.cash_number,
	//	|	shift.number,
	//	|	shift.date,
	//	|	shift.id,
	//	|	shift.close_date,
	//	|	shift.return,
	//	|	shift.sale,
	//	|	shift.cancel,
	//	|	shift.cancel_return,
	//	|	shift.ext_status,
	//	|	login.user_id,
	//	|	close_login.user_id as user_id_close
	//	|FROM
	//	|	`shift`
	//	|LEFT JOIN
	//	|	login AS login
	//	|ON
	//	|	shift.store = login.store AND
	//	|	shift.cash_number = login.cash_number AND
	//	|	shift.cash_id = login.cash_id AND
	//	|	shift.login = login.id
	//	|LEFT JOIN
	//	|	login AS close_login
	//	|ON
	//	|	shift.store = close_login.store AND
	//	|	shift.cash_number = close_login.cash_number AND
	//	|	shift.cash_id = close_login.cash_id AND
	//	|	shift.close_login = close_login.id
	//	|WHERE
	//	|	shift.store="+НомерМагазина+" AND " + ?(ДатаНачалаЗагрузки = Неопределено,"", "shift.date > date('" + Формат(ДатаНачалаЗагрузки,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "') AND ") + "
	//	|	shift.cash_number IN ("+СтрокаУсловияКасс+")" + ?(ТолькоЗакрытые, " AND
	//	|	shift.close_date is not NULL", "") + ?(СЗагруженными, "", " AND
	//	|	shift.ext_status=0") + "
	//	|ORDER BY
	//	|	cash_number,
	//	|	number
	//	|",БД,2,3,1);
		
#КонецОбласти

	Сутки = 86400;
	Если ДатаНачалаЗагрузки = НЕОПРЕДЕЛЕНО Тогда		
		ДатаНачалаЧеков = НачалоДня(ТекущаяДата())- Сутки*2;		
	Иначе		
    	ДатаНачалаЧеков = ДатаНачалаЗагрузки - Сутки*2;
	КонецЕсли;
	
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	Попытка
		Запрос.Open("select
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena,
		|	Min(Tp_hz_kassa.tdate) as tdate,
		|	Tp_hz_kassa.cashier,	
		|	Max(Tp_z_report.tdate) as ztdate,
		|	Tp_z_report.cashier as zcashier
		|FROM
		|	Tp_z_report AS Tp_z_report
		|LEFT JOIN
		|	Tp_hz_kassa AS Tp_hz_kassa
		|ON
		|	Tp_z_report.cassa = Tp_hz_kassa.cassa AND
		|	Tp_z_report.smena = Tp_hz_kassa.smena AND
		|	Tp_hz_kassa.tdate >=  date('" + Формат(ДатаНачалаЧеков,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "') 
		|WHERE
		|	Tp_z_report.cassa IN ("+СтрокаУсловияКасс+") " + ?(ДатаНачалаЗагрузки = Неопределено,"", " AND Tp_z_report.tdate > date('" + Формат(ДатаНачалаЗагрузки,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "') ") + "
		|GROUP BY
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena,
		|	Tp_hz_kassa.cashier,
		|	Tp_z_report.cashier
		|ORDER BY
		|	Tp_hz_kassa.cassa,		
		|	Tp_hz_kassa.smena
		|",БД,2,3,1);

	Исключение
		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы смен: '"));
		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;


	//Запрос = Новый COMОбъект("ADODB.Recordset");
	//Запрос.CursorLocation = 3;
	//Попытка
	//	Запрос.Open("select
	//	|	Tp_hz_kassa.cassa,
	//	|	Tp_hz_kassa.smena,
	//	|	Min(Tp_hz_kassa.tdate) as tdate,
	//	|	Tp_hz_kassa.cashier,	
	//	|	Max(Tp_z_report.tdate) as ztdate,
	//	|	Tp_z_report.cashier as zcashier
	//	|FROM
	//	|	Tp_hz_kassa
	//	|LEFT JOIN
	//	|	Tp_z_report AS Tp_z_report
	//	|ON
	//	|	Tp_hz_kassa.cassa = Tp_z_report.cassa AND
	//	|	Tp_hz_kassa.smena = Tp_z_report.smena 
	//	|WHERE
	//	|	Tp_hz_kassa.cassa IN ("+СтрокаУсловияКасс+") " + ?(ДатаНачалаЗагрузки = Неопределено,"", " AND Tp_hz_kassa.tdate > date('" + Формат(ДатаНачалаЗагрузки,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "') ") + "
	//	|	" + ?(ТолькоЗакрытые, " AND not Tp_z_report.tdate is NULL", "") + "
	//	|GROUP BY
	//	|	Tp_hz_kassa.cassa,
	//	|	Tp_hz_kassa.smena,
	//	|	Tp_hz_kassa.cashier,
	//	|	Tp_z_report.cashier
	//	|ORDER BY
	//	|	Tp_hz_kassa.cassa,		
	//	|	Tp_hz_kassa.smena
	//	|",БД,2,3,1);

	//Исключение
	//	ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы смен: '"));
	//	РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
	//	Возврат РезультатВыполнения;
	//КонецПопытки;
	
	СтатусСменыЗакрыта = ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Закрыта");
	СтатусСменыОткрыта = ПредопределенноеЗначение("Перечисление.СтатусыКассовойСмены.Открыта");
		
	Пока НЕ Запрос.EOF Цикл
		
		Попытка
		//КлючСмены = Формат(Запрос.Fields("cash_number").Value, "ЧН=0; ЧГ=0")+"-"+Формат(Запрос.Fields("number").Value,"ЧН=0; ЧГ=0");
			КлючСмены = Формат(Запрос.Fields("cassa").Value, "ЧН=0; ЧГ=0")+"-"+Формат(Запрос.Fields("smena").Value,"ЧН=0; ЧГ=0");
			
			НоваяСтрока = ПолучитьСмену();
			НомКассы = Число(Прав(Запрос.Fields("cassa").Value,1));
			НоваяСтрока.НомерКассы 	 	  = НомКассы;
			НоваяСтрока.НомерСмены        = Запрос.Fields("smena").Value;
			НоваяСтрока.ИдСмены           = Запрос.Fields("smena").Value;
			НоваяСтрока.ДатаОткрытияСмены = Запрос.Fields("tdate").Value;
			НоваяСтрока.ДатаЗакрытияСмены = Запрос.Fields("ztdate").Value;
			НоваяСтрока.КассирОткрыл      = Запрос.Fields("cashier").Value;
			НоваяСтрока.КассирЗакрыл      = Запрос.Fields("zcashier").Value;
			НоваяСтрока.Идентификатор     = Запрос.Fields("smena").Value;
			НоваяСтрока.Загружен          = Ложь;
			НоваяСтрока.КлючСмены         = КлючСмены;
			Если ЗначениеЗаполнено(НоваяСтрока.ДатаЗакрытияСмены) Тогда
				НоваяСтрока.СтатусСмены = СтатусСменыЗакрыта;
			Иначе
				НоваяСтрока.СтатусСмены = СтатусСменыОткрыта;
			КонецЕсли;
			
			ТаблицаСмен.Добавить(НоваяСтрока);
			
		Исключение
			
		КонецПопытки;
		
		Запрос.MoveNext();
		
	КонецЦикла;
	
	Запрос.Close();
	
	//Если ТолькоЗакрытые Тогда
	//	Если НЕ ПроверитьКорректностьЗагружаемыхСмен(НомерМагазина, БД, СтрокаУсловияКасс, ТаблицаСмен) Тогда
	//		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы сумм смен: '"));
	//		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
	//		Возврат РезультатВыполнения;
	//	КонецЕсли;
	//КонецЕсли;
	
	РезультатВыполнения.Успешно     = Истина;
	РезультатВыполнения.ТаблицаСмен = ТаблицаСмен;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка смен. Конец.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСписокЧеков(НомерМагазина, БД, СтрокаУсловияКасс, СЗагруженными = Ложь, ДатаНачалаЗагрузкиЧековИКассовыхСмен = Неопределено,Идентификатор = Неопределено) Экспорт
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка чеков. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаЧеков", Неопределено);
	РезультатВыполнения.Вставить("Успешно",      Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки",  "");
	
	ДатаНачалаЗагрузки = Неопределено;
	Если ЗначениеЗаполнено(ДатаНачалаЗагрузкиЧековИКассовыхСмен) Тогда
		ДатаНачалаЗагрузки = ДатаНачалаЗагрузкиЧековИКассовыхСмен;
	КонецЕсли;	
	
	
	ТаблицаЧеков = Новый Массив;
	
	// получим заголовки чеков
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	
#Область ЗапросУКМ

	//СтрокиУсловияСмен = СтрЗаменить(СтрокаУсловияСмен,",",Символы.ПС);
	//СтрокиУсловияСмен = СтрЗаменить(СтрокиУсловияСмен,"""","");
	//ВсегоСтрок = СтрЧислоСтрок(СтрокиУсловияСмен);
	//СтрокаУсловияЧеков = " ";
	//Для НомерСтроки = 1 по ВсегоСтрок Цикл
	//	ТекущаяСтрока = СтрПолучитьСтроку(СтрокиУсловияСмен,НомерСтроки);
	//	СтрНомерКассы = Лев(ТекущаяСтрока, СтрНайти(ТекущаяСтрока,"-")-1);
	//	Попытка
	//		НомерКассы = Число(СтрНомерКассы);
	//	Исключение
	//		НомерКассы = 0;
	//	КонецПопытки;
	//	ПараметрыПоследнегоЧека = ОфлайнОборудованиеPOSСуперМАГВызовСервера.ПолучитьПоследнийЧек(Идентификатор,НомерКассы);
	//	
	//	НомерЧека = ПараметрыПоследнегоЧека.НомерЧека;
	//	ДатаЧека = ПараметрыПоследнегоЧека.ДатаЧека;
	//	
	//	//(receipt.cash_number = 1 AND receipt.id > 111 AND receipt.DATE >= date('2021-05-02')) OR ...
	//	СтрокаУсловияЧеков = СтрокаУсловияЧеков + "(receipt.cash_number = "+Формат(НомерКассы,"ЧН=0; ЧГ=0")+" AND receipt.id > "+Формат(НомерЧека,"ЧН=0; ЧГ=0")+" AND receipt.DATE >= date('"+Формат(ДатаЧека,"ДФ='yyyy-MM-dd ЧЧ:мм:сс'; ДП='0001-01-01 00:00:00'")+"')) "+?(ВсегоСтрок<>НомерСтроки," OR "," ");
	//КонецЦикла;
	//СтрокаУсловияЧеков = "(" + СтрокаУсловияЧеков + ") AND ";
	//
	//Попытка
	//	//Сост("Получение таблицы чеков...");
	//	Запрос.Open("SELECT
	//	|	receipt.cash_number AS CASHNUMBER,
	//	|	receipt.shift_open AS ZNUMBER,
	//	|	receipt.id AS CHECKNUMBE,
	//	|	receipt.global_number AS global_number,
	//	|	receipt.TYPE,
	//	|	receipt.DATE AS SDATE,
	//	|	receipt.client_card_code AS CARDNUMBER,
	//	|	receipt.ext_processed,
	//	|	login.user_name,
	//	|	login.user_id,
	//	|	shift.number AS number
	//	|FROM
	//	|	`receipt`
	//	|LEFT JOIN
	//	|	login AS login
	//	|ON
	//	|	receipt.store = login.store AND
	//	|	receipt.cash_number = login.cash_number AND
	//	|	receipt.cash_id = login.cash_id AND
	//	|	receipt.login = login.id
	//	|LEFT JOIN
	//	|	shift AS shift
	//	|ON
	//	|	receipt.store = shift.store AND
	//	|	receipt.cash_number = shift.cash_number AND
	//	|	receipt.cash_id = shift.cash_id AND
	//	|	receipt.shift_open = shift.id
	//	|WHERE
	//	|	receipt.date >= '"+Формат(ДатаПервойСмены,"ДФ=yyyy-MM-dd")+"' AND 
	//	|	receipt.store="+НомерМагазина+" AND
	//	|	receipt.result=0 AND " + ?(ДатаНачалаЗагрузки = Неопределено,"", "receipt.DATE > date('" + Формат(ДатаНачалаЗагрузки,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "') AND ") + "
	//	|	"+СтрокаУсловияЧеков+"
	//	|	CONCAT(receipt.cash_number,""-"",receipt.shift_open) IN ("+СтрокаУсловияСмен+")" + ?(СЗагруженными, "", " AND
	//	|	receipt.ext_processed=0") + "
	//	|ORDER BY
	//	|	receipt.cash_number,
	//	|	receipt.shift_open,
	//	|	receipt.id
	//	|",БД,2,3,1);
	
#КонецОбласти

	Попытка
	
		Запрос.Open("select
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena,
		|	Tp_hz_kassa.tdate,
		|	Tp_hz_kassa.nomer,		
		|	Tp_hz_kassa.cashier
		|FROM
		|	Tp_hz_kassa
		|WHERE
		|	Tp_hz_kassa.cassa IN ("+СтрокаУсловияКасс+") AND " + ?(ДатаНачалаЗагрузки = Неопределено,"", "Tp_hz_kassa.tdate > date('" + Формат(ДатаНачалаЗагрузки,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "') ") + "
		|ORDER BY
		|	Tp_hz_kassa.cassa,		
		|	Tp_hz_kassa.smena
		|",БД,2,3,1);
	
	
	Исключение
		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы чеков: '"));
		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
	
	//КоличествоСтрок = Запрос.RecordCount;
	//Сч=0;
	//Индикатор = 0;
	Пока НЕ Запрос.EOF Цикл

		КлючСмены = Формат(Запрос.Fields("cassa").Value,"ЧН=0; ЧГ=0")+"-"+Формат(Запрос.Fields("smena").Value,"ЧН=0; ЧГ=0");
		
		Чек = ПолучитьЧек();
		
		НомКассы = Число(Прав(Запрос.Fields("cassa").Value,1));

		Чек.НомерКассы        = НомКассы;
		Чек.ИдСмены           = Запрос.Fields("smena").Value; // dmboro (Это идентификатор)
		Чек.НомерСмены        = Запрос.Fields("smena").Value; // dmboro (Это номер)
		//Чек.ДатаСмены         = ТаблицаСмен.Найти(НоваяСтрока.KEY,"KEY").SDATEZ;
		Чек.ДатаСмены         = Запрос.Fields("tdate").Value;                                                           		
		//НомерДокумента        = Строка(Запрос.Fields("nomer").Value) + Формат(Запрос.Fields("tdate").Value,"ДФ='yyyMMddЧЧммсс'");
		//НомерЧека             = Чек.НомерКассы + НомерДокумента;
		НомерДокумента        = Запрос.Fields("nomer").Value;
		Чек.НомерЧека         = Запрос.Fields("nomer").Value;
		Чек.ДатаЧека          = Запрос.Fields("tdate").Value;
		Чек.ТипЧека           = 0;
		Чек.НомерКартыКлиента = "";
		Чек.НомерДокумента    = НомерДокумента;
		//Чек.ИмяПользователя   = Запрос.Fields("user_name").Value;
		Чек.Кассир            = Запрос.Fields("cashier").Value;
		Чек.Загружен          = Ложь;
		Чек.КлючСмены         = КлючСмены;
		Чек.СуммаСкидки       = 0;
		
		ТаблицаЧеков.Добавить(Чек);
		
		Запрос.MoveNext();
		//Сч = Сч + 1;
	КонецЦикла;
	Запрос.Close();
	
	//ТаблицаЧеков.Индексы.Добавить("CASHNUMBER,CHECKNUMBE");
	
	РезультатВыполнения.Успешно      = Истина;
	РезультатВыполнения.ТаблицаЧеков = ТаблицаЧеков;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка чеков. Конец.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСписокДиапазоновЧеков(ТаблицаСмен, ТаблицаЧеков)
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаДиапазонов", Неопределено);
	РезультатВыполнения.Вставить("Успешно",           Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки",       "");
	
	ТаблицаДиапазонов = Новый Массив;
	
	КоличествоЧеков = ТаблицаЧеков.Количество();
	ИндексЧека      = 0;
	Для Каждого ТекущаяСмена Из ТаблицаСмен Цикл
		
		ДиапазонЧеков = ПолучитьДиапазонЧеков();
		ДиапазонЧеков.НомерКассы    = ТекущаяСмена.НомерКассы;
		ДиапазонЧеков.ИдСмены       = ТекущаяСмена.ИдСмены;
		ДиапазонЧеков.НомерСмены    = ТекущаяСмена.НомерСмены;
		ДиапазонЧеков.МинНомерЧека  = 0;
		ДиапазонЧеков.МаксНомерЧека = 0;
		ДиапазонЧеков.МинДатаЧека   = '00010101';
		ДиапазонЧеков.МаксДатаЧека  = '00010101';
		ДиапазонЧеков.КлючСмены     = ТекущаяСмена.КлючСмены;
		
		Пока КоличествоЧеков>ИндексЧека Цикл
			ТекущийЧек = ТаблицаЧеков[ИндексЧека];
			
			Если НЕ ТекущаяСмена.НомерКассы = ТекущийЧек.НомерКассы Тогда
				Прервать;
			КонецЕсли;
			
			Если НЕ ТекущаяСмена.ИдСмены = ТекущийЧек.ИдСмены Тогда
				Прервать;
			КонецЕсли;
			
			Если ДиапазонЧеков.МинНомерЧека = 0 Тогда
				ДиапазонЧеков.МинНомерЧека	= ТекущийЧек.НомерЧека;
				ДиапазонЧеков.МаксНомерЧека = ТекущийЧек.НомерЧека;
				ДиапазонЧеков.МинДатаЧека	= ТекущийЧек.ДатаЧека;
				ДиапазонЧеков.МаксДатаЧека	= ТекущийЧек.ДатаЧека;
			ИначеЕсли ТекущийЧек.НомерЧека - ДиапазонЧеков.МаксНомерЧека = 1 Тогда
				ДиапазонЧеков.МаксНомерЧека = ТекущийЧек.НомерЧека;
				ДиапазонЧеков.МаксДатаЧека	= ТекущийЧек.ДатаЧека;
			Иначе
				
				ТаблицаДиапазонов.Добавить(ДиапазонЧеков);
				
				ДиапазонЧеков = ПолучитьДиапазонЧеков();
				ДиапазонЧеков.НомерКассы    = ТекущаяСмена.НомерКассы;
				ДиапазонЧеков.НомерСмены    = ТекущаяСмена.НомерСмены;
				ДиапазонЧеков.ИдСмены       = ТекущаяСмена.ИдСмены;
				ДиапазонЧеков.МинНомерЧека  = ТекущийЧек.НомерЧека;
				ДиапазонЧеков.МаксНомерЧека = ТекущийЧек.НомерЧека;
				ДиапазонЧеков.МинДатаЧека	= ТекущийЧек.ДатаЧека;
				ДиапазонЧеков.МаксДатаЧека	= ТекущийЧек.ДатаЧека;
				ДиапазонЧеков.КлючСмены     = ТекущаяСмена.КлючСмены;
			КонецЕсли;
			
			ИндексЧека = ИндексЧека + 1
			
		КонецЦикла;
		
		ТаблицаДиапазонов.Добавить(ДиапазонЧеков);
		
	КонецЦикла;
	
	РезультатВыполнения.Успешно           = Истина;
	РезультатВыполнения.ТаблицаДиапазонов = ТаблицаДиапазонов;
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСписокПродаж(НомерМагазина, БД, ТаблицаДиапазонов, ДатаНачалаЗагрузкиЧековИКассовыхСмен,СтрокаУсловияКасс)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка продаж. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаПродаж", Неопределено);
	РезультатВыполнения.Вставить("Успешно",       Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки",   "");
	
	
	ДатаНачалаЗагрузки = Неопределено;
	Если ЗначениеЗаполнено(ДатаНачалаЗагрузкиЧековИКассовыхСмен) Тогда
		ДатаНачалаЗагрузки = ДатаНачалаЗагрузкиЧековИКассовыхСмен;
	КонецЕсли;		
	ТаблицаПродаж = Новый Массив;
	
#Область КодУКМ

//	ТекстЗапроса = "";
//	Для Каждого ДиапазонЧеков из ТаблицаДиапазонов Цикл
//		
//		ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "", "UNION ALL") + "
//		|SELECT
//		|	receipt_item.store AS SHOPINDEX,
//		|	receipt_item.cash_number AS CASHNUMBER,
//		|	" + Формат(ДиапазонЧеков.ИдСмены,"ЧГ=") + " AS ZNUMBER,
//		|	" + Формат(ДиапазонЧеков.НомерСмены,"ЧГ=") + " AS Shift_number,
//		|	receipt_item.seller_code AS CASHER,
//		|	receipt_item.receipt_header AS CHECKNUMBE,
//		|	receipt_item.id,
//		|	receipt_item.position,
//		|	receipt_item.price AS price,
//		|	receipt_item.item AS CARDARTICU,
//		|	receipt_item.total_quantity AS QUANTITY,
//		|	receipt_item.measurement AS measurement,
//		|	receipt_item.measurement_precision AS measurement_precision,
//		|	receipt_item.real_amount AS TOTALRUB,
//		|	receipt_item.total AS WODISCRUB,
//		|	receipt_item.tax AS tax,
//		|	receipt_item_discount.sequence AS sequence,
//		|	receipt_item_discount.increment AS increment,
//		|	receipt_discounts.discount_type AS discount_type,
//		|	receipt_discounts.name AS discount_name
//		//|	receipt_tax.percent AS PercentTax
//		|FROM
//		|	`receipt_item`
//		|LEFT JOIN
//		|	receipt_item_discount AS receipt_item_discount
//		|ON
//		|	receipt_item.store = receipt_item_discount.store AND
//		|	receipt_item.cash_number = receipt_item_discount.cash_number AND
//		|	receipt_item.cash_id = receipt_item_discount.cash_id AND
//		|	receipt_item.id = receipt_item_discount.receipt_item
//		|LEFT JOIN
//		|	receipt_discounts AS receipt_discounts
//		|ON
//		|	receipt_item_discount.store = receipt_discounts.store AND
//		|	receipt_item.receipt_header = receipt_discounts.receipt_header AND
//		|	receipt_item_discount.cash_number = receipt_discounts.cash_number AND
//		|	receipt_item_discount.cash_id = receipt_discounts.cash_id AND
//		|	receipt_item_discount.receipt_discount = receipt_discounts.id
//		|WHERE
//		|	receipt_item.store = "+Формат(НомерМагазина,"ЧГ=")+" AND
//		|	receipt_item.type = 0 AND 
//		|	receipt_item.cash_number = "+Формат(ДиапазонЧеков.НомерКассы,"ЧН=0; ЧГ=0")+" AND
//		|	receipt_item.receipt_header between "+Формат(ДиапазонЧеков.МинНомерЧека,"ЧН=0; ЧГ=0")+" and "+Формат(ДиапазонЧеков.МаксНомерЧека,"ЧН=0; ЧГ=0")+"
//		|";
//		
//	КонецЦикла;
//	
//	ТекстЗапроса = ТекстЗапроса + "
//	|ORDER BY
//	|	CASHNUMBER,
//	|	ZNUMBER,
//	|	CHECKNUMBE,
//	|	position,
//	|	sequence
//	|";
	
#КонецОбласти	
	
	ТекстЗапроса = 	"select
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena,
		|	Tp_hz_kassa.tdate,
		|	Tp_hz_kassa.cashid,	
		|	Tp_hz_kassa.nomer,			
		|	Tp_z_kassa.salerid as salerid,
		|	Tp_z_kassa.barcod as barcod,
		|	Tp_z_kassa.line as line,
		|	Tp_z_kassa.how as how,
		|	Tp_z_kassa.price as price,
		|	Tp_z_kassa.summa as summa,
		|	Tp_z_kassa.baseprice as baseprice,	
		|	Tp_z_kassa.knds as knds,			
		|	Tp_z_kassa.disc as disc
		|FROM
		|	Tp_hz_kassa
		|LEFT JOIN
		|	Tp_z_kassa AS Tp_z_kassa
		|ON
		|	Tp_hz_kassa.cassa = Tp_z_kassa.cassa AND
		|	Tp_hz_kassa.tdate = Tp_z_kassa.tdate 
		|WHERE
		|	Tp_hz_kassa.cassa IN ("+СтрокаУсловияКасс+") AND " + ?(ДатаНачалаЗагрузки = Неопределено,"", "Tp_hz_kassa.tdate > date('" + Формат(ДатаНачалаЗагрузки,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "')") + "
		|";
	
	
	// получим заголовки чеков
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	Попытка
		Запрос.Open(ТекстЗапроса, БД,2,3,1);
	Исключение 
		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы продаж: '"));
		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
		
	//КоличествоСтрок = Запрос.RecordCount;
	//Сч=0;
	//Индикатор = 0;
	Пока НЕ Запрос.EOF Цикл
		
		//НомерДокумента        = Строка(Запрос.Fields("nomer").Value) + Формат(Запрос.Fields("tdate").Value,"ДФ='yyyMMddЧЧммсс'");
		//НомерЧека             = Чек.НомерКассы + НомерДокумента;
		НомерДокумента        = Запрос.Fields("nomer").Value;

		СтрокаПродажи = ПолучитьСтрокуПродажи();
		НомКассы = Число(Прав(Запрос.Fields("cassa").Value,1));

		СтрокаПродажи.НомерКассы        = НомКассы;
		СтрокаПродажи.ИдСмены       = Запрос.Fields("smena").Value;
		СтрокаПродажи.НомерСмены    = Запрос.Fields("smena").Value;
		СтрокаПродажи.НомерЧека     = Запрос.Fields("nomer").Value;
		СтрокаПродажи.КодКассира    = Запрос.Fields("salerid").Value;
		СтрокаПродажи.Артикул       = Запрос.Fields("barcod").Value;
		СтрокаПродажи.ИДСтроки      = Запрос.Fields("line").Value;
		СтрокаПродажи.НомерСтроки   = Запрос.Fields("line").Value;
		СтрокаПродажи.Количество    = -Запрос.Fields("how").Value;
		СтрокаПродажи.Единица       = "";
		СтрокаПродажи.Коэффициент   = 1;
		СтрокаПродажи.СуммаВсего    = -Запрос.Fields("summa").Value;
		СтрокаПродажи.Цена          = Запрос.Fields("price").Value;
		СтрокаПродажи.Сумма         = -Запрос.Fields("summa").Value;
		//СтрокаПродажи.СуммаСкидки  = СтрокаПродажи.СуммаВсего - СтрокаПродажи.Сумма;
		СтрокаПродажи.Скидка        = Запрос.Fields("disc").Value;
		СтрокаПродажи.ИмяСкидки     = Запрос.Fields("disc").Value;
		
		ЦенаБезСкидки               = Запрос.Fields("baseprice").Value;
		Если ЦенаБезСкидки <> СтрокаПродажи.Цена Тогда
			
			Сумма      = ЦенаБезСкидки * СтрокаПродажи.Количество;
			СтрокаПродажи.Сумма         = Сумма;
			
			СтрокаПродажи.СуммаСкидки   = Сумма - СтрокаПродажи.СуммаВсего;
			СтрокаПродажи.ПорядокСкидки = 0;
		Иначе
			СтрокаПродажи.СуммаСкидки   = 0;
			СтрокаПродажи.ПорядокСкидки = 0;
			
		КонецЕсли;
		//Если Запрос.Fields("increment").Value = null Тогда
		//	СтрокаПродажи.СуммаСкидки   = 0;
		//	СтрокаПродажи.ПорядокСкидки = 0;
		//Иначе
		//	СтрокаПродажи.СуммаСкидки   = -Запрос.Fields("increment").Value;
		//	СтрокаПродажи.ПорядокСкидки = Запрос.Fields("sequence").Value;
		//КонецЕсли;
		
		КодСтавкиНДС = Запрос.Fields("knds").Value;
		СтрокаПродажи.СтавкаНДС    = 0;			
		//select kod,info from tp_vat where id_typvat=1 order by kod
		Если КодСтавкиНДС = "1" Тогда	
			СтрокаПродажи.СтавкаНДС    = 20;
		ИначеЕсли КодСтавкиНДС = "2" Тогда	
			СтрокаПродажи.СтавкаНДС    = 10;
		Иначе
			СтрокаПродажи.СтавкаНДС    = 0;	
 		КонецЕсли;	

		ТаблицаПродаж.Добавить(СтрокаПродажи);
		
		Запрос.MoveNext();
		//Сч = Сч + 1;
	КонецЦикла;
	Запрос.Close();
	
	РезультатВыполнения.Успешно       = Истина;
	РезультатВыполнения.ТаблицаПродаж = ТаблицаПродаж;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка продаж. Конец.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСписокОплат(НомерМагазина, БД, ТаблицаДиапазонов, ДатаНачалаЗагрузкиЧековИКассовыхСмен,СтрокаУсловияКасс)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка оплат. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаОплат", Неопределено);
	РезультатВыполнения.Вставить("Успешно",       Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки",   "");
	
	ДатаНачалаЗагрузки = Неопределено;
	Если ЗначениеЗаполнено(ДатаНачалаЗагрузкиЧековИКассовыхСмен) Тогда
		ДатаНачалаЗагрузки = ДатаНачалаЗагрузкиЧековИКассовыхСмен;
	КонецЕсли;		
	
	ТаблицаОплат = Новый Массив;
	
#Область КодУКМ
	
	//ТекстЗапроса = "";
	//Для Каждого ДиапазонЧеков из ТаблицаДиапазонов Цикл
	//	
	//	ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "", "UNION ALL") + "
	//	|SELECT DISTINCT
	//	|	receipt_payment.store AS SHOPINDEX,
	//	|	receipt_payment.cash_number AS CASHNUMBER,
	//	|	" + Формат(ДиапазонЧеков.ИдСмены,"ЧГ=") + " AS ZNUMBER,
	//	|	" + Формат(ДиапазонЧеков.НомерСмены,"ЧГ=") + " AS Shift_number,
	//	|	receipt_payment.receipt_header AS CHECKNUMBE,
	//	|	receipt_payment.card_number AS CARDNUMB,
	//	|	receipt_payment.type AS type,
	//	|	receipt_payment.payment_id AS PAYMENT,
	//	|	receipt_payment.amount AS PAYEDRUB
	//	|FROM
	//	|	`receipt_payment`
	//	|WHERE
	//	|	receipt_payment.store="+Формат(НомерМагазина,"ЧГ=")+" AND
	//	|	receipt_payment.type=0 AND 
	//	|	receipt_payment.cash_number = "+Формат(ДиапазонЧеков.НомерКассы,"ЧН=0; ЧГ=0")+" AND
	//	|	receipt_payment.card_number IS NOT NULL AND
	//	|	receipt_payment.receipt_header between "+Формат(ДиапазонЧеков.МинНомерЧека,"ЧН=0; ЧГ=0")+" and "+Формат(ДиапазонЧеков.МаксНомерЧека,"ЧН=0; ЧГ=0")+"
	//	|";
	//	
	//КонецЦикла;
	//
	//ТекстЗапроса = ТекстЗапроса + "
	//|ORDER BY
	//|	CASHNUMBER,
	//|	ZNUMBER,
	//|	CHECKNUMBE
	//|";
	
#КонецОбласти

	ТекстЗапроса = 	"select
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena,
		|	Tp_hz_kassa.tdate,
		|	Tp_hz_kassa.nomer,			
		|	Tp_Payments.summa as summa,
		|	Tp_Payments.payment as payment,
		|	Tp_Payments.line as line	
		|FROM
		|	Tp_hz_kassa
		|LEFT JOIN
		|	Tp_Payments AS Tp_Payments
		|ON
		|	Tp_hz_kassa.cassa = Tp_Payments.cassa AND
		|	Tp_hz_kassa.tdate = Tp_Payments.tdate 	
		|WHERE
		|	Tp_hz_kassa.cassa IN ("+СтрокаУсловияКасс+") AND " + ?(ДатаНачалаЗагрузки = Неопределено,"", "Tp_hz_kassa.tdate > date('" + Формат(ДатаНачалаЗагрузки,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "') ") + "		
		|";


	// получим заголовки чеков
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	Попытка
		Запрос.Open(ТекстЗапроса, БД,2,3,1);
	Исключение 
		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы оплат: '"));
		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
	
	//КоличествоСтрок = Запрос.RecordCount;
	//Сч=0; Индикатор = 0;
	Пока НЕ Запрос.EOF Цикл
		//а=Индикатор;
		//с=Цел(100*Сч/КоличествоСтрок);
		//Если а<>с Тогда
		//	Индикатор = с;
		//КонецЕсли;
		//Сост("Загрузка скидок по д/к...");
		СтрокаОплаты = ПолучитьСтрокуОплаты();
		НомКассы = Число(Прав(Запрос.Fields("cassa").Value,1));
		СтрокаОплаты.НомерКассы   = НомКассы;
		СтрокаОплаты.ИдСмены      = Запрос.Fields("smena").Value;
		СтрокаОплаты.НомерСмены   = Запрос.Fields("smena").Value;
		СтрокаОплаты.НомерЧека    = Запрос.Fields("nomer").Value;
		СтрокаОплаты.ТипПлатежа   = Запрос.Fields("payment").Value;
		СтрокаОплаты.ИДУстройства = Запрос.Fields("line").Value;
		СтрокаОплаты.СуммаПлатежа = -Запрос.Fields("summa").Value;
		СтрокаОплаты.НомерКарты   = "";
		
		ТаблицаОплат.Добавить(СтрокаОплаты);
		//Сч = Сч + 1;
		Запрос.MoveNext();
	КонецЦикла;
	Запрос.Close();
	
	РезультатВыполнения.Успешно      = Истина;
	РезультатВыполнения.ТаблицаОплат = ТаблицаОплат;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка оплат. Конец.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСписокСкидокПоКарте(НомерМагазина, БД, ТаблицаДиапазонов, ДатаНачалаЗагрузкиЧековИКассовыхСмен = Неопределено, СтрокаУсловияКасс)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка скидок по карте. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаСкидокПоКарте", Неопределено);
	РезультатВыполнения.Вставить("Успешно",       Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки",   "");
	
	ДатаНачалаЗагрузки = Неопределено;
	Если ЗначениеЗаполнено(ДатаНачалаЗагрузкиЧековИКассовыхСмен) Тогда
		ДатаНачалаЗагрузки = ДатаНачалаЗагрузкиЧековИКассовыхСмен;
	КонецЕсли;	
	
	ТаблицаСкидокПоКарте = Новый Массив;
	
#Область КодУКМ
	
	//ТекстЗапроса = "";
	//Для Каждого ДиапазонЧеков из ТаблицаДиапазонов Цикл
	//	
	//	ТекстЗапроса = ТекстЗапроса + ?(ТекстЗапроса = "", "", "UNION ALL") + "
	//	|SELECT DISTINCT
	//	|	receipt_discounts.store AS SHOPINDEX,
	//	|	receipt_discounts.cash_number AS CASHNUMBER,
	//	|	" + Формат(ДиапазонЧеков.ИдСмены,"ЧГ=") + " AS ZNUMBER,
	//	|	" + Формат(ДиапазонЧеков.НомерСмены,"ЧГ=") + " AS Shift_number,
	//	|	receipt_discounts.receipt_header AS CHECKNUMBE,
	//	|	receipt_discounts.card_number AS CARDNUMBER,
	//	|	receipt_discounts.card_type AS CARDTYPE
	//	|FROM
	//	|	`receipt_discounts`
	//	|INNER JOIN `receipt`
	//	|on receipt_discounts.receipt_header = receipt.id AND
	//	|receipt.store = "+Формат(НомерМагазина,"ЧГ=")+"  AND " + ?(ДатаНачалаЗагрузки = Неопределено,"", "receipt.date > date('" + Формат(ДатаНачалаЗагрузки,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "') AND ") + "
	//	|receipt.ext_processed=0 AND receipt.date >= date('" + Формат(ДиапазонЧеков.МинДатаЧека,"ДФ='yyyy-MM-dd ЧЧ:мм:сс'; ДП='0001-01-01 00:00:00'") + "') AND receipt.date <= ADDTIME('" + Формат(ДиапазонЧеков.МаксДатаЧека,"ДФ='yyyy-MM-dd ЧЧ:мм:сс'; ДП='0001-01-01 00:00:00'") + "','1')
	//	|WHERE
	//	|	receipt_discounts.store = "+Формат(НомерМагазина,"ЧГ=")+" AND
	//	|	receipt_discounts.cash_number = "+Формат(ДиапазонЧеков.НомерКассы,"ЧН=0; ЧГ=0")+" AND
	//	|	receipt_discounts.card_number IS NOT NULL AND
	//	|	receipt_discounts.receipt_header between "+Формат(ДиапазонЧеков.МинНомерЧека,"ЧН=0; ЧГ=0")+" and "+Формат(ДиапазонЧеков.МаксНомерЧека,"ЧН=0; ЧГ=0")+"
	//	|";
	//	
	//КонецЦикла;
	//
	//ТекстЗапроса = ТекстЗапроса + "
	//|ORDER BY
	//|	CASHNUMBER,
	//|	ZNUMBER,
	//|	CHECKNUMBE
	//|";
#КонецОбласти

	ТекстЗапроса = 	"select
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena,
		|	Tp_hz_kassa.tdate,
		|	Tp_hz_kassa.nomer,			
		|	Max(Tp_Disc.CardCli) as CardCli
		|FROM
		|	Tp_hz_kassa
		|LEFT JOIN
		|	Tp_Disc AS Tp_Disc
		|ON
		|	Tp_hz_kassa.cassa = Tp_Disc.cassa AND
		|	Tp_hz_kassa.tdate = Tp_Disc.tdate AND
		|	Tp_hz_kassa.nomer = Tp_Disc.nomer 		
		|WHERE
		|	not Tp_Disc.CardCli is Null AND Tp_hz_kassa.cassa IN ("+СтрокаУсловияКасс+") AND " + ?(ДатаНачалаЗагрузки = Неопределено,"", "Tp_hz_kassa.tdate > date('" + Формат(ДатаНачалаЗагрузки,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "') ") + "
		|GROUP BY
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena,
		|	Tp_hz_kassa.tdate,
		|	Tp_hz_kassa.nomer		
		|";

	// получим заголовки чеков
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	Попытка
		Запрос.Open(ТекстЗапроса, БД,2,3,1);
	Исключение 
		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы скидок по карте: '"));
		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
	
	//КоличествоСтрок = Запрос.RecordCount;
	//Сч=0; Индикатор = 0;
	Пока НЕ Запрос.EOF Цикл
		//а=Индикатор;
		//с=Цел(100*Сч/КоличествоСтрок);
		//Если а<>с Тогда
		//	Индикатор = с;
		//КонецЕсли;
		//Сост("Загрузка скидок по д/к...");
		СтрокаСкидки = ПолучитьСтрокуСкидкиПоКарте();
		НомКассы = Число(Прав(Запрос.Fields("cassa").Value,1));
		СтрокаСкидки.НомерКассы = НомКассы;
		СтрокаСкидки.ИдСмены    = Запрос.Fields("smena").Value;
		СтрокаСкидки.НомерСмены = Запрос.Fields("smena").Value;
		СтрокаСкидки.НомерЧека  = Запрос.Fields("nomer").Value;
		СтрокаСкидки.НомерКарты = Запрос.Fields("CardCli").Value;
		СтрокаСкидки.ТипКарты   = "";
		
		ТаблицаСкидокПоКарте.Добавить(СтрокаСкидки);
		//Сч = Сч + 1;
		Запрос.MoveNext();
	КонецЦикла;
	Запрос.Close();
	
	РезультатВыполнения.Успешно              = Истина;
	РезультатВыполнения.ТаблицаСкидокПоКарте = ТаблицаСкидокПоКарте;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка скидок по карте. Конец.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСводныйСписокПродаж(НомерМагазина, БД, СтрокаУсловияСмен, ДатаПервойСмены)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение сводного списка продаж. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаСводныхПродаж", Неопределено);
	РезультатВыполнения.Вставить("Успешно",       Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки",   "");
	
	ТаблицаПродаж = Новый Массив;
	
#Область КодУКМ
	
	//ТекстЗапроса = "
	//|SELECT
	//|	InnerTable.cash_number AS CASHNUMBER,
	//|	InnerTable.shift_open AS ZNUMBER,
	//|	COUNT(DISTINCT InnerTable.receipt_id) AS COUNT_CHECK,
	//|	COUNT(DISTINCT InnerTable.id_receipt_return) AS COUNT_CHECK_returned,
	//|	InnerTable.price AS price,
	//|	InnerTable.item AS CARDARTICU,
	//|	Sum(IF(InnerTable.receipt_return, 0, InnerTable.total_quantity)) AS QUANTITY,
	//|	Sum(IF(InnerTable.receipt_return, InnerTable.total_quantity, 0)) AS QUANTITY_returned,
	//|	InnerTable.measurement AS measurement,
	//|	InnerTable.measurement_precision AS measurement_precision,
	//|	Sum(IF(InnerTable.receipt_return, 0, InnerTable.real_amount)) AS TOTALRUB,
	//|	Sum(IF(InnerTable.receipt_return, InnerTable.real_amount, 0)) AS TOTALRUB_returned,
	//|	Sum(IF(InnerTable.receipt_return, 0, InnerTable.total)) AS WODISCRUB,
	//|	Sum(IF(InnerTable.receipt_return, InnerTable.total, 0)) AS WODISCRUB_returned,
	//|	InnerTable.tax AS tax,
	//|	Sum(IF(InnerTable.receipt_return, 0, InnerTable.increment)) AS increment,
	//|	Sum(IF(InnerTable.receipt_return, InnerTable.increment, 0)) AS increment_returned
	//|FROM
	//|	(SELECT
	//|		IF(receipt.TYPE IN (1,4,9,10), TRUE, FALSE) AS receipt_return,
	//|		IF(receipt.TYPE IN (1,4,9,10), receipt.id, NULL) AS id_receipt_return,
	//|		receipt.id AS receipt_id,
	//|		receipt.cash_number AS cash_number,
	//|		receipt.shift_open AS shift_open,
	//|		receipt_item.price AS price,
	//|		receipt_item.item AS item,
	//|		receipt_item.total_quantity AS total_quantity,
	//|		receipt_item.measurement AS measurement,
	//|		receipt_item.measurement_precision AS measurement_precision,
	//|		receipt_item.real_amount AS real_amount,
	//|		receipt_item.total,
	//|		receipt_item.tax AS tax,
	//|		SUM(IFNULL(receipt_item_discount.increment, 0) ) AS increment
	//|	FROM
	//|		`receipt`
	//|	INNER JOIN
	//|		`receipt_item`
	//|	ON
	//|		receipt_item.store = receipt.store AND
	//|		receipt_item.type = 0 AND 
	//|		receipt_item.cash_number = receipt.cash_number AND
	//|		receipt_item.cash_id = receipt.cash_id AND
	//|		receipt_item.receipt_header = receipt.id
	//|	LEFT JOIN
	//|		receipt_item_discount AS receipt_item_discount
	//|	ON
	//|		receipt_item.store = receipt_item_discount.store AND
	//|		receipt_item.cash_number = receipt_item_discount.cash_number AND
	//|		receipt_item.cash_id = receipt_item_discount.cash_id AND
	//|		receipt_item.id = receipt_item_discount.receipt_item
	//|	WHERE
	//|		receipt.date >= '"+Формат(ДатаПервойСмены,"ДФ=yyyy-MM-dd")+"' AND 
	//|		receipt.store="+НомерМагазина+" AND
	//|		receipt.result=0 AND
	//|		CONCAT(receipt.cash_number,""-"",receipt.shift_open) IN ("+СтрокаУсловияСмен+")
	//|	GROUP BY
	//|		IF(receipt.TYPE IN (1,4,9,10), TRUE, FALSE),
	//|		receipt.id,
	//|		receipt_item.id,
	//|		receipt.cash_number,
	//|		receipt.shift_open,
	//|		receipt_item.price,
	//|		receipt_item.item,
	//|		receipt_item.total_quantity,
	//|		receipt_item.measurement,
	//|		receipt_item.measurement_precision,
	//|		receipt_item.real_amount,
	//|		receipt_item.total,
	//|		receipt_item.tax) AS InnerTable
	//|GROUP BY
	//|	InnerTable.cash_number,
	//|	InnerTable.shift_open,
	//|	InnerTable.price,
	//|	InnerTable.item,
	//|	InnerTable.measurement,
	//|	InnerTable.measurement_precision,
	//|	InnerTable.tax
	//|ORDER BY
	//|	CASHNUMBER,
	//|	ZNUMBER
	//|";
	
#КонецОбласти

	ТекстЗапроса = 	"select
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena,
		|	Count(DISTINCT(Tp_hz_kassa.nomer)) AS COUNT_CHECK,
		|	Sum(CASE when Tp_z_kassa.how > 0 then 1 else 0 END) AS COUNT_VCHECK,	
		|	Sum(CASE when Tp_z_kassa.how > 0 then Tp_z_kassa.how else 0 END) AS vhow,	
		|	Sum(CASE when Tp_z_kassa.how > 0 then Tp_z_kassa.summa else 0 END) AS vsumma,			
		|	Tp_z_kassa.barcod as barcod,
		|	Tp_z_kassa.line as line,
		|	Sum(Tp_z_kassa.how) as how,
		|	Tp_z_kassa.price as price,
		|	Sum(Tp_z_kassa.summa) as summa,
		|	Tp_z_kassa.baseprice as baseprice,	
		|	Tp_z_kassa.knds as knds,			
		|	Tp_z_kassa.disc as disc
		|FROM
		|	Tp_hz_kassa
		|LEFT JOIN
		|	Tp_z_kassa AS Tp_z_kassa
		|ON
		|	Tp_hz_kassa.cassa = Tp_z_kassa.cassa AND
		|	Tp_hz_kassa.tdate = Tp_z_kassa.tdate 
		|WHERE
		|	Tp_hz_kassa.smena IN ("+СтрокаУсловияСмен+") AND Tp_hz_kassa.tdate >= date('" + Формат(ДатаПервойСмены,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "')
		|GROUP BY
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena,
		|	Tp_z_kassa.barcod,
		|	Tp_z_kassa.line,	
		|	Tp_z_kassa.price,	
		|	Tp_z_kassa.baseprice,		
		|	Tp_z_kassa.knds,
		|	Tp_z_kassa.disc		
		|";

	
	
	// получим заголовки чеков
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	Попытка
		Запрос.Open(ТекстЗапроса, БД,2,3,1);
	Исключение 
		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы продаж: '"));
		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
		
	//КоличествоСтрок = Запрос.RecordCount;
	//Сч=0;
	//Индикатор = 0;
	Пока НЕ Запрос.EOF Цикл
		СтрокаПродажи = ПолучитьСводнуюСтрокуПродажи();
		НомКассы = Число(Прав(Запрос.Fields("cassa").Value,1));
		СтрокаПродажи.НомерКассы = НомКассы;
		СтрокаПродажи.ИдСмены                = Запрос.Fields("smena").Value;
		СтрокаПродажи.КоличествоЧеков        = Запрос.Fields("COUNT_CHECK").Value;
		СтрокаПродажи.КоличествоЧековВозврат = Запрос.Fields("COUNT_VCHECK").Value;
		СтрокаПродажи.Артикул       		 = Запрос.Fields("barcod").Value;
		СтрокаПродажи.Количество        	 = -Запрос.Fields("how").Value;
		СтрокаПродажи.КоличествоВозврат 	 = Запрос.Fields("vhow").Value;
		СтрокаПродажи.Единица      		 	 = "";
		СтрокаПродажи.Коэффициент   		 = 1;
		
		СтрокаПродажи.СуммаВсего    		 = -Запрос.Fields("summa").Value;
		СтрокаПродажи.Цена          		 = Запрос.Fields("price").Value;
		СтрокаПродажи.Сумма         		 = -Запрос.Fields("summa").Value;
		СтрокаПродажи.СуммаВсегоВозврат 	 = Запрос.Fields("vsumma").Value;
		СтрокаПродажи.СуммаВозврат  		 = Запрос.Fields("vsumma").Value;
		
		ЦенаБезСкидки               = Запрос.Fields("baseprice").Value;
		Если ЦенаБезСкидки <> СтрокаПродажи.Цена Тогда
			
			Сумма      = ЦенаБезСкидки * СтрокаПродажи.Количество;
			СтрокаПродажи.Сумма         = Сумма;
			
			СтрокаПродажи.СуммаСкидки   = Сумма - СтрокаПродажи.СуммаВсего;
		Иначе
			СтрокаПродажи.СуммаСкидки   = 0;
			
		КонецЕсли;

		
		КодСтавкиНДС = Запрос.Fields("knds").Value;
		СтрокаПродажи.СтавкаНДС    = 0;			
		//select kod,info from tp_vat where id_typvat=1 order by kod
		Если КодСтавкиНДС = "1" Тогда	
			СтрокаПродажи.СтавкаНДС    = 20;
		ИначеЕсли КодСтавкиНДС = "2" Тогда	
			СтрокаПродажи.СтавкаНДС    = 10;
		Иначе
			СтрокаПродажи.СтавкаНДС    = 0;	
 		КонецЕсли;	
		
		
		ТаблицаПродаж.Добавить(СтрокаПродажи);
		
		Запрос.MoveNext();
		//Сч = Сч + 1;
	КонецЦикла;
	Запрос.Close();
	
	РезультатВыполнения.Успешно              = Истина;
	РезультатВыполнения.ТаблицаСводныхПродаж = ТаблицаПродаж;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение сводного списка продаж. Конец.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСводныйСписокВозвратов(НомерМагазина, БД, СтрокаУсловияСмен, ДатаПервойСмены)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение сводного списка возвратов. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаСводныхВозвратов", Новый Массив);
	РезультатВыполнения.Вставить("Успешно",       Истина);
	РезультатВыполнения.Вставить("ТекстОшибки",   "");
	
	Возврат РезультатВыполнения;
	
	ТаблицаВозвратов = Новый Массив;
	
	ТекстЗапроса = "
	|SELECT
	|	InnerTable.cash_number AS CASHNUMBER,
	|	InnerTable.shift_open AS ZNUMBER,
	|	COUNT(DISTINCT InnerTable.receipt_id) AS COUNT_CHECK,
	|	InnerTable.price AS price,
	|	InnerTable.item AS CARDARTICU,
	|	Sum(InnerTable.total_quantity) AS QUANTITY,
	|	InnerTable.measurement AS measurement,
	|	InnerTable.measurement_precision AS measurement_precision,
	|	Sum(InnerTable.real_amount) AS TOTALRUB,
	|	Sum(InnerTable.total) AS WODISCRUB,
	|	InnerTable.tax AS tax,
	|	Sum(InnerTable.increment) AS increment
	|FROM
	|	(SELECT
	|		receipt.id AS receipt_id,
	|		receipt.cash_number AS cash_number,
	|		receipt.shift_open AS shift_open,
	|		receipt_item.price AS price,
	|		receipt_item.item AS item,
	|		receipt_item.total_quantity AS total_quantity,
	|		receipt_item.measurement AS measurement,
	|		receipt_item.measurement_precision AS measurement_precision,
	|		receipt_item.real_amount AS real_amount,
	|		receipt_item.total,
	|		receipt_item.tax AS tax,
	|		SUM(IFNULL(receipt_item_discount.increment, 0) ) AS increment
	|	FROM
	|		`receipt`
	|	INNER JOIN
	|		`receipt_item`
	|	ON
	|		receipt_item.store = receipt.store AND
	|		receipt_item.type = 0 AND 
	|		receipt_item.cash_number = receipt.cash_number AND
	|		receipt_item.cash_id = receipt.cash_id AND
	|		receipt_item.receipt_header = receipt.id
	|	LEFT JOIN
	|		receipt_item_discount AS receipt_item_discount
	|	ON
	|		receipt_item.store = receipt_item_discount.store AND
	|		receipt_item.cash_number = receipt_item_discount.cash_number AND
	|		receipt_item.cash_id = receipt_item_discount.cash_id AND
	|		receipt_item.id = receipt_item_discount.receipt_item
	|	WHERE
	|		receipt.date >= '"+Формат(ДатаПервойСмены,"ДФ=yyyy-MM-dd")+"' AND 
	|		receipt.store="+НомерМагазина+" AND
	|		receipt.result=0 AND
	|		receipt.TYPE IN (1,4,9,10) AND
	|		CONCAT(receipt.cash_number,""-"",receipt.shift_open) IN ("+СтрокаУсловияСмен+")
	|	GROUP BY
	|		receipt.id,
	|		receipt_item.id,
	|		receipt.cash_number,
	|		receipt.shift_open,
	|		receipt_item.price,
	|		receipt_item.item,
	|		receipt_item.total_quantity,
	|		receipt_item.measurement,
	|		receipt_item.measurement_precision,
	|		receipt_item.real_amount,
	|		receipt_item.total,
	|		receipt_item.tax) AS InnerTable
	|GROUP BY
	|	InnerTable.cash_number,
	|	InnerTable.shift_open,
	|	InnerTable.price,
	|	InnerTable.item,
	|	InnerTable.measurement,
	|	InnerTable.measurement_precision,
	|	InnerTable.tax
	|ORDER BY
	|	CASHNUMBER,
	|	ZNUMBER
	|";
	
	// получим заголовки чеков
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	Попытка
		Запрос.Open(ТекстЗапроса, БД,2,3,1);
	Исключение 
		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы продаж: '"));
		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
		
	//КоличествоСтрок = Запрос.RecordCount;
	//Сч=0;
	//Индикатор = 0;
	Пока НЕ Запрос.EOF Цикл
		//а=Индикатор;
		//с=Цел(100*Сч/КоличествоСтрок);
		//Если а<>с Тогда
		//	Индикатор = с;
		//КонецЕсли;
		//Сост("Загрузка продаж...");
		//ОбработкаПрерыванияПользователя();
		
		СтрокаВозврата = ПолучитьСводнуюСтрокуВозвратов();
		СтрокаВозврата.НомерКассы      = Запрос.Fields("CASHNUMBER").Value;
		СтрокаВозврата.ИдСмены	       = Запрос.Fields("ZNUMBER").Value;
		СтрокаВозврата.КоличествоЧеков = Запрос.Fields("COUNT_CHECK").Value;
		СтрокаВозврата.Артикул         = Запрос.Fields("CARDARTICU").Value;
		СтрокаВозврата.Количество      = Запрос.Fields("QUANTITY").Value;
		СтрокаВозврата.Единица         = Запрос.Fields("measurement").Value;
		СтрокаВозврата.Коэффициент     = Запрос.Fields("measurement_precision").Value;
		СтрокаВозврата.СуммаВсего      = Запрос.Fields("TOTALRUB").Value;
		СтрокаВозврата.Цена            = Запрос.Fields("price").Value;
		СтрокаВозврата.Сумма           = Запрос.Fields("WODISCRUB").Value;
		СтрокаВозврата.СтавкаНДС       = Запрос.Fields("tax").Value;
		
		Если Запрос.Fields("increment").Value = null Тогда
			СтрокаВозврата.СуммаСкидки = 0;
		Иначе
			СтрокаВозврата.СуммаСкидки = -Запрос.Fields("increment").Value;
		КонецЕсли;
		
		ТаблицаВозвратов.Добавить(СтрокаВозврата);
		
		Запрос.MoveNext();
		//Сч = Сч + 1;
	КонецЦикла;
	Запрос.Close();
	
	РезультатВыполнения.Успешно                 = Истина;
	РезультатВыполнения.ТаблицаСводныхВозвратов = ТаблицаВозвратов;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение сводного списка возвратов. Конец.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСводныйСписокСкидок(НомерМагазина, БД, СтрокаУсловияСмен, ДатаПервойСмены, ТаблицаСводныхПродаж)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение сводного списка скидок. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаСводныхСкидок", Неопределено);
	РезультатВыполнения.Вставить("Успешно",              Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки",          "");
	
	ТаблицаСкидокПоКарте = Новый Массив;
	
#Область КодУКМ
	
	//ТекстЗапроса = "
	//|SELECT
	//|	receipt.shift_open AS ZNUMBER,
	//|	receipt.cash_number AS CASHNUMBER,
	//|	COUNT(DISTINCT receipt.id) AS COUNT_CHECK,
	//|	SUM(receipt.amount) AS TOTALRUB,
	//|	SUM(receipt_item_discount.increment) AS increment,
	//|	receipt_discounts.discount_type AS discount_type,
	//|	receipt_discounts.name AS discount_name,
	//|	receipt_discounts.card_type,
	//|	receipt_discounts.card_number
	//|FROM
	//|	`receipt`
	//|INNER JOIN
	//|	receipt_discounts AS receipt_discounts
	//|ON
	//|	receipt.store = receipt_discounts.store AND
	//|	receipt.id = receipt_discounts.receipt_header AND
	//|	receipt.cash_number = receipt_discounts.cash_number AND
	//|	receipt.cash_id = receipt_discounts.cash_id
	//|INNER JOIN
	//|	receipt_item_discount AS receipt_item_discount
	//|ON
	//|	receipt_item_discount.store = receipt_discounts.store AND
	//|	receipt_item_discount.cash_number = receipt_discounts.cash_number AND
	//|	receipt_item_discount.cash_id = receipt_discounts.cash_id AND
	//|	receipt_item_discount.receipt_discount = receipt_discounts.id
	//|WHERE
	//|	receipt.date >= '"+Формат(ДатаПервойСмены,"ДФ=yyyy-MM-dd")+"' AND 
	//|	receipt.store="+НомерМагазина+" AND
	//|	receipt.result=0 AND
	//|	receipt.TYPE IN (0,5,8) AND
	//|	CONCAT(receipt.cash_number,""-"",receipt.shift_open) IN ("+СтрокаУсловияСмен+")
	//|GROUP BY
	//|	receipt.shift_open,
	//|	receipt.cash_number,
	//|	receipt_discounts.discount_type,
	//|	receipt_discounts.name,
	//|	receipt_discounts.card_type,
	//|	receipt_discounts.card_number
	//|ORDER BY
	//|	CASHNUMBER,
	//|	ZNUMBER
	//|";
		

	//ТекстЗапроса = 	"select
	//	|	Tp_Disc.cassa,
	//	|	Tp_Disc.smena,
	//	|	Count(DISTINCT(Tp_Disc.nomer)) AS COUNT_CHECK,		
	//	|	Sum(Tp_Disc.DiscSum) as DiscSum,
	//	|	Sum(Tp_z_kassa.summa) as summa
	//	|FROM
	//	|	Tp_Disc
	//	|LEFT JOIN
	//	|	Tp_DiscInfo AS Tp_DiscInfo
	//	|ON
	//	|	Tp_Disc.cassa = Tp_DiscInfo.cassa AND
	//	|	Tp_Disc.tdate = Tp_DiscInfo.tdate AND
	//	|	Tp_Disc.NOMER = Tp_DiscInfo.NOMER AND
	//	|	Tp_Disc.LINE  = Tp_DiscInfo.LINE  
	//	|LEFT JOIN
	//	|	Tp_z_kassa AS Tp_z_kassa
	//	|ON
	//	|	Tp_Disc.cassa = Tp_z_kassa.cassa AND
	//	|	Tp_Disc.tdate = Tp_z_kassa.tdate AND
	//	|	Tp_Disc.BARCOD  = Tp_z_kassa.BARCOD 		
	//	|WHERE
	//	|	Tp_Disc.smena IN ("+СтрокаУсловияСмен+") AND Tp_Disc.tdate >= date('" + Формат(ДатаПервойСмены,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "')
	//	|GROUP BY
	//	|	Tp_Disc.cassa,
	//	|	Tp_Disc.smena		
	//	|";
	//
	//
	//// получим заголовки чеков
	//Запрос = Новый COMОбъект("ADODB.Recordset");
	//Запрос.CursorLocation = 3;
	//Попытка
	//	Запрос.Open(ТекстЗапроса, БД,2,3,1);
	//Исключение 
	//	ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы скидок по карте: '"));
	//	РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
	//	Возврат РезультатВыполнения;
	//КонецПопытки;
	//
	////КоличествоСтрок = Запрос.RecordCount;
	////Сч=0; Индикатор = 0;
	//Пока НЕ Запрос.EOF Цикл
	//	//а=Индикатор;
	//	//с=Цел(100*Сч/КоличествоСтрок);
	//	//Если а<>с Тогда
	//	//	Индикатор = с;
	//	//КонецЕсли;
	//	//Сост("Загрузка скидок по д/к...");
	//	СтрокаСкидки = ПолучитьСводнуюСтрокуСкидки();
	//	СтрокаСкидки.НомерКассы      = Запрос.Fields("cassa").Value;
	//	СтрокаСкидки.ИдСмены         = Запрос.Fields("smena").Value;
	//	СтрокаСкидки.КоличествоЧеков = Запрос.Fields("COUNT_CHECK").Value;
	//	СтрокаСкидки.СуммаВсего      = -Запрос.Fields("summa").Value;
	//	СтрокаСкидки.СуммаСкидки     = -Запрос.Fields("DiscSum").Value;
	//	СтрокаСкидки.НомерКарты      = "";//Запрос.Fields("card_number").Value;
	//	СтрокаСкидки.ТипКарты        = "";//Запрос.Fields("card_type").Value;
	//	СтрокаСкидки.Скидка          = "";//Запрос.Fields("discount_type").Value;
	//	СтрокаСкидки.ИмяCкидки       = "";//Запрос.Fields("discount_name").Value;
	//	
	//	ТаблицаСкидокПоКарте.Добавить(СтрокаСкидки);
	//	//Сч = Сч + 1;
	//	Запрос.MoveNext();
	//КонецЦикла;
	//Запрос.Close();
#КонецОбласти	

	массСводныхСкидок = МенеджерОборудованияРарусСервер.ПолучитьСводнуюТаблицуСкидок(ТаблицаСводныхПродаж);
	Для Каждого стр ИЗ массСводныхСкидок Цикл
		
		СтрокаСкидки = ПолучитьСводнуюСтрокуСкидки();
		СтрокаСкидки.НомерКассы      = стр.Касса;
		СтрокаСкидки.ИдСмены         = стр.Смена;
		СтрокаСкидки.КоличествоЧеков = стр.КоличествоЧеков;
		СтрокаСкидки.СуммаВсего      = стр.СуммаВсего;
		СтрокаСкидки.СуммаСкидки     = стр.СуммаСкидки;
		СтрокаСкидки.НомерКарты      = "";//Запрос.Fields("card_number").Value;
		СтрокаСкидки.ТипКарты        = "";//Запрос.Fields("card_type").Value;
		СтрокаСкидки.Скидка          = "";//Запрос.Fields("discount_type").Value;
		СтрокаСкидки.ИмяCкидки       = "";//Запрос.Fields("discount_name").Value;
		
		ТаблицаСкидокПоКарте.Добавить(СтрокаСкидки);
		
	КонецЦикла;
	
	РезультатВыполнения.Успешно              = Истина;
	РезультатВыполнения.ТаблицаСводныхСкидок = ТаблицаСкидокПоКарте;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение сводного списка скидок. Конец.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСводныйСписокОплат(НомерМагазина, БД, СтрокаУсловияСмен, ДатаПервойСмены)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение сводного списка оплат. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаСводныхОплат", Неопределено);
	РезультатВыполнения.Вставить("Успешно",             Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки",         "");
	
	
	ТаблицаОплат = Новый Массив;
	
#Область КодУКМ
	
	//ТекстЗапроса = "
	//|SELECT DISTINCT
	//|	receipt.shift_open AS ZNUMBER,
	//|	receipt.cash_number AS CASHNUMBER,
	//|	receipt_payment.card_number AS CARDNUMB,
	//|	receipt_payment.payment_id AS PAYMENT,
	//|	receipt_payment.payment_name AS PAYMENT_NAME,
	//|	COUNT(DISTINCT IF(receipt.TYPE IN (1,4,9,10), null, receipt.id)) AS COUNT_CHECK,
	//|	SUM(IF(receipt.TYPE IN (1,4,9,10), 0, receipt.amount)) AS TOTALRUB,
	//|	SUM(IF(receipt.TYPE IN (1,4,9,10), receipt.amount, 0)) AS TOTALRUB_returned,
	//|	SUM(IF(receipt.TYPE IN (1,4,9,10), 0, receipt_payment.amount)) AS PAYEDRUB,
	//|	SUM(IF(receipt.TYPE IN (1,4,9,10), receipt_payment.amount, 0)) AS PAYEDRUB_returned
	//|FROM
	//|	`receipt`
	//|INNER JOIN
	//|	`receipt_payment`
	//|ON
	//|	receipt.store = receipt_payment.store AND
	//|	receipt.id = receipt_payment.receipt_header AND
	//|	receipt.cash_number = receipt_payment.cash_number AND
	//|	receipt.cash_id = receipt_payment.cash_id
	//|WHERE
	//|	receipt.date >= '"+Формат(ДатаПервойСмены,"ДФ=yyyy-MM-dd")+"' AND 
	//|	receipt.store="+НомерМагазина+" AND
	//|	receipt.result=0 AND
	//|	CONCAT(receipt.cash_number,""-"",receipt.shift_open) IN ("+СтрокаУсловияСмен+") AND 
	//|	receipt_payment.type=0
	//|GROUP BY
	//|	receipt.shift_open,
	//|	receipt.cash_number,
	//|	receipt_payment.card_number,
	//|	receipt_payment.payment_id,
	//|	receipt_payment.payment_name
	//|ORDER BY
	//|	CASHNUMBER,
	//|	ZNUMBER
	//|";
	
#КонецОбласти
	
	
	ТекстЗапроса = 	"select
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena,
		|	COUNT(DISTINCT Tp_hz_kassa.nomer) as COUNT_CHECK,			
		|	SUM(Tp_Payments.summa) as summa,
		|	SUM(CASE when Tp_Payments.summa > 0 then Tp_Payments.summa else 0 END) AS vsumma,		
		|	Max(Tp_Payments.line) as payment
		|FROM
		|	Tp_hz_kassa
		|LEFT JOIN
		|	Tp_Payments AS Tp_Payments
		|ON
		|	Tp_hz_kassa.cassa = Tp_Payments.cassa AND
		|	Tp_hz_kassa.tdate = Tp_Payments.tdate 	
		|WHERE
		|	Tp_hz_kassa.smena IN ("+СтрокаУсловияСмен+") AND Tp_hz_kassa.tdate >= date('" + Формат(ДатаПервойСмены,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "')	
		|GROUP BY
		|	Tp_hz_kassa.cassa,
		|	Tp_hz_kassa.smena		
		|";
	
	// получим заголовки чеков
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	Попытка
		Запрос.Open(ТекстЗапроса, БД,2,3,1);
	Исключение 
		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы оплат: '"));
		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
	
	//КоличествоСтрок = Запрос.RecordCount;
	//Сч=0; Индикатор = 0;
	Пока НЕ Запрос.EOF Цикл
		
		СтрокаОплаты = ПолучитьСводнуюСтрокуОплаты();
		НомКассы = Число(Прав(Запрос.Fields("cassa").Value,1));
		СтрокаОплаты.НомерКассы 	 = НомКассы;
		СтрокаОплаты.ИдСмены         = Запрос.Fields("smena").Value;
		СтрокаОплаты.КоличествоЧеков = Запрос.Fields("COUNT_CHECK").Value;
		СтрокаОплаты.ИДУстройства    = Запрос.Fields("payment").Value;
		СтрокаОплаты.ИмяУстройства   = "";
		СтрокаОплаты.НомерКарты      = "";
		СтрокаОплаты.СуммаПлатежа        = -Запрос.Fields("summa").Value;
		СтрокаОплаты.СуммаПлатежаВозврат = Запрос.Fields("vsumma").Value;
		СтрокаОплаты.СуммаВсего        = -Запрос.Fields("summa").Value;
		СтрокаОплаты.СуммаВсегоВозврат = Запрос.Fields("vsumma").Value;
		ТаблицаОплат.Добавить(СтрокаОплаты);
		//Сч = Сч + 1;
		Запрос.MoveNext();
	КонецЦикла;
	Запрос.Close();
	
	РезультатВыполнения.Успешно             = Истина;
	РезультатВыполнения.ТаблицаСводныхОплат = ТаблицаОплат;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение сводного списка оплат. Конец.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСводныйСписокВозвратовОплат(НомерМагазина, БД, СтрокаУсловияСмен, ДатаПервойСмены)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение сводного списка возвратов оплат. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаСводныхВозвратовОплат", Новый Массив);
	РезультатВыполнения.Вставить("Успешно",             Истина);
	РезультатВыполнения.Вставить("ТекстОшибки",         "");
	
	Возврат РезультатВыполнения;
	
	ТаблицаОплат = Новый Массив;
	ТекстЗапроса = "
	|SELECT DISTINCT
	|	receipt.shift_open AS ZNUMBER,
	|	receipt.cash_number AS CASHNUMBER,
	|	receipt_payment.card_number AS CARDNUMB,
	|	receipt_payment.payment_id AS PAYMENT,
	|	receipt_payment.payment_name AS PAYMENT_NAME,
	|	COUNT(DISTINCT receipt.id) AS COUNT_CHECK,
	|	SUM(receipt.amount) AS TOTALRUB,
	|	SUM(receipt_payment.amount) AS PAYEDRUB
	|FROM
	|	`receipt`
	|INNER JOIN
	|	`receipt_payment`
	|ON
	|	receipt.store = receipt_payment.store AND
	|	receipt.id = receipt_payment.receipt_header AND
	|	receipt.cash_number = receipt_payment.cash_number AND
	|	receipt.cash_id = receipt_payment.cash_id
	|WHERE
	|	receipt.date >= '"+Формат(ДатаПервойСмены,"ДФ=yyyy-MM-dd")+"' AND 
	|	receipt.store="+НомерМагазина+" AND
	|	receipt.result=0 AND
	|	receipt.TYPE IN (1,4,9,10) AND
	|	CONCAT(receipt.cash_number,""-"",receipt.shift_open) IN ("+СтрокаУсловияСмен+") AND 
	|	receipt_payment.type=0
	|GROUP BY
	|	receipt.shift_open,
	|	receipt.cash_number,
	|	receipt_payment.card_number,
	|	receipt_payment.payment_id,
	|	receipt_payment.payment_name
	|ORDER BY
	|	CASHNUMBER,
	|	ZNUMBER
	|";
	
	// получим заголовки чеков
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	Попытка
		Запрос.Open(ТекстЗапроса, БД,2,3,1);
	Исключение 
		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы оплат: '"));
		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
	
	//КоличествоСтрок = Запрос.RecordCount;
	//Сч=0; Индикатор = 0;
	Пока НЕ Запрос.EOF Цикл
		//а=Индикатор;
		//с=Цел(100*Сч/КоличествоСтрок);
		//Если а<>с Тогда
		//	Индикатор = с;
		//КонецЕсли;
		//Сост("Загрузка скидок по д/к...");
		
		СтрокаОплаты = ПолучитьСводнуюСтрокуВозвратаОплаты();
		СтрокаОплаты.НомерКассы      = Запрос.Fields("CASHNUMBER").Value;
		СтрокаОплаты.ИдСмены         = Запрос.Fields("ZNUMBER").Value;
		СтрокаОплаты.КоличествоЧеков = Запрос.Fields("COUNT_CHECK").Value;
		СтрокаОплаты.ИДУстройства    = Запрос.Fields("PAYMENT").Value;
		СтрокаОплаты.ИмяУстройства   = Запрос.Fields("PAYMENT_NAME").Value;
		СтрокаОплаты.НомерКарты      = Запрос.Fields("CARDNUMB").Value;
		СтрокаОплаты.СуммаПлатежа    = Запрос.Fields("PAYEDRUB").Value;
		СтрокаОплаты.СуммаВсего      = Запрос.Fields("TOTALRUB").Value;
		ТаблицаОплат.Добавить(СтрокаОплаты);
		//Сч = Сч + 1;
		Запрос.MoveNext();
	КонецЦикла;
	Запрос.Close();
	
	РезультатВыполнения.Успешно             = Истина;
	РезультатВыполнения.ТаблицаСводныхВозвратовОплат = ТаблицаОплат;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение сводного списка возвратов оплат. Начало.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьСписокИнкассаций(НомерМагазина, БД, СтрокаУсловияСмен)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка инкассаций. Начало.");
	
	РезультатВыполнения = Новый Структура;
	РезультатВыполнения.Вставить("ТаблицаИнкассаций", Неопределено);
	РезультатВыполнения.Вставить("Успешно",       Ложь);
	РезультатВыполнения.Вставить("ТекстОшибки",   "");
	
	ТаблицаИнкассаций = Новый Массив;
	
	ДатаНачалаЗагрузки = НачалоДня(ТекущаяДата()-3*24*60*60);
	//ДатаНачалаЗагрузки = '20210501';
	
	ТекстЗапроса = "
	|SELECT
	|	moneyoperation.cash_number AS CASHNUMBER,
	|	moneyoperation.shift_number AS ZNUMBER,
	|	moneyoperation.local_number AS local_number,
	|	moneyoperation.global_number AS global_number,
	|	moneyoperation.login AS login,
	|	Max(moneyoperation.date) AS date,
	|	Sum(IF(moneyoperation.type = 100, moneyoperation.amount, 0)) AS amount,
	|	Sum(IF(moneyoperation.type = 101, moneyoperation.amount, 0)) AS amount_return
	|FROM
	|	`moneyoperation`
	|WHERE
	|	moneyoperation.store="+НомерМагазина+" AND 
	//|	CONCAT(moneyoperation.cash_number,""-"",moneyoperation.shift_number) IN ("+СтрокаУсловияСмен+") AND
	//|	moneyoperation.type=100 AND 
	|	moneyoperation.date >= date('" + Формат(ДатаНачалаЗагрузки,"ДФ='yyy-MM-dd ЧЧ:мм:сс'") + "')
	|GROUP BY
	|	moneyoperation.cash_number,
	|	moneyoperation.shift_number,
	|	moneyoperation.local_number,
	|	moneyoperation.global_number,
	|	moneyoperation.login
	|ORDER BY
	|	CASHNUMBER,
	|	ZNUMBER,
	|	date
	|";
	
	// получим заголовки чеков
	Запрос = Новый COMОбъект("ADODB.Recordset");
	Запрос.CursorLocation = 3;
	Попытка
		Запрос.Open(ТекстЗапроса, БД,2,3,1);
	Исключение 
		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Ошибка получения таблицы инкассаций: '"));
		РезультатВыполнения.Вставить("ТекстОшибки", ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
		
	Пока НЕ Запрос.EOF Цикл
		
		СтрокаИнкасация = Новый Структура;
		СтрокаИнкасация.Вставить("НомерКассы",    Запрос.Fields("CASHNUMBER").Value);
		СтрокаИнкасация.Вставить("НомерСмены",    Запрос.Fields("ZNUMBER").Value);
		СтрокаИнкасация.Вставить("НомерДокумента", Запрос.Fields("local_number").Value);
		СтрокаИнкасация.Вставить("НомерДокументаГлоб", Запрос.Fields("global_number").Value);
		СтрокаИнкасация.Вставить("Дата",          Запрос.Fields("date").Value);
		СтрокаИнкасация.Вставить("СуммаВнесения", Запрос.Fields("amount").Value);
		СтрокаИнкасация.Вставить("СуммаИзъятия",  Запрос.Fields("amount_return").Value);
		СтрокаИнкасация.Вставить("Кассир",        Запрос.Fields("login").Value);
		
		ТаблицаИнкассаций.Добавить(СтрокаИнкасация);
		
		Запрос.MoveNext();
		
	КонецЦикла;
	Запрос.Close();
	
	РезультатВыполнения.Успешно           = Истина;
	РезультатВыполнения.ТаблицаИнкассаций = ТаблицаИнкассаций;
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение списка инкассаций. Конец.");
	
	Возврат РезультатВыполнения;
	
КонецФункции

Функция ПолучитьДанныеПоЧекам(БД, НомерМагазина, СтрокаУсловияКасс, ОповещениеОПрогрессеВыполнения,ДатаНачалаЗагрузкиЧековИКассовыхСмен = Неопределено,Идентификатор = Неопределено)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение данных по чекам. Начало.");
	
	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Получение списка смен");
	
	РезультатПолученияСмен = ПолучитьСписокСмен(НомерМагазина, БД, СтрокаУсловияКасс,,,ДатаНачалаЗагрузкиЧековИКассовыхСмен);
	Если НЕ РезультатПолученияСмен.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияСмен.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаСмен = РезультатПолученияСмен.ТаблицаСмен;
	
	Если ТаблицаСмен.Количество() = 0 Тогда
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("ТаблицаСмен",          Новый Массив);
		РезультатВыполнения.Вставить("ТаблицаЧеков",         Новый Массив);
		РезультатВыполнения.Вставить("ТаблицаПродаж",        Новый Массив);
		РезультатВыполнения.Вставить("ТаблицаОплат",         Новый Массив);
		РезультатВыполнения.Вставить("ТаблицаСкидокПоКарте", Новый Массив);
		РезультатВыполнения.Вставить("Успешно",              Истина);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	#Область НеИспользуетсяКодУКМ
	//#Если Клиент Тогда
	//	ДатаПервойСмены = ТекущаяДата();
	//#Иначе
	//	ДатаПервойСмены = ТекущаяДатаСеанса();
	//#КонецЕсли
	//
	//СтрокаУсловияСмен = "";
	//Для Каждого ТекущаяСмена Из ТаблицаСмен Цикл
	//	СтрокаУсловияСмен = СтрокаУсловияСмен + """" + ТекущаяСмена.КлючСмены + """" + ",";
	//	ДатаПервойСмены = Мин(ДатаПервойСмены, ТекущаяСмена.ДатаОткрытияСмены);
	//КонецЦикла;
	//СтрокаУсловияСмен = Лев(СтрокаУсловияСмен,СтрДлина(СтрокаУсловияСмен)-1);
	#КонецОбласти
	
	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Получение данных продаж по чекам");
	
	РезультатПолученияЧеков = ПолучитьСписокЧеков(НомерМагазина, БД, СтрокаУсловияКасс,,ДатаНачалаЗагрузкиЧековИКассовыхСмен,Идентификатор);
	Если НЕ РезультатПолученияЧеков.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияЧеков.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаЧеков = РезультатПолученияЧеков.ТаблицаЧеков;
	
	//РезультатПолученияДиапазонов = ПолучитьСписокДиапазоновЧеков(НомерМагазина, БД, СтрокаУсловияСмен);
	РезультатПолученияДиапазонов = ПолучитьСписокДиапазоновЧеков(ТаблицаСмен, ТаблицаЧеков);
	Если НЕ РезультатПолученияДиапазонов.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияДиапазонов.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаДиапазонов = РезультатПолученияДиапазонов.ТаблицаДиапазонов;
	
	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Получение данных о проданных товарах");
	
	РезультатПолученияПродаж = ПолучитьСписокПродаж(НомерМагазина, БД, ТаблицаДиапазонов, ДатаНачалаЗагрузкиЧековИКассовыхСмен,СтрокаУсловияКасс);
	Если НЕ РезультатПолученияПродаж.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияПродаж.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаПродаж = РезультатПолученияПродаж.ТаблицаПродаж;
	
	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Получение данных о педоставленных скидках");
	
	РезультатПолученияСкидок = ПолучитьСписокСкидокПоКарте(НомерМагазина, БД, ТаблицаДиапазонов,ДатаНачалаЗагрузкиЧековИКассовыхСмен,СтрокаУсловияКасс);
	Если НЕ РезультатПолученияСкидок.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияСкидок.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаСкидокПоКарте = РезультатПолученияСкидок.ТаблицаСкидокПоКарте;
	
	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Получение данных об оплатах");
	
	РезультатПолученияОплат = ПолучитьСписокОплат(НомерМагазина, БД, ТаблицаДиапазонов, ДатаНачалаЗагрузкиЧековИКассовыхСмен,СтрокаУсловияКасс);
	Если НЕ РезультатПолученияОплат.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияОплат.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаОплат = РезультатПолученияОплат.ТаблицаОплат;
	
	РезультатЗагрузки = Новый Структура;
	РезультатЗагрузки.Вставить("ТаблицаСмен",          ТаблицаСмен);
	РезультатЗагрузки.Вставить("ТаблицаЧеков",         ТаблицаЧеков);
	РезультатЗагрузки.Вставить("ТаблицаПродаж",        ТаблицаПродаж);
	РезультатЗагрузки.Вставить("ТаблицаОплат",         ТаблицаОплат);
	РезультатЗагрузки.Вставить("ТаблицаСкидокПоКарте", ТаблицаСкидокПоКарте);
	РезультатЗагрузки.Вставить("Успешно",              Истина);
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение данных по чекам. Конец.");
	
	Возврат РезультатЗагрузки;
	
КонецФункции

Функция ПолучитьДанныеПоЗакрытымСменам(БД, НомерМагазина, СтрокаУсловияКасс, ОповещениеОПрогрессеВыполнения, ДатаНачалаЗагрузкиЧековИКассовыхСмен)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение данных по закрытым сменам. Начало.");
	
	РезультатПолученияСмен = ПолучитьСписокСмен(НомерМагазина, БД, СтрокаУсловияКасс, Истина, ,ДатаНачалаЗагрузкиЧековИКассовыхСмен);
	Если НЕ РезультатПолученияСмен.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияСмен.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаСмен = РезультатПолученияСмен.ТаблицаСмен;
	Если ТаблицаСмен.Количество() = 0 Тогда
		РезультатВыполнения = Новый Структура;
		РезультатВыполнения.Вставить("ТаблицаСмен",                  Новый Массив);
		РезультатВыполнения.Вставить("ТаблицаСводныхПродаж",         Новый Массив);
		РезультатВыполнения.Вставить("ТаблицаСводныхОплат",          Новый Массив);
		РезультатВыполнения.Вставить("ТаблицаСводныхСкидок",         Новый Массив);
		РезультатВыполнения.Вставить("ТаблицаСводныхВозвратов",      Новый Массив);
		РезультатВыполнения.Вставить("ТаблицаСводныхВозвратовОплат", Новый Массив);
		РезультатВыполнения.Вставить("Успешно",                      Истина);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	
	#Если Клиент Тогда
		ДатаПервойСмены = ТекущаяДата();
	#Иначе
		ДатаПервойСмены = ТекущаяДатаСеанса();
	#КонецЕсли

	СтрокаУсловияСмен = "";
	Для Каждого ТекущаяСмена Из ТаблицаСмен Цикл
		СтрокаУсловияСмен = СтрокаУсловияСмен + СтрЗаменить(Строка(ТекущаяСмена.НомерСмены)," ","") + ",";
		ДатаПервойСмены = Мин(ДатаПервойСмены, ТекущаяСмена.ДатаОткрытияСмены);
	КонецЦикла;
	СтрокаУсловияСмен = Лев(СтрокаУсловияСмен,СтрДлина(СтрокаУсловияСмен)-1);

	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Получение данных продаж в сменах");
	
	РезультатПолученияПродаж = ПолучитьСводныйСписокПродаж(НомерМагазина, БД, СтрокаУсловияСмен, ДатаПервойСмены);
	Если НЕ РезультатПолученияПродаж.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияПродаж.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаСводныхПродаж = РезультатПолученияПродаж.ТаблицаСводныхПродаж;
	
	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Получение данных о педоставленных скидках в сменах");
	
	РезультатПолученияСкидок = ПолучитьСводныйСписокСкидок(НомерМагазина, БД, СтрокаУсловияСмен, ДатаПервойСмены, ТаблицаСводныхПродаж);
	Если НЕ РезультатПолученияСкидок.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияСкидок.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаСводныхСкидок = РезультатПолученияСкидок.ТаблицаСводныхСкидок;
	
	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Получение данных об оплатах в сменах");
	
	РезультатПолученияОплат = ПолучитьСводныйСписокОплат(НомерМагазина, БД, СтрокаУсловияСмен, ДатаПервойСмены);
	Если НЕ РезультатПолученияОплат.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияОплат.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаСводныхОплат = РезультатПолученияОплат.ТаблицаСводныхОплат;
	
	РезультатПолученияВозвратов = ПолучитьСводныйСписокВозвратов(НомерМагазина, БД, СтрокаУсловияКасс, ДатаПервойСмены);
	Если НЕ РезультатПолученияВозвратов.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияВозвратов.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Получение данных об возвратах в сменах");
	
	ТаблицаСводныхВозвратов = РезультатПолученияВозвратов.ТаблицаСводныхВозвратов;
	
	РезультатПолученияВозвратовОплат = ПолучитьСводныйСписокВозвратовОплат(НомерМагазина, БД, СтрокаУсловияКасс, ДатаПервойСмены);
	Если НЕ РезультатПолученияВозвратовОплат.Успешно Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияВозвратовОплат.ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ТаблицаСводныхВозвратовОплат = РезультатПолученияВозвратовОплат.ТаблицаСводныхВозвратовОплат;
	
	РезультатЗагрузки = Новый Структура;
	РезультатЗагрузки.Вставить("ТаблицаСмен",                  ТаблицаСмен);
	РезультатЗагрузки.Вставить("ТаблицаСводныхПродаж",         ТаблицаСводныхПродаж);
	РезультатЗагрузки.Вставить("ТаблицаСводныхОплат",          ТаблицаСводныхОплат);
	РезультатЗагрузки.Вставить("ТаблицаСводныхСкидок",         ТаблицаСводныхСкидок);
	РезультатЗагрузки.Вставить("ТаблицаСводныхВозвратов",      ТаблицаСводныхВозвратов);
	РезультатЗагрузки.Вставить("ТаблицаСводныхВозвратовОплат", ТаблицаСводныхВозвратовОплат);
	РезультатЗагрузки.Вставить("Успешно",                      Истина);
	
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение данных по закрытым сменам. Конец.");
	
	Возврат РезультатЗагрузки;
	
КонецФункции

Функция ПолучитьДанныеПоИнкассациям(БД, НомерМагазина, СтрокаУсловияКасс, ОповещениеОПрогрессеВыполнения)
	ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение данных по инкассациям. Начало.");
	
	РезультатЗагрузки = Новый Структура;
	РезультатЗагрузки.Вставить("ТаблицаСмен",       Новый Массив);
	РезультатЗагрузки.Вставить("ТаблицаИнкассаций", Новый Массив);
	РезультатЗагрузки.Вставить("Успешно",           Истина);
		
	#Область ЗагурзкаИнкссацийУКМ
	
	//РезультатПолученияСмен = ПолучитьСписокСмен(НомерМагазина, БД, СтрокаУсловияКасс);
	//Если НЕ РезультатПолученияСмен.Успешно Тогда
	//	РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияСмен.ТекстОшибки);
	//	Возврат РезультатВыполнения;
	//КонецЕсли;
	//
	//ТаблицаСмен = РезультатПолученияСмен.ТаблицаСмен;
	//Если ТаблицаСмен.Количество() = 0 Тогда
	//	РезультатВыполнения = Новый Структура;
	//	РезультатВыполнения.Вставить("ТаблицаСмен",       Новый Массив);
	//	РезультатВыполнения.Вставить("ТаблицаИнкассаций", Новый Массив);
	//	РезультатВыполнения.Вставить("Успешно",           Истина);
	//	Возврат РезультатВыполнения;
	//КонецЕсли;
	//
	//СтрокаУсловияСмен = "";
	//Для Каждого ТекущаяСмена Из ТаблицаСмен Цикл
	//	СтрокаУсловияСмен = СтрокаУсловияСмен + """" + ТекущаяСмена.КлючСмены + """" + ",";
	//КонецЦикла;
	//СтрокаУсловияСмен = Лев(СтрокаУсловияСмен, СтрДлина(СтрокаУсловияСмен)-1);
	//
	//ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Получение данных по инкассациям");
	//
	//РезультатПолученияДанных = ПолучитьСписокИнкассаций(НомерМагазина, БД, СтрокаУсловияСмен);
	//Если НЕ РезультатПолученияДанных.Успешно Тогда
	//	РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, РезультатПолученияДанных.ТекстОшибки);
	//	Возврат РезультатВыполнения;
	//КонецЕсли;
	//
	//ТаблицаИнкассаций = РезультатПолученияДанных.ТаблицаИнкассаций;
	//
	//РезультатЗагрузки = Новый Структура;
	//РезультатЗагрузки.Вставить("ТаблицаСмен",       ТаблицаСмен);
	//РезультатЗагрузки.Вставить("ТаблицаИнкассаций", ТаблицаИнкассаций);
	//РезультатЗагрузки.Вставить("Успешно",           Истина);
	//
	//ОфлайнОборудованиеPOSСуперМАГВызовСервера.ЗаписатьТекстВЛог(Формат(НомерМагазина,"ЧГ=0"),"Получение данных по инкассациям. Конец.");
	//
	#КонецОбласти
	
	Возврат РезультатЗагрузки;
	
КонецФункции

Функция ПолучитьДанныеПродажVRM(Параметры, ОповещениеОПрогрессеВыполнения = Неопределено) Экспорт
	
	Результат = Истина;
	
	МоментВыгрузкиДанных = ТекущаяДата();
	
	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Подключение к устройству");
	
	//Проверим есть ли хоть один каталог свободный, что бы зря не собирать данные
	//По умолчанию все заняты
	// проверим флаг занятости
	БД = Новый COMОбъект("ADODB.Connection");
	СтрокаУКМ = ПолучитьСтрокуПодключения(Параметры, Параметры.БазаИмпорт);
	
	Попытка
		БД.ConnectionString = СтрокаУКМ;
		БД.Open();
		ПодключениеОткрыто = Истина;
	Исключение
		ОписаниеОшибки = НСтр("ru='Ошибка соединения с БД по причине: %1%'");
		ТекстОшибки = СтрЗаменить(ОписаниеОшибки, "%1%", ОписаниеОшибки());
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
	
	НомерМагазина = Формат(Параметры.ИндексМагазина, "ЧН=0; ЧГ=0");
	
	СтрокаУсловияКасс = "";
	Для Каждого ТекущаяКасса Из Параметры.Кассы Цикл
		Если ТекущаяКасса.Активна Тогда
			
			длинаНомераPOS = СтрДлина(Строка(ТекущаяКасса.НомерPOS));
			ТекКасса = НомерМагазина;
			Если длинаНомераPOS = 1 Тогда			
				ТекКасса = НомерМагазина + "00" + Строка(ТекущаяКасса.НомерPOS);
			ИначеЕсли длинаНомераPOS = 2 Тогда			
				ТекКасса = НомерМагазина + "0" + Строка(ТекущаяКасса.НомерPOS);
			ИначеЕсли длинаНомераPOS = 3 Тогда			
				ТекКасса = НомерМагазина + "" + Строка(ТекущаяКасса.НомерPOS);
			КонецЕсли;
			СтрокаУсловияКасс = СтрокаУсловияКасс + ?(СтрокаУсловияКасс = "", "", ",")  + "'" + ТекКасса + "'";
			
		КонецЕсли;
	КонецЦикла;
	
	ТекДата      = НачалоДня(ТекущаяДата());
	
	Если Параметры.Свойство("ДатаНачалаЗагрузкиЧековИКассовыхСмен") Тогда
		ДатаПараметр = НачалоДня(Параметры.ДатаНачалаЗагрузкиЧековИКассовыхСмен);
	Иначе
		ДатаПараметр = ТекДата;
	КонецЕсли;
	ДатаНачалаЗагрузкиЧековИКассовыхСмен = ДатаПараметр;
	
	МоментПоследнейЗагрузки = ОфлайнОборудованиеPOSСуперМАГВызовСервера.ПолучитьПоследнийМоментЗагрузки(Параметры.Идентификатор);
	Если ЗначениеЗаполнено(МоментПоследнейЗагрузки) Тогда
		ДатаНачалаЗагрузкиЧековИКассовыхСмен = МоментПоследнейЗагрузки;	
	КонецЕсли;
	                 

	
	#Область НеудачныйВызовХранимойПроцедуры
	//Сутки = 86400;
	//Пока ДатаПараметр <= ТекДата Цикл
	//	ДатаВЗапрос = Формат(ДатаПараметр,"ДФ=yyyy-MM-dd");
	//	
	//	com = New COMОбъект("ADODB.Command");
	//	com.ActiveConnection=БД;
	//	//com.CommandText ="Qp_ValidSaleDay";
	//	//com.CommandType=4;
	//	//com.Parameters.Append (com.CreateParameter("@day", 135, 1,8));
	//	//com.Parameters.Append (com.CreateParameter("@KodBOMag", 3, 1,4));
	//	//com.Parameters.Append (com.CreateParameter("@KodBOPosX", 3, 1,4));
	//	//com.Parameters.Append (com.CreateParameter("@Ping",3, 1,4));

	//	//com.Parameters(0).value =ДатаВЗапрос;	
	//	
	//	com.CommandText ="Qp_GetSalesDay";
	//	com.CommandType=4;
	//	
	//	//Param = com.CreateParameter("@p1", 200, 2, 20);
	//	//com.Parameters.Append(Param); 
	//	com.Parameters.Append (com.CreateParameter("@res",  202, 2, 36));
	//	
	//	com.Parameters.Append (com.CreateParameter("@id_cassa", 3, 1,4));
	//	com.Parameters.Append (com.CreateParameter("@tdateBG", 135, 1,8));
	//	com.Parameters.Append (com.CreateParameter("@z", 3, 1,4));
	//	com.Parameters.Append (com.CreateParameter("@what",3, 1,4));

	//	//com.Parameters(0).value =7;		
	//	com.Parameters(2).value =ДатаВЗапрос;		
	//	com.Prepared = true;
	//	

	//	Попытка
	//		//com.ExecuteNonQuery();			
	//		RS = com.Execute();
	//		//RETURN_VALUE = com.Parameters("res").Value; 
	//		//RS = com.ExecuteReader()
	//		//com.CommandText = "fetch all in \"<unnamed portal 1>\"";
	//		//
	//		//npgsqlDataReader = com.ExecuteReader();

	//		//	Пока (npgsqlDataReader.Read()) Цикл

	//		//		
	//		//	КонецЦикла;

	//	Исключение 
	//		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Флаг выгрузки: '"));
	//		БД.Close();
	//		Результат = Ложь;
	//		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
	//		Возврат РезультатВыполнения;
	//	КонецПопытки;
	//		 
	//	Пока RS.EOF() = 0 Цикл
	////Пока RS.Read() = 0 Цикл	
	//		//Пока RS.Fields[0].Value.EOF() = 0 Цикл
	//		//	
	//		//КонецЦикла;
	//		RS.MoveNext();
	//	КонецЦикла;		
	//	
	//	ДатаПараметр = ДатаПараметр + Сутки;
	//КонецЦикла;
#КонецОбласти

	ДанныеПоЧекам = ПолучитьДанныеПоЧекам(БД, НомерМагазина, СтрокаУсловияКасс, ОповещениеОПрогрессеВыполнения, ДатаНачалаЗагрузкиЧековИКассовыхСмен, Параметры.Идентификатор);
	Если (НЕ ДанныеПоЧекам.Успешно) Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ДанныеПоЧекам.ТекстОшибки);
		БД.Close();
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ДанныеПоЗакрытымСменам = ПолучитьДанныеПоЗакрытымСменам(БД, НомерМагазина, СтрокаУсловияКасс, ОповещениеОПрогрессеВыполнения, ДатаНачалаЗагрузкиЧековИКассовыхСмен);
	Если (НЕ ДанныеПоЗакрытымСменам.Успешно) Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ДанныеПоЗакрытымСменам.ТекстОшибки);
		БД.Close();
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ДанныеПоИнкассациям = ПолучитьДанныеПоИнкассациям(БД, НомерМагазина, СтрокаУсловияКасс, ОповещениеОПрогрессеВыполнения);
	Если (НЕ ДанныеПоИнкассациям.Успешно) Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ДанныеПоИнкассациям.ТекстОшибки);
		БД.Close();
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	БД.Close();
	
	РезультатЗагрузки = Новый Структура;
	РезультатЗагрузки.Вставить("ДанныеПоЧекам",          ДанныеПоЧекам);
	РезультатЗагрузки.Вставить("ДанныеПоЗакрытымСменам", ДанныеПоЗакрытымСменам);
	РезультатЗагрузки.Вставить("ДанныеПоИнкассациям",    ДанныеПоИнкассациям);
	РезультатЗагрузки.Вставить("Успешно",                 Истина);
	
	Возврат РезультатЗагрузки;
	
КонецФункции

Функция ПолучитьДанныеПродаж(Параметры, ОповещениеОПрогрессеВыполнения = Неопределено)
	
	Результат = Истина;
	
	МоментВыгрузкиДанных = ТекущаяДата();
	
	ОтправитьСообщениеПрогресса(ОповещениеОПрогрессеВыполнения, "Подключение к устройству");
	
	//Проверим есть ли хоть один каталог свободный, что бы зря не собирать данные
	//По умолчанию все заняты
	// проверим флаг занятости
	БД = Новый COMОбъект("ADODB.Connection");
	СтрокаУКМ = ПолучитьСтрокуПодключения(Параметры, Параметры.БазаЭкспорт);
	
	Попытка
		БД.ConnectionString = СтрокаУКМ;
		БД.Open();
		ПодключениеОткрыто = Истина;
	Исключение
		ОписаниеОшибки = НСтр("ru='Ошибка соединения с БД по причине: %1%'");
		ТекстОшибки = СтрЗаменить(ОписаниеОшибки, "%1%", ОписаниеОшибки());
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ТекстОшибки);
		Возврат РезультатВыполнения;
	КонецПопытки;
	
	НомерМагазина = Формат(Параметры.ИндексМагазина, "ЧН=0; ЧГ=0");
	
	СтрокаУсловияКасс = "";
	Для Каждого ТекущаяКасса Из Параметры.Кассы Цикл
		Если ТекущаяКасса.Активна Тогда
			СтрокаУсловияКасс = СтрокаУсловияКасс + ?(СтрокаУсловияКасс = "", "", ",")  + ТекущаяКасса.НомерPOS;
		КонецЕсли;
	КонецЦикла;
	
	Если Параметры.Свойство("ДатаНачалаЗагрузкиЧековИКассовыхСмен") Тогда
		ДатаНачалаЗагрузкиЧековИКассовыхСмен = Параметры.ДатаНачалаЗагрузкиЧековИКассовыхСмен;
	Иначе
		ДатаНачалаЗагрузкиЧековИКассовыхСмен = Неопределено;
	КонецЕсли;

	ДанныеПоЧекам = ПолучитьДанныеПоЧекам(БД, НомерМагазина, СтрокаУсловияКасс, ОповещениеОПрогрессеВыполнения, ДатаНачалаЗагрузкиЧековИКассовыхСмен, Параметры.Идентификатор);
	Если (НЕ ДанныеПоЧекам.Успешно) Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ДанныеПоЧекам.ТекстОшибки);
		БД.Close();
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ДанныеПоЗакрытымСменам = ПолучитьДанныеПоЗакрытымСменам(БД, НомерМагазина, СтрокаУсловияКасс, ОповещениеОПрогрессеВыполнения, ДатаНачалаЗагрузкиЧековИКассовыхСмен);
	Если (НЕ ДанныеПоЗакрытымСменам.Успешно) Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ДанныеПоЗакрытымСменам.ТекстОшибки);
		БД.Close();
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	ДанныеПоИнкассациям = ПолучитьДанныеПоИнкассациям(БД, НомерМагазина, СтрокаУсловияКасс, ОповещениеОПрогрессеВыполнения);
	Если (НЕ ДанныеПоИнкассациям.Успешно) Тогда
		РезультатВыполнения = Новый Структура("Успешно, ТекстОшибки", Ложь, ДанныеПоИнкассациям.ТекстОшибки);
		БД.Close();
		Возврат РезультатВыполнения;
	КонецЕсли;
	
	БД.Close();
	
	РезультатЗагрузки = Новый Структура;
	РезультатЗагрузки.Вставить("ДанныеПоЧекам",          ДанныеПоЧекам);
	РезультатЗагрузки.Вставить("ДанныеПоЗакрытымСменам", ДанныеПоЗакрытымСменам);
	РезультатЗагрузки.Вставить("ДанныеПоИнкассациям",    ДанныеПоИнкассациям);
	РезультатЗагрузки.Вставить("Успешно",                 Истина);
	
	Возврат РезультатЗагрузки;
	
КонецФункции

Процедура ЗафиксироватьВыполненныйОбмен(Параметры, ДиапазоныЧеков, ЗакрытыеСмены, Отказ, ТекстОшибки)
	
	Если ДиапазоныЧеков.Количество() = 0 И ЗакрытыеСмены.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	//БД = Новый COMОбъект("ADODB.Connection");
	//СтрокаУКМ = ПолучитьСтрокуПодключения(Параметры, Параметры.БазаЭкспорт);
	//
	//Попытка
	//	БД.ConnectionString = СтрокаУКМ;
	//	БД.Open();
	//	ПодключениеОткрыто = Истина;
	//Исключение
	//	Отказ       = Истина;
	//	ТекстОшибки = НСтр("ru='Ошибка соединения с БД по причине: %1%'");
	//	БД.Close();
	//	Возврат;
	//КонецПопытки;
	
	НомерМагазина = Формат(Параметры.ИндексМагазина, "ЧН=0; ЧГ=0");
	Для Каждого ДиапазонЧеков Из ДиапазоныЧеков Цикл
	//	
	//	// Установить признак загруженного чека
	//	Команда = Новый COMОбъект("ADODB.Command");
	//	Команда.ActiveConnection = БД;
	//	
	//	Попытка
	//		Команда.CommandText = "
	//		|UPDATE
	//		|	`receipt`
	//		|SET
	//		|	ext_processed=1
	//		|WHERE
	//		|	store="+НомерМагазина+" and
	//		|	cash_number = "+Формат(ДиапазонЧеков.НомерКассы,"ЧН=0; ЧГ=0")+" and
	//		|	shift_open = "+Формат(ДиапазонЧеков.НомерСмены,"ЧН=0; ЧГ=0")+" and
	//		|	id between "+Формат(ДиапазонЧеков.МинНомерЧека,"ЧН=0; ЧГ=0")+" and "+Формат(ДиапазонЧеков.МаксНомерЧека,"ЧН=0; ЧГ=0")+" and 
	//		|	ext_processed = 0";
	//		Команда.Execute(); 
	//	Исключение 
	//		Отказ       = Истина;
	//		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Обновление статусов чеков: '"));
	//		БД.Close();
	//		Возврат;
	//	КонецПопытки;
	
		ОфлайнОборудованиеPOSСуперМАГВызовСервера.УстановитьПоследнийЧек(Параметры.Идентификатор,ДиапазонЧеков.НомерКассы,ДиапазонЧеков.МаксНомерЧека,ДиапазонЧеков.МаксДатаЧека,ДиапазонЧеков.НомерСмены);
	КонецЦикла;
	
	//Для Каждого ТекущаяСмена Из ЗакрытыеСмены Цикл
	//	
	//	// Установить признак загруженного чека
	//	Команда = Новый COMОбъект("ADODB.Command");
	//	Команда.ActiveConnection = БД;
	//	
	//	Попытка
	//		Команда.CommandText = "
	//		|UPDATE
	//		|	`shift`
	//		|SET
	//		|	ext_status=1
	//		|WHERE
	//		|	store = "+НомерМагазина+" and
	//		|	cash_number = "+Формат(ТекущаяСмена.НомерКассы, "ЧН=0; ЧГ=0")+" and
	//		|	id="+Формат(ТекущаяСмена.ИдСмены,"ЧН=0; ЧГ=0")+" and
	//		|	ext_status=0";
	//		Команда.Execute(); 
	//	Исключение 
	//		Отказ       = Истина;
	//		ТекстОшибки = ОшибкаАДО(БД, НСтр("ru = 'Обновление статусов смен: '"));
	//		БД.Close();
	//		Возврат;
	//	КонецПопытки;
	//	
	//КонецЦикла;
	
	//БД.Close();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Функция осуществляет проверку путей по которым хранятся файлы обмена.
//
Функция ТестУстройства(Параметры, ВыходныеПараметры) 
	
	Результат = Истина;
	ТекстОшибкиОбщий = "";
	ВремПараметр = "";
	
	Параметры.Свойство("ИндексМагазина", ВремПараметр);
	Если НЕ ЗначениеЗаполнено(ВремПараметр) Тогда
		Результат = Ложь;
		ТекстОшибкиОбщий = ТекстОшибкиОбщий + ?(ТекстОшибкиОбщий = "", "", Символы.ПС) + НСтр("ru='Индекс магазина не указан.'");
	КонецЕсли;
	
	Параметры.Свойство("Кассы", ВремПараметр);
	Если ТипЗнч(ВремПараметр) = Тип("Массив") И ВремПараметр.Количество() = 0 Тогда
		Результат = Ложь;
		ТекстОшибкиОбщий = ТекстОшибкиОбщий + ?(ТекстОшибкиОбщий = "", "", Символы.ПС) + НСтр("ru='Таблица касс не заполнена.'");
	КонецЕсли;
	
	Параметры.Свойство("ФорматОбмена", ВремПараметр);
	Если НЕ ЗначениеЗаполнено(ВремПараметр) Тогда
		Результат = Ложь;
		ТекстОшибкиОбщий = ТекстОшибкиОбщий + ?(ТекстОшибкиОбщий = "", "", Символы.ПС) + НСтр("ru='Формат обмена не указан.'");
	КонецЕсли;
	
	Параметры.Свойство("Сервер", ВремПараметр);
	Если НЕ ЗначениеЗаполнено(ВремПараметр) Тогда
		Результат = Ложь;
		ТекстОшибкиОбщий = ТекстОшибкиОбщий + ?(ТекстОшибкиОбщий = "", "", Символы.ПС) + НСтр("ru='Сервер не указан.'");
	КонецЕсли;
	
	Параметры.Свойство("Пользователь", ВремПараметр);
	Если НЕ ЗначениеЗаполнено(ВремПараметр) Тогда
		Результат = Ложь;
		ТекстОшибкиОбщий = ТекстОшибкиОбщий + ?(ТекстОшибкиОбщий = "", "", Символы.ПС) + НСтр("ru='Пользователь не указан.'");
	КонецЕсли;
	
	Параметры.Свойство("Пароль", ВремПараметр);
	Если НЕ ЗначениеЗаполнено(ВремПараметр) Тогда
		Результат = Ложь;
		ТекстОшибкиОбщий = ТекстОшибкиОбщий + ?(ТекстОшибкиОбщий = "", "", Символы.ПС) + НСтр("ru='Пароль не указан.'");
	КонецЕсли;
	
	Параметры.Свойство("БазаИмпорт", ВремПараметр);
	Если Параметры.ВыгружатьТовары И ПустаяСтрока(ВремПараметр) Тогда
		Результат = Ложь;
		ТекстОшибкиОбщий = ТекстОшибкиОбщий + ?(ТекстОшибкиОбщий = "", "", Символы.ПС) + НСтр("ru='База импорта не указана.'");
	КонецЕсли;
	
	Параметры.Свойство("БазаЭкспорт", ВремПараметр);
	Если Параметры.ЗагружатьПродажи И ПустаяСтрока(ВремПараметр) Тогда
		Результат = Ложь;
		ТекстОшибкиОбщий = ТекстОшибкиОбщий + ?(ТекстОшибкиОбщий = "", "", Символы.ПС) + НСтр("ru='База экспорта не указана.'");
	КонецЕсли;
	
	Параметры.Свойство("БазаТерминала", ВремПараметр);
	Если Параметры.ВыгружатьСкидки И ПустаяСтрока(ВремПараметр) Тогда
		Результат = Ложь;
		ТекстОшибкиОбщий = ТекстОшибкиОбщий + ?(ТекстОшибкиОбщий = "", "", Символы.ПС) + НСтр("ru='База терминала не указана.'");
	КонецЕсли;
	
	СтрокаУКМ = "";
	СтрокаУКМ = ПолучитьСтрокуПодключения(Параметры, Параметры.БазаИмпорт);	
	//Если Параметры.ВыгружатьТовары И ЗначениеЗаполнено(Параметры.БазаИмпорт) Тогда
	//	СтрокаУКМ = ОфлайнОборудованиеPOSСуперМАГКлиентСервер.ПолучитьСтрокуПодключения(Параметры, Параметры.БазаИмпорт);
	//ИначеЕсли Параметры.ЗагружатьПродажи И ЗначениеЗаполнено(Параметры.БазаЭкспорт) Тогда
	//	СтрокаУКМ = ОфлайнОборудованиеPOSСуперМАГКлиентСервер.ПолучитьСтрокуПодключения(Параметры, Параметры.БазаЭкспорт);
	//ИначеЕсли Параметры.ВыгружатьСкидки И ЗначениеЗаполнено(Параметры.БазаТерминала) Тогда
	//	СтрокаУКМ = ОфлайнОборудованиеPOSСуперМАГКлиентСервер.ПолучитьСтрокуПодключения(Параметры, Параметры.БазаТерминала);
	//КонецЕсли;
	
	Если ЗначениеЗаполнено(СтрокаУКМ) Тогда
		БД = Новый COMОбъект("ADODB.Connection");
		Попытка
			БД.ConnectionString = СтрокаУКМ;
			БД.Open();
			БД.Close();
		Исключение
			Результат      = Ложь;
			ТекстСообщения = НСтр("ru='Ошибка соединения с БД по причине: %1%'");
			ТекстСообщения = СтрЗаменить(ТекстСообщения, "%1%", ОписаниеОшибки());
			ТекстОшибкиОбщий = ТекстОшибкиОбщий + ?(ТекстОшибкиОбщий = "", "", Символы.ПС) + ТекстСообщения;
		КонецПопытки;
	КонецЕсли;
	
	ВыходныеПараметры.Добавить(?(Результат, 0, 999));
	Если НЕ ПустаяСтрока(ТекстОшибкиОбщий) Тогда
		ВыходныеПараметры.Добавить(ТекстОшибкиОбщий);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция СформироватьФайлТоваров(МассивФайлов, тКодировка, ФорматОбмена, Разделитель, Товары, ГруппыТоваров, ВыходныеПараметры)
	
	Результат = Истина;
	
	// таблица штрихкодов
	BAR = Новый XBase();
	BAR.Кодировка=тКодировка;
	BAR.Поля.Добавить("BARCODE","S",15);
	BAR.Поля.Добавить("CARDARTICU","S",30);
	BAR.Поля.Добавить("CARDSIZE","S",10);
	BAR.Поля.Добавить("QUANTITY","N",16,6);
	Попытка УдалитьФайлы(КаталогВременныхФайлов()+"BAR.DBF"); Исключение КонецПопытки;
	BAR.СоздатьФайл(КаталогВременныхФайлов()+"BAR.DBF");
	BAR.АвтоСохранение = Истина;
	
	// таблица товаров
	PLUCASH = Новый XBase();
	PLUCASH.Кодировка=тКодировка;
	PLUCASH.Поля.Добавить("ARTICUL","S",30);
	PLUCASH.Поля.Добавить("NAME","S",80);
	PLUCASH.Поля.Добавить("MESURIMENT","S",10);
	PLUCASH.Поля.Добавить("MESPRESISI","N",16,6);
	PLUCASH.Поля.Добавить("ADD1","S",20);
	PLUCASH.Поля.Добавить("ADD2","S",20);
	PLUCASH.Поля.Добавить("ADD3","S",20);
	PLUCASH.Поля.Добавить("ADDNUM1","N",16,6);
	PLUCASH.Поля.Добавить("ADDNUM2","N",16,6);
	PLUCASH.Поля.Добавить("ADDNUM3","N",16,6);
	PLUCASH.Поля.Добавить("SCALE","S",10);
	PLUCASH.Поля.Добавить("GROOP1","N",6);
	PLUCASH.Поля.Добавить("GROOP2","N",6);
	PLUCASH.Поля.Добавить("GROOP3","N",6);
	PLUCASH.Поля.Добавить("GROOP4","N",6);
	PLUCASH.Поля.Добавить("GROOP5","N",6);
	PLUCASH.Поля.Добавить("PRICERUB","N",16,2);
	PLUCASH.Поля.Добавить("PRICECUR","N",16,2);
	PLUCASH.Поля.Добавить("CLIENTINDE","N",6);
	PLUCASH.Поля.Добавить("COMMENTARY","S",80);
	PLUCASH.Поля.Добавить("DELETED","N",6);
	PLUCASH.Поля.Добавить("MODDATE","D",8);
	PLUCASH.Поля.Добавить("MODTIME","N",6);
	PLUCASH.Поля.Добавить("MODPERSONI","N",16,6);
	Попытка УдалитьФайлы(КаталогВременныхФайлов()+"PLUCASH.DBF"); Исключение КонецПопытки;
	PLUCASH.СоздатьФайл(КаталогВременныхФайлов()+"PLUCASH.DBF");
	PLUCASH.АвтоСохранение = Истина;
	
	Индикатор = 0; Сч = 0; КоличествоСтрок = Товары.Количество();
	
	Для Каждого Товар Из Товары Цикл
		
		Если Товар.ЭтоГруппа Тогда
			Продолжить;
		КонецЕсли;
		
		Индикатор = Цел(100*Сч/КоличествоСтрок); Сч = Сч + 1;
			
		НайденнаяСтрокаГруппы = НайтиГруппуТовара(Товар.КодГруппы, ГруппыТоваров);
		PLUCASH.Добавить();
		Если НайденнаяСтрокаГруппы<>Неопределено Тогда
			PLUCASH.GROOP1	= НайденнаяСтрокаГруппы.Группа1;
			PLUCASH.GROOP2	= НайденнаяСтрокаГруппы.Группа2;
			PLUCASH.GROOP3	= НайденнаяСтрокаГруппы.Группа3;
			PLUCASH.GROOP4	= НайденнаяСтрокаГруппы.Группа4;
			PLUCASH.GROOP5	= НайденнаяСтрокаГруппы.Группа5;
		Иначе
			PLUCASH.GROOP1	= 0;
			PLUCASH.GROOP2	= 0;
			PLUCASH.GROOP3	= 0;
			PLUCASH.GROOP4	= 0;
			PLUCASH.GROOP5	= 0;
		КонецЕсли;
		PLUCASH.ARTICUL		= Товар.Код;
		PLUCASH.NAME		= Товар.Наименование;
		PLUCASH.MESURIMENT	= Товар.ЕдиницаИзмерения;
		PLUCASH.MESPRESISI	= ?(Товар.ЭтоВесовой,0.001,1);
		PLUCASH.PRICERUB	= Товар.Цена;
		//PLUCASH.PRICECUR	= Товар.ЦенаВал;
		//PLUCASH.CLIENTINDE	= Товар.КодКлиента;
		PLUCASH.ADDNUM2		= Товар.СтавкаНДС;
		PLUCASH.SCALE		= "NOSIZE";
		PLUCASH.MODDATE		= ТекущаяДата();
		PLUCASH.DELETED		= 1;
		PLUCASH.COMMENTARY	= "111";
		PLUCASH.MODTIME		= 111;
		
		// заполняем таблицы ШтрихКодов
		Для Каждого ШтрихКод Из Товар.ШтрихКоды Цикл
			
			BAR.Добавить();
			BAR.BARCODE		= ШтрихКод;
			BAR.CARDARTICU	= Товар.Код;
			BAR.CARDSIZE	= "NOSIZE";
			BAR.QUANTITY	= 1;
		КонецЦикла;
			
	КонецЦикла;
	
	Попытка
		// добавим файлы которые отдадим кассам
		МассивФайлов.Добавить("PLUCASH.DBF");
		МассивФайлов.Добавить("BAR.DBF");
		// закрываем файлы
		PLUCASH.ЗакрытьФайл();
		BAR.ЗакрытьФайл();
	Исключение
		Результат = Ложь;
	КонецПопытки;
		
	Возврат Результат;
	
КонецФункции

// Функция возвращает разделитель полей таблицы содержащейся в файле.
//
Функция ПолучитьРазделитель()
	
	Возврат ";";
	
КонецФункции

Функция НайтиГруппуТовара(КодРодителя, ГруппыТоваров) Экспорт 
	
	НайденнаяГруппа = Неопределено;
	Для Каждого СтрокаГруппыТоваров Из ГруппыТоваров Цикл
		Если СтрокаГруппыТоваров.Код = КодРодителя Тогда
			НайденнаяГруппа = СтрокаГруппыТоваров;
			Прервать;
		КонецЕсли;
	КонецЦикла;	
	Возврат НайденнаяГруппа;
	
КонецФункции

// Подготавливает строку для выгрузки.
//
Функция ПодготовитьСтроку(Знач ИсходнаяСтрока, МаксимальнаяДлина=100)
	
	ИсходнаяСтрока = СтрЗаменить(СокрЛП(ИсходнаяСтрока), ПолучитьРазделитель(), " "); 
	ИсходнаяСтрока = СтрЗаменить(ИсходнаяСтрока, "#", " "); 
	ИсходнаяСтрока = Лев(ИсходнаяСтрока, МаксимальнаяДлина);
		 
	Возврат ИсходнаяСтрока;
	
КонецФункции

Процедура ДополнитьФайл(Результат, Файл, ВыходныеПараметры, Параметры, Знач ДанныеДляЗаполнения = Неопределено)

	Разделитель			= Параметры.Разделитель;
	Уровень				= Параметры.Уровень;
	ФорматОбмена		= Параметры.ФорматОбмена;
	Источник			= Параметры.Источник;
	
	Если Уровень = "Номенклатура" Тогда
		
		ДанныеДляЗаполнения = Новый Структура;
		ДанныеДляЗаполнения.Вставить("Код", Формат(Источник.Код, "ЧН=0; ЧГ=0"));
		ДанныеДляЗаполнения.Вставить("Наименование", ПодготовитьСтроку(Источник.Наименование));
		ДанныеДляЗаполнения.Вставить("КодРодительскойГруппы", Источник.КодГруппы);
		//ДанныеДляЗаполнения.Вставить("Артикул", ПодготовитьСтроку(Источник.Артикул, 20));
		ДанныеДляЗаполнения.Вставить("Артикул", "");
		
		Если НЕ Источник.ЭтоГруппа Тогда
			ДанныеДляЗаполнения.Вставить("Коэффициент", "1");
			ДанныеДляЗаполнения.Вставить("КодНалога", ПолучитьКодНалогаПоСтавкеНДС(СокрЛП(Источник.СтавкаНДС)));
			
			//Если ЗначениеЗаполнено(Источник.ЭтоАлкоголь) И Источник.ЭтоАлкоголь Тогда
			Если ЛОЖЬ Тогда
				АлкогольныеРеквизиты = Источник.АлкогольныеРеквизиты;
				ДанныеДляЗаполнения.Вставить("Алкоголь", Истина);
				ДанныеДляЗаполнения.Вставить("Маркируемый", АлкогольныеРеквизиты.Маркируемый);
				ДанныеДляЗаполнения.Вставить("КодВидаАлкогольнойПродукции", АлкогольныеРеквизиты.КодВидаАлкогольнойПродукции);
				ДанныеДляЗаполнения.Вставить("ЕмкостьТары", Формат(АлкогольныеРеквизиты.ЕмкостьТары, "ЧДЦ=3; ЧГ=0"));
				ДанныеДляЗаполнения.Вставить("Крепость", Формат(АлкогольныеРеквизиты.Крепость, "ЧГ=0"));
				ДанныеДляЗаполнения.Вставить("ИННПроизводителя", АлкогольныеРеквизиты.ИННПроизводителя);
				ДанныеДляЗаполнения.Вставить("КПППроизводителя", АлкогольныеРеквизиты.КПППроизводителя);
			Иначе
				ДанныеДляЗаполнения.Вставить("Алкоголь", Ложь);
				ДанныеДляЗаполнения.Вставить("Маркируемый", Ложь);
				ДанныеДляЗаполнения.Вставить("КодВидаАлкогольнойПродукции", "");
				ДанныеДляЗаполнения.Вставить("ЕмкостьТары", "");
				ДанныеДляЗаполнения.Вставить("Крепость", "");
				ДанныеДляЗаполнения.Вставить("ИННПроизводителя", "");
				ДанныеДляЗаполнения.Вставить("КПППроизводителя", "");
			КонецЕсли;
			
			ДанныеДляЗаполнения.Вставить("ВесовойТовар", Источник.ЭтоВесовой);
			ДанныеДляЗаполнения.Вставить("РазрешитьДробноеКоличество", ?(Источник.ЭтоВесовой, "1", "0"));
			
			ДанныеДляЗаполнения.Вставить("НаименованиеУпаковки", Источник.ЕдиницаИзмерения);
				
			Если ТипЗнч(Источник.Штрихкоды) = Тип("Строка") Тогда
				Штрихкод = РазложитьШтрихкод(Источник.Штрихкоды);
			ИначеЕсли ТипЗнч(Источник.Штрихкоды) = Тип("Массив") Тогда
				Штрихкод = "";
				Запятая = "";
				Для Каждого ДанныеШтрихкода Из Источник.Штрихкоды Цикл
					Штрихкод = Штрихкод + Запятая + ДанныеШтрихкода;
					Запятая = ",";
				КонецЦикла;
			Иначе
				Штрихкод = "";
			КонецЕсли;
			ДанныеДляЗаполнения.Вставить("Штрихкод", Формат(Штрихкод, "ЧН=0; ЧГ=0"));
			ДанныеДляЗаполнения.Вставить("Цена", Формат(Источник.Цена, "ЧЦ=15; ЧДЦ=2; ЧГ=0"));
			ДанныеДляЗаполнения.Вставить("Остаток", "");
		КонецЕсли;
		ДобавитьСтрокуВФайл(Файл, Разделитель, ДанныеДляЗаполнения, ФорматОбмена, Источник.ЭтоГруппа);
	ИначеЕсли Уровень = "Характеристика" Тогда
		//
		//Если Источник.ИмеетУпаковки Тогда
		//	
		//	// Наименование
		//	ДанныеДляЗаполнения.Вставить("НаименованиеХарактеристики", ПодготовитьСтроку(Источник.Наименование));
		//	
		//	Если ЗначениеЗаполнено(Источник.Код) Тогда
		//		
		//		ДанныеДляЗаполнения.Вставить("НаименованиеУпаковки", БазоваяЕИ);
		//		
		//		// Код
		//		ДанныеДляЗаполнения.Вставить("Код", Формат(Источник.Код, "ЧН=0; ЧГ=0"));
		//		
		//		Если ТипЗнч(Источник.Штрихкоды) = Тип("Строка") Тогда
		//			
		//			Штрихкод = РазложитьШтрихкод(Источник.Штрихкоды);
		//			
		//		ИначеЕсли ТипЗнч(Источник.Штрихкоды) = Тип("Массив") Тогда
		//			
		//			Штрихкод = "";
		//			Запятая = "";
		//			
		//			Для Каждого ДанныеШтрихкода Из Источник.Штрихкоды Цикл
		//				
		//				Штрихкод = Штрихкод + Запятая + ДанныеШтрихкода.Штрихкод;
		//				Запятая = ",";
		//				
		//			КонецЦикла;
		//			
		//		Иначе
		//			
		//			Штрихкод = "";
		//		КонецЕсли;
		//		
		//		// Штрихкод
		//		ДанныеДляЗаполнения.Вставить("Штрихкод", Формат(Штрихкод, "ЧН=0; ЧГ=0"));
		//		// Цена
		//		ДанныеДляЗаполнения.Вставить("Цена", Формат(Источник.Цена, "ЧЦ=15; ЧДЦ=2; ЧГ=0"));
		//		// Остаток
		//		ДанныеДляЗаполнения.Вставить("Остаток", Формат(Источник.Остаток, "ЧЦ=17; ЧДЦ=3; ЧГ=0"));
		//		
		//		ДобавитьСтрокуВФайл(Файл, Разделитель, ДанныеДляЗаполнения, ФорматОбмена);
		//		
		//	КонецЕсли;
		//	
		//	Для Каждого ТекУпаковка Из Источник.Упаковки Цикл
		//		
		//		Параметры = Новый Структура;
		//		
		//		Параметры.Вставить("Разделитель", Разделитель);
		//		Параметры.Вставить("Уровень", "Упаковка");
		//		Параметры.Вставить("РасширеннаяВыгрузка", РасширеннаяВыгрузка);
		//		Параметры.Вставить("ФорматОбмена", ФорматОбмена);
		//		Параметры.Вставить("Источник", ТекУпаковка);
		//		Параметры.Вставить("БазоваяЕИ", БазоваяЕИ);
		//		
		//		ДополнитьФайл(Результат, Файл, ВыходныеПараметры, Параметры, ДанныеДляЗаполнения);
		//		
		//	КонецЦикла;
		//	
		//Иначе
		//	
		//	// Наименование
		//	ДанныеДляЗаполнения.Вставить("НаименованиеХарактеристики", ПодготовитьСтроку(Источник.Наименование));
		//	// Код
		//	ДанныеДляЗаполнения.Вставить("Код", Формат(Источник.Код, "ЧН=0; ЧГ=0"));
		//	// Цена
		//	ДанныеДляЗаполнения.Вставить("Цена", Формат(Источник.Цена, "ЧЦ=15; ЧДЦ=2; ЧГ=0"));
		//	// Остаток
		//	ДанныеДляЗаполнения.Вставить("Остаток", Формат(Источник.Остаток, "ЧЦ=17; ЧДЦ=3; ЧГ=0"));
		//	
		//	Если ТипЗнч(Источник.Штрихкоды) = Тип("Строка") Тогда
		//		
		//		Штрихкод = РазложитьШтрихкод(Источник.Штрихкоды);
		//		
		//	ИначеЕсли ТипЗнч(Источник.Штрихкоды) = Тип("Массив") Тогда
		//		
		//		Штрихкод = "";
		//		Запятая = "";
		//		
		//		Для Каждого ДанныеШтрихкода Из Источник.Штрихкоды Цикл
		//			
		//			Штрихкод = Штрихкод + Запятая + ДанныеШтрихкода.Штрихкод;
		//			Запятая = ",";
		//			
		//		КонецЦикла;
		//		
		//	Иначе
		//		
		//		Штрихкод = "";
		//	КонецЕсли;
		//	
		//	// Штрихкод
		//	ДанныеДляЗаполнения.Вставить("Штрихкод", Формат(Штрихкод, "ЧН=0; ЧГ=0"));
		//	
		//	ДобавитьСтрокуВФайл(Файл, Разделитель, ДанныеДляЗаполнения, ФорматОбмена);
		//	
		//КонецЕсли;
		//
	ИначеЕсли Уровень = "Упаковка" Тогда
		//
		//МассивСтрокУпаковок = Новый Массив;
		//
		//// Коэффициент
		//ДанныеДляЗаполнения.Вставить("Коэффициент", Формат(1, "ЧЦ=17; ЧДЦ=3; ЧГ=0"));
		//
		//// Наименование
		//ДанныеДляЗаполнения.Вставить("НаименованиеУпаковки", ПодготовитьСтроку(Источник.Наименование));
		//
		//// Код
		//ДанныеДляЗаполнения.Вставить("Код", Формат(Источник.Код, "ЧН=0; ЧГ=0"));
		//// Цена
		//ДанныеДляЗаполнения.Вставить("Цена", Формат(Источник.Цена, "ЧЦ=15; ЧДЦ=2; ЧГ=0"));
		//// Остаток
		//ДанныеДляЗаполнения.Вставить("Остаток", Формат(Источник.Остаток, "ЧЦ=17; ЧДЦ=3; ЧГ=0"));
		//
		//Если ТипЗнч(Источник.Штрихкоды) = Тип("Строка") Тогда
		//	
		//	Штрихкод = РазложитьШтрихкод(Источник.Штрихкоды);
		//	
		//ИначеЕсли ТипЗнч(Источник.Штрихкоды) = Тип("Массив") Тогда
		//	
		//	Штрихкод = "";
		//	Запятая = "";
		//	
		//	Для Каждого ДанныеШтрихкода Из Источник.Штрихкоды Цикл
		//		
		//		Штрихкод = Штрихкод + Запятая + ДанныеШтрихкода.Штрихкод;
		//		Запятая = ",";
		//		
		//	КонецЦикла;
		//	
		//Иначе
		//	
		//	Штрихкод = "";
		//КонецЕсли;
		//	
		//// Штрихкод
		//ДанныеДляЗаполнения.Вставить("Штрихкод", Формат(Штрихкод, "ЧН=0; ЧГ=0"));
		//
		//ДобавитьСтрокуВФайл(Файл, Разделитель, ДанныеДляЗаполнения, ФорматОбмена);
		//
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьКодНалогаПоСтавкеНДС(СтавкаНДС)
	
	КодНалога = Неопределено;
	
	Если СтавкаНДС = "0" Тогда
		
		КодНалога = 4;
		
	ИначеЕсли СтавкаНДС = "10" Тогда
		
		КодНалога = 2;
		
	ИначеЕсли СтавкаНДС = "18" Тогда
		
		КодНалога = 1;
		
	ИначеЕсли СтавкаНДС = "none" Тогда
		
		КодНалога = 3;
		
	КонецЕсли;
	
	Возврат КодНалога;
	
КонецФункции

Процедура СформироватьСтавкиНДС(МассивФайлов, тКодировка, Товары)
	
	Если Товары.Количество()>0 Тогда
		// таблица товаров
		PLUTAX = Новый XBase();
		PLUTAX.Кодировка=тКодировка;
		PLUTAX.Поля.Добавить("CARDARTICU",	"S",30);
		PLUTAX.Поля.Добавить("TAXINDEX",	"N",6,0);
		PLUTAX.Поля.Добавить("TAX",			"N",16,2);
		PLUTAX.Поля.Добавить("TAXSUMRUB",	"N",16,2);
		PLUTAX.Поля.Добавить("TAXSUMCUR",	"N",16,2);
		Попытка УдалитьФайлы(КаталогВременныхФайлов()+"PLUTAX.DBF"); Исключение КонецПопытки;
		PLUTAX.СоздатьФайл(КаталогВременныхФайлов()+"PLUTAX.DBF");
		PLUTAX.АвтоСохранение = Истина;
		
		// заполняем таблицы данными
		Для Каждого СтрокаДанных Из Товары Цикл
			
			Код			= 1;
			СтавкаНДС	= СтрокаДанных.СтавкаНДС;
			
			PLUTAX.Добавить();
			
			PLUTAX.CARDARTICU		= СтрокаДанных.Код;
			PLUTAX.TAXINDEX			= Формат(Код,"ЧГ=0");
			PLUTAX.TAX				= СтавкаНДС;
			PLUTAX.TAXSUMRUB		= 0;
			PLUTAX.TAXSUMCUR		= 0;
		КонецЦикла;
		
		Попытка
			// добавим файлы которые отдадим кассам
			МассивФайлов.Добавить("PLUTAX.DBF");
			// закрываем файлы
			PLUTAX.ЗакрытьФайл();
		Исключение
		КонецПопытки;
		
	КонецЕсли;
	
КонецПроцедуры

Функция СпискиНалоговИКомбинацийНалогов()
	
	Налоги = Новый Массив;
	
	НалогНДС = Новый Структура;
	
	НалогНДС.Вставить("Код");
	НалогНДС.Вставить("Наименование");
	НалогНДС.Вставить("Ставки", Новый Массив);
	
	НалогНДС.Код = "1";
	НалогНДС.Наименование = "НДС";
	
	// 18%
	СтавкаНалога18 = Новый Структура;
	СтавкаНалога18.Вставить("Код", 1);
	СтавкаНалога18.Вставить("Текст", "НДС 18%");
	СтавкаНалога18.Вставить("Значение", 18);
	СтавкаНалога18.Вставить("НомерНалогаККМ", 3);
	НалогНДС.Ставки.Добавить(СтавкаНалога18);
	
	// 10%
	СтавкаНалога10 = Новый Структура;
	СтавкаНалога10.Вставить("Код", 2);
	СтавкаНалога10.Вставить("Текст", "НДС 10%");
	СтавкаНалога10.Вставить("Значение", 10);
	СтавкаНалога10.Вставить("НомерНалогаККМ", 2);
	НалогНДС.Ставки.Добавить(СтавкаНалога10);
	
	// Без НДС
	СтавкаНалогаБезНДС = Новый Структура;
	СтавкаНалогаБезНДС.Вставить("Код", 3);
	СтавкаНалогаБезНДС.Вставить("Текст", "Без НДС");
	СтавкаНалогаБезНДС.Вставить("Значение", 0);
	СтавкаНалогаБезНДС.Вставить("НомерНалогаККМ", 4);
	НалогНДС.Ставки.Добавить(СтавкаНалогаБезНДС);
	
	// 0%
	СтавкаНалога0 = Новый Структура;
	СтавкаНалога0.Вставить("Код", 4);
	СтавкаНалога0.Вставить("Текст", "НДС 0%");
	СтавкаНалога0.Вставить("Значение", 0);
	СтавкаНалога0.Вставить("НомерНалогаККМ", 1);
	НалогНДС.Ставки.Добавить(СтавкаНалога0);
	
	Налоги.Добавить(НалогНДС);
	
	Возврат Налоги;
	
КонецФункции

Процедура ДобавитьСтрокуВФайл(Файл, Разделитель, ДанныеДляЗаполнения, ФорматОбмена, ЭтоГруппа = Ложь)
	
	// ФорматОбмена:
	// 0 - АТОЛ: РМК
	// 1 - Frontol 5
	// 2 - Frontol Win32 v.4.x
	// 3 - Frontol WinCE v.2.x
	// 4 - Frontol xPOS 1.6.x
	// 5 - Frontol xPOS 1.5.x
	// 6 - Frontol xPOS 1.7.x
	
	Наименование = ДанныеДляЗаполнения.Наименование;
	
	Если ДанныеДляЗаполнения.Свойство("НаименованиеХарактеристики") Тогда
		Наименование = Наименование + " " + ДанныеДляЗаполнения.НаименованиеХарактеристики;
	КонецЕсли;
	
	Если ДанныеДляЗаполнения.Свойство("НаименованиеУпаковки") Тогда
		Наименование = Наименование + " " + ДанныеДляЗаполнения.НаименованиеУпаковки;
	КонецЕсли;
	
	Если ЭтоГруппа Тогда
		
		Строка =
			ДанныеДляЗаполнения.Код + Разделитель												// Код (1)
			+ Разделитель																		// Штрихкод (2)
			+ Наименование + Разделитель														// Наименование (3)
			+ Наименование + Разделитель														// Текст для чека (4)
			+ Разделитель																		// Цена (5)
			+ Разделитель																		// Остаток (6)
			+ Разделитель																		// Код группы условий скидки (7)
			+ Разделитель																		// Флаги через запятую (8)
			+ Разделитель																		// Минимальная цена (9)
			+ Разделитель																		// Срок годности (10)
			+ Разделитель																		// Код схемы разрезов (11)
			+ Разделитель																		// Вариант использования разрезов (12).
			+ Разделитель																		// Код схемы внешней автоматической скидки (13).
			+ Разделитель																		// Коэффициент (14)
			+ Разделитель																		// Код базового товара (15)
			+ ?(ФорматОбмена=0, "", ДанныеДляЗаполнения.КодРодительскойГруппы) + Разделитель	// Код родительской группы (16).
			+ "0" + Разделитель																	// Товар или группа: для товара «1» Товар или группа: для группы «0» (17).
			+ Разделитель																		// Номер уровня иерархического списка (18).
			+ Разделитель																		// Код значения первого разреза схемы с кодом «1» (19).
			+ Разделитель																		// Серия номенклатуры (20)
			+ Разделитель																		// Сертификат (21)
			+ Разделитель																		// Код ККМ (22)
			+ Разделитель																		// Код налоговой группы (23)
			+ Разделитель																		// Код весов с ПЭ (24)
			+ Разделитель																		// Код товара в весах ПЭ (25)
			+ Разделитель																		// Артикул (26)
			+ Разделитель																		// Тип скидки/надбавки: (27)
			+ Разделитель																		// Значение товарной скидки/надбавки (28)
			+ Разделитель																		// Максимальная скидка, % (29)
			+ Разделитель																		// Код принтера чеков (30)
			+ Разделитель																		// Файл *.bmp с картинкой (31)
			+ Разделитель																		// Описание (32)
			+ "";																					// Кратность количества (33)
			
	Иначе
		
		Флаги = 
				?(ДанныеДляЗаполнения.ВесовойТовар, "1", "0") + ","							// Дробное количество (весовой) (8.1)
				+ "1,"																		// Продажа (8.2)
				+ "1,"																		// Возврат (8.3)
				+ "0,"																		// Отрицательные остатки / Без ввода количества(8.4)
				+ ?(ФорматОбмена<>3, "0", ?(ДанныеДляЗаполнения.Цена=0, "1", "0")) + ","	// Без ввода количества / Редактирование цены (8.5)
				+ ?(ФорматОбмена=3, "1", "0") + ","											// Списание остатков / Ввод количества вручную(8.6)
				+ ?(ФорматОбмена=3, "", ?(ДанныеДляЗаполнения.Цена=0, "1", "0")) + ","		// Редактирование цены / Печать в чеке (8.7)
				+ ?(ФорматОбмена=3, "", "1");												// Ввод количества вручную / Скидки (8.8)
				
		Если ФорматОбмена > 0 Тогда
			
			Флаги = Флаги + ","
					+ ?(ФорматОбмена=3, "0", "") + ","	// Печатать в документе / Списание остатков (8.9)
					+ ?(ФорматОбмена=3, "0", "");		// Наливаемый товар / Отрицательные остатки(8.10)
					
		КонецЕсли;
		
		Строка =
			ДанныеДляЗаполнения.Код + Разделитель																// Код (1)
			+ ДанныеДляЗаполнения.Штрихкод + Разделитель														// Штрихкод (2)
			+ Наименование + Разделитель																		// Наименование (3)
			+ Наименование + Разделитель																		// Текст для чека (4)
			+ ДанныеДляЗаполнения.Цена + Разделитель															// Цена (5)
			+ ДанныеДляЗаполнения.Остаток + Разделитель															// Остаток (6)
			+ "" + Разделитель																					// Код группы условий скидки (7)
			+ Флаги + Разделитель																				// Флаги через запятую (8)
			+ "" + Разделитель																					// Минимальная цена (9)
			+ "" + Разделитель																					// Срок годности (10)
			+ "" + Разделитель																					// Код схемы разрезов (11)
			+ "" + Разделитель																					// Вариант использования разрезов (12).
			+ "" + Разделитель																					// Код схемы внешней автоматической скидки (13).
			+ ДанныеДляЗаполнения.Коэффициент + Разделитель														// Коэффициент (14)
			+ "" + Разделитель																					// Код базового товара (15)
			+ ?(ФорматОбмена=0, "", ДанныеДляЗаполнения.КодРодительскойГруппы) + Разделитель					// Код родительской группы (16).
			+ "1" + Разделитель																					// Товар или группа: для товара «1» Товар или группа: для группы «0» (17).
			+ "" + Разделитель																					// Номер уровня иерархического списка (18).
			+ "" + Разделитель																					// Код значения первого разреза схемы с кодом «1» (19).
			+ "" + Разделитель																					// Серия номенклатуры (20)
			+ "" + Разделитель																					// Сертификат (21)
			+ "" + Разделитель																					// Код ККМ (22)
			+ ?(ФорматОбмена < 4, ДанныеДляЗаполнения.КодНалога, "") + Разделитель								// Код налоговой группы (23)
			+ "" + Разделитель																					// Код весов с ПЭ (24)
			+ ?(ДанныеДляЗаполнения.ВесовойТовар И ФорматОбмена<3, ДанныеДляЗаполнения.Код, "") + Разделитель	// Код товара в весах ПЭ (25)
			+ ДанныеДляЗаполнения.Артикул + Разделитель															// Артикул (26)
			+ "" + Разделитель																					// Тип скидки/надбавки: (27)
			+ "" + Разделитель																					// Значение товарной скидки/надбавки (28)
			+ "" + Разделитель																					// Максимальная скидка, % (29)
			+ "" + Разделитель																					// Код принтера чеков (30)
			+ "" + Разделитель																					// Файл *.bmp с картинкой (31)
			+ "" + Разделитель																					// Описание (32)
			+ "";																								// Кратность количества (33)
			
			Если ФорматОбмена = 1 ИЛИ ФорматОбмена = 2 ИЛИ ФорматОбмена = 6 Тогда
				
				Строка = Строка + Разделитель
						+ Разделитель																				// Код ценника (34)
						+ Разделитель																				// Тип вознаграждения (35)
						+ Разделитель																				// Значение вознаграждения (36)
						+ Разделитель																				// Номер секции ККМ (37)
						+ Разделитель																				// ГТД (38)
						+ Разделитель																				// Код группы печати чека (39)
						+ Разделитель																				// Код группы печати копии (40)
						+ Разделитель																				// Код группы печати счета (41)
						+ Разделитель																				// Код группы печати марки (42)
						+ Разделитель																				// Код предприятия (43)
						+ Разделитель																				// Не используется (44)
						+ Разделитель																				// Номер сообщения в весах с ПЭ (45)
						+ Разделитель																				// Не используется (46)
						+ Разделитель																				// Значение флага «Визуальный выбор модификаторов при регистрации» (47)
						+ Разделитель																				// Левая граница допустимого суммарного удельного веса модификаторов (48)
						+ Разделитель																				// Правая граница допустимого суммарного удельного веса модификаторов (49)
						+ Разделитель																				// Текстовое сообщение для весов с ПЭ (50)
						+ Разделитель																				// Тип товара (51)
						+ Разделитель																				// Код тарифицируемой услуги (52)
						+ ДанныеДляЗаполнения.КодВидаАлкогольнойПродукции + Разделитель								// Код вида алкогольной или спиртосодержащей продукции (53)
						+ ДанныеДляЗаполнения.ЕмкостьТары + Разделитель												// Емкость тары в литрах (54)
						+ ?(ДанныеДляЗаполнения.Алкоголь, "1", "0") + Разделитель									// Алкогольная продукция (55)
						+ ?(ДанныеДляЗаполнения.Алкоголь И ДанныеДляЗаполнения.Маркируемый, "0", "1") + Разделитель	// Маркировка алкогольной продукции (56)
						+ ДанныеДляЗаполнения.Крепость + Разделитель												// Крепость алкогольной продукции (57)
						+ Разделитель;																				// Признак способа расчёта (58)
				
			КонецЕсли;
			
	КонецЕсли;
	
	Если НЕ (ФорматОбмена = 0 И ЭтоГруппа) Тогда
		Файл.ДобавитьСтроку(Строка);
	КонецЕсли;
	
КонецПроцедуры

Функция РазложитьШтрихкод(Штрихкод)
	
	Штрихкод = СокрЛП(Штрихкод);
	
	СписокРазделителей = Новый Массив;
	
	СписокРазделителей.Добавить(",");
	СписокРазделителей.Добавить(";");
	СписокРазделителей.Добавить(".");
	СписокРазделителей.Добавить(" ");
	
	Для Каждого Разделитель Из СписокРазделителей Цикл
		
		Если Найти(Штрихкод, Разделитель) > 0 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Штрихкод = СтрЗаменить(СокрЛП(Штрихкод), Разделитель, ",");
	
	Возврат Штрихкод;
	
КонецФункции

Функция ПолучитьПараметрСтроки(Знач ИмяПараметра, Знач СтрокаСПараметром)
	МассивРазделителей = Новый Массив;
	МассивРазделителей.Добавить(" ");
	МассивРазделителей.Добавить(";");
	МассивРазделителей.Добавить(",");
	
	ИмяПараметра = НРег(ИмяПараметра);
	СтрокаСПараметромРег = СтрокаСПараметром;
	СтрокаСПараметром = НРег(СтрокаСПараметром);
	
	ДлинаПараметра = СтрДлина(ИмяПараметра);
	ПозицияПараметра = Найти(СтрокаСПараметром,ИмяПараметра);
	Если ПозицияПараметра=0 Тогда
		// нет такого параметра
		Возврат "";
	КонецЕсли;
	Строка1 = СокрЛП(Сред(СтрокаСПараметромРег,ПозицияПараметра+ДлинаПараметра+1));
	Для каждого Разделитель из МассивРазделителей Цикл
		ПозицияРазделителя = Найти(Строка1,Разделитель);
		Если ПозицияРазделителя>0 Тогда
			Строка1 = Лев(Строка1,ПозицияРазделителя-1);
		КонецЕсли;
	КонецЦикла;
	Возврат Строка1;
КонецФункции

Функция ПолучитьСтрокуПодключения(Параметры, ПараметрБД = "import") Экспорт
	
	Сервер 			= Параметры.Сервер;
	Пользователь 	= Параметры.Пользователь;
	Пароль 		  	= Параметры.Пароль;
	Порт         	= "5432";//Параметры.Порт;  //5432
	//Если Импорт Тогда
	//	ПараметрБД = Параметры.БазаИмпорт;
	//Иначе
	//	ПараметрБД = Параметры.БазаЭкспорт;
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(ПараметрБД) Тогда
	//	ПараметрБД = ?(Импорт, "import", "export");
	//КонецЕсли;
	
	//Возврат "driver={MySQL ODBC 5.3 ANSI Driver}; server="+Сервер+"; uid="+Пользователь+"; Pwd="+Пароль+"; Database="+ПараметрБД;
	//Возврат "DRIVER={MySQL ODBC 8.0 ANSI Driver}; server="+Сервер+"; uid="+Пользователь+"; Pwd="+Пароль+"; Database="+ПараметрБД;
	Возврат "Driver={PostgreSQL Unicode}; server="+Сервер+"; Port= " + Порт + "; uid="+Пользователь+"; Pwd="+Пароль+"; Database="+ПараметрБД + "; STMT=utf8";
	
КонецФункции

Функция ПолучитьКодСтавкиНДС(СтруктураСтавок,Ставка)
	Возврат СтруктураСтавок["Ставка"+?(Ставка="none","0",Ставка)];
	//Возврат Ставка;
	//Если Ставка = 10 Тогда
	//	Возврат 1;
	//ИначеЕсли Ставка = 0 Тогда
	//	Возврат 2;
	//Иначе
	//	Возврат 0;
	//КонецЕсли;
КонецФункции

// получает из строкового кода товара числовой вариант
Функция ВыделитьЧисло(Знач Стр) Экспорт
	ВозвСтр=""; Стр=СокрЛП(Стр);
	Для Сч=1 По СтрДлина(Стр) Цикл
		ВозвСтр=ВозвСтр+?(Найти("1234567890",Сред(Стр,Сч,1))=0,"0",Сред(Стр,Сч,1));
	КонецЦикла;
	
	Возврат Число(ВозвСтр);
КонецФункции

#КонецОбласти