
// Возвращает основную рецептуру
Функция ПолучитьОсновнуюРецептуру(Продукция, НаДату, ХозОперация = Неопределено, Подразделение = Неопределено) Экспорт
	
	Результат = Неопределено;
	
	Если ХозОперация = Неопределено Тогда
		ХозОперация = Справочники.ХозОперации.Рецептура;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Продукция",     Продукция);
	Запрос.УстановитьПараметр("ХозОперация",   ХозОперация);
	Запрос.УстановитьПараметр("НаДату",        НаДату);
	
	Если Подразделение = Неопределено Тогда
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Рецептура.Ссылка КАК Ссылка,
		               |	Рецептура.Дата КАК ДатаРецептуры
		               |ПОМЕСТИТЬ втРезультат
		               |ИЗ
		               |	Документ.Рецептура КАК Рецептура
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рецептура.Подразделения КАК РецептураПодразделения
		               |		ПО Рецептура.Ссылка = РецептураПодразделения.Ссылка
		               |ГДЕ
		               |	НЕ Рецептура.ПометкаУдаления
		               |	И Рецептура.Продукция = &Продукция
		               |	И Рецептура.ОсновнаяРецептура
		               |	И Рецептура.Дата <= &НаДату
		               |	И Рецептура.ХозОперация = &ХозОперация
		               |	И РецептураПодразделения.Ссылка ЕСТЬ NULL
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(втРезультат.ДатаРецептуры) КАК ДатаРецептуры
		               |ПОМЕСТИТЬ втМксДаты
		               |ИЗ
		               |	втРезультат КАК втРезультат
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втРезультат.Ссылка КАК Ссылка,
		               |	втРезультат.ДатаРецептуры КАК ДатаРецептуры
		               |ИЗ
		               |	втРезультат КАК втРезультат
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втМксДаты КАК втМксДаты
		               |		ПО втРезультат.ДатаРецептуры = втМксДаты.ДатаРецептуры";
		
	Иначе
		
		Если ТипЗнч(Подразделение) = Тип("Массив") Тогда
			МассивВодразделений = Подразделение;
		Иначе
			МассивВодразделений = Новый Массив;
			МассивВодразделений.Добавить(Подразделение);
		КонецЕсли;
		
		Запрос.УстановитьПараметр("Подразделение", МассивВодразделений);
		
		ТекстЗапроса = "ВЫБРАТЬ
		               |	Рецептура.Ссылка КАК Ссылка,
		               |	Рецептура.Дата КАК ДатаРецептуры
		               |ПОМЕСТИТЬ втРезультат
		               |ИЗ
		               |	Документ.Рецептура КАК Рецептура
		               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рецептура.Подразделения КАК РецептураПодразделения
		               |		ПО Рецептура.Ссылка = РецептураПодразделения.Ссылка
		               |ГДЕ
		               |	НЕ Рецептура.ПометкаУдаления
		               |	И Рецептура.Продукция = &Продукция
		               |	И Рецептура.ОсновнаяРецептура
		               |	И Рецептура.ПодразделениеКомпании В(&Подразделение)
		               |	И Рецептура.Дата <= &НаДату
		               |	И Рецептура.ХозОперация = &ХозОперация
		               |	И РецептураПодразделения.Ссылка ЕСТЬ NULL
		               |
		               |ОБЪЕДИНИТЬ
		               |
		               |ВЫБРАТЬ
		               |	РецептураПодразделения.Ссылка,
		               |	РецептураПодразделения.Ссылка.Дата
		               |ИЗ
		               |	Документ.Рецептура.Подразделения КАК РецептураПодразделения
		               |ГДЕ
		               |	НЕ РецептураПодразделения.Ссылка.ПометкаУдаления
		               |	И РецептураПодразделения.Ссылка.Продукция = &Продукция
		               |	И РецептураПодразделения.Ссылка.ОсновнаяРецептура
		               |	И РецептураПодразделения.ПодразделениеКомпании В(&Подразделение)
		               |	И РецептураПодразделения.Ссылка.Дата <= &НаДату
		               |	И РецептураПодразделения.Ссылка.ХозОперация = &ХозОперация
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	МАКСИМУМ(втРезультат.ДатаРецептуры) КАК ДатаРецептуры
		               |ПОМЕСТИТЬ тбМаксДатаРецептуры
		               |ИЗ
		               |	втРезультат КАК втРезультат
		               |;
		               |
		               |////////////////////////////////////////////////////////////////////////////////
		               |ВЫБРАТЬ
		               |	втРезультат.Ссылка КАК Ссылка,
		               |	втРезультат.ДатаРецептуры КАК ДатаРецептуры
		               |ИЗ
		               |	втРезультат КАК втРезультат
		               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ тбМаксДатаРецептуры КАК тбМаксДатаРецептуры
		               |		ПО втРезультат.ДатаРецептуры = тбМаксДатаРецептуры.ДатаРецептуры";
	КонецЕсли;
	
	Запрос.Текст = ТекстЗапроса;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Результат = Выборка.Ссылка;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции
