
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Если ПараметрКоманды = Неопределено ИЛИ ПараметрКоманды.Пустая() Тогда
		Возврат;
	КонецЕсли;
	
	// фильтры
	ОтчетОтбор = Новый Структура;
	ОтчетОтбор.Вставить("Инвентаризация", ПараметрКоманды);
	
	ПолучитьПараметрыОтчета(ПараметрКоманды,ОтчетОтбор);
	
	ОтчетыПлатформаКлиент.ОткрытьОтчет(
		"Отчет.итРезультатыИнвентаризацийКонтрольПересортицы",
		"Основной",,,,
		ОтчетОтбор);

КонецПроцедуры

&НаСервере
Процедура ПолучитьПараметрыОтчета(Документ,ПараметрыОтчета)
	
	ПараметрыОтчета.Вставить("ПериодОтчета",    	  Документ.Дата + 2);
	ПараметрыОтчета.Вставить("CкладКомпании", 		  Документ.СкладКомпании);
	//ПараметрыОтчета.Вставить("ДатаПредыдущейИнвентаризации",  Документы.Инвентаризация.ПолучитьДатуПредыдущейИнвентаризации(Документ));
	
КонецПроцедуры // ПолучитьПараметрыОтчета()
