// Общий модуль "Управление диалогом (клиент-сервер)"


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Возвращает право пользователя
Функция ПравоПользователяКлиент(Право, Объект=Неопределено) Экспорт
	
	Возврат УправлениеДиалогомВызовСервера.ПравоПользователяКлиент(Право, Объект);
	
КонецФункции // ПравоПользователяКлиент()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ПОЛУЧЕНИЯ ПРЕДСТАВЛЕНИЯ ДОКУМЕНТА

// Общий обработчик события получения состава полей, из которых формируется представление объекта или ссылки.
//
// Параметры:
//  Источник             - ДокументОбъект - Объект, для которого происходит формирование представления.
//  Поля                 - Массив - Массив, содержащий имена полей, которые нужны для формирования представления.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаПолученияПолейПредставления(Источник, Поля, СтандартнаяОбработка=ИСТИНА) Экспорт
	
	УправлениеДиалогомВызовСервера.ОбработкаПолученияПолейПредставления(ТипЗнч(Источник), Поля, СтандартнаяОбработка);
	
КонецПроцедуры // ОбработкаПолученияПолейПредставления()

// Общий обработчик события возникающего при получении представления объекта или ссылки.
//
// Параметры:
//  Источник             - ДокументМенеджер - Документ менеджер, для которого происходит формирование представления.
//  Данные               - Структура - Содержит значения полей, из которых формируется представление.
//  Представление        - Строка - Строка, в которую нужно поместить представление объекта или ссылки.
//  СтандартнаяОбработка - Булево - В данный параметр передается признак выполнения системной обработки события.
//
Процедура ОбработкаПолученияПредставления(Источник, Данные, Представление, СтандартнаяОбработка=ИСТИНА) Экспорт
	
	// Проверяем на попытку получить представление битой ссылки
	Если Данные.Дата=NULL Тогда
		Возврат;
	КонецЕсли;
	
	// Проверяем целесообразность программной обработки события.
	Если НЕ Данные.Свойство("ХозОперация") Тогда
		Возврат;
	КонецЕсли;
	
	// Отказываемся от стандартной обработки события.
	СтандартнаяОбработка = ЛОЖЬ;
	
	// Формируем новое представление объекта.
	СостояниеДокумента = УправлениеДиалогомВызовСервера.ПолучитьСостояниеДокумента(Данные);
	Представление = Строка(Данные.ХозОперация) + ?(ЗначениеЗаполнено(Данные.Ссылка), " №" + Данные.Номер 
		+ " "+"от"+" " + Формат(Данные.Дата, "ДЛФ=D"), "") + СостояниеДокумента;
	
КонецПроцедуры // ОбработкаПолученияПредставления()

