Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Основной");
	НастройкиВарианта.Описание = НСтр("ru = 'Подробный отчет по взаиморасчетам с Яндекс.Еда'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "НеОплаченныеЗаказы");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по взаиморасчетам с Яндекс.Еда с отбором по неоплаченным заказам'");
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "ЗаказыСПереплатой");
	НастройкиВарианта.Описание = НСтр("ru = 'Отчет по взаиморасчетам с Яндекс.Еда с отбором по заказам с переплатой'");
	
КонецПроцедуры