////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обновление конфигурации"
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Устарела. Следует использовать ПриОпределенииКраткогоИмениКонфигурации
//
Функция КороткоеИмяКонфигурации() Экспорт
	
КонецФункции

// Определяет короткое имя (идентификатор) конфигурации.
//
// Параметры:
//	КраткоеИмя - Строка- короткое имя конфигурации.
//
Процедура ПриОпределенииКраткогоИмениКонфигурации(КраткоеИмя) Экспорт
	
	// +РАРУС
	КраткоеИмя = "AccountingCorp";
	// -РАРУС
	
КонецПроцедуры

// Устарела. Следует использовать ПриОпределенииАдресаСервераДляПроверкиНаличияОбновления
//
Функция АдресСервераДляПроверкиНаличияОбновления() Экспорт
	
КонецФункции

// Получает адрес веб-сервера поставщика конфигурации, на котором находится
// информация о доступных обновлениях ("открытая" часть веб-сайта).
//
// Параметры:
//	АдресСервера - Строка - адрес веб-сервера.
//
// Пример:
//	АдресСервера = "localhost";  // локальный веб-сервер для тестирования
//
Процедура ПриОпределенииАдресаСервераДляПроверкиНаличияОбновления(АдресСервера) Экспорт
	
	// +РАРУС
	// !!!_АдресСервера = "update.rarus.ru";
	// -РАРУС
	
КонецПроцедуры

// Устарела. Следует использовать ПриОпределенииАдресаРесурсаДляПроверкиНаличияОбновления
//
Функция АдресРесурсаДляПроверкиНаличияОбновления() Экспорт
	
КонецФункции

// Получить адрес ресурса на веб-сервере для проверки наличия обновлений
// (на "открытой" части веб-сайта).
//
// Параметры:
//	АдресРесурса - Строка - Адрес ресурса для проверки наличия обновления
//
Процедура ПриОпределенииАдресаРесурсаДляПроверкиНаличияОбновления(АдресРесурса) Экспорт
	
	// +РАРУС
	// !!!_АдресРесурса = "/public/release-news";
	// -РАРУС
	
КонецПроцедуры

// Устарела. Следует использовать ПриОпределенииКаталогаОбновлений
//
Функция КаталогОбновлений() Экспорт
	
КонецФункции

// Получает адрес веб-сайта с каталогом обновлений ("закрытая" часть веб-сайта).
//
// Параметры:
//	АдресКаталогаОбновлений - Строка - Адрес каталога обновлений
//
// Пример:
//	АдресКаталогаОбновлений = "localhost/tmplts/"; // локальный веб-сервер для тестирования 
//
Процедура ПриОпределенииАдресаКаталогаОбновлений(АдресКаталогаОбновлений) Экспорт
	
	// +РАРУС
	// !!!_АдресКаталогаОбновлений = "http://update.rarus.ru/update/storage/";
	// -РАРУС
	
КонецПроцедуры

#КонецОбласти
