// Модуль менеджера регистра сведений "Сегментация клиентов"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

Функция ПолучитьТаблицуКлиентов(СегментКлиента) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СегментацияКлиентов.Клиент КАК Клиент
	                      |ИЗ
	                      |	РегистрСведений.СегментацияКлиентов КАК СегментацияКлиентов
	                      |ГДЕ
	                      |	СегментацияКлиентов.Принадлежность
	                      |	И СегментацияКлиентов.СегментКлиента = &СегментКлиента
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	СегментацияКлиентов.Клиент.Наименование");
	Запрос.УстановитьПараметр("СегментКлиента",СегментКлиента);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Функция ПолучитьТаблицуСегментов(Клиент) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	СегментацияКлиентов.СегментКлиента КАК Сегмент
	                      |ИЗ
	                      |	РегистрСведений.СегментацияКлиентов КАК СегментацияКлиентов
	                      |ГДЕ
	                      |	СегментацияКлиентов.Принадлежность
	                      |	И СегментацияКлиентов.Клиент = &Клиент
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	СегментацияКлиентов.СегментКлиента.Наименование");
	Запрос.УстановитьПараметр("Клиент",Клиент);
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

Процедура ЗаписатьТаблицуКлиентов(ТаблицаКлиентов,СегментКлиента) Экспорт
	НачатьТранзакцию();
	// сначала очистим клиентов по данному сегменту
	нзСегментацияКлиентов = РегистрыСведений.СегментацияКлиентов.СоздатьНаборЗаписей();
	нзСегментацияКлиентов.Отбор.СегментКлиента.Установить(СегментКлиента);
	Попытка
		нзСегментацияКлиентов.Записать();
	Исключение
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	// теперь запишем новые записи
	Для каждого СтрокаКлиента из ТаблицаКлиентов Цикл
		зСегментацияКлиентов = РегистрыСведений.СегментацияКлиентов.СоздатьМенеджерЗаписи();
		зСегментацияКлиентов.СегментКлиента = СегментКлиента;
		зСегментацияКлиентов.Клиент = СтрокаКлиента.Клиент;
		зСегментацияКлиентов.Принадлежность = Истина;
		Попытка
			зСегментацияКлиентов.Записать();
		Исключение
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры

Процедура ЗаписатьТаблицуСегментов(ТаблицаСегментов,Клиент) Экспорт
	НачатьТранзакцию();
	// сначала очистим клиентов по данному сегменту
	нзСегментацияКлиентов = РегистрыСведений.СегментацияКлиентов.СоздатьНаборЗаписей();
	нзСегментацияКлиентов.Отбор.Клиент.Установить(Клиент);
	Попытка
		нзСегментацияКлиентов.Записать();
	Исключение
		ОтменитьТранзакцию();
		Возврат;
	КонецПопытки;
	// теперь запишем новые записи
	Для каждого СтрокаСегмента из ТаблицаСегментов Цикл
		зСегментацияКлиентов = РегистрыСведений.СегментацияКлиентов.СоздатьМенеджерЗаписи();
		зСегментацияКлиентов.СегментКлиента = СтрокаСегмента.Сегмент;
		зСегментацияКлиентов.Клиент = Клиент;
		зСегментацияКлиентов.Принадлежность = Истина;
		Попытка
			зСегментацияКлиентов.Записать();
		Исключение
			ОтменитьТранзакцию();
			Возврат;
		КонецПопытки;
	КонецЦикла;
	ЗафиксироватьТранзакцию();
КонецПроцедуры

Функция ПолучитьСписокКонтрагентовПользователя() Экспорт
	СписокКонтрагентов = Неопределено;
	СегментыКлиентов = ПараметрыСеанса.ТекущийПользователь.СегментыКлиентов;
	Если СегментыКлиентов.Количество()>0 Тогда
		Запрос = Новый Запрос("ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	СегментацияКлиентов.Клиент КАК Клиент
		                      |ИЗ
		                      |	РегистрСведений.СегментацияКлиентов КАК СегментацияКлиентов
		                      |ГДЕ
		                      |	СегментацияКлиентов.СегментКлиента В(&МассивСегментов)");
		Запрос.УстановитьПараметр("МассивСегментов",СегментыКлиентов.ВыгрузитьКолонку("СегментКлиента"));
		СписокКонтрагентов = Новый СписокЗначений;
		СписокКонтрагентов.ЗагрузитьЗначения(Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Клиент"));
	КонецЕсли;
	
	Возврат СписокКонтрагентов;
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ПОЛУЧЕНИЯ СПИСКОВ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты регистра
	ОбязательныеРеквизиты = ОбработкаСобытийРегистраСервер.ПолучитьСтандартныеОбязательныеРеквизиты(Объект);
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли