// Общий модуль "Утверждение документов (сервер)"

#Область СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытийФормыСпискаИДокумента

// Размещает команды утверждения документов на форме.
//
// МестоРазмещенияКоманд - ЭлементФормы - группа, в которую необходимо разместить меню УтверждениеДокументов,
//                                        по умолчанию размещается в командную панель формы.
Процедура ПриСозданииНаСервере(Форма, Объект) Экспорт
	
	// Проверим, используется ли утверждение документов.
	Если НЕ ИспользоватьУтверждениеДокументов() ИЛИ НЕ ЕстьРеквизит(Форма, "ПолноеИмяОбъекта") ИЛИ НЕ УтверждениеДокументовПовтИсп.КонтролироватьУтверждениеДокумента(Форма.ПолноеИмяОбъекта) Тогда
		
		// Утверждение в данном документе не используется, отключаем видимость колонки статуса.
		ГруппаКолонокУтверждения = Форма.Элементы.Найти("Утверждения");
		Если ГруппаКолонокУтверждения <> Неопределено Тогда
			ГруппаКолонокУтверждения.Видимость = Ложь;
		КонецЕсли;
		
		Возврат;
	КонецЕсли;
	
	// Посмотрим, включена ли настройка утверждения для данного типа документов (есть ли хотя бы один доступный статус).
	ДоступныеСтатусы = УтверждениеДокументовПовтИсп.ДоступныеСтатусы(Форма.ПолноеИмяОбъекта);
	Если ДоступныеСтатусы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДобавитьКомандыУтверждения(Форма, СтатусыДокументов());
	
	Если Объект <> Неопределено Тогда
		УстановитьКартинкуТекущегоСтатусаДокумента(Форма, Объект);
	КонецЕсли;

КонецПроцедуры

// Общий обработчик события возникающего при нажатии программно добавленной кнопки.
//
// Параметры:
//  Форма              - УправляемаяФорма  - Форма, в которой вызвано выполнение команды.
//  КомандаИмя         - Строка            - Имя выполняемой команды.
//  ТекущийЭлемент     - ДокументСсылка    - Документ, для которого настраиваются доступность команд утверждения
//  ПараметрыДействия  - Структура         - Набор параметров, использующихся при выполнения операции.
//
Процедура ОбработкаКомандыФормы(Форма, КомандаИмя, ТекущийЭлемент, ПараметрыДействия) Экспорт
	
	ИмяСтатуса = "";
	
	Если СтрНайти(КомандаИмя, "История")=0 Тогда
		
		// Нажата кнопка изменения статуса документа, ищем по имени команды выбранный статус.
		СтатусыДокументов = СтатусыДокументов();
		Для каждого ТекСтатус Из СтатусыДокументов Цикл
			
			// В имени команды используем строчное значение имени перечисления.
			ПредставлениеСтатуса = Строка(ТекСтатус.Значение);
			Если СтрНайти(КомандаИмя, "Статус" + ПредставлениеСтатуса) > 0 Тогда
				
				ИмяСтатуса = ПредставлениеСтатуса;
				Прервать;
				
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ИмяСтатуса) Тогда
		Возврат;
	КонецЕсли;
	
	// Изменим статус документа
	УтверждениеДокумента(Форма, ТекущийЭлемент, ИмяСтатуса);
	
	// Обновим отображение формы
	УтверждениеДокументовКлиентСервер.УстановитьДоступностьКнопокУтверждения(Форма, ТекущийЭлемент);
	
	Если ПолучитьЗначениеПараметраСтруктуры(ПараметрыДействия, "ОбновлятьКартинку", Истина) Тогда
		
		УстановитьКартинкуТекущегоСтатусаДокумента(Форма, ТекущийЭлемент);
		
	КонецЕсли;
	
	// Оповестим все открытые формы об изменении статуса утверждения
	УправлениеДиалогомСервер.ДобавитьОповещениеФорм("ПослеУтвержденияДокументов", ТекущийЭлемент, Форма.ИмяФормы, ПараметрыДействия);
	
	// Произведем перерисовку динамических списков
	УправлениеДиалогомСервер.ДобавитьОповещениеДинамическихСписков(ТекущийЭлемент, ПараметрыДействия);
	
КонецПроцедуры // ОбработкаКомандыФормы()

// Проверяет допустимость записи и проведения документа в зависимости от статуса и настроек утверждения.
//
// Параметры:
//  Объект       - ДокументОбъект        - Записываемый документ.
//  Отказ        - Булево                - Флаг отказа от дальнейшего выполнения операции.
//  РежимЗаписи  - РежимЗаписиДокумента  - Режим записи документа.
//
Процедура ОбработкаУтвержденияПередЗаписью(Объект, Отказ, РежимЗаписи) Экспорт
	
	Если Отказ ИЛИ НЕ ЕстьРеквизит(Объект, "СтатусУтверждения") Тогда
		// У документа нет необходимых общих реквизитов, выходим.
		Возврат;
	КонецЕсли;
	
	// Получим необходимые значения из документа.
	СтатусИзОбъекта = Объект.СтатусУтверждения;
	СтатусИзСсылки  = Объект.Ссылка.СтатусУтверждения;
	ИмяДокумента    = Объект.Метаданные().ПолноеИмя();
	
	// Проверяем участие документа в утверждении и получаем значение настройки ОтклонениеПриОтменеПроведения из регистра.
	ОтклонениеПриОтменеПроведения = Ложь;
	Если НЕ УтверждениеДокументовПовтИсп.КонтролироватьУтверждениеДокумента(ИмяДокумента, ОтклонениеПриОтменеПроведения) Тогда
		// Документ не участвует в утверждении, выходим.
		Возврат;
	КонецЕсли;
	
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) И ЕстьРеквизит(Объект, "ПортфельКатегорий") И ЗначениеЗаполнено(Объект.ПортфельКатегорий)
		И ПравоПользователя("РедактированиеДокументаТолькоМенеджеромПортфеля", Объект) Тогда
		
		НашлиМенеджера = Ложь;
		Для Каждого текМенеджер Из Объект.ПортфельКатегорий.Менеджеры Цикл
			начПериода = текМенеджер.НачалоПериода;
			конПериода = текМенеджер.КонецПериода;
			ДатаОбъекта = Объект.Дата;
			
			Если текМенеджер.Менеджер=ТекущийПользователь И (НЕ ЗначениеЗаполнено(начПериода) ИЛИ начПериода<=ДатаОбъекта) И (НЕ ЗначениеЗаполнено(конПериода) ИЛИ конПериода>=ДатаОбъекта) Тогда
				НашлиМенеджера = Истина;;
			КонецЕсли;
		КонецЦикла;
		
		Если НЕ НашлиМенеджера Тогда
			Отказ = Истина;
			ВывестиСообщение(НСтр("ru='Изменение статуса документа, разрешено только менеджерам портфеля, указанного в данном документе.'"), Объект);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ТекстОшибки = "";
	
	// Найдем автора, установившего предыдущий статус документа.
	//ТекущийПользователь = Пользователи.ТекущийПользователь();
	АвторСтатуса        = Неопределено;
	СтатусДокумента(Объект.Ссылка, АвторСтатуса);
	
	// Получим доступные статусы документа.
	ДоступныеСтатусы = УтверждениеДокументовПовтИсп.ДоступныеСтатусы(ИмяДокумента);
	
	// Для удобства чтения условий проверок запомним основные статусы документов.
	Подготовка  = Перечисления.СтатусыДокументов.Подготовка;
	Подготовлен = Перечисления.СтатусыДокументов.Подготовлен;
	Согласован  = Перечисления.СтатусыДокументов.Согласован;
	Утвержден   = Перечисления.СтатусыДокументов.Утвержден;
	Отклонен    = Перечисления.СтатусыДокументов.Отклонен;
	
	СтатусыЗапрещенныеДляРедактирования = Новый Структура("Согласован, Утвержден, Отклонен", Истина, Истина, Истина);
	
	Если РежимЗаписи = РежимЗаписиДокумента.Запись Тогда
		
		// Если статус документа не заполнен, устанавливаем статус Подготовка.
		Если НЕ ЗначениеЗаполнено(СтатусИзОбъекта) ИЛИ СтатусИзОбъекта = Перечисления.СтатусыДокументов.НеУстановлен Тогда
			
			Объект.СтатусУтверждения = Подготовка;
			СтатусИзОбъекта = Подготовка;
		КонецЕсли;
		
		// При утверждении (из формы документа) переключаем запись на проведение и вызываем проверку заново.
		Если СтатусИзОбъекта = Утвержден Тогда
			
			// Проверяем право на утверждение документа.
			Если ДоступныеСтатусы.НайтиПоЗначению(Утвержден) <> Неопределено Тогда
				
				РежимЗаписи = РежимЗаписиДокумента.Проведение;
			Иначе
				// У пользователя нет прав на утверждение документов, проведение тоже запрещено.
				Отказ = Истина;
				ТекстОшибки = НСтр("ru = 'У вас недостаточно прав для утверждения документов «%1», проведение отменено.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СокрЛП(Объект.Метаданные().Синоним));
			КонецЕсли;
			
		ИначеЕсли СтатусИзОбъекта = СтатусИзСсылки И СтатусыЗапрещенныеДляРедактирования.Свойство(Строка(СтатусИзОбъекта)) Тогда
			
			// Документ отклонен, изменять нельзя.
			Отказ = Истина;
			ВывестиСообщение(НСтр("ru = 'Документ в статусе «%1», запись отменена. Перед изменением документа нужно установить статус «Подготовлен».'"), , , , , СтатусИзОбъекта);
			
		ИначеЕсли (СтатусИзОбъекта = Подготовка ИЛИ СтатусИзОбъекта = Подготовлен ИЛИ СтатусИзОбъекта = Согласован) И СтатусИзСсылки = Согласован И ДоступныеСтатусы.НайтиПоЗначению(Согласован) = Неопределено Тогда
			
			// Документ согласован, нет прав на согласование.
			Отказ = Истина;
			ТекстОшибки = НСтр("ru = 'У вас недостаточно прав для согласования (и редактирования согласованных) документов «%1», запись отменена.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СокрЛП(Объект.Метаданные().Синоним));
			
		ИначеЕсли НЕ ЗначениеЗаполнено(СтатусИзСсылки) Тогда
			
			// Документ был создан до включения механизма контроля утверждения документов.
			Если Объект.Проведен И СтатусИзОбъекта <> Утвержден Тогда
				
				РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
			ИначеЕсли НЕ Объект.Проведен И СтатусИзОбъекта = Утвержден Тогда
				
				РежимЗаписи = РежимЗаписиДокумента.Проведение
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Если СтатусИзОбъекта = Отклонен Тогда
			
			// Документ отклонен, проводить нельзя.
			Отказ = Истина;
			ТекстОшибки = НСтр("ru = 'Документ был отклонен, проведение отменено. Сначала нужно установить статус «Подготовлен».'");
			
		ИначеЕсли СтатусИзОбъекта <> Утвержден И Объект.Проведен Тогда
			
			// Документ был создан до включения механизма контроля утверждения документов.
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения
			
		ИначеЕсли СтатусИзОбъекта <> Утвержден И СтатусИзСсылки <> Утвержден Тогда
			
			// Проверяем право на утверждение документа, если есть, сразу устанавливаем статус Утвержден.
			Если ДоступныеСтатусы.НайтиПоЗначению(Утвержден) <> Неопределено Тогда
				
				Объект.СтатусУтверждения = Утвержден;
			Иначе
				// У пользователя/подразделения нет прав на утверждение документов, проведение тоже запрещено.
				Отказ = Истина;
				ТекстОшибки = НСтр("ru = 'У вас недостаточно прав для утверждения документов «%1», проведение отменено.'");
				ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СокрЛП(Объект.Метаданные().Синоним));
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		
		// Разрешаем отменять проведение только пользователям, у которых есть права на утверждение.
		Если ДоступныеСтатусы.НайтиПоЗначению(Утвержден) <> Неопределено Тогда
			
			Объект.СтатусУтверждения = ?(ОтклонениеПриОтменеПроведения, Отклонен, Подготовка);
			СтатусИзОбъекта          = Объект.СтатусУтверждения;
		Иначе
			
			Отказ = Истина;
			ТекстОшибки = НСтр("ru = 'У вас недостаточно прав для утверждения (и отмены проведения) документов «%1», действие отменено.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СокрЛП(Объект.Метаданные().Синоним));
		КонецЕсли;
	КонецЕсли;
	
	Если НЕ Отказ И СтатусИзОбъекта = Согласован И СтатусИзСсылки = Утвержден Тогда
		
		// Проверяем право на утверждение и согласование документа.
		Если ДоступныеСтатусы.НайтиПоЗначению(Утвержден) <> Неопределено И ДоступныеСтатусы.НайтиПоЗначению(Согласован) <> Неопределено Тогда
			
			// Статус был изменен с Утвержден на Согласован, отменяем проведение.
			РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения;
		Иначе
			// У пользователя нет прав на утверждение и согласование документов, проведение тоже запрещено.
			Отказ = Истина;
			ТекстОшибки = НСтр("ru = 'У вас недостаточно прав для утверждения и согласования документов «%1», действие отменено.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, СокрЛП(Объект.Метаданные().Синоним));
		КонецЕсли;
	КонецЕсли;
	
	// Сообщаем об ошибках.
	Если Отказ И ЗначениеЗаполнено(ТекстОшибки) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецЕсли;
	
	// Если документ будет проведен, выполним проверку заполнения
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Отказ = (НЕ Объект.ПроверитьЗаполнение()) ИЛИ Отказ;
	КонецЕсли;
	
КонецПроцедуры // ПроверитьДоступностьЗаписиИПроведенияПоСтатусуУтверждения()

// Проверяет и записывает в регистр статус утверждения документа.
//
// Параметры:
//  Объект       - ДокументОбъект        - Записываемый документ.
//  Отказ        - Булево                - Флаг отказа от дальнейшего выполнения операции.
//
Процедура ОбработкаУтвержденияПриЗаписи(Объект, Отказ) Экспорт
	
	Если Отказ ИЛИ НЕ ЕстьРеквизит(Объект, "СтатусУтверждения") Тогда
		// У документа нет необходимых общих реквизитов, выходим.
		Возврат;
	КонецЕсли;
	
	// Получим необходимые значения из документа.
	СтатусИзОбъекта   = Объект.СтатусУтверждения;
	ИмяДокумента      = Объект.Метаданные().ПолноеИмя();
	
	// Проверяем участие документа в утверждении.
	Если НЕ УтверждениеДокументовПовтИсп.КонтролироватьУтверждениеДокумента(ИмяДокумента) Тогда
		// Документ не участвует в утверждении, выходим.
		Возврат;
	КонецЕсли;
	
	// Найдем автора, установившего предыдущий статус документа.
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	АвторСтатуса        = Неопределено;
	СтатусИзРегистра    = СтатусДокумента(Объект.Ссылка, АвторСтатуса);
	
	// Статус не был изменен, записывать изменения в регистр не нужно.
	Если СтатусИзОбъекта = СтатусИзРегистра ИЛИ НЕ ЗначениеЗаполнено(СтатусИзОбъекта) Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	// Получаем значения реквизитов документа.
	СуммаДокументаКомментарий = Новый Структура("СуммаДокумента, Комментарий", 0, "");
	ЗаполнитьЗначенияСвойств(СуммаДокументаКомментарий, Объект);
	
	СуммаДокумента = СуммаДокументаКомментарий.СуммаДокумента;
	Комментарий    = СуммаДокументаКомментарий.Комментарий;
	
	// Создаем набор записей РС СостоянияДокументов и устанавливаем отбор по текущему документу.
	НаборЗаписейСостоянияДокументов = РегистрыСведений.СостоянияДокументов.СоздатьНаборЗаписей();
	НаборЗаписейСостоянияДокументов.Отбор.Регистратор.Установить(Объект.Ссылка);
	НаборЗаписейСостоянияДокументов.Прочитать();
	
	// Добавляем новую запись в набор записей.
	Запись = НаборЗаписейСостоянияДокументов.Добавить();
	Запись.Регистратор     = Объект.Ссылка;
	Запись.Период          = ТекущаяДатаСеанса();
	Запись.Пользователь    = ТекущийПользователь;
	Запись.СтатусДокумента = СтатусИзОбъекта;
	Запись.Сумма           = СуммаДокумента;
	Запись.Комментарий     = Комментарий;
	
	// Записываем набор записей в регистр.
	НаборЗаписейСостоянияДокументов.Записать();
	
	//напомним пользователю
	НапомнитьПользователюОбИзмененииСтатуса(Объект);
	
КонецПроцедуры // ПроверитьДоступностьЗаписиИПроведенияПоСтатусуУтверждения()

#КонецОбласти

// Проверяет и устанавливает ТолькоПросмотр в форме в зависимости от статуса документа и прав пользователя.
//
// Параметры:
//  Форма                    - УправляемаяФорма - Форма текущего документа.
//  ФормаНеДоступнаИзменений - Булево           - Признак доступности форму для изменений.
//
Процедура УстановитьДоступностьФормыДляРедактирования(Форма, ФормаНеДоступнаИзменений, Объект) Экспорт
	
	ТекущийСтатус = Неопределено;
	Если НЕ ФормаНеДоступнаИзменений И Объект.Свойство("СтатусУтверждения", ТекущийСтатус) Тогда
		
		// Закрываем на редактирование форму документа, который утвержден или отклонен.
		Если    Строка(ТекущийСтатус) = "Утвержден" 
			ИЛИ Строка(ТекущийСтатус) = "Отклонен" 
			ИЛИ Строка(ТекущийСтатус) = "Согласован" 
			ИЛИ Строка(ТекущийСтатус) = "" И Объект.Проведен Тогда
			
			Форма.ТолькоПросмотр = Истина;
			
		Иначе
			
			Форма.ТолькоПросмотр = Ложь;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // УстановитьДоступностьФормыДляРедактирования()

// Выполняет проверку на необходимость использования системы утверждения документов
//
// Параметры:
//  Нет
//
// Возвращаемое значение:
//  Булево - Использование подсистемы утверждения документов: Истина - включено, Ложь - отключено.
//
Функция ИспользоватьУтверждениеДокументов() Экспорт
	
	Возврат ПолучитьФункциональнуюОпцию("ИспользоватьУтверждениеДокументов");
	
КонецФункции // ИспользоватьУтверждениеДокументов()

// Возвращает текущий статус утверждения документа.
//
// Параметры:
//  Документ         - Документ.Ссылка - Ссылка на документ, по которому получаем статус.
//  Пользователь     - Неопределено    - Переменная, в которую будет помещен пользователь, установивший статус.
// Возвращаемое значение:
//  СтатусДокумента  - ПеречислениеСсылка.СтатусыДокумента - Текущий статус документа.
//
Функция СтатусДокумента(Документ, Пользователь = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1 СтатусДокумента, Пользователь ИЗ РегистрСведений.СостоянияДокументов ГДЕ Регистратор = &Регистратор УПОРЯДОЧИТЬ ПО Период УБЫВ";
	
	Запрос.УстановитьПараметр("Регистратор", Документ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Результат    = Перечисления.СтатусыДокументов.ПустаяСсылка();
	Пользователь = Пользователи.ТекущийПользователь();
	
	Если Выборка.Следующий() Тогда
		Результат    = Выборка.СтатусДокумента;
		Пользователь = Выборка.Пользователь;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // СтатусДокумента()

// Обновляет настройки в кэше повторного использования после их изменения.
//
// Параметры:
//  Документ   - Строка  - Имя документа, для которого обновляется кэш.
//
Процедура ОбновитьНастройкуВКэше(Документ = Неопределено) Экспорт
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры // ОбновитьНастройкуВКэше()

// Устанавливает доступность кнопок в подменю утверждения документов
//
// Параметры:
//  Форма          - УправляемаяФорма - Форма списка документа.
//  ТекущийЭлемент - ДокументСсылка   - Документ, для которого настраиваются доступность команд утверждения.
//
Процедура УстановитьКартинкуТекущегоСтатусаДокумента(Форма, ТекущийЭлемент) Экспорт
	
	ПодменюУтверждения = Форма.Элементы.Найти("ПодменюУтверждениеДокументов");
	
	// Проверяем наличие подменю утверждения (использование подсистемы).
	Если ПодменюУтверждения = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекСтатусДокумента = "Утверждение";
	
	Если НЕ ТипЗнч(ТекущийЭлемент)=Тип("СтрокаГруппировкиДинамическогоСписка") И ЕстьРеквизит(ТекущийЭлемент, "СтатусУтверждения") Тогда
		
		ТекСтатусДокумента = Строка(ТекущийЭлемент.СтатусУтверждения);
		Если НЕ ЗначениеЗаполнено(ТекСтатусДокумента) Тогда
			ТекСтатусДокумента = "Подготовка";
		КонецЕсли;
		
	КонецЕсли;
	
	Если НЕ ПодменюУтверждения.Картинка = БиблиотекаКартинок[ТекСтатусДокумента] Тогда
		ПодменюУтверждения.Картинка = БиблиотекаКартинок[ТекСтатусДокумента];
	КонецЕсли;
	
КонецПроцедуры // УстановитьКартинкуТекущегоСтатусаДокумента()

// Запись нового статуса документа в реквизит документа.
//
// Параметры:
//  Форма              - УправляемаяФорма - Форма документа.
//  Документ           - ДокументСсылка   - Документ, у которого меняем статус утверждения.
//  ИмяСтатуса         - Строка     - Имя нового устанавливаемого статуса документа (Перечисления.СтатусыДокументов).
//
Процедура УтверждениеДокумента(Форма, Документ, ИмяСтатуса, Объект = Неопределено) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	ТекущийПользователь  = Пользователи.ТекущийПользователь();
	АвторСтатуса         = Неопределено;
	НовыйСтатусДокумента = Перечисления.СтатусыДокументов[ИмяСтатуса];
	ТекСтатусДокумента   = СтатусДокумента(Документ, АвторСтатуса);
	
	// Статус не изменился, ничего делать не надо.
	Если НовыйСтатусДокумента = ТекСтатусДокумента Тогда
		Возврат;
	КонецЕсли;
	
	// Записываем новый статус в реквизит документа СтатусУтверждения.
	Если Объект <> Неопределено И ЕстьРеквизит(Объект, "СтатусУтверждения") Тогда
		
		// Из формы документа документ не записываем, только меняем реквизит.
		Объект.СтатусУтверждения = НовыйСтатусДокумента;
		Форма.Записать();
	Иначе
		
		// Из списка документов для записи сначала по ссылке получаем объект.
		ДокументОбъект = Документ.ПолучитьОбъект();
		Если ЕстьРеквизит(ДокументОбъект, "СтатусУтверждения") Тогда
			
			ДокументОбъект.СтатусУтверждения = НовыйСтатусДокумента;
			Попытка
				ДокументОбъект.Записать();
			Исключение
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Не удалось записать" + Символы.НПП + ТипЗнч(ДокументОбъект) + ".'", ОбщегоНазначенияКлиентСервер.КодОсновногоЯзыка()),УровеньЖурналаРегистрации.Ошибка,,,ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			КонецПопытки;
		Иначе
			
			ТекстОшибки = НСтр("ru = 'В документе %1 не найден реквизит «Статус утверждения». Статус утверждения документа не изменен.'");
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстОшибки, ТипЗнч(ДокументОбъект));
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			Возврат;
			
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // УтверждениеДокумента()

// Получает статусы документа с учетом текущего статуса.
//
// Параметры:
//  Документ - ДокументСсылка - Документ, для которого получаются статусы
//  ПолноеИмяОбъекта - Строка - Имя документа
//  ЗаполнятьДоступные - Булево - Заполнять коллекцию доступных статусов
//  ЗаполнятьВозможные - Булево - Заполнять коллекцию ваозможных статусов
//
// Возвращаемое значение:
//   Структура - Статусы для документа:
//   * Все - Соответствие - Все статусы утверждения
//   * Доступные - СписокЗначений - Доступные статусы утверждения
//   * Возможные - СписокЗначений - Возможные статусы утверждения
//
Функция СтатусыДокумента(Документ, ПолноеИмяОбъекта, ЗаполнятьДоступные=Истина, ЗаполнятьВозможные=Истина) Экспорт
	
	Статусы = Новый Структура(
		"Все,Доступные,Возможные",
		Новый Соответствие(),
		Новый СписокЗначений(),
		Новый СписокЗначений());
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	СтатусыДокументов.Ссылка КАК Значение,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(СтатусыДокументов.Ссылка) КАК Ключ
	|ИЗ
	|	Перечисление.СтатусыДокументов КАК СтатусыДокументов");
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Статусы.Все.Вставить(Выборка.Ключ, Выборка.Значение);
		
	КонецЦикла;
	
	Если ЗаполнятьДоступные И ЕстьРеквизит(Документ, "СтатусУтверждения") Тогда
		
		Статусы.Доступные = УтверждениеДокументовПовтИсп.ДоступныеСтатусы(ПолноеИмяОбъекта);
		
	КонецЕсли;
	
	Если ЗаполнятьВозможные И Статусы.Доступные.Количество() Тогда
		
		РеквизитыДокумента = Новый Структура("СтатусУтверждения,Проведен", Неопределено, Ложь);
		
		Если ЗначениеЗаполнено(Документ) Тогда
			
			РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Документ, "СтатусУтверждения,Проведен");
			
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(РеквизитыДокумента.СтатусУтверждения)
			ИЛИ РеквизитыДокумента.СтатусУтверждения = ПредопределенноеЗначение("Перечисление.СтатусыДокументов.НеУстановлен") Тогда
			
			Если РеквизитыДокумента.Проведен Тогда
				
				Статусы.Возможные.Добавить("Согласован");
				
			Иначе
				
				Статусы.Возможные.Добавить("Подготовка");
				Статусы.Возможные.Добавить("Подготовлен");
				Статусы.Возможные.Добавить("Утвержден");
				Статусы.Возможные.Добавить("Отклонен");
				
			КонецЕсли;
			
		ИначеЕсли РеквизитыДокумента.СтатусУтверждения = ПредопределенноеЗначение("Перечисление.СтатусыДокументов.Подготовка") Тогда
			
			Статусы.Возможные.Добавить("Подготовлен");
			Статусы.Возможные.Добавить("Согласован");
			Статусы.Возможные.Добавить("Утвержден");
			Статусы.Возможные.Добавить("Отклонен");
			
		ИначеЕсли РеквизитыДокумента.СтатусУтверждения = ПредопределенноеЗначение("Перечисление.СтатусыДокументов.Подготовлен") Тогда
			
			Статусы.Возможные.Добавить("Подготовка");
			Статусы.Возможные.Добавить("Согласован");
			Статусы.Возможные.Добавить("Утвержден");
			Статусы.Возможные.Добавить("Отклонен");
			
		ИначеЕсли РеквизитыДокумента.СтатусУтверждения = ПредопределенноеЗначение("Перечисление.СтатусыДокументов.Согласован") Тогда
			
			Статусы.Возможные.Добавить("Подготовка");
			Статусы.Возможные.Добавить("Подготовлен");
			Статусы.Возможные.Добавить("Утвержден");
			Статусы.Возможные.Добавить("Отклонен");
			
		ИначеЕсли РеквизитыДокумента.СтатусУтверждения = ПредопределенноеЗначение("Перечисление.СтатусыДокументов.Утвержден") Тогда
			
			Статусы.Возможные.Добавить("Согласован");
			
		ИначеЕсли РеквизитыДокумента.СтатусУтверждения = ПредопределенноеЗначение("Перечисление.СтатусыДокументов.Отклонен") Тогда
			
			Статусы.Возможные.Добавить("Подготовка");
			Статусы.Возможные.Добавить("Подготовлен");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Статусы;
	
КонецФункции

// Напоминает пользователю об изменении стутса
Процедура НапомнитьПользователюОбИзмененииСтатуса(Объект)
	
	НапоминатьПользователю = Ложь;
	
	//Проверим необходимость напоминания
	Запрос = Новый Запрос("ВЫБРАТЬ Напоминать ИЗ РегистрСведений.ИспользоватьУтверждениеДокументов ГДЕ Документ=&Документ И Использовать");
	Запрос.УстановитьПараметр("Документ", "Документ." + Объект.Метаданные().Имя);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		НапоминатьПользователю = Выборка.Напоминать;
	КонецЕсли;
	
	Если НЕ НапоминатьПользователю Тогда
		Возврат;
	КонецЕсли;
	
	Если (Объект.СтатусУтверждения=Перечисления.СтатусыДокументов.Подготовка И ПараметрыСеанса.ТекущийПользователь=Объект.Автор)
		ИЛИ Объект.СтатусУтверждения=Перечисления.СтатусыДокументов.Утвержден Тогда
		Возврат;
	КонецЕсли;
	
	//откроем портфель
	МассивМенеджеров = Новый Массив;
	Если ЕстьРеквизит(Объект, "ПортфельКатегорий") И ЗначениеЗаполнено(Объект.ПортфельКатегорий) Тогда
		Для Каждого текМенеджер Из Объект.ПортфельКатегорий.Менеджеры Цикл
			начПериода = текМенеджер.НачалоПериода;
			конПериода = текМенеджер.КонецПериода;
			Если ЕстьРеквизит(Объект, "ДатаНачалаДействия") И ЗначениеЗаполнено(Объект.ДатаНачалаДействия) Тогда
				ДатаОбъекта = Объект.ДатаНачалаДействия;
			Иначе
				ДатаОбъекта = Объект.Дата;
			КонецЕсли;
			
			Если (НЕ ЗначениеЗаполнено(начПериода) ИЛИ начПериода<=ДатаОбъекта) И (НЕ ЗначениеЗаполнено(конПериода) ИЛИ конПериода>=ДатаОбъекта) Тогда
				МассивМенеджеров.Добавить(текМенеджер.Менеджер);
			КонецЕсли;
		КонецЦикла;
		Если МассивМенеджеров.Количество()=0 Тогда
			МассивМенеджеров.Добавить(Справочники.Пользователи.ПустаяСсылка());
		КонецЕсли;
	КонецЕсли;
	
	//Получим пользователей для напоминания
	МассивПользователей = Новый Массив;

	Если Объект.СтатусУтверждения=Перечисления.СтатусыДокументов.Подготовка Тогда
		
		МассивПользователей.Добавить(Объект.Автор);
		
	ИначеЕсли Объект.СтатусУтверждения=Перечисления.СтатусыДокументов.Подготовлен ИЛИ Объект.СтатусУтверждения=Перечисления.СтатусыДокументов.Согласован Тогда
		
		ТекстОтбора = ?(Объект.СтатусУтверждения=Перечисления.СтатусыДокументов.Подготовлен, "И Согласован", "И Утвержден");
		
		Запрос = Новый Запрос("ВЫБРАТЬ Объект ИЗ РегистрСведений.НастройкиУтвержденияДокументов ГДЕ Документ=&Документ " + ТекстОтбора);
		Запрос.УстановитьПараметр("Документ", "Документ." + Объект.Метаданные().Имя);
		
		Рез = Запрос.Выполнить();
		
		//если нет пользователей с правом согласования, то найдем пользователей с правом утверждения
		Если Рез.Пустой() И Объект.СтатусУтверждения=Перечисления.СтатусыДокументов.Подготовлен Тогда
			Запрос.Текст = "ВЫБРАТЬ Объект ИЗ РегистрСведений.НастройкиУтвержденияДокументов ГДЕ Документ=&Документ И Утвержден";
			Рез = Запрос.Выполнить();
		КонецЕсли;
		
		Выборка = Рез.Выбрать();
		
		Пока Выборка.Следующий() Цикл
			ОбъектНапоминания = Выборка.Объект;
			
			Если ТипЗнч(ОбъектНапоминания)=Тип("СправочникСсылка.ГруппыДоступа") Тогда
				
				Для Каждого текПользователь Из ОбъектНапоминания.Пользователи Цикл
					Если ТипЗнч(текПользователь.Пользователь)=Тип("СправочникСсылка.Пользователи") Тогда
						Если МассивМенеджеров.Количество()=0 ИЛИ МассивМенеджеров.Найти(текПользователь.Пользователь)<>Неопределено Тогда
							МассивПользователей.Добавить(текПользователь.Пользователь);
						КонецЕсли;
					КонецЕсли;
				КонецЦикла;
				
			ИначеЕсли ТипЗнч(ОбъектНапоминания)=Тип("СправочникСсылка.Пользователи") Тогда
				
				Если МассивМенеджеров.Количество()=0 ИЛИ МассивМенеджеров.Найти(ОбъектНапоминания)>0 Тогда
					МассивПользователей.Добавить(ОбъектНапоминания);
				КонецЕсли;
				
			КонецЕсли;
		КонецЦикла;
				
	ИначеЕсли Объект.СтатусУтверждения=Перечисления.СтатусыДокументов.Отклонен Тогда
		
		Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 Пользователь ИЗ РегистрСведений.СостоянияДокументов ГДЕ Регистратор=&Регистратор И СтатусДокумента В(&СтатусыПодготовки) УПОРЯДОЧИТЬ ПО Период УБЫВ");
		МассивСтатусов = Новый Массив;
		МассивСтатусов.Добавить(Перечисления.СтатусыДокументов.Подготовка);
		МассивСтатусов.Добавить(Перечисления.СтатусыДокументов.Подготовлен);
		Запрос.УстановитьПараметр("СтатусыПодготовки", МассивСтатусов);
		Запрос.УстановитьПараметр("Регистратор", Объект.Ссылка);
		
		Выборка = Запрос.Выполнить().Выбрать();
		
		Если Выборка.Следующий() Тогда
			МассивПользователей.Добавить(Выборка.Пользователь);
		Иначе
			МассивПользователей.Добавить(Объект.Автор);
		КонецЕсли;
		
	КонецЕсли;
	
	//Создаем напоминание для пользователя
	Если МассивПользователей.Количество()>0 Тогда
		
		Для Каждого текПользователь Из МассивПользователей Цикл
			НаборЗаписей = РегистрыСведений.НапоминанияПользователя.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.Пользователь.Установить(текПользователь);
			НаборЗаписей.Отбор.Источник.Установить(Объект.Ссылка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество()>0 Тогда
				НоваяЗапись = НаборЗаписей[0];
			Иначе
				НоваяЗапись = НаборЗаписей.Добавить();
			КонецЕсли;
			
			НоваяЗапись.Пользователь						= текПользователь;
			НоваяЗапись.Автор								= Объект.Автор;
			НоваяЗапись.ИнтервалВремениНапоминания			= 0;
			НоваяЗапись.ВремяСобытия						= ТекущаяДатаСеанса();
			НоваяЗапись.Источник							= Объект.Ссылка;
			НоваяЗапись.СрокНапоминания						= ТекущаяДатаСеанса();
			НоваяЗапись.Описание							= "Изменился статус документа согл.цен №" + Объект.Номер + ", дата начала: " + Формат(Объект.ДатаНачалаДействия, "ДФ=dd.MM.yyyy") + ", контрагент: " + Объект.Контрагент;
			НоваяЗапись.СпособУстановкиВремениНапоминания	= Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
			НоваяЗапись.ИмяРеквизитаИсточника				= "";
			НоваяЗапись.Расписание							= Неопределено;
			НоваяЗапись.ПредставлениеИсточника				= СокрЛП(Объект.Ссылка);
			НоваяЗапись.ДатаСоздания						= ТекущаяДата();
			
			НаборЗаписей.Записать();
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры //НапомнитьПользователюОбИзмененииСтатуса()

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Выбирает статусы утверждения документов из перечисления (кроме служебного №0).
//
// Параметры:
//   НЕТ
//
// Возвращаемое значение:
//   СписокЗначений   - Статусы утверждения документов из перечисления (кроме служебного №0).
//
Функция СтатусыДокументов()
	
	ДоступныеСтатусы = Новый СписокЗначений;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ Ссылка ИЗ Перечисление.СтатусыДокументов ГДЕ Порядок > 0 УПОРЯДОЧИТЬ ПО Порядок";
	
	ВыборкаСтатусов = Запрос.Выполнить().Выбрать();
	Пока ВыборкаСтатусов.Следующий() Цикл
		ДоступныеСтатусы.Добавить(ВыборкаСтатусов.Ссылка, Строка(ВыборкаСтатусов.Ссылка));
	КонецЦикла;
	
	Возврат ДоступныеСтатусы;
	
КонецФункции // СтатусыДокументов()

// Создает подменю "Утверждение документов" на форме и добавляет в него команды.
Процедура ДобавитьКомандыУтверждения(Форма, Знач ДоступныеСтатусы)
	
	// Определяем родительскую группу формы для размещения подменю и элемент, перед которым выведем подменю.
	ИмяГруппыРазмещенияПодменю = ?(Форма.Элементы.Найти("ДействияФормы") = Неопределено И Форма.Элементы.Найти("ОсновныеДействия") <> Неопределено, "ОсновныеДействия", "ДействияФормы");
	ИмяСледующегоЭлементаФормы   = ?(Форма.Элементы.Найти("ФормаСоздатьНаОсновании") <> Неопределено, "ФормаСоздатьНаОсновании", ?(Форма.Элементы.Найти("ФормаМенюДополнительныхФункций"), "ФормаМенюДополнительныхФункций", ""));
	
	// Создаем подменю.
	ПодменюУтверждениеДокументов = ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, "ПодменюУтверждениеДокументов", ИмяГруппыРазмещенияПодменю, Истина, НСтр("ru = 'Утверждение документов'"), БиблиотекаКартинок.Утверждение, НСтр("ru = 'Утверждение документов'"), ИмяСледующегоЭлементаФормы);
	ПодменюУтверждениеДокументов.Отображение = ОтображениеКнопки.Картинка;
	
	// Создаем родительскую группу для размещения команд.
	ИмяГруппыКомандУтверждения = "ГруппаИзменениеСтатусаУтвержденияДокументов";
	ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, ИмяГруппыКомандУтверждения, "ПодменюУтверждениеДокументов", Ложь);
	
	// Добавляем в список статусов элемент для отображения истории утверждения документа.
	ДоступныеСтатусы.Добавить("ИсторияДокументов", "История");
	
	// Перебираем статусы из перечисления.
	Для каждого ТекДоступныйСтатус Из ДоступныеСтатусы Цикл
		
		ПредставлениеСтатуса = Строка(ТекДоступныйСтатус.Значение);
		
		// В имени команды используем строчное значение имени перечисления.
		ИмяКоманды = "УтверждениеДокументов" + "Статус" + ПредставлениеСтатуса;
		
		// Добавим отдельную группу для кнопки "История".
		Если ПредставлениеСтатуса = "ИсторияДокументов" Тогда
			ЗащищенныеФункцииСервер.ДобавитьГруппуКоманд(Форма, "ГруппаИсторияУтвержденияДокументов", "ПодменюУтверждениеДокументов", Ложь);
			ИмяГруппыКомандУтверждения = "ГруппаИсторияУтвержденияДокументов"
		КонецЕсли;
		
		// Создаем команды изменения статуса.
		ЗащищенныеФункцииСервер.ДобавитьКоманду(Форма, ИмяКоманды, ИмяГруппыКомандУтверждения, 
			БиблиотекаКартинок[ПредставлениеСтатуса], ПредставлениеСтатуса, НСтр("ru = 'Установить статус документа:'") + " " 
			+ ТекДоступныйСтатус.Представление, Ложь, , "Подключаемый_ОбработкаКомандыФормы", ОтображениеКнопки.КартинкаИТекст);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти


