
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьЧек(Смена, НомерЧека)
	
	НайденныеЧеки = НайтиСтроки(Смена.Чеки, Новый Структура("НомерЧека", НомерЧека));
	
	Если НайденныеЧеки.Количество()>0 Тогда
		Возврат Смена.Чеки[НайденныеЧеки[0].ИндексВМассиве];
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Возвращает массив элементов, найденных в массиве структур по параметрам отбора.
// Параметры отбора являют собой структуру.
// Действует аналогично методу НайтиСтроки таблицы значений.
//
Функция НайтиСтроки(Знач МассивПоиска, ПараметрыОтбора)
	
	Результат = Новый Массив;
	Для ВремИндекс = 0 По МассивПоиска.Количество()-1 Цикл
		
		ЭлементМассива = МассивПоиска[ВремИндекс];
		ПолноеСовпадение = Истина;
		
		Для каждого ЭлементОтбора Из ПараметрыОтбора Цикл
			
			Если ЭлементМассива.Свойство(ЭлементОтбора.Ключ) 
				И НЕ ЭлементОтбора.Значение = ЭлементМассива[ЭлементОтбора.Ключ] Тогда
				ПолноеСовпадение = Ложь;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ПолноеСовпадение Тогда
			ЭлементМассива.Вставить("ИндексВМассиве", ВремИндекс);
			Результат.Добавить(ЭлементМассива);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Процедура УдалитьНеподдерживаемыеОперации(Чеки)
	
	КодОперацииПриход = 14;
	ОперацияПриход = ТипОперацииККМ(КодОперацииПриход);
	
	Индекс = Чеки.Количество() - 1;
	
	Пока Индекс > 0 Цикл
		
		Чек = Чеки[Индекс];
		
		Если Чек.ТипОперацииККМ = ОперацияПриход Тогда
			Чеки.Удалить(Индекс);
		КонецЕсли;
		
		Индекс = Индекс - 1;
	КонецЦикла;
	
КонецПроцедуры

Функция ТипОперацииККМ(КодТипаОперации)
	
	Если КодТипаОперации = 1 Тогда
		Возврат "Продажа";
	ИначеЕсли КодТипаОперации = 2 Тогда
		Возврат "Возврат";
	КонецЕсли;
	
	Возврат "";
	
КонецФункции

Функция ЗакрытьЧек(ТекущийЧек, Транзакция, ТекстОшибки)
	
	ТекущийЧек.Закрыт   = Истина;
	Если ТекущийЧек.Оплаты.Количество()>0 Тогда
		ТекущийЧек.ДатаЧека = ТекущийЧек.Оплаты[ТекущийЧек.Оплаты.Количество()-1].ДатаИВремя;
	ИначеЕсли ТекущийЧек.Товары.Количество()>0 Тогда
		ТекущийЧек.ДатаЧека = ТекущийЧек.Товары[ТекущийЧек.Товары.Количество()-1].ДатаИВремяТранзакции;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ОткрытьЧек(Смена, Транзакция)
	
	Чек = Новый Структура;
	Чек.Вставить("Закрыт",         Ложь);
	Чек.Вставить("ДатаЧека",       Транзакция.ДатаИВремя); // устанавливается при закрытии
	Чек.Вставить("НомерЧека",      Транзакция.НомерЧека);
	Чек.Вставить("Товары",         Новый Массив);
	Чек.Вставить("Оплаты",         Новый Массив);
	Чек.Вставить("ТипКарты",	   Транзакция.ТипКарты);
	Чек.Вставить("НомерКарты",	   Транзакция.НомерКарты);
	Чек.Вставить("ТипОперацииККМ", ТипОперацииККМ(Транзакция.Тип));
	
	Смена.Чеки.Добавить(Чек);
	
	Возврат Смена.Чеки[Смена.Чеки.Количество()-1];
	
КонецФункции

Процедура ДобавитьОплату(ТекущийЧек, Транзакция)
	
	СтрокаОплаты = Неопределено;
	ОплатыЧека = ТекущийЧек.Оплаты;
	Для Каждого ТекущаяСтрока Из ОплатыЧека Цикл
		Если ТекущаяСтрока.ТипОплаты = Транзакция.ТипОплаты Тогда
			СтрокаОплаты = ТекущаяСтрока;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если СтрокаОплаты = Неопределено Тогда
		СтрокаОплаты = Новый Структура;
		СтрокаОплаты.Вставить("ТипОплаты",		Транзакция.ТипОплаты);
		Если Транзакция.ТипОплаты = 1 Тогда
			СтрокаОплаты.Вставить("ТипКарты",   "");
			СтрокаОплаты.Вставить("НомерКарты", "");
		Иначе
			СтрокаОплаты.Вставить("ТипКарты",   ТекущийЧек.ТипКарты);
			СтрокаОплаты.Вставить("НомерКарты", ТекущийЧек.НомерКарты);
		КонецЕсли;
		СтрокаОплаты.Вставить("Сумма",		Транзакция.Сумма);
		
		ОплатыЧека.Добавить(СтрокаОплаты);
	Иначе
		СтрокаОплаты.Вставить("Сумма",		СтрокаОплаты.Сумма+Транзакция.Сумма);
	КонецЕсли;
	
	СтрокаОплаты.Вставить("ДатаИВремя", Транзакция.ДатаИВремя);
	
КонецПроцедуры

Процедура ДобавитьТоварнуюПозицию(ТекущийЧек, Транзакция)
	
	НовыйТовар = Новый Структура;
	НовыйТовар.Вставить("Код",					Транзакция.Код);
	НовыйТовар.Вставить("Количество",			Транзакция.Количество);
	НовыйТовар.Вставить("Цена",					Транзакция.Цена);
	НовыйТовар.Вставить("Сумма",				Транзакция.СуммаНВ);
	НовыйТовар.Вставить("НомерТранзакции",		Транзакция.НомерЧека);
	НовыйТовар.Вставить("ДатаИВремяТранзакции",	Транзакция.ДатаИВремя);
	НовыйТовар.Вставить("Скидка",				Транзакция.Скидка);
	НовыйТовар.Вставить("СкидкаАБС",			Транзакция.СкидкаАБС);
	НовыйТовар.Вставить("Штрихкод",				Транзакция.Штрихкод);
	
	ТекущийЧек.Товары.Добавить(НовыйТовар);
		
КонецПроцедуры

Функция ЗаполнитьТранзакцию(Строка, Транзакция, ФорматОбмена, ТекстОшибки)
	
	Результат = Истина;
	
	Попытка
		
		ПолеОшибки = НСтр("ru='Номер транзакции (1)'");
		
		// Номер транзакции.
		ПоложениеЗнакаРовно = СтрНайти(Строка,"="); 
		
		Если ПоложениеЗнакаРовно = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Если Лев(Строка, ПоложениеЗнакаРовно-1) = "C" Тогда
			Транзакция.Вставить("ТипТранзакции", "C");
			Транзакция.Вставить("НомерЧека", Число(СокрЛП(Сред(СтрПолучитьСтроку(Строка, 1),ПоложениеЗнакаРовно+1))));
			
			ПолеОшибки = НСтр("ru='Дата и время транзакции (2,3)'");
			
			ДатаТранзакции = СтрЗаменить(СтрПолучитьСтроку(Строка, 2), "/", Символы.ПС);
			ВремяТранзакции = СтрЗаменить(СтрПолучитьСтроку(Строка, 3), ":", Символы.ПС);
			
			// Дата и время транзакции.
			Транзакция.Вставить("ДатаИВремя", Дата(Число(СтрПолучитьСтроку(ДатаТранзакции, 3)), Число(СтрПолучитьСтроку(ДатаТранзакции, 2)), Число(СтрПолучитьСтроку(ДатаТранзакции, 1)), Число(СтрПолучитьСтроку(ВремяТранзакции, 1)), Число(СтрПолучитьСтроку(ВремяТранзакции, 2)), Число(СтрПолучитьСтроку(ВремяТранзакции, 3))));
			
			ПолеОшибки = НСтр("ru='Тип транзакции (4)'");
			
			// Тип транзакции.
			Транзакция.Вставить("Тип", Число(СтрПолучитьСтроку(Строка, 4)));
			
			ПолеОшибки = НСтр("ru='Ценовая Схема (5)'");
			
			// ЦеноваяСхема транзакции.
			Транзакция.Вставить("ЦенСхема", Число(СтрПолучитьСтроку(Строка, 5)));
			
			// СуммаБВ
			ПолеОшибки = НСтр("ru='СуммаБВ (6)'");
			
			Транзакция.Вставить("СуммаБВ",Число(СтрПолучитьСтроку(Строка, 6)));
			
			// СуммаНВ
			ПолеОшибки = НСтр("ru='СуммаНВ (7)'");
			
			Транзакция.Вставить("СуммаНВ",Число(СтрПолучитьСтроку(Строка, 7)));
			
			
			// % СКИДКИ
			ПолеОшибки = НСтр("ru='% СКИДКИ (8)'");
			
			Транзакция.Вставить("СкидкаПроц",Число(СтрПолучитьСтроку(Строка, 8)));
			
			//  СКИДКА АБС.
			//ПолеОшибки = НСтр("ru=' СКИДКА АБС. (9)'");
			//Транзакция.Вставить("СкидкаАБС",Число(СтрПолучитьСтроку(Строка, 9)));
			
			//  Кассир
			ПолеОшибки = НСтр("ru='Кассир (10)'");
			Транзакция.Вставить("Кассир",Число(СтрПолучитьСтроку(Строка, 10)));
			
			//  НОМЕР КАРТЫ
			ПолеОшибки = НСтр("ru='Номер карты (11)'");
			Транзакция.Вставить("НомерКарты",СтрПолучитьСтроку(Строка, 11));
			
			//  Тип КАРТЫ
			ПолеОшибки = НСтр("ru='Тип карты (12)'");
			Транзакция.Вставить("ТипКарты",СтрПолучитьСтроку(Строка, 12));
			
		ИначеЕсли Лев(Строка, ПоложениеЗнакаРовно-1) = "CM" Тогда
			
			Транзакция.Вставить("ТипТранзакции", "CM");

			Транзакция.Вставить("НомерЧека", Число(СокрЛП(Сред(СтрПолучитьСтроку(Строка, 1),ПоложениеЗнакаРовно+1))));
			
			// Дата и время транзакции.
			ПолеОшибки = НСтр("ru='Дата и время транзакции (2,3)'");
			ДатаТранзакции = СтрЗаменить(СтрПолучитьСтроку(Строка, 2), "/", Символы.ПС);
			ВремяТранзакции = СтрЗаменить(СтрПолучитьСтроку(Строка, 3), ":", Символы.ПС);
			Транзакция.Вставить("ДатаИВремя", Дата(Число(СтрПолучитьСтроку(ДатаТранзакции, 3)), Число(СтрПолучитьСтроку(ДатаТранзакции, 2)), Число(СтрПолучитьСтроку(ДатаТранзакции, 1)), Число(СтрПолучитьСтроку(ВремяТранзакции, 1)), Число(СтрПолучитьСтроку(ВремяТранзакции, 2)), Число(СтрПолучитьСтроку(ВремяТранзакции, 3))));
			
			// Тип транзакции.
			ПолеОшибки = НСтр("ru='Тип транзакции (4)'");
			Транзакция.Вставить("Тип", Число(СтрПолучитьСтроку(Строка, 4)));
			
			//Валюта - в файле это тип оплаты
			ПолеОшибки = НСтр("ru='ТипОплаты (5)'");
			Транзакция.Вставить("ТипОплаты", Число(СтрПолучитьСтроку(Строка, 5)));
			
			//Сумма
			ПолеОшибки = НСтр("ru='Суммма (6)'");
			Транзакция.Вставить("Сумма", Число(СтрПолучитьСтроку(Строка, 6)));
			
		ИначеЕсли Лев(Строка, ПоложениеЗнакаРовно-1) = "CT" Тогда
			
			Транзакция.Вставить("ТипТранзакции", "CT");
			Транзакция.Вставить("НомерЧека", Число(СокрЛП(Сред(СтрПолучитьСтроку(Строка, 1),ПоложениеЗнакаРовно+1))));
			
			//Раскладываем Дату и Время на строки
			ПолеОшибки = НСтр("ru='Дата и время транзакции (2,3)'");
			ДатаТранзакции = СтрЗаменить(СтрПолучитьСтроку(Строка, 2), "/", Символы.ПС);
			ВремяТранзакции = СтрЗаменить(СтрПолучитьСтроку(Строка, 3), ":", Символы.ПС);
			
			// Дата и время транзакции.
			Транзакция.Вставить("ДатаИВремя", Дата(Число(СтрПолучитьСтроку(ДатаТранзакции, 3)), Число(СтрПолучитьСтроку(ДатаТранзакции, 2)), Число(СтрПолучитьСтроку(ДатаТранзакции, 1)), Число(СтрПолучитьСтроку(ВремяТранзакции, 1)), Число(СтрПолучитьСтроку(ВремяТранзакции, 2)), Число(СтрПолучитьСтроку(ВремяТранзакции, 3))));
			ПолеОшибки = НСтр("ru='Тип транзакции (4)'");
			
			// Тип транзакции.
			Транзакция.Вставить("Тип", Число(СтрПолучитьСтроку(Строка, 4)));
			ПолеОшибки = НСтр("ru='Отдел (5)'");
			
			// ЦеноваяСхема транзакции.
			Транзакция.Вставить("Отдел", Число(СтрПолучитьСтроку(Строка, 5)));
			
			// Штрихкод
			ПолеОшибки = НСтр("ru='Штрихкод (6)'");
			Транзакция.Вставить("Штрихкод",СтрПолучитьСтроку(Строка, 6));
			
			// Цена
			ПолеОшибки = НСтр("ru='Цена (7)'");
			Транзакция.Вставить("Цена",Число(СтрПолучитьСтроку(Строка, 7)));
			
			// % СуммаБВ
			ПолеОшибки = НСтр("ru='% СуммаБВ (8)'");
			Транзакция.Вставить("СуммаБВ",Число(СтрПолучитьСтроку(Строка, 8)));
			
			//  СуммаНВ
			ПолеОшибки = НСтр("ru=' СуммаНВ. (9)'");
			Транзакция.Вставить("СуммаНВ",Число(СтрПолучитьСтроку(Строка, 9)));
			
			//  Количество
			ПолеОшибки = НСтр("ru='Количество (10)'");
			Транзакция.Вставить("Количество",Число(СтрПолучитьСтроку(Строка, 10)));
			
			//  Скидка
			ПолеОшибки = НСтр("ru='Скидка (11)'");
			Транзакция.Вставить("Скидка",Число(СтрПолучитьСтроку(Строка, 11)));
			
			//  Скидка
			ПолеОшибки = НСтр("ru='СкидкаАБС (12)'");
			Транзакция.Вставить("СкидкаАБС",Число(СтрПолучитьСтроку(Строка, 12)));
			
			//  Кассир
			ПолеОшибки = НСтр("ru='Кассир (13)'");
			Транзакция.Вставить("Кассир",Число(СтрПолучитьСтроку(Строка, 13)));
			
			//  КодТовара
			ПолеОшибки = НСтр("ru='КодТовара (14)'");
			Транзакция.Вставить("Код",СтрПолучитьСтроку(Строка, 14));
			
			//  НОМЕР КАРТЫ
			ПолеОшибки = НСтр("ru='Номер карты (15)'");
			Транзакция.Вставить("НомерКарты",СтрПолучитьСтроку(Строка, 15));
			
			//  Тип КАРТЫ
			ПолеОшибки = НСтр("ru='Тип карты (16)'");
			Транзакция.Вставить("ТипКарты",СтрПолучитьСтроку(Строка, 16));
			
			// ЦеноваяСхема транзакции.
			ПолеОшибки = НСтр("ru='Ценовая Схема (17)'");
			Транзакция.Вставить("ЦенСхема", Число(СтрПолучитьСтроку(Строка, 17)));
			
		Иначе
			
			Возврат Ложь;
			
		КонецЕсли
		
	Исключение
		
		// Если в процессе разбора транзакции произошла ошибка.
		ТекстОшибки = НСтр("ru='Неверный формат файла. Невозможно распознать поле: %1%");
		ТекстОшибки = СтрЗаменить(ТекстОшибки, "%1%", ПолеОшибки);
		
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДатуПервойСмены(Оборудование) Экспорт
	
	ЗаполнитьПараметрыОборудования(Оборудование);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	НАЧАЛОПЕРИОДА(МИНИМУМ(ЗакрытиеСмены.Дата), ДЕНЬ) КАК ДатаСмены
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ 
	|	ЗакрытиеСмены.КассаККМ = &КассаККМ
	|";
	Запрос.УстановитьПараметр("КассаККМ", Оборудование.Касса);
	Выборка = Запрос.Выполнить().Выбрать();
	Результат = Неопределено;
	Если Выборка.Следующий() Тогда
		Результат = Выборка.ДатаСмены;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(Результат) Тогда
		Результат = Дата(2019,7,1);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ЗагрузитьМарки(ТаблицаМарок, Оборудование, НомерКассы, НомерСмены, ДатаСмены, МассивШтрихКодов) Экспорт
	
	Если ТаблицаМарок.Количество() = 0 Тогда
		Возврат Истина;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Организация           = Оборудование.Организация;
	ПодразделениеКомпании = Оборудование.ПодразделениеКомпании;
	ОрганизацияЕГАИС      = Оборудование.ОрганизацияЕГАИС;
	
	Если Не ЗначениеЗаполнено(ОрганизацияЕГАИС) Тогда
		Событие                = НСтр("ru = 'Загрузка кассовых смен'");
		ОписаниеПредупреждения = СтрШаблон(НСтр("ru = 'Ошибка загрузки марок: По организации %1 и подразделению %2 не найдена организация ЕГАИС.'"), 
		Организация, ПодразделениеКомпании);
		ЗаписьЖурналаРегистрации(Событие,УровеньЖурналаРегистрации.Ошибка,,Оборудование.Касса,ОписаниеПредупреждения);
		Возврат Ложь;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗакрытиеСмены.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.НомерСмены     = &НомерСмены И 
	|	ЗакрытиеСмены.КассаККМ       = &КассаККМ И 
	|	НАЧАЛОПЕРИОДА(ЗакрытиеСмены.Дата, ДЕНЬ) = &ДатаДокумента И 
	|	ЗакрытиеСмены.НомерДокумента = &НомерДокумента
	|";
	
	Запрос.УстановитьПараметр("НомерСмены",     Число(НомерСмены));
	Запрос.УстановитьПараметр("ДатаДокумента",  НачалоДня(ДатаСмены));
	Запрос.УстановитьПараметр("КассаККМ",       Оборудование.Касса);
	Запрос.УстановитьПараметр("НомерДокумента", Число(НомерСмены));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗакрытиеСмены = Выборка.Ссылка.ПолучитьОбъект();
	
	//ОрганизацияЕГАИС = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторОрганизации(Организация, ПодразделениеКомпании, Организация.ИНН, ПодразделениеКомпании.КПП);
	
	НачатьТранзакцию();
	Попытка
		
		ТаблицаШтрихКодов = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(МассивШтрихКодов);
		ТаблицаШтрихКодов.Индексы.Добавить("Штрихкод");
		
		ЗакрытиеСмены.Марки.Очистить();
		Для Каждого СтрокаМарок Из ТаблицаМарок Цикл
			
			НоваяСтрока = ЗакрытиеСмены.Марки.Добавить();
			НоваяСтрока.ЭтоВозврат = СтрокаМарок.ЭтоВозврат;
			НоваяСтрока.КодМарки   = СтрокаМарок.КодМарки;
			
			НайденныйШтрихКод = ТаблицаШтрихКодов.Найти(СтрокаМарок.ШтрихКод, "Штрихкод");
			Если НайденныйШтрихКод = Неопределено Тогда
				НоваяСтрока.Номенклатура = НайтиНоменклатуру(СтрокаМарок.Артикул, Неопределено);
			Иначе
				НоваяСтрока.Номенклатура = НайденныйШтрихКод.Объект;
			КонецЕсли;
			
			РезультатПоиска = ИнтеграцияЕГАИС.ПолучитьКодПоОстаткамМарок(СтрокаМарок.КодМарки);
			Если ПустаяСтрока(РезультатПоиска.КодАП) И СтрДлина(СтрокаМарок.КодМарки)=68 Тогда
				КодАП = ИнтеграцияЕГАИСВызовСервера.ПолучитьКодИзPDF(СтрокаМарок.КодМарки);
				
				АлкогольнаяПродукция = ИнтеграцияЕГАИС.ПолучитьКлассификаторАлкоголяПоКоду(КодАП);
				НоваяСтрока.АлкогольнаяПродукция = АлкогольнаяПродукция;
			Иначе
				НоваяСтрока.АлкогольнаяПродукция = РезультатПоиска.АлкогольнаяПродукция;
			КонецЕсли;
			
		КонецЦикла;
		
		Если ЗакрытиеСмены.Марки.Количество()>0 Тогда
			ЗакрытиеСмены.ОбменДанными.Загрузка = ИСТИНА;
			ЗакрытиеСмены.Записать(РежимЗаписиДокумента.Запись);
			
			ТаблицаДвижений = ЗакрытиеСмены.ПолучитьДвиженияПоМаркамСмены(ЗакрытиеСмены.Дата, ОрганизацияЕГАИС, ЗакрытиеСмены.Ссылка, ЗакрытиеСмены.МоментВремени());
			
			НаборЗаписей = РегистрыНакопления.ОстаткиМарокЕГАИС.СоздатьНаборЗаписей();
			НаборЗаписей.Загрузить(ТаблицаДвижений);
			НаборЗаписей.Отбор.Регистратор.Значение = ЗакрытиеСмены.Ссылка;
			НаборЗаписей.Отбор.Регистратор.Использование = Истина;
			НаборЗаписей.Записать(Истина);
			
		КонецЕсли;
		
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Событие                = НСтр("ru = 'Загрузка кассовых смен'");
		ОписаниеПредупреждения = СтрШаблон(НСтр("ru = 'Ошибка проведения закрытия смены %1 по кассе %2. Ошибка:
		|	%3'"), НомерСмены, Оборудование.Касса, ТекстОшибки);
		ЗаписьЖурналаРегистрации(Событие,УровеньЖурналаРегистрации.Ошибка,,Оборудование.Касса,ОписаниеПредупреждения);
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	ЗафиксироватьТранзакцию();
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Область ПрограммныйИнтерфейс

Функция НайтиНоменклатуру(Артикул, СлужебныйТовар)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Артикул = &Артикул
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	Номенклатура.Ссылка
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Код = &Артикул
	|";
	
	Запрос.УстановитьПараметр("Артикул", Артикул);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат СлужебныйТовар;
	КонецЕсли;

КонецФункции

Функция ОбработатьЗагружаемыеДанныеИзККМ(ТекстовыйДокумент, ФорматОбмена, ЗагружаемыеДанныеИзККМ, Оборудование, ТекстОшибки, ВариантЗаполненияДатыСмены, ВремяСмены) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ЗаполнитьПараметрыОборудования(Оборудование);
	
	Результат = Истина;
	
	ВсегоСтрок = ТекстовыйДокумент.КоличествоСтрок();
	
	ЗагружаемыеДанныеИзККМ = МенеджерОфлайнОборудования.ПолучитьЗагружаемыеДанныеИзККМ();
	
	ТекстОшибки = "";
	Строка      = ТекстовыйДокумент.ПолучитьСтроку(1);
	
	ПродолжатьЧтениеФайла = Истина;
	Индекс = 9;  // Номер строки в файле. "9" первая заполненная строка чека
	// проверка на пустую сессию кассы ККМ
	ПроверкаСтроки = ТекстовыйДокумент.ПолучитьСтроку(Индекс);
	Если ПроверкаСтроки = "КОНЕЦ КОНТРОЛЬНОЙ ЛЕНТЫ" Тогда
		Результат = Ложь;
		ТекстОшибки = "Незаполненный Файл смены для " +Строка(Оборудование.Касса);
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	СтрокаСессииСмены = ТекстовыйДокумент.ПолучитьСтроку(5);
	ТекущаяСмена = новый Структура;
	ИндексНачала = Найти(СтрокаСессииСмены,"/");
	ТекущаяСмена.Вставить("Номер",Сред(СтрокаСессииСмены,ИндексНачала+1));
	
	СтрокаСессииСмены = ВРег(ТекстовыйДокумент.ПолучитьСтроку(4));
	СтрокаСессииСмены = СтрЗаменить(СтрокаСессииСмены, "КАССА=", "");
	СтрокаСессииСмены = СтрЗаменить(СтрокаСессииСмены, "=", "");
	ТекущаяСмена.Вставить("Касса", СтрокаСессииСмены);
	
	СтрокаСессииСмены = ВРег(ТекстовыйДокумент.ПолучитьСтроку(2));
	СтрокаСессииСмены = СтрЗаменить(СтрокаСессииСмены, "/", Символы.ПС);
	СтрокаСессииСмены = СтрЗаменить(СтрокаСессииСмены, "ДАТА", "");
	СтрокаСессииСмены = СтрЗаменить(СтрокаСессииСмены, "=", "");
	
	ГодСмены   = Число(СтрПолучитьСтроку(СтрокаСессииСмены, 3));
	МесяцСмены = Число(СтрПолучитьСтроку(СтрокаСессииСмены, 2));
	ДеньСмены  = Число(СтрПолучитьСтроку(СтрокаСессииСмены, 1));
	
	СтрокаСессииСмены = ВРег(ТекстовыйДокумент.ПолучитьСтроку(3));
	СтрокаСессииСмены = СтрЗаменить(СтрокаСессииСмены, ":", Символы.ПС);
	СтрокаСессииСмены = СтрЗаменить(СтрокаСессииСмены, "ВРЕМЯ", "");
	СтрокаСессииСмены = СтрЗаменить(СтрокаСессииСмены, "=", "");
	
	ЧасСмены    = Число(СтрПолучитьСтроку(СтрокаСессииСмены, 1));
	МинутаСмены = Число(СтрПолучитьСтроку(СтрокаСессииСмены, 2));
	
	ТекущаяСмена.Вставить("ДатаОткрытия", Дата(ГодСмены, МесяцСмены, ДеньСмены, ЧасСмены, МинутаСмены, 0));
	ТекущаяСмена.Вставить("ДатаЗакрытия", Неопределено);
	ТекущаяСмена.Вставить("Чеки", Новый Массив);
	
	ТекущийЧек = Неопределено;
	
	// В цикле читаем транзакции.
	Пока ПродолжатьЧтениеФайла Цикл
		
		Если Индекс > ВсегоСтрок Тогда // Проводим Закрытие последнего чека и прекращаем чтение файла
			Прервать;
		КонецЕсли;
		
		// Получаем строку с очередной транзакцией.
		Строка = ТекстовыйДокумент.ПолучитьСтроку(Индекс);
		
		Транзакция = Новый Структура;
		// Раскладываем транзакцию на поля.
		Если НЕ ЗаполнитьТранзакцию(СтрЗаменить(Строка, ",", Символы.ПС), Транзакция, ФорматОбмена, ТекстОшибки) Тогда
			Индекс = Индекс + 1;
			Продолжить;
		КонецЕсли;
		
		Если Транзакция.ТипТранзакции = "CT" Тогда
			ДобавитьТоварнуюПозицию(ТекущийЧек, Транзакция);
		ИначеЕсли Транзакция.ТипТранзакции = "CM" Тогда
			ДобавитьОплату(ТекущийЧек, Транзакция);
		ИначеЕсли Транзакция.ТипТранзакции = "C" Тогда
			Если НЕ ТекущийЧек = Неопределено Тогда
				ЗакрытьЧек(ТекущийЧек, Транзакция, ТекстОшибки);
			КонецЕсли;
			ТекущийЧек = ОткрытьЧек(ТекущаяСмена, Транзакция);
		КонецЕсли;
		
		Индекс = Индекс + 1;
	КонецЦикла;
	
	Если НЕ ТекущийЧек = Неопределено Тогда
		ЗакрытьЧек(ТекущийЧек, Транзакция, ТекстОшибки);
		ТекущаяСмена.ДатаЗакрытия = ТекущийЧек.ДатаЧека;
	КонецЕсли;
	
	//Создаю таблицы для документа закрытие смены
	ТаблицаЗакрытиеСменыТовары = СоздатьТаблицуТовары();
	ТаблицаЗакрытиеСменыОплаты = СоздатьТаблицуОплаты();
	ТаблицаЗакрытиеСменыСкидки = СоздатьТаблицуСкидки();
	ТаблицаВозвраты            = СоздатьТаблицуВозвраты();
	
	ЧекиВПолнойСмене = новый Массив;
	//Смена = ТекущаяСмена;
	ДанныеСмены = Новый Структура;
	ДанныеСмены.Вставить("Номер", ТекущаяСмена.Номер);
	ДанныеСмены.Вставить("Касса", ТекущаяСмена.Касса);
	ДанныеСмены.Вставить("ДатаОткрытия", ТекущаяСмена.ДатаОткрытия);
	ДанныеСмены.Вставить("ДатаЗакрытия", ТекущаяСмена.ДатаЗакрытия);
	
	Если НЕ Результат Тогда
		Если ПривилегированныйРежим() Тогда
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
		Возврат Результат;
	КонецЕсли;
	
	// Перебираем смены.
	// Формируем описание смены.
	// Перебираем все чеки смены.
	СуммаЧеков      = 0;
	СкидкаЧеков     = 0;
	КоличествоЧеков = 0;
	Для Каждого Чек Из ТекущаяСмена.Чеки Цикл
		
		// Если чек закрыт.
		Если НЕ Чек.Закрыт Тогда
			Продолжить;
		КонецЕсли;
		
		Если Чек.ТипОперацииККМ = "Продажа" Тогда
			Для каждого СтрокаТаблицы Из Чек.Товары Цикл
				СкидкаСтроки  = (СтрокаТаблицы.Цена*СтрокаТаблицы.Количество)-СтрокаТаблицы.Сумма;
				НоваяСтрока = ТаблицаЗакрытиеСменыТовары.Добавить();
				НоваяСтрока.Код 							= СокрЛП(СтрокаТаблицы.Код);
				НоваяСтрока.Цена 							= СтрокаТаблицы.Цена;
				НоваяСтрока.Сумма 							= СтрокаТаблицы.Сумма;
				НоваяСтрока.СуммаВозврат					= 0;
				НоваяСтрока.Количество 						= СтрокаТаблицы.Количество;
				НоваяСтрока.КоличествоВозврат				= 0;
				НоваяСтрока.Штрихкод                        = СокрЛП(СтрокаТаблицы.Штрихкод);
				НоваяСтрока.Скидка 							= СкидкаСтроки;
				НоваяСтрока.СкидкаВозврат					= 0;
				НоваяСтрока.СкидкаАБС						= 0;
				НоваяСтрока.СкидкаАБСВозврат				= 0;
				НоваяСтрока.КоличествоЧеков					= 1;
				НоваяСтрока.КоличествоЧековВозврат   		= 0;
				
				Если (НЕ СкидкаСтроки=0) Тогда
					КоличествоЧеков = КоличествоЧеков + 1;
					СуммаЧеков  = СуммаЧеков + НоваяСтрока.Сумма;
					СкидкаЧеков = СкидкаЧеков + НоваяСтрока.Скидка;
				КонецЕсли;
				
			КонецЦикла;
		Иначе
			Для каждого СтрокаТаблицы Из Чек.Товары Цикл
				КоличествоКВозврату = -СтрокаТаблицы.Количество;
				СкидкаСтроки  = (СтрокаТаблицы.Цена*КоличествоКВозврату)-СтрокаТаблицы.Сумма;
				НоваяСтрока = ТаблицаЗакрытиеСменыТовары.Добавить();
				НоваяСтрока.Код 							= СокрЛП(СтрокаТаблицы.Код);
				НоваяСтрока.Цена 							= СтрокаТаблицы.Цена;
				НоваяСтрока.Сумма 							= 0;
				НоваяСтрока.СуммаВозврат					= СтрокаТаблицы.Сумма;
				НоваяСтрока.Количество 						= 0;
				НоваяСтрока.КоличествоВозврат				= КоличествоКВозврату;
				НоваяСтрока.Штрихкод                        = СокрЛП(СтрокаТаблицы.Штрихкод);
				НоваяСтрока.Скидка 							= 0;
				НоваяСтрока.СкидкаВозврат					= СкидкаСтроки;
				НоваяСтрока.СкидкаАБС						= 0;
				НоваяСтрока.СкидкаАБСВозврат				= 0;
				НоваяСтрока.КоличествоЧеков					= 0;
				НоваяСтрока.КоличествоЧековВозврат   		= 1;
				
				Если (НЕ СкидкаСтроки=0) Тогда
					СуммаЧеков  = СуммаЧеков - НоваяСтрока.СуммаВозврат;
					СкидкаЧеков = СкидкаЧеков - НоваяСтрока.СкидкаВозврат;
				КонецЕсли;
				
				НоваяСтрока = ТаблицаВозвраты.Добавить();
				НоваяСтрока.Код 				 = СокрЛП(СтрокаТаблицы.Код);
				НоваяСтрока.Цена 				 = СтрокаТаблицы.Цена;
				НоваяСтрока.Сумма 				 = СтрокаТаблицы.Сумма;
				НоваяСтрока.Количество 			 = КоличествоКВозврату;
				НоваяСтрока.Штрихкод             = СокрЛП(СтрокаТаблицы.Штрихкод);
				НоваяСтрока.Скидка 				 = СкидкаСтроки;
				НоваяСтрока.СкидкаАБС			 = 0;
				НоваяСтрока.ДатаРеализации       = Чек.ДатаЧека;
				НоваяСтрока.НомерФискальногоЧека = Чек.НомерЧека;
				
			КонецЦикла;
			
		КонецЕсли;
		
		Для Каждого Оплата Из Чек.Оплаты Цикл
			
			СтрокаОплаты = ТаблицаЗакрытиеСменыОплаты.Добавить();
			Если Чек.ТипОперацииККМ = "Продажа" Тогда
				СтрокаОплаты.Сумма = Оплата.Сумма;
				СтрокаОплаты.КоличествоЧеков = 1;
			Иначе
				СтрокаОплаты.СуммаВозврат = -Оплата.Сумма;
				СтрокаОплаты.КоличествоЧековВозврат = 1;
			КонецЕсли;
			Если Оплата.ТипОплаты = 1 Тогда
				//СтрокаОплаты.ТипОплаты = "Продажа";
				СтрокаОплаты.ТипОплаты = Справочники.ТипыОплат.Наличные;
			Иначе
				СтрокаОплаты.ТипОплаты = Справочники.ТипыОплат.Безналичные;
				СтрокаОплаты.КодВидаЭлектроннойОплаты = Оплата.ТипОплаты;
				Если Оплата.ТипОплаты = 4 Тогда
					СтрокаОплаты.УникальныйИдентификаторВидаЭлектроннойОплаты = Справочники.ТипыПлатежныхКарт.Sbercard;
				ИначеЕсли Оплата.ТипОплаты = 10 тогда
					СтрокаОплаты.УникальныйИдентификаторВидаЭлектроннойОплаты = Справочники.ТипыПлатежныхКарт.Eurocard_Mastercard;
				Иначе
					СтрокаОплаты.ТипОплаты = Справочники.ТипыОплат.ЗачетАванса;
					СтрокаОплаты.УникальныйИдентификаторВидаЭлектроннойОплаты = Справочники.ТипыПлатежныхКарт.GiftCard;
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если (НЕ СкидкаЧеков=0) Тогда
		СтрокаСкидки = ТаблицаЗакрытиеСменыСкидки.Добавить();
		СтрокаСкидки.Скидка          = СкидкаЧеков;
		СтрокаСкидки.СкидкаАБС       = 0;
		СтрокаСкидки.Сумма           = СуммаЧеков;
		СтрокаСкидки.КоличествоЧеков = КоличествоЧеков;
	КонецЕсли;
	
	// начинаю оформлять Таблицы товаров и таблицы Оплат  
	Автор = ПараметрыСеанса.АвторизованныйПользователь;
	
	ДокументЗакрытиеСмены = СоздатьЗакрытиеСмены(ДанныеСмены.Касса, Автор, Оборудование, ДанныеСмены, ВариантЗаполненияДатыСмены, ВремяСмены);
	
	СлужебныйТовар = Константы.СлужебныйТовар.Получить();
	
	ТаблицаЗакрытиеСменыТовары.Свернуть("Код,Штрихкод,Цена","Сумма,СуммаВозврат,Количество,КоличествоВозврат,Скидка,СкидкаВозврат,СкидкаАБС,СкидкаАБСВозврат,КоличествоЧеков,КоличествоЧековВозврат");
	ТаблицаЗакрытиеСменыСкидки.Свернуть("","Скидка,КоличествоЧеков,СкидкаАБС,Сумма");
	ТаблицаЗакрытиеСменыОплаты.Свернуть("ТипОплаты,КодВидаЭлектроннойОплаты,УникальныйИдентификаторВидаЭлектроннойОплаты","КоличествоЧеков,КоличествоЧековВозврат,Сумма,СуммаВозврат");
	ТаблицаВозвраты.Свернуть("Код,Штрихкод,Цена,ДатаРеализации,НомерФискальногоЧека","Сумма,Количество,Скидка,СкидкаАБС");
	
	Штрихкоды = ТаблицаЗакрытиеСменыТовары.ВыгрузитьКолонку("Штрихкод");
	ТаблицаШтрихКодов = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(Штрихкоды);
	ТаблицаШтрихКодов.Индексы.Добавить("Штрихкод");
	
	ПараметрыДействия = Новый Структура;
	Для каждого СтрокаДокумента Из ТаблицаЗакрытиеСменыТовары Цикл
		СтрокаТоваров = ДокументЗакрытиеСмены.Товары.Добавить();
		// СтрокаТоваров.Код =  ТаблицаЗакрытиеСменыТовары.Код;
		
		СтрокаТоваров.МестоРазмещения = ДокументЗакрытиеСмены.СкладКомпании;
		
		НайденныйШтрихКод = ТаблицаШтрихКодов.Найти(СтрокаДокумента.Штрихкод, "Штрихкод");
		Если НайденныйШтрихКод = Неопределено Тогда
			СтрокаТоваров.Номенклатура = НайтиНоменклатуру(СтрокаДокумента.Код, СлужебныйТовар);
		Иначе
			СтрокаТоваров.Номенклатура               = НайденныйШтрихКод.Объект;
			СтрокаТоваров.ЕдиницаИзмерения           = НайденныйШтрихКод.ЕдиницаИзмерения;
			СтрокаТоваров.ХарактеристикаНоменклатуры = НайденныйШтрихКод.ХарактеристикаНоменклатуры;
		КонецЕсли;
		
		ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеНоменклатура(ДокументЗакрытиеСмены, СтрокаТоваров, ПараметрыДействия);
		
		Если ЗначениеЗаполнено(СтрокаТоваров.ЕдиницаИзмерения) Тогда
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаТоваров.Номенклатура) Тогда
			СтрокаТоваров.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		ИначеЕсли ЗначениеЗаполнено(СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения) Тогда
			СтрокаТоваров.ЕдиницаИзмерения = СтрокаТоваров.Номенклатура.ОсновнаяЕдиницаИзмерения;
		Иначе
			СтрокаТоваров.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(СтрокаТоваров.Номенклатура);
		КонецЕсли;
		
		СтрокаТоваров.Коэффициент = СтрокаТоваров.ЕдиницаИзмерения.Коэффициент;
		СтрокаТоваров.Количество  = СтрокаДокумента.Количество;
		
		Документы.ЗакрытиеСмены.ТоварыКоличествоПриИзменении(ДокументЗакрытиеСмены, СтрокаТоваров);
		СтрокаТоваров.Цена 					= СтрокаДокумента.Цена;
		Документы.ЗакрытиеСмены.ТоварыЦенаПриИзменении(ДокументЗакрытиеСмены, СтрокаТоваров);
		СтрокаТоваров.СуммаВсего  = СтрокаДокумента.Сумма;
		СтрокаТоваров.СуммаСкидки = СтрокаДокумента.Скидка;
		
		//Если СтрокаДокумента.Скидка>0 Тогда 
		//	СтрокаТоваров.ПроцентСкидки = СтрокаДокумента.Скидка;
		//Иначе
		Если СтрокаТоваров.СуммаСкидки>0 Тогда 
			СуммаБезСкидки = СкидкиНаценкиСервер.ПолучитьСуммуСтрокиБезСкидок(ДокументЗакрытиеСмены, СтрокаТоваров, "Товары");
			СтрокаТоваров.ПроцентСкидки = ?(СуммаБезСкидки = 0, 0, СтрокаТоваров.СуммаСкидки*100/СуммаБезСкидки);
		КонецЕсли;
		
		Документы.ЗакрытиеСмены.ТоварыСуммаВсегоПриИзменении(ДокументЗакрытиеСмены, СтрокаТоваров);
		
		СтрокаТоваров.КоличествоЧеков = СтрокаДокумента.КоличествоЧеков;
		
	КонецЦикла;
	
	ДокументЗакрытиеСмены.Товары.Сортировать("Номенклатура");
	НайденныеСтроки = ДокументЗакрытиеСмены.Товары.НайтиСтроки(Новый Структура("Номенклатура", СлужебныйТовар));
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		ИндексСтроки = ДокументЗакрытиеСмены.Товары.Индекс(ТекущаяСтрока);
		Если ИндексСтроки = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДокументЗакрытиеСмены.Товары.Сдвинуть(ИндексСтроки, -ИндексСтроки);
	КонецЦикла;
	
	Для Каждого СтрокаДокумента Из ТаблицаЗакрытиеСменыОплаты Цикл
		СтрокаОплат = ДокументЗакрытиеСмены.Оплаты.Добавить();
		СтрокаОплат.Касса = Оборудование.Касса;
		СтрокаОплат.ТипОплаты 		      = СтрокаДокумента.ТипОплаты;
		СтрокаОплат.ТипПлатежнойКарты     = СтрокаДокумента.УникальныйИдентификаторВидаЭлектроннойОплаты;
		СтрокаОплат.Сумма                 = СтрокаДокумента.Сумма;
		СтрокаОплат.СуммаОплата           = 0;
		СтрокаОплат.СуммаВозврат          = СтрокаДокумента.СуммаВозврат;
		СтрокаОплат.СуммаВозвратОплата    = 0;
		СтрокаОплат.КоличествоЧековОплата = 0;
		СтрокаОплат.КоличествоЧеков       = СтрокаДокумента.КоличествоЧеков;
		
	КонецЦикла;
	
	Для Каждого СтрокаДокумента Из ТаблицаЗакрытиеСменыСкидки Цикл
		СтрокаСкидок = ДокументЗакрытиеСмены.Скидки.Добавить();
		СтрокаСкидок.СкидкаНаценка   = Справочники.ТипыСкидок.РучнаяСкидка;
		СтрокаСкидок.СуммаСкидки     = СтрокаДокумента.Скидка;
		СтрокаСкидок.СуммаВсего      = СтрокаДокумента.Сумма;
		СтрокаСкидок.Сумма           = СтрокаДокумента.Сумма + СтрокаДокумента.Скидка;
		СтрокаСкидок.КоличествоЧеков = СтрокаДокумента.КоличествоЧеков;
	КонецЦикла;
	
	Штрихкоды = ТаблицаВозвраты.ВыгрузитьКолонку("Штрихкод");
	ТаблицаШтрихКодов = ШтрихкодированиеВызовСервера.НайтиОбъектыПоШтрихкоду(Штрихкоды);
	ТаблицаШтрихКодов.Индексы.Добавить("Штрихкод");
	
	Для Каждого СтрокаДокумента Из ТаблицаВозвраты Цикл
		СтрокаВозвраты = ДокументЗакрытиеСмены.Возвраты.Добавить();
		
		СтрокаВозвраты.МестоРазмещения = ДокументЗакрытиеСмены.СкладКомпании;
		
		НайденныйШтрихКод = ТаблицаШтрихКодов.Найти(СтрокаДокумента.Штрихкод, "Штрихкод");
		Если НайденныйШтрихКод = Неопределено Тогда
			СтрокаТоваров.Номенклатура = НайтиНоменклатуру(СтрокаДокумента.Код, СлужебныйТовар);
		Иначе
			СтрокаВозвраты.Номенклатура               = НайденныйШтрихКод.Объект;
			СтрокаВозвраты.ЕдиницаИзмерения           = НайденныйШтрихКод.ЕдиницаИзмерения;
			СтрокаВозвраты.ХарактеристикаНоменклатуры = НайденныйШтрихКод.ХарактеристикаНоменклатуры;
		КонецЕсли;
		
		ОбработкаТабличнойЧастиТовары.ОбработатьИзменениеНоменклатура(ДокументЗакрытиеСмены, СтрокаВозвраты, ПараметрыДействия);
		
		Если ЗначениеЗаполнено(СтрокаВозвраты.ЕдиницаИзмерения) Тогда
		ИначеЕсли НЕ ЗначениеЗаполнено(СтрокаВозвраты.Номенклатура) Тогда
			СтрокаВозвраты.СтавкаНДС = Справочники.СтавкиНДС.ОсновнаяСтавкаНДС;
		ИначеЕсли ЗначениеЗаполнено(СтрокаВозвраты.Номенклатура.ОсновнаяЕдиницаИзмерения) Тогда
			СтрокаВозвраты.ЕдиницаИзмерения = СтрокаВозвраты.Номенклатура.ОсновнаяЕдиницаИзмерения;
		Иначе
			СтрокаВозвраты.ЕдиницаИзмерения = Справочники.Номенклатура.ПолучитьОсновнуюЕдиницуПоБазовой(СтрокаВозвраты.Номенклатура);
		КонецЕсли;
		
		СтрокаВозвраты.Коэффициент = СтрокаВозвраты.ЕдиницаИзмерения.Коэффициент;
		СтрокаВозвраты.Количество  = СтрокаДокумента.Количество;
		
		Документы.ЗакрытиеСмены.ВозвратыКоличествоПриИзменении(ДокументЗакрытиеСмены, СтрокаВозвраты);
		
		
		СтрокаВозвраты.Цена = СтрокаДокумента.Цена;
		Документы.ЗакрытиеСмены.ВозвратыЦенаПриИзменении(ДокументЗакрытиеСмены, СтрокаВозвраты);
		СтрокаВозвраты.СуммаВсего  = СтрокаДокумента.Сумма;
		СтрокаВозвраты.СуммаСкидки = СтрокаДокумента.Скидка;
		
		Если СтрокаВозвраты.СуммаСкидки>0 Тогда 
			СуммаБезСкидки = СкидкиНаценкиСервер.ПолучитьСуммуСтрокиБезСкидок(ДокументЗакрытиеСмены, СтрокаВозвраты, "Товары");
			СтрокаВозвраты.ПроцентСкидки = ?(СуммаБезСкидки = 0, 0, СтрокаВозвраты.СуммаСкидки*100/СуммаБезСкидки);
		КонецЕсли;
		
		СтрокаВозвраты.ДатаРеализации       = СтрокаДокумента.ДатаРеализации;
		СтрокаВозвраты.НомерФискальногоЧека = СтрокаДокумента.НомерФискальногоЧека;
		
		СтрокаВозвраты.КоличествоЧеков = 1;
		
	КонецЦикла;
	
	НайденныеСтроки = ДокументЗакрытиеСмены.Возвраты.НайтиСтроки(Новый Структура("Номенклатура", СлужебныйТовар));
	Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
		ИндексСтроки = ДокументЗакрытиеСмены.Возвраты.Индекс(ТекущаяСтрока);
		Если ИндексСтроки = 0 Тогда
			Продолжить;
		КонецЕсли;
		ДокументЗакрытиеСмены.Возвраты.Сдвинуть(ИндексСтроки, -ИндексСтроки);
	КонецЦикла;
	
	Для Каждого СтрокаДокумента Из ТаблицаЗакрытиеСменыОплаты Цикл
		
		Если СтрокаДокумента.СуммаВозврат = 0 Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаОплат = ДокументЗакрытиеСмены.ВозвратОплаты.Добавить();
		СтрокаОплат.Касса = Оборудование.Касса;
		СтрокаОплат.ТипОплаты 		      = СтрокаДокумента.ТипОплаты;
		СтрокаОплат.ТипПлатежнойКарты     = СтрокаДокумента.УникальныйИдентификаторВидаЭлектроннойОплаты;
		СтрокаОплат.Сумма                 = СтрокаДокумента.СуммаВозврат;
		СтрокаОплат.СуммаОплата           = 0;
		СтрокаОплат.КоличествоЧековОплата = 0;
		СтрокаОплат.КоличествоЧеков       = СтрокаДокумента.КоличествоЧеков;
		
	КонецЦикла;
	
	ИтогиОперации = Документы.ЗакрытиеСмены.РассчитатьИтогиОперации(ДокументЗакрытиеСмены);
	ЗаполнитьЗначенияСвойств(ДокументЗакрытиеСмены, ИтогиОперации);
	
	Попытка
		ДокументЗакрытиеСмены.Записать(РежимЗаписиДокумента.Проведение);
	Исключение
		ТекстОшибки = КраткоеПредставлениеОшибки(ИнформацияОбОшибке());
		
		Событие                = НСтр("ru = 'Загрузка кассовых смен'");
		ОписаниеПредупреждения = СтрШаблон(НСтр("ru = 'Ошибка проведения закрытия смены %1 по кассе %2. Ошибка:
		|	%3'"), ТекущаяСмена.Номер, ТекущаяСмена.Касса, ТекстОшибки);
		ЗаписьЖурналаРегистрации(Событие,УровеньЖурналаРегистрации.Ошибка,,ТекущаяСмена.Касса,ОписаниеПредупреждения);
		
		ДокументЗакрытиеСмены.Записать(РежимЗаписиДокумента.Запись);
		Результат = Ложь;
		//ВызватьИсключение(ТекстОшибки);
	КонецПопытки;
	
	ЗагружаемыеДанныеИзККМ.ОтчетыОПродажах.Добавить(ДокументЗакрытиеСмены.Ссылка);
	
	Если ПривилегированныйРежим() Тогда
		УстановитьПривилегированныйРежим(Ложь);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьТоварЧекаККМ()
	
	СтруктураЗаписи = Новый ТаблицаЗначений;
	
	СтруктураЗаписи.Колонки.Добавить("Код",);
	//СтруктураЗаписи.Колонки.Добавить("Номенклатура");
	СтруктураЗаписи.Колонки.Добавить("Цена");
	СтруктураЗаписи.Колонки.Добавить("Сумма");
	СтруктураЗаписи.Колонки.Добавить("Количество");
	СтруктураЗаписи.Колонки.Добавить("Штрихкод");
	СтруктураЗаписи.Колонки.Добавить("Скидка");
	СтруктураЗаписи.Колонки.Добавить("СкидкаАБС");
	
	//СтруктураЗаписи.Колонки.Добавить("ПризнакСпособаРасчета");
	//СтруктураЗаписи.Колонки.Добавить("УникальныйИдентификаторНоменклатуры");
	//СтруктураЗаписи.Колонки.Добавить("УникальныйИдентификаторХарактеристики");
	//СтруктураЗаписи.Колонки.Добавить("УникальныйИдентификаторУпаковки");
	
	Возврат СтруктураЗаписи;
	
КонецФункции

Процедура ЗаполнитьПараметрыОборудования(Оборудование) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КассыККМ.Ссылка КАК Ссылка,
	|	КассыККМ.Организация КАК Организация,
	|	КассыККМ.Организация.ИНН КАК ИНН
	|ИЗ
	|	Справочник.КассыККМ КАК КассыККМ
	|ГДЕ
	|	КассыККМ.ПометкаУдаления = ЛОЖЬ
	|	И КассыККМ.Оборудование = &Оборудование
	|	И КассыККМ.НомерPOS = &НомерPOS";
	
	Запрос.УстановитьПараметр("НомерPOS",     Оборудование.НомерPOS);
	Запрос.УстановитьПараметр("Оборудование", Оборудование.Идентификатор);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		Оборудование.Организация = Выборка.Организация;
		Оборудование.Касса       = Выборка.Ссылка;
		ПодразделениеКомпании = Оборудование.ОсновнойОтдел.ПодразделениеКомпании;
		ОрганизацияЕГАИС = Справочники.КлассификаторОрганизацийЕГАИС.НайтиКлассификаторОрганизации(Выборка.Организация, ПодразделениеКомпании, Выборка.ИНН, ПодразделениеКомпании.КПП);
		Оборудование.Вставить("ПодразделениеКомпании", ПодразделениеКомпании);
		Оборудование.Вставить("ОрганизацияЕГАИС",      ОрганизацияЕГАИС);
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьТаблицуТовары()
	
	СтруктураЗаписи = Новый ТаблицаЗначений;
	
	СтруктураЗаписи.Колонки.Добавить("Код");
	//СтруктураЗаписи.Колонки.Добавить("Номенклатура");
	СтруктураЗаписи.Колонки.Добавить("КоличествоЧеков");
	СтруктураЗаписи.Колонки.Добавить("КоличествоЧековВозврат");
	СтруктураЗаписи.Колонки.Добавить("Цена");
	СтруктураЗаписи.Колонки.Добавить("Количество");
	СтруктураЗаписи.Колонки.Добавить("КоличествоВозврат");
	СтруктураЗаписи.Колонки.Добавить("Сумма");
	СтруктураЗаписи.Колонки.Добавить("СуммаВозврат");
	СтруктураЗаписи.Колонки.Добавить("Штрихкод");
	СтруктураЗаписи.Колонки.Добавить("Скидка");
	СтруктураЗаписи.Колонки.Добавить("СкидкаАБС");
	СтруктураЗаписи.Колонки.Добавить("СкидкаВозврат");
	СтруктураЗаписи.Колонки.Добавить("СкидкаАБСВозврат");
	
	Возврат СтруктураЗаписи;
	
КонецФункции

Функция СоздатьТаблицуСкидки()
	
	СтруктураЗаписи = Новый ТаблицаЗначений;
	
	СтруктураЗаписи.Колонки.Добавить("КоличествоЧеков");
	СтруктураЗаписи.Колонки.Добавить("Сумма");
	СтруктураЗаписи.Колонки.Добавить("Скидка");
	СтруктураЗаписи.Колонки.Добавить("СкидкаАБС");
	СтруктураЗаписи.Колонки.Добавить("Цена");
	СтруктураЗаписи.Колонки.Добавить("Количество");
	
	Возврат СтруктураЗаписи;
	
КонецФункции

Функция СоздатьТаблицуОплаты()
	
	СтруктураЗаписи = Новый ТаблицаЗначений;
	СтруктураЗаписи.Колонки.Добавить("ТипОплаты");
	СтруктураЗаписи.Колонки.Добавить("КоличествоЧеков");
	СтруктураЗаписи.Колонки.Добавить("КоличествоЧековВозврат");
	СтруктураЗаписи.Колонки.Добавить("Сумма");
	СтруктураЗаписи.Колонки.Добавить("СуммаВозврат");
	СтруктураЗаписи.Колонки.Добавить("КодВидаЭлектроннойОплаты");
	СтруктураЗаписи.Колонки.Добавить("УникальныйИдентификаторВидаЭлектроннойОплаты");
	
	Возврат СтруктураЗаписи;
КонецФункции

Функция СоздатьТаблицуВозвраты()
	
	СтруктураЗаписи = Новый ТаблицаЗначений;
	СтруктураЗаписи.Колонки.Добавить("Код");
	СтруктураЗаписи.Колонки.Добавить("Цена");
	СтруктураЗаписи.Колонки.Добавить("Количество");
	СтруктураЗаписи.Колонки.Добавить("Сумма");
	СтруктураЗаписи.Колонки.Добавить("Штрихкод");
	СтруктураЗаписи.Колонки.Добавить("Скидка");
	СтруктураЗаписи.Колонки.Добавить("СкидкаАБС");
	СтруктураЗаписи.Колонки.Добавить("ДатаРеализации");
	СтруктураЗаписи.Колонки.Добавить("НомерФискальногоЧека");
	
	Возврат СтруктураЗаписи;
КонецФункции

Функция ПолучитьЧекККМ() 
	
	Чек = Новый Структура;
	
	Чек.Вставить("ДатаЧека");
	Чек.Вставить("НомерЧека");
	Чек.Вставить("УникальныйИдентификатор");
	Чек.Вставить("СистемаНалогообложения", ПредопределенноеЗначение("Перечисление.ТипыСистемНалогообложенияККТ.ПустаяСсылка"));
	Чек.Вставить("ТипСвязанногоДокументаККМ");
	Чек.Вставить("УникальныйИдентификаторСвязанногоДокументаККМ");
	Чек.Вставить("ТипРасчета", ПредопределенноеЗначение("Перечисление.ТипыРасчетаДенежнымиСредствами.ПустаяСсылка"));
	Чек.Вставить("Товары", Новый ТаблицаЗначений);
	Чек.Вставить("Оплаты", Новый ТаблицаЗначений);
	
	Возврат Чек;
	
КонецФункции

Функция СоздатьЗакрытиеСмены(КассаККМ, Автор, Оборудование, ДанныеСмены, ВариантЗаполненияДатыСмены, ВремяСмены)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗакрытиеСмены.Ссылка
	|ИЗ
	|	Документ.ЗакрытиеСмены КАК ЗакрытиеСмены
	|ГДЕ
	|	ЗакрытиеСмены.НомерСмены     = &НомерСмены И 
	|	ЗакрытиеСмены.КассаККМ       = &КассаККМ И 
	|	ЗакрытиеСмены.Дата           = &ДатаДокумента И 
	|	ЗакрытиеСмены.НомерДокумента = &НомерДокумента И 
	|	ЗакрытиеСмены.ПометкаУдаления = ЛОЖЬ
	|";
	
	Если ВариантЗаполненияДатыСмены = 0 Тогда
		ДатаДокумента = ДанныеСмены.ДатаОткрытия;
	ИначеЕсли ВариантЗаполненияДатыСмены = 1 Тогда
		ДатаДокумента = ДанныеСмены.ДатаЗакрытия;
	ИначеЕсли ВариантЗаполненияДатыСмены = 2 Тогда
		ДатаДокумента = Дата(Год(ДанныеСмены.ДатаЗакрытия), Месяц(ДанныеСмены.ДатаЗакрытия), День(ДанныеСмены.ДатаЗакрытия), Час(ВремяСмены), Минута(ВремяСмены), Секунда(ВремяСмены));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("НомерСмены",     Число(ДанныеСмены.Номер));
	Запрос.УстановитьПараметр("ДатаДокумента",  ДатаДокумента);
	Запрос.УстановитьПараметр("КассаККМ",       Оборудование.Касса);
	Запрос.УстановитьПараметр("НомерДокумента", Число(ДанныеСмены.Номер));
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		КассоваяСмена = Выборка.Ссылка.ПолучитьОбъект();
		КассоваяСмена.СуммаДокумента = 0;
		КассоваяСмена.ДатаОткрытияСмены = ДанныеСмены.ДатаОткрытия;
		КассоваяСмена.Товары.Очистить();
		КассоваяСмена.Оплаты.Очистить();
		КассоваяСмена.Скидки.Очистить();
		КассоваяСмена.Контрагенты.Очистить();
		КассоваяСмена.Возвраты.Очистить();
		КассоваяСмена.ВозвратОплаты.Очистить();
		Возврат КассоваяСмена;
	КонецЕсли;
	
	КассоваяСмена = Документы.ЗакрытиеСмены.СоздатьДокумент();
	КассоваяСмена.НомерСмены     = Число(ДанныеСмены.Номер);
	КассоваяСмена.КассаККМ       = Оборудование.Касса;
	КассоваяСмена.Дата           = ДатаДокумента;
	КассоваяСмена.ДатаПоследнегоДокумента = ДанныеСмены.ДатаЗакрытия;
	КассоваяСмена.ДатаОткрытияСмены       = ДанныеСмены.ДатаОткрытия;
	КассоваяСмена.НомерДокумента = Число(ДанныеСмены.Номер);
	КассоваяСмена.Автор          = Автор;
	КассоваяСмена.ХозОперация    = Справочники.ХозОперации.ЗакрытиеСмены;
	КассоваяСмена.БлокироватьПерерасчетСкидок = Истина;
	
	КассоваяСмена.Заполнить(Неопределено);
	
	// Устанавливаем параметры выполнения операции.
	ПараметрыДействия = Документы.ЗакрытиеСмены.ПолучитьПараметрыДействия(КассоваяСмена);
	ПараметрыДействия.Вставить("ЗапретИзмененияЦен", Истина);
	
	ОсновнойОтдел = Оборудование.ОсновнойОтдел;
	//	Если ЗначениеЗаполнено(Оборудование.Организация) Тогда
	//		КассоваяСмена.Организация = Оборудование.Организация;
	//	Иначе
	КассоваяСмена.Организация = ОсновнойОтдел.Организация;
	//	КонецЕсли;
	
	Документы.ЗакрытиеСмены.ОрганизацияПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	Если НЕ КассоваяСмена.ПодразделениеКомпании = ОсновнойОтдел.ПодразделениеКомпании Тогда
		КассоваяСмена.ПодразделениеКомпании = ОсновнойОтдел.ПодразделениеКомпании;
		Документы.ЗакрытиеСмены.ПодразделениеКомпанииПриИзменении(КассоваяСмена, ПараметрыДействия);
	КонецЕсли;
	
	КассоваяСмена.СкладКомпании = ОсновнойОтдел;
	Документы.ЗакрытиеСмены.СкладКомпанииПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	КассоваяСмена.ТипЦен = ОсновнойОтдел.ТипЦенРозничнойТорговли;
	Документы.ЗакрытиеСмены.ТипЦенПриИзменении(КассоваяСмена, ПараметрыДействия);
	
	Если ЗначениеЗаполнено(КассоваяСмена.ТипЦен.ВалютаЦены) И (КассоваяСмена.ТипЦен.ВалютаЦены <> КассоваяСмена.ВалютаДокумента) Тогда
		КассоваяСмена.ВалютаДокумента = КассоваяСмена.ТипЦен.ВалютаЦены;
		Документы.ЗакрытиеСмены.ВалютаДокументаПриИзменении(КассоваяСмена, ПараметрыДействия);
	КонецЕсли;
	
	КассоваяСмена.Товары.Очистить();
	КассоваяСмена.Оплаты.Очистить();
	КассоваяСмена.Скидки.Очистить();
	КассоваяСмена.Контрагенты.Очистить();
	КассоваяСмена.Возвраты.Очистить();
	КассоваяСмена.ВозвратОплаты.Очистить();
	
	Возврат КассоваяСмена;
	
КонецФункции

#КонецОбласти
