
#Область ПрограммныйИнтерфейс

// Обрабтчик при изменении номенклатуры, по которой аедется учет маркировки.
//
// Параметры:
//  Объект					 - ДанныеФормыСтруктура	 - Данные документа для которого выполянется заполнение.
//  Строка					 - ДанныеФормыЭлементКоллекции	 - Данные строки табличной части товара с маркировкой.
//  Форма					 - УправляемаяФорма				 - Форма документа.
//  УдалятьКодыМаркировки	 - Истина - Признак удаления ранее считанных кодов.
//
Процедура НачатьСканированиеМаркировки(Объект, Строка, Форма, УдалятьКодыМаркировки = Истина) Экспорт
	
	// Инициализация параметров сканирования кода маркировки
	ПараметрыФормы = Новый Структура();
	ПараметрыФормы.Вставить("ИдентификаторТовара",  Строка.ИдентификаторТовара);
	ПараметрыФормы.Вставить("Номенклатура",         Строка.Номенклатура);
	
	ОбработкаОповещения = Новый ОписаниеОповещения(
		"Подключаемый_СканированиеМаркировкиЗавершение",
		Форма,
		ПараметрыФормы);
	
	// Проверим введены ли были ранее маркировки до изменения номенклатуры.
	СтруктураПоиска = Новый Структура("ИдентификаторТовара", Строка.ИдентификаторТовара);
	НайденныеСтроки = Объект.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
	
	Если НайденныеСтроки.Количество() > 0 И УдалятьКодыМаркировки Тогда
		
		// Выбрали номенклатуру, по которой не ведется учет по маркировке
		Если Строка.МаркируемыйТовар Тогда
			
			// Зададим вопрос об очистке ранее сканированных маркировок.
			ПараметрыОповещения = Новый Структура;
			ПараметрыОповещения.Вставить("ПараметрыФормы", ПараметрыФормы);
			ПараметрыОповещения.Вставить("Форма", Форма);
			ПараметрыОповещения.Вставить("ОбработкаОповещения", ОбработкаОповещения);
			ПараметрыОповещения.Вставить("СтрокиКодовМаркировки", НайденныеСтроки);
			
			ОбработчикОповещения = Новый ОписаниеОповещения(
				"Подключаемый_ЗавершениеВопросаОчисткиКодовМаркировки",
				ЭтотОбъект,
				ПараметрыОповещения);
			
			ПоказатьВопрос(
				ОбработчикОповещения,
				НСтр("ru = 'Для данной строки указаны коды маркировки. Удалить считанные коды маркировки?'"),
				РежимДиалогаВопрос.ДаНет);
			
			Возврат;
		Иначе
			// Очистим ранее введенные маркировки
			Для Каждого ТекущаяМаркировка Из НайденныеСтроки Цикл
				Объект.КодыМаркировки.Удалить(ТекущаяМаркировка);
			КонецЦикла;
		КонецЕсли;
		
	КонецЕсли;
	
	ПродолжитьСканированиеМаркировки(Форма, ПараметрыФормы, ОбработкаОповещения);
	
КонецПроцедуры // НачатьСканированиеМаркировки()

// Открывает форму редактирования текущей строки товаров.
//
// Параметры:
//  Форма				 - УправляемаяФорма	 - Форма документа.
//  ВыбраннаяСтрока		 - Ссылка			 - Значение выбранной строки.
//  Поле				 - ПолеФормы		 - Активное поле.
//  СтандартнаяОбработка - Булево			 - В данный параметр передается признак выполнения системной обработки события.
//  ИмяТабличнойЧасти	 - Строка			 - Имя табличной части документа.
//  ТолькоПросмотрКодов	 - Булево			 - Признак того, что список не доступен для редактирования.
//
Процедура ОткрытьСписокКодовМаркировки(
		Форма,
		ВыбраннаяСтрока,
		Поле,
		СтандартнаяОбработка,
		ИмяТабличнойЧасти = "Товары",
		ТолькоПросмотрКодов = Ложь) Экспорт
	
	// Проверим выбранное поле
	Если Форма.Элементы.Найти(ИмяТабличнойЧасти + "КодыМаркировки") = Неопределено
		ИЛИ Поле.Имя <> Форма.Элементы[ИмяТабличнойЧасти + "КодыМаркировки"].Имя Тогда
		Возврат;
	КонецЕсли;
	
	Объект = Неопределено;
	
	// Получим основной объект данных формы
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	СтандартнаяОбработка = Ложь;
	
	Строка = Объект[ИмяТабличнойЧасти].НайтиПоИдентификатору(ВыбраннаяСтрока);
	
	// Проверим, что у строки ведется маркировка
	Если ЕстьРеквизитНаКлиенте(Строка, "МаркируемыйТовар") 
		И НЕ Строка.МаркируемыйТовар Тогда
		Возврат;
	КонецЕсли;
	
	// Получим список кодов маркировки
	СтруктураПоиска = Новый Структура;
	СтруктураПоиска.Вставить("ИдентификаторТовара", Строка.ИдентификаторТовара);
	НайденныеКодыМаркировки = Объект.КодыМаркировки.НайтиСтроки(СтруктураПоиска);
	
	СписокКодовМаркировки = Новый Массив;
	
	ПроверкаСоответствияКодовМаркировкиПроводилась = Ложь;
	Если ЕстьРеквизитНаКлиенте(Строка, "ПроверкаСоответствияКодовМаркировкиПроводилась") Тогда
		ПроверкаСоответствияКодовМаркировкиПроводилась = Строка.ПроверкаСоответствияКодовМаркировкиПроводилась;
		ОтображатьСостояния = Истина;
	ИначеЕсли ЕстьРеквизитНаКлиенте(Форма, "ПроверкаСоответствияКодовМаркировкиПроводилась") Тогда
		ПроверкаСоответствияКодовМаркировкиПроводилась = Форма.ПроверкаСоответствияКодовМаркировкиПроводилась;
		ОтображатьСостояния = Истина;
	Иначе
		ОтображатьСостояния = Ложь;
	КонецЕсли;
	
	Для Каждого ТекущаяСтрока Из НайденныеКодыМаркировки Цикл
		СтрокаСписка = Новый Структура(
			"КодМаркировки,СостояниеКодаМаркировкиИБ,СостояниеКодаМаркировкиСМТ,Соответствует,Примечание,Возврат"
		);
		ЗаполнитьЗначенияСвойств(СтрокаСписка, ТекущаяСтрока);
		Если НЕ ПроверкаСоответствияКодовМаркировкиПроводилась Тогда 
			СтрокаСписка.Соответствует = Истина;
			СтрокаСписка.СостояниеКодаМаркировкиИБ = Неопределено;
			СтрокаСписка.СостояниеКодаМаркировкиСМТ = Неопределено;
			СтрокаСписка.Примечание = "";
		КонецЕсли;
		СписокКодовМаркировки.Добавить(СтрокаСписка);
	КонецЦикла;
	
	ЭтоКорректировка = ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаПоступления")
		ИЛИ ТипЗнч(Объект.Ссылка) = Тип("ДокументСсылка.КорректировкаРеализации");
		
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("СписокКодовМаркировки", СписокКодовМаркировки);
	ПараметрыФормы.Вставить("ИдентификаторТовара", Строка.ИдентификаторТовара);
	ПараметрыФормы.Вставить("Номенклатура", Строка.Номенклатура);
	ПараметрыФормы.Вставить("ОтображатьСостояния", ОтображатьСостояния);
	ПараметрыФормы.Вставить("ТолькоПросмотр", 
		Форма.ТолькоПросмотр ИЛИ Форма.Элементы[ИмяТабличнойЧасти].ТолькоПросмотр ИЛИ ТолькоПросмотрКодов);
	ПараметрыФормы.Вставить("Организация", Объект.Организация);
	ПараметрыФормы.Вставить("ПодразделениеКомпании", Объект.ПодразделениеКомпании);
	ПараметрыФормы.Вставить("ЭтоКорректировка", ЭтоКорректировка);
	
	ОбработкаОповещения = Новый ОписаниеОповещения(
		"Подключаемый_ОбработкаРезультатаОповещения",
		Форма,
		"РедактированиеКодовМаркировкиСтрокиТовара"
	);
	
	ОткрытьФорму(
		"ОбщаяФорма.ФормаСпискаМаркировок",
		ПараметрыФормы,
		Форма,
		, , ,
		ОбработкаОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца
	);
	
КонецПроцедуры // ОткрытьСписокКодовМаркировки()

// Добавление кода маркировки в табличную часть документа "Коды маркировки"
//
// Параметры:
//  ТаблицаКодовМаркировки	 - ДанныеФормыСтруктура - Табличная часть документа с кодами маркировки.
//  КодМаркировки			 - Строка	 - Добавляемый код маркировки
//  ДополнительныеПараметры	 - Структура - Параметры сканирования
//
Процедура ДобавитьКодМаркировки(ТаблицаКодовМаркировки, КодМаркировки, ДополнительныеПараметры) Экспорт
	
	Если КодМаркировки <> Неопределено И НЕ ПустаяСтрока(КодМаркировки) Тогда
		
		ИдентификаторТовара = ПолучитьЗначениеПараметраСтруктуры(ДополнительныеПараметры, "ИдентификаторТовара", "");
		
		Если ИдентификаторТовара <> "" Тогда
			
			// Удалим ранее считанные для строки
			// Предполагается, что это единственная маркировка считанная на данный момент
			СтруктураПосика = Новый Структура("ИдентификаторТовара", ИдентификаторТовара);
			НайденныеСтроки = ТаблицаКодовМаркировки.НайтиСтроки(СтруктураПосика);
			
			Для Каждого ТекущаяСтрока Из НайденныеСтроки Цикл
				ТаблицаКодовМаркировки.Удалить(ТекущаяСтрока);
			КонецЦикла;
			
			// Добавим новую строку в список маркировок.
			НоваяСтрока = ТаблицаКодовМаркировки.Добавить();
			НоваяСтрока.ИдентификаторТовара = ИдентификаторТовара;
			НоваяСтрока.КодМаркировки = КодМаркировки;
			
			Если ЕстьРеквизитНаКлиенте(НоваяСтрока, "Подтверждено") Тогда
				НоваяСтрока.Подтверждено = Истина;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#Область ОбменСЧестнымЗнаком

// Начало отправки запроса на сервер Честного знака
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//  Объект     - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ДополнительныеПараметры - Структура - Набор параметров, использующихся при выполнения операции.
//
Процедура ОтправитьПолучитьДокумент(Форма, Объект, ДополнительныеПараметры) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) ИЛИ Форма.Модифицированность Тогда
		ПоказатьПредупреждение(
			,
			НСтр("ru = 'Данные еще не записаны.
			|Выполните данную операцию после записи документа.'"));
		Возврат;
	КонецЕсли;
	
	Если Форма.РежимОбменаСЧестнымЗнаком =
			ПредопределенноеЗначение("Перечисление.СпособыОбменаСЧестнымЗнаком.ЧерезAPI") Тогда
		
		ОбменССистемойМаркировкиКлиент.ФормированиеЗапросаВФоне(Форма, Объект, ДополнительныеПараметры);
		
	ИначеЕсли Форма.РежимОбменаСЧестнымЗнаком = 
			ПредопределенноеЗначение("Перечисление.СпособыОбменаСЧестнымЗнаком.Файловый") Тогда
		
		ОбменССистемойМаркировкиКлиент.ВыполнитьОбменЧерезФайл(Форма, Объект, ДополнительныеПараметры);
		
	КонецЕсли;
	
КонецПроцедуры

// Начало отправки запроса на сервер Честного знака
//
// Параметры:
//  Форма - УправляемаяФорма - Форма, в которой возникло событие.
//  Объект     - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ДополнительныеПараметры - Структура - Набор параметров, использующихся при выполнения операции.
//
Процедура ОтправитьПолучитьЗапрос(Форма, Объект, ДополнительныеПараметры) Экспорт
	
	ПолучитьОсновнойОбъектФормы(Форма, Объект);
	
	Если Форма.РежимОбменаСЧестнымЗнаком =
			ПредопределенноеЗначение("Перечисление.СпособыОбменаСЧестнымЗнаком.ЧерезAPI") Тогда
		
		ОбменССистемойМаркировкиКлиент.ФормированиеЗапросаВФоне(Форма, Объект, ДополнительныеПараметры);
		
	Иначе
		
		ВывестиСообщение(
			НСтр("ru = 'Запрос текущих статусов кодов маркировки возможен только через API. Операция отменена'"),
			Форма
		);
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ПродолжитьСканированиеМаркировки(Форма, ПараметрыФормы, ОбработкаОповещения)
	
	ОткрытаяФорма = ОткрытьФорму(
		"ОбщаяФорма.ФормаСканированияМаркировки",
		ПараметрыФормы,
		Форма,
		,
		,
		,
		ОбработкаОповещения,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
	Если ОткрытаяФорма = Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОбработкаОповещения);
	КонецЕсли;
	
КонецПроцедуры

Процедура Подключаемый_ЗавершениеВопросаОчисткиКодовМаркировки(Ответ, ДополнительныеПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Нет Тогда
		
		ВыполнитьОбработкуОповещения(ДополнительныеПараметры.ОбработкаОповещения);
		
	ИначеЕсли Ответ = КодВозвратаДиалога.Да Тогда
		
		// Получим основной объект данных формы
		Объект = Неопределено;
		ПолучитьОсновнойОбъектФормы(ДополнительныеПараметры.Форма, Объект);
		
		// Очистим ранее введенные маркировки
		Для Каждого ТекущаяМаркировка Из ДополнительныеПараметры.СтрокиКодовМаркировки Цикл
			Объект.КодыМаркировки.Удалить(ТекущаяМаркировка);
		КонецЦикла;
		
		ПродолжитьСканированиеМаркировки(
			ДополнительныеПараметры.Форма, 
			ДополнительныеПараметры.ПараметрыФормы,
			ДополнительныеПараметры.ОбработкаОповещения);
		
	КонецЕсли;
	
КонецПроцедуры // Подключаемый_ЗавершениеВопросаОчисткиКодовМаркировки()

#КонецОбласти
