#Область Печать

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Полный комлект
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПолныйКомплект";
	КомандаПечати.Представление = НСтр("ru = 'Полный комплект'");
	КомандаПечати.Порядок		= 1; 
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	//
	// Акт инвентаризации ИНВ-15
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктИнвентаризацииДС_ИНВ15";
	КомандаПечати.Представление = НСтр("ru = 'Акт инвентаризации ИНВ-15'");
	КомандаПечати.Порядок		= 2;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	
	// Приказ об инвентаризации ИНВ-22
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПриказОПроведенииИнвентаризации_ИНВ22";
	КомандаПечати.Представление = НСтр("ru = 'Приказ о проведении инвентаризации ИНВ-22'");
	КомандаПечати.Порядок		= 3;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Заявление на удержание
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ЗаявлениеНаУдержание";
	КомандаПечати.Представление = НСтр("ru = 'Заявление на удержание'");
	КомандаПечати.Порядок		= 4;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
	// Приказ на удержание
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "ПриказОбУдержании";
	КомандаПечати.Представление = НСтр("ru = 'Приказ об удержании'");
	КомандаПечати.Порядок		= 5;
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	
КонецПроцедуры

Функция ПодготовитьДанныеПечати(МассивДокументов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИТ_ИнвентаризацияДенежныхСредств.Ссылка КАК Документ,
		|	ИТ_ИнвентаризацияДенежныхСредств.Ссылка.Номер КАК Номер,
		|	ИТ_ИнвентаризацияДенежныхСредств.Ссылка.Дата КАК Дата,
		|	ИТ_ИнвентаризацияДенежныхСредств.Ссылка.Магазин КАК Магазин,
		|	ЕСТЬNULL(ИТ_ИнвентаризацияДенежныхСредствВиновныеЛица.СуммаУдержания, 0) КАК СуммаУдержания,
		|	ВЫБОР
		|		КОГДА ИТ_ИнвентаризацияДенежныхСредств.Ссылка.Магазин.Организация = &ЮрЛицоФММР
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЭтоФММР,
		|	ИТ_ИнвентаризацияДенежныхСредств.Ссылка.Магазин_Адрес КАК Магазин_Адрес,
		|	ИТ_ИнвентаризацияДенежныхСредств.Ссылка.Организация КАК ЮрЛицо,
		|	ЕСТЬNULL(ИТ_ИнвентаризацияДенежныхСредствВиновныеЛица.Продавец, """") КАК Продавец,
		|	ЕСТЬNULL(ИТ_ИнвентаризацияДенежныхСредствВиновныеЛица.Должность, """") КАК Должность,
		|	ИТ_ИнвентаризацияДенежныхСредств.Организация КАК Организация
		|ИЗ
		|	Документ.ИТ_ИнвентаризацияДенежныхСредств КАК ИТ_ИнвентаризацияДенежныхСредств
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ИТ_ИнвентаризацияДенежныхСредств.ВиновныеЛица КАК ИТ_ИнвентаризацияДенежныхСредствВиновныеЛица
		|		ПО ИТ_ИнвентаризацияДенежныхСредств.Ссылка = ИТ_ИнвентаризацияДенежныхСредствВиновныеЛица.Ссылка
		|ГДЕ
		|	ИТ_ИнвентаризацияДенежныхСредств.Ссылка В(&МассивДокументов)
		|ИТОГИ
		|	МАКСИМУМ(Номер),
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(Магазин),
		|	СУММА(СуммаУдержания),
		|	МАКСИМУМ(ЭтоФММР),
		|	МАКСИМУМ(Магазин_Адрес),
		|	МАКСИМУМ(ЮрЛицо)
		|ПО
		|	Документ";
	
	Запрос.УстановитьПараметр("МассивДокументов",	МассивДокументов);
	//Запрос.УстановитьПараметр("ЮрЛицоФММР",			Справочники.ИТ_Организации.ПолучитьСсылку(Новый УникальныйИдентификатор("c399a75a-e536-4773-9316-6e3366e5b32a")));// ООО ФММР
	Запрос.УстановитьПараметр("ЮрЛицоФММР",					Справочники.Организации.НайтиПоРеквизиту("ЕРПМастерКлюч","00000000150"));	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	//Возврат
	Возврат РезультатЗапроса;
	
КонецФункции

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	РезультатЗапроса = ПодготовитьДанныеПечати(МассивОбъектов);

	// ПОЛНЫЙ КОМПЛЕКТ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПолныйКомплект") Тогда
		КоллекцияПечатныхФорм.Очистить();
		
		
		// Акт инвентаризации
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "АктИнвентаризацииДС_ИНВ15";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"АктИнвентаризацииДС_ИНВ15", 
		"Акт инвентаризации", 
		Печать_АктИнвентаризации(РезультатЗапроса, ОбъектыПечати, ПараметрыПечати));
		
		// Приказ об инвентаризации
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "ПриказОПроведенииИнвентаризации_ИНВ22";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"ПриказОПроведенииИнвентаризации_ИНВ22", 
		"Приказ о проведении инвентаризации ИНВ-22", 
		Печать_ПриказОбИнвентаризации(РезультатЗапроса, ОбъектыПечати, ПараметрыПечати));
		
		// Заявление на удержание
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "ЗаявлениеНаУдержание";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"ЗаявлениеНаУдержание", 
		"Заявление на удержание", 
		Печать_ЗаявлениеНаУдержание(РезультатЗапроса, ОбъектыПечати, ПараметрыПечати));
		
		// Приказ об удержании
		НовыйМакет = КоллекцияПечатныхФорм.Добавить();
		НовыйМакет.ИмяМакета	= "ПриказОбУдержании";
		НовыйМакет.ИмяВРЕГ		= ВРег(НовыйМакет.ИмяМакета);
		НовыйМакет.Экземпляров	= 1;
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"ПриказОбУдержании", 
		"Приказ об удержании", 
		Печать_ПриказОбУдержании(РезультатЗапроса, ОбъектыПечати, ПараметрыПечати));
		
	КонецЕсли;
	
	//АКТ ИНВЕНТАРИЗАЦИИ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "АктИнвентаризацииДС_ИНВ15") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"АктИнвентаризацииДС_ИНВ15", 
		"Акт инвентаризации", 
		Печать_АктИнвентаризации(РезультатЗапроса, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	// ПРИКАЗ ОБ ИНВЕНТАРИЗАЦИИ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриказОПроведенииИнвентаризации_ИНВ22") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"ПриказОПроведенииИнвентаризации_ИНВ22", 
		"Приказ о проведении инвентаризации ИНВ-22", 
		Печать_ПриказОбИнвентаризации(РезультатЗапроса, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	// ЗАЯВЛЕНИЕ НА УДЕРЖАНИЕ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЗаявлениеНаУдержание") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"ЗаявлениеНаУдержание", 
		"Заявление на удержание", 
		Печать_ЗаявлениеНаУдержание(РезультатЗапроса, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
	// ПРИКАЗ ОБ УДЕРЖАНИИ
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПриказОбУдержании") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
		КоллекцияПечатныхФорм, 
		"ПриказОбУдержании", 
		"Приказ об удержании", 
		Печать_ПриказОбУдержании(РезультатЗапроса, ОбъектыПечати, ПараметрыПечати));
	КонецЕсли;
	
КонецПроцедуры

Функция Печать_АктИнвентаризации(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_АктИнвентаризацииДС_ИНВ15";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ИнвентаризацияДенежныхСредств.АктИнвентаризацииДС_ИНВ15");
	
	Область_Шапка		= Макет.ПолучитьОбласть("Шапка");
	Область_Итоги 		= Макет.ПолучитьОбласть("Итоги");
	Область_Подвал		= Макет.ПолучитьОбласть("Подвал");
	Область_Страница2	= Макет.ПолучитьОбласть("Страница2");
	
	ВыборкаДокумент = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// Вывод данных в табличный документ
	Пока ВыборкаДокумент.Следующий() Цикл
		ТекущийДокумент = ВыборкаДокумент.Документ;
		
		ДатаИнвентаризации			= ВыборкаДокумент.Дата;
		ДатаИнвентаризацииСтрокой	= Формат(ВыборкаДокумент.Дата,"ДФ=dd.MM.yyyy");
		Организация					= ВыборкаДокумент.ЮрЛицо;
		
		Продавец			= "";
		ДолжностьПродавца	= "";
			
		ВыборкаПродавцы = ВыборкаДокумент.Выбрать();
		Пока ВыборкаПродавцы.Следующий() Цикл
			Продавец			= ВыборкаПродавцы.Продавец;
			ДолжностьПродавца	= ВыборкаПродавцы.Должность;
			Прервать;	
		КонецЦикла;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область_Шапка.Параметры.ДатаДокумента 			= ДатаИнвентаризацииСтрокой;
		Область_Шапка.Параметры.Организация				= СокрЛП(Организация.Наименование);
		Область_Шапка.Параметры.Подразделение		 	= ВыборкаДокумент.Магазин;
		Область_Шапка.Параметры.ОрганизацияКодПоОКПО	= СокрЛП(Организация.КодПоОКПО);
		Область_Шапка.Параметры.НомерДокумента			= ПрефиксацияОбъектовПлатформа.ПолучитьНомерНаПечать(ТекущийДокумент.Номер);
		
		Область_Шапка.Параметры.ДолжностьПродавца	= ДолжностьПродавца;
		Область_Шапка.Параметры.Продавец			= Продавец;
		
		СуммаПоФакту		= ТекущийДокумент.СуммаПоФакту;
		СуммаПоФактуСтрокой = Строка(СуммаПоФакту);
		ПозицияЗапятой		= СтрНайти(СуммаПоФактуСтрокой, ",");
		
		Если ПозицияЗапятой <> 0 Тогда
			Область_Итоги.Параметры.СуммаПоФактуРубли	= Лев(СуммаПоФактуСтрокой, ПозицияЗапятой - 1);
			Область_Итоги.Параметры.СуммаПоФактуКопейки = Сред(СуммаПоФактуСтрокой, ПозицияЗапятой + 1);
		Иначе
			Область_Итоги.Параметры.СуммаПоФактуРубли	= СуммаПоФактуСтрокой;
			Область_Итоги.Параметры.СуммаПоФактуКопейки = "00";
		КонецЕсли;
	
		Область_Итоги.Параметры.СуммаПоФактуРеглПрописью = ИТ_СпециальныйМодульСервер.СформироватьСуммуПрописью(СуммаПоФакту);
		
		СуммаПоУчету		= ТекущийДокумент.СуммаПоУчету;
		СуммаПоУчетуСтрокой = Строка(СуммаПоУчету);
		ПозицияЗапятой		= СтрНайти(СуммаПоУчетуСтрокой, ",");
		
		Если ПозицияЗапятой <> 0 Тогда
			Область_Итоги.Параметры.СуммаПоУчетуРубли	= Лев(СуммаПоУчетуСтрокой, ПозицияЗапятой - 1);
			Область_Итоги.Параметры.СуммаПоУчетуКопейки = Сред(СуммаПоУчетуСтрокой, ПозицияЗапятой + 1);
		Иначе
			Область_Итоги.Параметры.СуммаПоУчетуРубли	= СуммаПоУчетуСтрокой;
			Область_Итоги.Параметры.СуммаПоУчетуКопейки = "00";
		КонецЕсли;
		
		Область_Итоги.Параметры.СуммаПоУчетуРеглПрописью = ИТ_СпециальныйМодульСервер.СформироватьСуммуПрописью(СуммаПоУчету);
		
		РезультатИнвентаризации = ТекущийДокумент.РезультатИнвентаризации;
		Если РезультатИнвентаризации > 0 Тогда
			СуммаИзлишек	= РезультатИнвентаризации;
			СуммаНедостача	= 0;
		ИначеЕсли РезультатИнвентаризации < 0 Тогда
			СуммаИзлишек	= 0;
			СуммаНедостача	= -РезультатИнвентаризации;
		Иначе
			СуммаИзлишек  	= 0;
			СуммаНедостача	= 0;
		КонецЕсли;
		
		СуммаИзлишекСтрокой = Строка(СуммаИзлишек);
		ПозицияЗапятой		= СтрНайти(СуммаИзлишекСтрокой, ",");
		
		Если ПозицияЗапятой <> 0 Тогда
			Область_Итоги.Параметры.СуммаИзлишекРубли	= Лев(СуммаИзлишекСтрокой, ПозицияЗапятой - 1);
			Область_Итоги.Параметры.СуммаИзлишекКопейки = Сред(СуммаИзлишекСтрокой, ПозицияЗапятой + 1);
		Иначе
			Область_Итоги.Параметры.СуммаИзлишекРубли	= СуммаИзлишекСтрокой;
			Область_Итоги.Параметры.СуммаИзлишекКопейки = "00";
		КонецЕсли;
	
		СуммаНедостачаСтрокой	= Строка(СуммаНедостача);
		ПозицияЗапятой			= СтрНайти(СуммаНедостачаСтрокой, ",");
		
		Если ПозицияЗапятой <> 0 Тогда
			Область_Итоги.Параметры.СуммаНедостачаРубли		= Лев(СуммаНедостачаСтрокой, ПозицияЗапятой - 1);
			Область_Итоги.Параметры.СуммаНедостачаКопейки 	= Сред(СуммаНедостачаСтрокой, ПозицияЗапятой + 1);
		Иначе
			Область_Итоги.Параметры.СуммаНедостачаРубли		= СуммаНедостачаСтрокой;
			Область_Итоги.Параметры.СуммаНедостачаКопейки 	= "00";
		КонецЕсли;
		
		//Руководители = ФормированиеПечатныхФормСервер.ОтветственныеЛицаОрганизаций(Организация, ДатаИнвентаризации);
		Руководители = ДанныеОтветственногоЛицаИнв(ВыборкаДокумент.Документ,"Руководитель");
		
		Область_Подвал.Параметры.ДатаДокумента 		= ДатаИнвентаризацииСтрокой;
		Область_Подвал.Параметры.ДолжностьПродавца	= Продавец.ФизическоеЛицо.Должность;
		Область_Подвал.Параметры.Продавец			= Продавец;
		
		Если ВыборкаДокумент.ЭтоФММР Тогда
			Область_Подвал.Параметры.ПредседательКомиссииДолжность	= "Руководитель КРО";
			Область_Подвал.Параметры.ПредседательКомиссии			= "Рябых С.О.";
		Иначе
			Область_Подвал.Параметры.ПредседательКомиссииДолжность	= Руководители.РуководительДолжность;
			Область_Подвал.Параметры.ПредседательКомиссии			= Руководители.Руководитель;	
		КонецЕсли;
		
		
		Область_Страница2.Параметры.ДатаДокумента			= ДатаИнвентаризацииСтрокой;
		Область_Страница2.Параметры.РуководительДолжность	= Руководители.РуководительДолжность;
		Область_Страница2.Параметры.ФИОРуководителя			= Руководители.Руководитель;
		Область_Страница2.Параметры.ДолжностьПродавца		= Продавец.ФизическоеЛицо.Должность;
		Область_Страница2.Параметры.Продавец				= Продавец;
		
		ТабличныйДокумент.Вывести(Область_Шапка);
		ТабличныйДокумент.Вывести(Область_Итоги);
		ТабличныйДокумент.Вывести(Область_Подвал);
		
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		
		ТабличныйДокумент.Вывести(Область_Страница2);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;

КонецФункции

// получение данных отв. лица документа
Функция ДанныеОтветственногоЛицаИнв(Документ, ВидОтветственногоЛица, ВыводНаПечать="", Знач Организация=Неопределено) 
	ОтветственноеЛицо = Неопределено;
	
	
	Если НЕ ЗначениеЗаполнено(Организация) Тогда
		Организация = Документ.Организация;
	КонецЕсли;
	
	стрВидОтветственногоЛица = ?(ТипЗнч(ВидОтветственногоЛица) = Тип("Строка"), ВидОтветственногоЛица, Метаданные.Перечисления.ВидыОбъектовСведений.ЗначенияПеречисления[Перечисления.ВидыОбъектовСведений.Индекс(ВидОтветственногоЛица)].Имя);
	
	Если ПустаяСтрока(ВыводНаПечать) Тогда
		ВыводНаПечать = стрВидОтветственногоЛица;
	КонецЕсли;
		
	// +Рарус Для корректной работы функции при вызове из справочника "Подтверждающие документы".
	Если Метаданные.Документы.Содержит(Документ.Метаданные()) Тогда
		Дата = Документ.Дата; 
	Иначе
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	// -Рарус
	
	Если НЕ ЗначениеЗаполнено(ОтветственноеЛицо) Тогда
		Если ЕстьРеквизит(Документ, стрВидОтветственногоЛица) И ЗначениеЗаполнено(Документ[стрВидОтветственногоЛица]) Тогда
			ОтветственноеЛицо = Документ[стрВидОтветственногоЛица];
		Иначе
			// +Рарус Для корректной работы функции при вызове из справочника "Подтверждающие документы"
			//Если Метаданные.Документы.Содержит(Документ.Метаданные()) Тогда
			//	Дата = Документ.Дата; 
			//Иначе
			//	Дата = ТекущаяДатаСеанса();
			//КонецЕсли;
			
			ТипОтветственногоЛица = ПолучитьТипОтветственногоЛица(стрВидОтветственногоЛица);
			
			Если ТипОтветственногоЛица <> Неопределено Тогда
				СтруктураСведений = РегистрыСведений.СведенияКомпании.ПолучитьПоследнее(Дата, Новый Структура("Организация,Объект", Организация, ТипОтветственногоЛица));
				// -Рарус
				ОтветственноеЛицо = СтруктураСведений.Значение;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	
	// положим все в структуру
	СтруктураВозврата = Новый Структура;
	Если ЕстьРеквизит(ОтветственноеЛицо,"Должность") Тогда
		СтруктураВозврата.Вставить(ВыводНаПечать + "Должность", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОтветственноеЛицо,"Должность"));
	Иначе
		СтруктураВозврата.Вставить(ВыводНаПечать + "Должность",);
	КонецЕсли;
	// +Рарус
	СтруктураВозврата.Вставить(ВыводНаПечать + "Представление", ?(ЗначениеЗаполнено(ОтветственноеЛицо),"/ ","") +  ПолучитьНаименованиеСправочника(ОтветственноеЛицо, Дата) + ?(ЗначениеЗаполнено(ОтветственноеЛицо)," /",""));
	// -Рарус
	СтруктураВозврата.Вставить(ВыводНаПечать, ОтветственноеЛицо);
	
	Возврат СтруктураВозврата;
	
КонецФункции

// Полное наименование справочника, если есть.
Функция ПолучитьНаименованиеСправочника(Объект, НаДату = Неопределено) Экспорт
	Если Объект = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЕстьРеквизит(Объект,"НаименованиеПолное") Тогда
		Если ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
			НаименованиеПолное = Объект.НаименованиеПолное;
			
			Если ЗначениеЗаполнено(НаДату) Тогда
				СтруктураНаименований = ОбщегоНазначения.ПолучитьНаименованияНаДату(Объект, НаДату);
				НаименованиеПолное = СтруктураНаименований.НаименованиеПолное;
			КонецЕсли;
				
			Возврат НаименованиеПолное;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Объект.Наименование;
КонецФункции

// получение ответственного лица
Функция ПолучитьТипОтветственногоЛица(ВидОтветственногоЛица)
	
	Если ТипЗнч(ВидОтветственногоЛица) <> Тип("Строка") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВидОтветственногоЛица = "ГлавныйБухгалтер" Тогда
		Возврат Перечисления.ВидыОбъектовСведений.ГлавныйБухгалтер;
	ИначеЕсли ВидОтветственногоЛица = "Руководитель" Тогда
		Возврат Перечисления.ВидыОбъектовСведений.Руководитель;
	ИначеЕсли ВидОтветственногоЛица = "Кассир" Тогда
		Возврат Перечисления.ВидыОбъектовСведений.Кассир;
	ИначеЕсли ВидОтветственногоЛица = "МОЛ" Тогда
		Возврат Перечисления.ВидыОбъектовСведений.МОЛ;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции // ПолучитьТипОтветственногоЛица()

Функция Печать_ПриказОбИнвентаризации(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказОПроведенииИнвентаризации_ИНВ22";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ИнвентаризацияДенежныхСредств.ПриказОПроведенииИнвентаризации_ИНВ22");
	
	Область_Шапка	= Макет.ПолучитьОбласть("Шапка");
	Область_Подвал	= Макет.ПолучитьОбласть("Подвал");
	
	
	ВыборкаДокумент = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// Вывод данных в табличный документ
	Пока ВыборкаДокумент.Следующий() Цикл
		ТекущийДокумент = ВыборкаДокумент.Документ;	
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ДатаИнвентаризации			= ВыборкаДокумент.Дата;
		ДатаИнвентаризацииСтрокой	= Формат(ВыборкаДокумент.Дата,"ДФ=dd.MM.yyyy");
		Организация					= ВыборкаДокумент.ЮрЛицо;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Область_Шапка.Параметры.ДатаДокумента 			= ДатаИнвентаризацииСтрокой;
		Область_Шапка.Параметры.Организация				= СокрЛП(Организация.Наименование);
		Область_Шапка.Параметры.Подразделение		 	= ВыборкаДокумент.Магазин;
		Область_Шапка.Параметры.ОрганизацияКодПоОКПО	= СокрЛП(Организация.КодПоОКПО);
		Область_Шапка.Параметры.НомерДокумента			= ПрефиксацияОбъектовПлатформа.ПолучитьНомерНаПечать(ТекущийДокумент.Номер);
		
		Область_Шапка.Параметры.НаименованиеИмуществаОбязательств = "кассы организации";
		
		//Руководители = ФормированиеПечатныхФормСервер.ОтветственныеЛицаОрганизаций(Организация, ДатаИнвентаризации);
		Руководители = ДанныеОтветственногоЛицаИнв(ВыборкаДокумент.Документ,"Руководитель");
		
		Если ВыборкаДокумент.ЭтоФММР Тогда
			Область_Шапка.Параметры.ПредседательКомиссииДолжность	= "Руководитель КРО";
			Область_Шапка.Параметры.ПредседательКомиссии			= "Рябых С.О.";
		Иначе
			Область_Шапка.Параметры.ПредседательКомиссииДолжность	= Руководители.РуководительДолжность;
			Область_Шапка.Параметры.ПредседательКомиссии			= Руководители.Руководитель;	
		КонецЕсли;

		Область_Подвал.Параметры.НаименованиеИмуществаОбязательств 	= "денежные средства находящиеся в кассе организации";
		Область_Подвал.Параметры.ПричинаПроведенияИнвентаризации	= "контрольная проверка";
		
		ДатаИнвентаризацииПлюсОдинДень = ДатаИнвентаризации + 24*60*60;
		
		Область_Подвал.Параметры.ДатаНачалаИнвентаризации		= Формат(ДатаИнвентаризацииПлюсОдинДень, "ДЛФ=DD");
		Область_Подвал.Параметры.ДатаОкончанияИнвентаризации    = Формат(ДатаИнвентаризацииПлюсОдинДень, "ДЛФ=DD");
		
		Область_Подвал.Параметры.ДолжностьРуководителя	= Руководители.РуководительДолжность;
		Область_Подвал.Параметры.Руководитель			= Руководители.Руководитель;	
		
		Область_Подвал.Параметры.ДатаПередачиВБухгалтерию = Формат(ДатаИнвентаризацииПлюсОдинДень + 24*60*60, "ДЛФ=DD");
		
		Продавец = "";
		ДолжностьПродавца = "";
		
		ВыборкаПродавцы = ВыборкаДокумент.Выбрать();
		Пока ВыборкаПродавцы.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаПродавцы.Продавец) Тогда
				Продавец			= ВыборкаПродавцы.Продавец;
				ДолжностьПродавца	= ВыборкаПродавцы.Продавец.ФизическоеЛицо.Должность;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Область_Подвал.Параметры.Продавец = Продавец;
		Область_Подвал.Параметры.ДолжностьПродавца = ДолжностьПродавца;
		
		ТабличныйДокумент.Вывести(Область_Шапка);
		ТабличныйДокумент.Вывести(Область_Подвал);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;
	
	Возврат ТабличныйДокумент;	
КонецФункции

Функция Печать_ЗаявлениеНаУдержание(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявлениеНаУдержание";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ИнвентаризацияДенежныхСредств.ЗаявлениеНаУдержание");
	Область_ПустаяСтрока		= Макет.ПолучитьОбласть("ПустаяСтрока");
	Область_Шапка_ФММР			= Макет.ПолучитьОбласть("Шапка_ФММР");
	Область_Шапка_ИП			= Макет.ПолучитьОбласть("Шапка_ИП");
	Область_Тело				= Макет.ПолучитьОбласть("Тело"); 
	Область_Подвал				= Макет.ПолучитьОбласть("Подвал");
	
	ВыборкаДокумент = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	// Вывод данных в табличный документ
	Пока ВыборкаДокумент.Следующий() Цикл
		ТекущийДокумент = ВыборкаДокумент.Документ;
		
		ДатаИнвентаризации = ВыборкаДокумент.Дата;
		
		ВыборкаПродавцы = ВыборкаДокумент.Выбрать();
		Пока ВыборкаПродавцы.Следующий() Цикл
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// Заполнение данных
			Если ВыборкаДокумент.ЭтоФММР Тогда  
				Область_Шапка_ФММР.Параметры.Заполнить(ВыборкаДокумент);
				Область_Шапка = Область_Шапка_ФММР;
			Иначе
				Область_Шапка_ИП.Параметры.ЮрЛицо_Представление_1 = СокрЛП(ВыборкаДокумент.ЮрЛицо.Наименование);
				
				Область_Шапка_ИП.Параметры.Заполнить(ВыборкаДокумент);
				Область_Шапка = Область_Шапка_ИП;
			КонецЕсли;	
			
			Область_Шапка.Параметры.ДолжностьПродавца	= ВыборкаПродавцы.Продавец.ФизическоеЛицо.Должность;;
			Область_Шапка.Параметры.Продавец			= ВыборкаПродавцы.Продавец; 
			Область_Тело.Параметры.ДатаИнвентаризации	= Формат(ДатаИнвентаризации, "ДЛФ=DD");
			Область_Тело.Параметры.МесяцУдержания		= ПолучитьМесяцУдержанияСтрокой(ДатаИнвентаризации);
			
			ТекущаяСуммаУдержания = ВыборкаПродавцы.СуммаУдержания;
			
			Область_Тело.Параметры.СуммаИнвентаризации			= Формат(?(ТекущаяСуммаУдержания<0, -ТекущаяСуммаУдержания, ТекущаяСуммаУдержания), "ЧГ=0");
			Область_Тело.Параметры.СуммаИнвентаризацииПрописью	= ИТ_СпециальныйМодульСервер.СформироватьСуммуПрописью(ТекущаяСуммаУдержания);
			
			Область_Подвал.Параметры.ДатаЗаявления = Формат(ДатаИнвентаризации, "ДЛФ=DD");
			// Вывод данных
			ТабличныйДокумент.Вывести(Область_Шапка);
			МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 2);
			ТабличныйДокумент.Вывести(Область_Тело);
			МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 2);
			ТабличныйДокумент.Вывести(Область_Подвал);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;	
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция Печать_ПриказОбУдержании(ДанныеПечати, ОбъектыПечати, ПараметрыПечати)
	
	// Подготовка документа
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати	= "ПАРАМЕТРЫ_ПЕЧАТИ_ПриказОбУдержании";
	ТабличныйДокумент.АвтоМасштаб			= Истина;
	ТабличныйДокумент.ОриентацияСтраницы	= ОриентацияСтраницы.Портрет;
	
	// Подготовка областей
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ИТ_ИнвентаризацияДенежныхСредств.ПриказОбУдержании");
	Область_ПустаяСтрока	= Макет.ПолучитьОбласть("ПустаяСтрока");
	Область_Шапка			= Макет.ПолучитьОбласть("Шапка");
	Область_Тело_1			= Макет.ПолучитьОбласть("Тело_1"); 
	Область_Тело_2_ИП		= Макет.ПолучитьОбласть("Тело_2_ИП");
	Область_Тело_2_ФММР		= Макет.ПолучитьОбласть("Тело_2_ФММР");
	Область_Подвал_1_ФММР	= Макет.ПолучитьОбласть("Подвал_1_ФММР");
	Область_Подвал_1_ИП		= Макет.ПолучитьОбласть("Подвал_1_ИП");
	Область_Подвал_2		= Макет.ПолучитьОбласть("Подвал_2");
	
	// Вывод данных в табличный документ
	ВыборкаДокумент = ДанныеПечати.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаДокумент.Следующий() Цикл
		
		ТекущийДокумент		= ВыборкаДокумент.Документ;
		ДатаИнвентаризации	= ВыборкаДокумент.Дата;
		ВыборкаПродавцы		= ВыборкаДокумент.Выбрать();
		
		Пока ВыборкаПродавцы.Следующий() Цикл
			НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
			
			// Заполнение данных
			Область_Шапка.Параметры.ГодИнвентаризации = Формат(Год(ДатаИнвентаризации), "ЧГ=0");
			
			Область_Тело_1.Параметры.Заполнить(ВыборкаПродавцы);
			
			Область_Тело_1.Параметры.Магазин_Представление	= Строка(ВыборкаДокумент.Магазин);
			Область_Тело_1.Параметры.МесяцУдержания			= ПолучитьМесяцУдержанияСтрокой(ДатаИнвентаризации);
			
			Если ВыборкаДокумент.ЭтоФММР Тогда  
				Область_Тело_2		= Область_Тело_2_ФММР;
				Область_Подвал_1	= Область_Подвал_1_ФММР;
			Иначе
				Область_Тело_2		= Область_Тело_2_ИП;
				Область_Подвал_1	= Область_Подвал_1_ИП;
				Область_Подвал_1.Параметры.Заполнить(ВыборкаДокумент);
			КонецЕсли;	
			
			Область_Тело_2.Параметры.НомерДокумента	= ПрефиксацияОбъектовПлатформа.ПолучитьНомерНаПечать(ТекущийДокумент.Номер);
			Область_Тело_2.Параметры.ДатаДокумента	= Формат(ДатаИнвентаризации, "ДФ=dd.MM.yyyy");
			
			Область_Тело_1.Параметры.ДатаИнвентаризации	= Формат(ДатаИнвентаризации, "ДЛФ=DD");
			Область_Тело_1.Параметры.Продавец			= ВыборкаПродавцы.Продавец;
			Область_Тело_1.Параметры.ДолжностьПродавца	= ВыборкаПродавцы.Продавец.ФизическоеЛицо.Должность;;
			
			ТекущаяСуммаУдержания = ВыборкаПродавцы.СуммаУдержания;
			
			Область_Тело_1.Параметры.СуммаИнвентаризации			= ?(ТекущаяСуммаУдержания<0, -ТекущаяСуммаУдержания, ТекущаяСуммаУдержания);
			Область_Тело_1.Параметры.СуммаИнвентаризацииПрописью	= ИТ_СпециальныйМодульСервер.СформироватьСуммуПрописью(ТекущаяСуммаУдержания);
			
			Область_Подвал_2.Параметры.Продавец			 = ВыборкаПродавцы.Продавец;
			Область_Подвал_2.Параметры.ДолжностьПродавца = ВыборкаПродавцы.Продавец.ФизическоеЛицо.Должность;;
			
			// Вывод данных
			МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 2);
			ТабличныйДокумент.Вывести(Область_Шапка);
			ТабличныйДокумент.Вывести(Область_ПустаяСтрока);
			ТабличныйДокумент.Вывести(Область_Тело_1);
			ТабличныйДокумент.Вывести(Область_Тело_2);
			МногократноВывестиОбласть(ТабличныйДокумент, Область_ПустаяСтрока, 3);
			ТабличныйДокумент.Вывести(Область_Подвал_1);
			ТабличныйДокумент.Вывести(Область_Подвал_2);
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
	КонецЦикла;	
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьМесяцУдержанияСтрокой(Дата)
	
	ДатаСтрокой		= Формат(Дата, "ДФ='dd MMMM yyyy ""г.""'");
	МесяцУдержания	= Сред(ДатаСтрокой, 4);
	
	Возврат МесяцУдержания;
	
КонецФункции

Функция МногократноВывестиОбласть(ТабличныйДокумент, ОбластьМакета, КоличествоВыводов)
	
	Для НомерВывода = 1 По КоличествоВыводов Цикл 
		Если ТипЗнч(ОбластьМакета) = Тип("Массив") Тогда 
			Для Каждого ОбластьМассива Из ОбластьМакета Цикл 
				ТабличныйДокумент.Вывести(ОбластьМассива);	
			КонецЦикла;	
		Иначе	
			ТабличныйДокумент.Вывести(ОбластьМакета);
		КонецЕсли;	
	КонецЦикла;	
	
КонецФункции

#КонецОбласти