
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.ИТ_РезультатыИнвентаризацийДенежныхСредств.Записывать = Истина;
	Движение = Движения.ИТ_РезультатыИнвентаризацийДенежныхСредств.Добавить();
	Движение.Период = Дата;
	ЗаполнитьЗначенияСвойств(Движение,Ссылка);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	СуммаПоУчету = 0;
	СуммаПоФакту = 0;
	РезультатИнвентаризации = 0;
	ВариантПогашенияНедостачи = Перечисления.ИТ_ВариантыПогашенияНедостачи.ПустаяСсылка();
	АктИнвентаризации = Ложь;
	
КонецПроцедуры
