
#Область ОбработчикиОсновныхСобытийФормы

// Обработчик события формы ПриСозданииНаСервере.
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Параметры.Свойство("Владелец") Тогда
		Владелец = Параметры.Владелец;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Владелец) Тогда
		ВывестиСообщение(НСтр("ru = 'Владелец не выбран.'"));
		Отказ = Истина;
	КонецЕсли;
	
	ФлажокОчищать = Истина;
	
КонецПроцедуры

// Обработчик события формы ПриОткрытии.
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовФормы

// Обработчик события ПриИзменении элемента формы ПереключательПоОстаткам.
&НаКлиенте
Процедура ПереключательПоОстаткамПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементовФормы();
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

// Обработчик команды Заполнить.
&НаКлиенте
Процедура Заполнить(Команда)
	
	Если ФлажокОчищать Тогда
		
		ТекстВопроса        = НСтр("ru = 'Текущий прайс-лист будет очищен. Продолжить?'");
		ОповещениеОЗакрытии = Новый ОписаниеОповещения("ЗаполнитьПродолжение", ЭтотОбъект);
		
		ПоказатьВопрос(ОповещениеОЗакрытии, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
	Иначе
		
		ЗаполнитьПродолжение(КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

// Продолжение выполнения команды Заполнить.
&НаКлиенте
Процедура ЗаполнитьПродолжение(Ответ, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		Если ЗаполнитьНаСервере() Тогда
			
			ОповеститьОбИзменении(Тип("СправочникСсылка.ПрайсЛист"));
			Закрыть();
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры // ЗаполнитьПродолжение()

// Серверная часть команды Заполнить.
&НаСервере
Функция  ЗаполнитьНаСервере()
	
	НачатьТранзакцию();
	
	Попытка
		Если ФлажокОчищать Тогда
			
			ОчиститьТекущийПрайсЛист();
		КонецЕсли;
		
		ПараметрыЗаполнения = Новый Структура();
		ПараметрыЗаполнения.Вставить("Склад",              Склад);
		ПараметрыЗаполнения.Вставить("Дата",               Дата);
		ПараметрыЗаполнения.Вставить("Поставщик",          Поставщик);
		ПараметрыЗаполнения.Вставить("ВидПрайсЛиста",      ВидПрайсЛиста);
		ПараметрыЗаполнения.Вставить("ГруппаНоменклатуры", ГруппаНоменклатуры);
		
		Справочники.ПрайсЛист.ЗаполнитьПрайсЛист(Владелец, ПереключательПоОстаткам, ПараметрыЗаполнения, ПереключательНеСоздавать, ФлажокОчищать, ТекущийРодитель);
		ЗафиксироватьТранзакцию();
	Исключение
		
		ОтменитьТранзакцию();
		Возврат Ложь;
	КонецПопытки;
	
	Возврат Истина;
	
КонецФункции // ЗаполнитьНаСервере()

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

// Устанавливает доступность элементов формы.
&НаКлиенте
Процедура УстановитьДоступностьЭлементовФормы()
	
	Элементы.ГруппаПараметрыОстатки.Доступность = ПереключательПоОстаткам = 0;
	Элементы.Поставщик.Доступность              = ПереключательПоОстаткам = 1;
	Элементы.ВидПрайсЛиста.Доступность          = ПереключательПоОстаткам = 3;
	
КонецПроцедуры // УстановитьДоступностьЭлементовФормы()

// Очищает текущий прайс-лист.
&НаСервере
Процедура ОчиститьТекущийПрайсЛист()
	
	УдаляемыеЭлементы = Новый СписокЗначений;
	
	Запрос = Новый Запрос("ВЫБРАТЬ Ссылка ИЗ Справочник.ПрайсЛист ГДЕ Владелец = &ИсходныйВладелец");
	Запрос.УстановитьПараметр("ИсходныйВладелец", Владелец);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.Ссылка.Уровень() = 0 Тогда
			
			УдаляемыеЭлементы.Добавить(Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого УдаляемыйЭлемент Из УдаляемыеЭлементы Цикл
		
		УдаляемыйЭлементОбъект = УдаляемыйЭлемент.Значение.ПолучитьОбъект();
		УдаляемыйЭлементОбъект.Удалить();
	КонецЦикла;
	
КонецПроцедуры // Очистить()

#КонецОбласти

