
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ОтборОтчета") Тогда
		
		ПараметрыОтчета = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных;
		пользавательскиеПараметрыОтчета = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы;
		
		//
		Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ПериодОтчета"));
		Параметр.Использование = Истина;
		Параметр.Значение = Параметры.ОтборОтчета.ПериодОтчета;		
		ЭлементПН = пользавательскиеПараметрыОтчета.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		ЭлементПН.Использование = Истина;
		ЭлементПН.Значение = Параметры.ОтборОтчета.ПериодОтчета;	
		
		
		Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДокументыФиксации"));
		Параметр.Использование = Истина;
		Параметр.Значение = Параметры.ОтборОтчета.ДокументыФиксации;
		ЭлементПН = пользавательскиеПараметрыОтчета.Найти(Параметр.ИдентификаторПользовательскойНастройки);
		ЭлементПН.Использование = Истина;
		ЭлементПН.Значение = Параметры.ОтборОтчета.ДокументыФиксации;	
		
		Параметр = ПараметрыОтчета.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ДокументФиксацияСтрокой"));
		Параметр.Использование = Истина;
		Параметр.Значение = Параметры.ОтборОтчета.ДокументФиксацияСтрокой;

	КонецЕсли;	
КонецПроцедуры
