
#Область ПрограммныйИнтерфейс

#Область Массивы

Функция ОбъединитьМассивы(Массив_1, Массив_2, ТолькоУникальныеЗначения = Ложь) Экспорт 
	
	Если Массив_1.Количество() > Массив_2.Количество() Тогда
		МассивПриемник = Массив_1;
		МассивИсточник = Массив_2;
	Иначе
		МассивПриемник = Массив_2;
		МассивИсточник = Массив_1;	
	КонецЕсли;	
	
	Если ТолькоУникальныеЗначения Тогда 
		Для Каждого ЭлементМассива Из МассивИсточник Цикл 
			ДобавитьУникальноеЗначениеВМассив(МассивПриемник, ЭлементМассива, Истина); 
		КонецЦикла;	
	Иначе
		Для Каждого ЭлементМассива Из МассивИсточник Цикл 
			МассивПриемник.Добавить(ЭлементМассива);
		КонецЦикла;	
	КонецЕсли; 	
	
	Возврат МассивПриемник;
	
КонецФункции

Процедура ДобавитьУникальноеЗначениеВМассив(Массив, Значение, Добавлять = Истина) Экспорт
	
	Если Добавлять Тогда 
		Если Массив.Найти(Значение) = Неопределено Тогда 
			Массив.Добавить(Значение);
		КонецЕсли;
	КонецЕсли;	
		
КонецПроцедуры

Процедура УдалитьЗначениеИзМассива(Массив, Значение) Экспорт
	
	Индекс = Массив.Найти(Значение);
	
	Пока Индекс <> Неопределено Цикл 
		Массив.Удалить(Индекс);
		Индекс = Массив.Найти(Значение);
	КонецЦикла;	
		
КонецПроцедуры	

#КонецОбласти

#Область СпискиЗначений

Функция ОбъединитьСпискиЗначений(СписокЗначений_1, СписокЗначений_2, ТолькоУникальныеЗначения = Ложь) Экспорт
	
	Если СписокЗначений_1.Количество() > СписокЗначений_2.Количество() Тогда
		СписокПриемник = СписокЗначений_1;
		СписокИсточник = СписокЗначений_2;
	Иначе
		СписокПриемник = СписокЗначений_2;
		СписокИсточник = СписокЗначений_1;	
	КонецЕсли;	
	
	Для Каждого ЭлементСписка Из СписокИсточник Цикл 
		Если ТолькоУникальныеЗначения Тогда 
			Если СписокПриемник.НайтиПоЗначению(ЭлементСписка.Значение) = Неопределено Тогда 
				СписокПриемник.Добавить(ЭлементСписка.Значение);					
			КонецЕсли;	
		Иначе 		
			СписокПриемник.Добавить(ЭлементСписка.Значение);			
		КонецЕсли;	
	КонецЦикла;	
	
	Возврат СписокПриемник;
	
КонецФункции

Процедура ДобавитьУникальноеЗначениеВСписокЗначений(СписокЗначений, Значение, Представление = "", Пометка = Ложь, Картинка = Неопределено, Добавлять = Истина) Экспорт
	
	Если Добавлять
		И СписокЗначений.НайтиПоЗначению(Значение) = Неопределено Тогда  
		Если Картинка = Неопределено Тогда 
			СписокЗначений.Добавить(Значение, Представление, Пометка);
		Иначе
			СписокЗначений.Добавить(Значение, Представление, Пометка, Картинка);
		КонецЕсли;	
	КонецЕсли;	
		
КонецПроцедуры

#КонецОбласти

#Область Структуры

// Функция проверяет наличие свойства у структуры. При необходимости идет проверка типа значения свойства требуемуму типу.
// Если задано значение по умолчанию, то оно будет установлено возвращаемому значению в случае если требуемого свойства нет, 
// оно неопределено или его тип не соответвует требуемуму типу.
//
Функция ПолучитьСвойствоСтруктуры(СтруктураСвойств, ИмяСвойства, ТребуемыйТипЗначения = Неопределено, ЗначениеПоУмолчанию = Неопределено) Экспорт 
	
	ЗначениеСвойства = Неопределено;
	
	// Проверка структуры
	Если ТипЗнч(СтруктураСвойств) = Тип("Структура") Тогда 
		СтруктураСвойств.Свойство(ИмяСвойства, ЗначениеСвойства);		
	КонецЕсли;	
	
	// Проверка на тип значения	
	Если ТребуемыйТипЗначения <> Неопределено
		И ТипЗнч(ТребуемыйТипЗначения) = Тип("Тип")
		И ТипЗнч(ЗначениеСвойства) <> ТребуемыйТипЗначения Тогда 
		ЗначениеСвойства = Неопределено;
	КонецЕсли;	
	
	// Проверка на заполненность
	Если ЗначениеСвойства = Неопределено Тогда 
		ЗначениеСвойства = ЗначениеПоУмолчанию;
	КонецЕсли;
	
	Возврат ЗначениеСвойства;
	
КонецФункции

Процедура ДобавитьСвойствоСтруктуры(СтруктураСвойств, ИмяСвойства, ЗначениеСвойства, ЗначениеПоУмолчанию = Неопределено) Экспорт 
	
	// Проверка структуры
	Если ТипЗнч(СтруктураСвойств) <> Тип("Структура") Тогда 
		СтруктураСвойств = Новый Структура();
	КонецЕсли;
	
	// Заполненность значения свойства
	Если ЗначениеЗаполнено(ЗначениеСвойства)
		ИЛИ ТипЗнч(ЗначениеСвойства) = Тип("Булево") Тогда 
		ДобавляемоеЗначение = ЗначениеСвойства;
	Иначе
		ДобавляемоеЗначение = ЗначениеПоУмолчанию;
	КонецЕсли;	
	
	// Наличие свойства
	Если СтруктураСвойств.Свойство(ИмяСвойства) Тогда 
		СтруктураСвойств[ИмяСвойства] = ДобавляемоеЗначение;
	Иначе
		СтруктураСвойств.Вставить(ИмяСвойства, ДобавляемоеЗначение);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОпределитьСвойствоСтруктуры(СтруктураСвойств, ИмяСвойства, ТребуемыйТипЗначения = Неопределено, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	// Если это не структура - создается структура с требуемым свойством и значением по умолчанию.
	Если ТипЗнч(СтруктураСвойств) <> Тип("Структура") Тогда 
		СтруктураСвойств = Новый Структура();
		СтруктураСвойств.Вставить(ИмяСвойства, ЗначениеПоУмолчанию);
		Возврат;
	КонецЕсли;	
	
	// Если свойства нет - добавляется свойство со значением по умолчанию. 
	Если Не(СтруктураСвойств.Свойство(ИмяСвойства)) Тогда 
		СтруктураСвойств.Вставить(ИмяСвойства, ЗначениеПоУмолчанию);
		Возврат;
	КонецЕсли;	
	
	// Тип значения свойства.
	ТипЗначенияСвойства = ТипЗнч(СтруктураСвойств[ИмяСвойства]);
	
	// Если тип свойства отличен от требуемого типа - присваивается значение по умолчанию.	
	Если ТребуемыйТипЗначения <> Неопределено 
		И ТипЗначенияСвойства <> ТребуемыйТипЗначения Тогда 
		СтруктураСвойств[ИмяСвойства] = ЗначениеПоУмолчанию;
		Возврат;
	КонецЕсли;	
	
	// Свойство уже есть, проверка на тип пройдена. 
	// Проверка на заполненность для булевых свойств не выполняется.
	Если ТипЗначенияСвойства = Тип("Булево") Тогда 
		Возврат;
	КонецЕсли;	
	
	// Если значение свойства не заполнено - присваивается значение по умолчанию.
	Если Не(ЗначениеЗаполнено(СтруктураСвойств[ИмяСвойства])) Тогда 
		СтруктураСвойств[ИмяСвойства] = ЗначениеПоУмолчанию;
		Возврат;
	КонецЕсли;	
	
КонецПроцедуры	

// Проверяет структура на наличие свойства, если задан тип свойства то дополнительно выполняется проверка на соответствие типов.
// Если все првоерки пройдены возвращает ИСТИНА, в противном случае - ЛОЖЬ.
//
// Параметры:
//	Структура			- Структура	- Структура, в которой требуется проверка свойства.
//	ИмяСвойства			- Строка	- Имя проверяемого свойства.
//	ТипЗначенияСвойства	- Тип		- Требуемый тип проверяемого свойства.
//
Функция ПроверитьСвойствоСтруктуры(Структура, ИмяСвойства, ТипЗначенияСвойства = Неопределено) Экспорт

	Если Структура.Свойство(ИмяСвойства) Тогда 
		Если ЗначениеЗаполнено(ТипЗначенияСвойства) 
			И ТипЗнч(ТипЗначенияСвойства) = Тип("Тип") Тогда 
			Если ТипЗнч(Структура[ИмяСвойства]) = ТипЗначенияСвойства Тогда 
				Возврат Истина;				
			Иначе
				Возврат Ложь;		
			КонецЕсли;	
		Иначе
			Возврат Истина;
		КонецЕсли;	
	Иначе		
		Возврат Ложь;		
	КонецЕсли;	
	
КонецФункции

#КонецОбласти

#Область ТаблицыЗначений

// Удаляет тип значения NULL из типов значения колонок таблицы значений.
// Если NULL является единственным типо колонки, колонка не создается.
//
Функция УдалитьПустыеТипыТаблицыЗначений(ТаблицаЗначений) Экспорт
	
	ОбработаннаяТаблица = Новый ТаблицаЗначений();
	КолонкиТаблицы = ТаблицаЗначений.Колонки;
	
	Для Каждого КолонкаТаблицы Из КолонкиТаблицы Цикл
		
		ТипыЗначенияКолонки = КолонкаТаблицы.ТипЗначения.Типы(); 
		ТипыЗначенияНовойКолонки = Новый Массив();
		
		Для Каждого ТипЗначенияКолонки Из ТипыЗначенияКолонки Цикл 
			Если ТипЗначенияКолонки <> Тип("Null") Тогда 
				ТипыЗначенияНовойКолонки.Добавить(ТипЗначенияКолонки);				
			КонецЕсли;	
		КонецЦикла;	
		
		Если ТипыЗначенияНовойКолонки.Количество() = 0 Тогда 
			Продолжить;
		Иначе
			ОписаниеТиповНовойКолонки = Новый ОписаниеТипов(ТипыЗначенияНовойКолонки);
		КонецЕсли;	
		
		ОбработаннаяТаблица.Колонки.Добавить(КолонкаТаблицы.Имя, ОписаниеТиповНовойКолонки, КолонкаТаблицы.Заголовок, КолонкаТаблицы.Ширина);
		
	КонецЦикла;	
	
	Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл 
		ЗаполнитьЗначенияСвойств(ОбработаннаяТаблица.Добавить(), СтрокаТаблицы);
	КонецЦикла;	
	
	Возврат ОбработаннаяТаблица;
	
КонецФункции

// Объединяет строки двух таблиц значений одинаковой структуры колонок.
// Анализирует какя таблица больше и добавляет строки в большую таблицу используя строки меньшей таблицы.
//
Функция ОбъединитьТаблицыЗначений(ТаблицаЗначений_1, ТаблицаЗначений_2) Экспорт
	
	Количество_1 = ТаблицаЗначений_1.Количество();
	Количество_2 = ТаблицаЗначений_2.Количество();
	
	Если Количество_1 > Количество_2 Тогда 
		ТаблицаПриемник	= ТаблицаЗначений_1;
		ТаблицаИсточник = ТаблицаЗначений_2; 
	Иначе
		ТаблицаПриемник	= ТаблицаЗначений_2;
		ТаблицаИсточник = ТаблицаЗначений_1;	
	КонецЕсли;	
	
	Для Каждого СтрокаТаблицы Из ТаблицаИсточник Цикл 
		ЗаполнитьЗначенияСвойств(ТаблицаПриемник.Добавить(), СтрокаТаблицы);
	КонецЦикла;	
	
	Возврат ТаблицаПриемник;
	
КонецФункции

Процедура ДобавитьСтрокуВТаблицуЗначений(ТаблицаЗначений, СтрокаТаблицы, ЗаполняемыеСвойства = Неопределено, ИсключаемыеСвойства = Неопределено, Добавлять = Истина) Экспорт

	Если Не(Добавлять) Тогда 
		Возврат;
	КонецЕсли;	
	
	НоваяСтрокаТаблицы = ТаблицаЗначений.Добавить();
	
	Если ЗаполняемыеСвойства = Неопределено Тогда 
		Если ИсключаемыеСвойства = Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаТаблицы);	
		Иначе
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаТаблицы,, ИсключаемыеСвойства);	
		КонецЕсли;	
	Иначе	
		Если ИсключаемыеСвойства = Неопределено Тогда 
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаТаблицы, ЗаполняемыеСвойства);	
		Иначе
			ЗаполнитьЗначенияСвойств(НоваяСтрокаТаблицы, СтрокаТаблицы, ЗаполняемыеСвойства, ИсключаемыеСвойства);	
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьСтрокиТаблицыЗначениеПоОтбору(
			Таблица, 
			РеквизитыОтбора, 
			ЗначенияОтбора_1, 
			ЗначенияОтбора_2 = Неопределено,
			ЗначенияОтбора_3 = Неопределено,
			ЗначенияОтбора_4 = Неопределено,
			ЗначенияОтбора_5 = Неопределено,
			ЗначенияОтбора_6 = Неопределено,
			ЗначенияОтбора_7 = Неопределено,
			ЗначенияОтбора_8 = Неопределено,
			ЗначенияОтбора_9 = Неопределено) Экспорт 
	
	МассивРеквизитов	= СтрРазделить(РеквизитыОтбора, ",", Ложь);
	ПараметрыОтбора		= Новый Структура(
							РеквизитыОтбора, 
							ЗначенияОтбора_1, 
							ЗначенияОтбора_2, 
							ЗначенияОтбора_3,
							ЗначенияОтбора_4, 
							ЗначенияОтбора_5, 
							ЗначенияОтбора_6,
							ЗначенияОтбора_7, 
							ЗначенияОтбора_8, 
							ЗначенияОтбора_9);
	
	СтрокиДляУдаления = Таблица.НайтиСтроки(ПараметрыОтбора);
	
	Для Каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл 
		Таблица.Удалить(СтрокаДляУдаления);
	КонецЦикла;	
	
КонецПроцедуры

Функция НайтиМинимумМаксимумКолонкиТаблицыЗначений(ТаблицаЗначений, ИмяКолонки) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаЗначений." + ИмяКолонки + " КАК ЗначенияКолонки
		|ПОМЕСТИТЬ ТаблицаЗначений
		|ИЗ
		|	&ТаблицаЗначений КАК ТаблицаЗначений
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МИНИМУМ(ТаблицаЗначений.ЗначенияКолонки) КАК Минимум,
		|	МАКСИМУМ(ТаблицаЗначений.ЗначенияКолонки) КАК Максимум
		|ИЗ
		|	ТаблицаЗначений КАК ТаблицаЗначений";
	
	Запрос.УстановитьПараметр("ТаблицаЗначений", ТаблицаЗначений);
	
	Возврат СформироватьСтруктуруСтрокиТаблицыЗначений(Запрос.Выполнить().Выгрузить(),, Истина);
	
КонецФункции	

Функция ПоделитьТаблицуЗначенийНаПорции(
	ТаблицаЗначений, 
	Знач ПоляПорции				= "", 
	Знач ПоляЭлементовПорции	= "", 
	Знач РазмерПорции			= 0, 
	Знач Группировать			= Ложь, 
	Знач ПолеГруппировки		= "") Экспорт
	
	Если Группировать Тогда 
		ОпределитьЗначение(ПолеГруппировки, Тип("Строка"), Неопределено);
		
		Если ПолеГруппировки = Неопределено 
			ИЛИ ТаблицаЗначений.Колонки.Найти(ПолеГруппировки) = Неопределено Тогда 
			Группировать = Ложь;
		КонецЕсли;	
	КонецЕсли;	

	МассивПорций = Новый Массив();
	
	Если Группировать Тогда 
		ЭлементыГруппировки = ПолучитьУникальныеЗначенияКолонкиТаблицыЗначений(ТаблицаЗначений, ПолеГруппировки);
		
		Для Каждого ЭлементГруппировки Из ЭлементыГруппировки Цикл 
			ТаблицаГруппировки	= ТаблицаЗначений.Скопировать(Новый Структура(ПолеГруппировки, ЭлементГруппировки));
			ПорцииЗначений		= ПоделитьКоллекциюЗначенийНаПорции(ТаблицаГруппировки, ПоляПорции, ПоляЭлементовПорции, РазмерПорции);
			МассивПорций		= ОбъединитьМассивы(МассивПорций, ПорцииЗначений);
		КонецЦикла;	
	Иначе
		МассивПорций = ПоделитьКоллекциюЗначенийНаПорции(ТаблицаЗначений, ПоляПорции, ПоляЭлементовПорции, РазмерПорции);	
	КонецЕсли;	
	
	Возврат МассивПорций;
	
КонецФункции

Процедура УстановитьПрефиксКолонокТаблицыЗначений(ТаблицаЗначений, Префикс) Экспорт
	
	ОпределитьЗначение(Префикс, Тип("Строка"), "");
	
	Если ПустаяСтрока(Префикс) Тогда 
		Возврат;
	КонецЕсли;	
	
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл 
		ИмяКолонки	= СокрЛП(Префикс) + Строка(Колонка.Имя);
		Колонка.Имя	= ИмяКолонки;
	КонецЦикла;	
	
КонецПроцедуры	

#КонецОбласти

#Область ПроизвольныеЗначения

// Проверяет переданное значение на заполненность и тип.
// Изменяет переданное значение, может использоваться как процедура и как функция.
//
Функция ОпределитьЗначение(Значение, ТипЗначения = Неопределено, ЗначениеПоУмолчанию = Неопределено) Экспорт
	
	Тип_Значение = ТипЗнч(Значение);	
	
	// Проверка на тип значения
	Если ЗначениеЗаполнено(ТипЗначения)
		И ТипЗначения = Тип("Тип")
		И Тип_Значение <> ТипЗначения Тогда 
		Значение = Неопределено;
	КонецЕсли;	
	
	// Проверка на заполненность	
	Если ЭтоМутабельныйТип(Тип_Значение) // Мутабельные типы и булево проверяются отдельно
		ИЛИ ТипЗначения = Тип("Булево") Тогда
		
		Если Значение = Неопределено 
			И ЗначениеПоУмолчанию <> Неопределено Тогда 
			Значение = ЗначениеПоУмолчанию;
		КонецЕсли;
	ИначеЕсли Не(ЗначениеЗаполнено(Значение)) Тогда 
		Если ЗначениеПоУмолчанию <> Неопределено Тогда 
			Значение = ЗначениеПоУмолчанию;	
		Иначе 
			Значение = Неопределено;
		КонецЕсли;	
	КонецЕсли;	
		
	Возврат Значение;
	
КонецФункции

Функция ПоделитьКоллекциюЗначенийНаПорции(
	КоллекцияЗначений, 
	Знач ПоляПорции				= Неопределено, 
	Знач ПоляЭлементовПорции	= Неопределено,
	Знач РазмерПорции			= 0) Экспорт
	
	КоличествоЭлементов	= КоллекцияЗначений.Количество();
	РазмерПорции		= ?(РазмерПорции = 0, КоличествоЭлементов, РазмерПорции);
	ГраницаПорции		= РазмерПорции;
	НомерЭлемента		= 1;
	МассивПорций		= Новый Массив();
	ПоляПорции			= ПолучитьКоллекциюКакСтроку(ПоляПорции);
	ПоляЭлементовПорции	= ПолучитьКоллекциюКакСтроку(ПоляЭлементовПорции);
	
	Пока НомерЭлемента <= КоличествоЭлементов Цикл 
		Если ГраницаПорции > КоличествоЭлементов Тогда 
			ГраницаПорции = КоличествоЭлементов;	
		КонецЕсли;	
		
		ПорцияЭлементов = Новый Массив();
			
		Пока НомерЭлемента <= ГраницаПорции Цикл 
			ЭлементКоллекции	= КоллекцияЗначений.Получить(НомерЭлемента - 1);
			НомерЭлемента		= НомерЭлемента + 1;
			
			Если ПоляЭлементовПорции = Неопределено Тогда  
				ПорцияЭлементов.Добавить(ЭлементКоллекции);
			Иначе
				ЭлементПорции = Новый Структура(ПоляЭлементовПорции);
				ЗаполнитьЗначенияСвойств(ЭлементПорции, ЭлементКоллекции, ПоляЭлементовПорции);
				ПорцияЭлементов.Добавить(ЭлементПорции);
			КонецЕсли;	
		КонецЦикла;	
		
		Если ПоляПорции = Неопределено Тогда 
			МассивПорций.Добавить(ПорцияЭлементов);
		Иначе
			СтруктураПорции = Новый Структура(ПоляПорции);
			ЗаполнитьЗначенияСвойств(СтруктураПорции, ЭлементКоллекции, ПоляПорции);
			СтруктураПорции.Вставить("Элементы", ПорцияЭлементов);
			МассивПорций.Добавить(СтруктураПорции);
		КонецЕсли;	
			
		ГраницаПорции = ГраницаПорции + РазмерПорции;
	КонецЦикла;	
	
	Возврат МассивПорций;	
	
КонецФункции	

Функция ЭтоМутабельноеЗначение(Значение) Экспорт
	
	Если ЭтоМутабельныйТип(ТипЗнч(Значение)) Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции	

Функция ЭтоМутабельныйТип(Тип) Экспорт
	
	Если Тип = Тип("МенеджерВременныхТаблиц")
		ИЛИ Тип = Тип("НастройкиКомпоновкиДанных")
		ИЛИ Тип = Тип("КомпоновщикНастроекКомпоновкиДанных")
		ИЛИ Тип = Тип("СхемаКомпоновкиДанных") Тогда 
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
	
КонецФункции	

#КонецОбласти

#Область Конвертеры

// Функция формирукт и возвращает структуру полученную из таблицы значений
// Если передана опция "УстанавливатьЗначения", то значениям свойств структуры будут присвоены значения переданной строки.
// Если строка не передана, то будет произведена попытка получить первую строку таблицы значения и присвоить ее значения.
// Если первой строки строки нет, то все значения свойств структуры будут равны "Неопределено"
// Если опция "УстанавливатьЗначения" = Ложь или опущена, то все значения свойств структуры будут равны "Неопределено", все зависимости от переданной строки или наличия строки в таблице значений.
//
// Параметры:
//	ТаблицаЗначений - ТаблицаЗначений из которой будет получена структура. Состав структуры повторяет состав колонок таблицы значений.
//	СтрокаТаблицыЗначений - СтрокаТаблицыЗначений, свойства которой будут присвоены свойствам структуры, если установлена опция "УстанавливатьЗначения".
//	УстанавливатьЗначения - Булево, признак необходимости присвоения значений строки структуре строки.
//
// Возвращаемые значения:
//	СтруктураСтроки - Структура, повторяющая состав колонок таблицы значений, в зщависимости от опций с заполненными или незаполненными свойствами.	
//
Функция СформироватьСтруктуруСтрокиТаблицыЗначений(Знач ТаблицаЗначений, Знач СтрокаТаблицыЗначений = Неопределено, Знач УстанавливатьЗначения = Ложь) Экспорт 
	
	СтруктураСтроки = Новый Структура();
	
	Если УстанавливатьЗначения Тогда 
		Если СтрокаТаблицыЗначений = Неопределено Тогда 
			Если ТаблицаЗначений.Количество() = 0 Тогда 
				УстанавливатьЗначения = Ложь;
			Иначе
				СтрокаТаблицыЗначений = ТаблицаЗначений.Получить(0);
			КонецЕсли;	
		КонецЕсли;	
	КонецЕсли;	
		
	Для Каждого Колонка Из ТаблицаЗначений.Колонки Цикл 
		СтруктураСтроки.Вставить(Колонка.Имя);
	КонецЦикла;	
	
	Если УстанавливатьЗначения Тогда 
		ЗаполнитьЗначенияСвойств(СтруктураСтроки, СтрокаТаблицыЗначений);
	КонецЕсли;	
	
	Возврат СтруктураСтроки;
	
КонецФункции

// Формирует массив уникальных значений одной из колонок таблицы значений
//
Функция ПолучитьУникальныеЗначенияКолонкиТаблицыЗначений(ТаблицаЗначений, ИмяКолонки) Экспорт
	
	ТаблицаЗначенийКолонки = ТаблицаЗначений.Скопировать(, ИмяКолонки);
	ТаблицаЗначенийКолонки.Свернуть(ИмяКолонки);
	
	Возврат ТаблицаЗначенийКолонки.ВыгрузитьКолонку(ИмяКолонки);
	
КонецФункции

Функция ПолучитьКоллекциюКакМассив(КоллекцияЗначений) Экспорт 
	
	ТипКоллекции = ТипЗнч(КоллекцияЗначений);
	
	Если ТипКоллекции = Тип("Массив") Тогда 
		Возврат КоллекцияЗначений;
	ИначеЕсли ТипКоллекции = Тип("Строка") Тогда 
		Возврат СтрРазделить(КоллекцияЗначений, ",", Ложь);
	ИначеЕсли ТипКоллекции = Тип("СписокЗначений") Тогда 
		Возврат КоллекцияЗначений.ВыгрузитьЗначения();
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
		
КонецФункции

Функция ПолучитьКоллекциюКакСтроку(КоллекцияЗначений) Экспорт
	
	МассивКоллекции = ПолучитьКоллекциюКакМассив(КоллекцияЗначений);
	ОпределитьЗначение(МассивКоллекции, Тип("Массив"), Неопределено);
	
	Если МассивКоллекции = Неопределено Тогда 
		СтрокаКоллецииЗначений = Неопределено;
	Иначе
		СтрокаКоллецииЗначений = СтрСоединить(МассивКоллекции, ",");
	КонецЕсли;	
	
	Возврат СтрокаКоллецииЗначений;
	
КонецФункции	

Функция МассивСтруктурВТаблицуЗначений(МассивСтруктур) Экспорт
	
	ОпределитьЗначение(МассивСтруктур, Тип("Массив"), Неопределено);
	
	Если МассивСтруктур = Неопределено Тогда 
		Возврат Неопределено;
	КонецЕсли;
	
	ПервыйЭлемент = МассивСтруктур.Получить(0);
	ТаблицаЗначенийМассива = Новый ТаблицаЗначений;
	
	Для Каждого КлючИЗначение Из ПервыйЭлемент Цикл 
		Тип_Значение	= ТипЗнч(КлючИЗначение.Значение);
		МассивТипов		= Новый Массив;
		МассивТипов.Добавить(Тип_Значение);
		ОписаниеТипов	= Новый ОписаниеТипов(МассивТипов);
		ТаблицаЗначенийМассива.Колонки.Добавить(КлючИЗначение.Ключ, ОписаниеТипов);		
	КонецЦикла;	
	
	Для Каждого ЭлементМассива Из МассивСтруктур Цикл 
		ЗаполнитьЗначенияСвойств(ТаблицаЗначенийМассива.Добавить(), ЭлементМассива);		
	КонецЦикла;	
	
	Возврат ТаблицаЗначенийМассива;
	
КонецФункции	

// Возвращает двоичные данные как данные сохраненного файла, полученные из переданного табличного документа.
//
// Параметры:
//	ТабличныйДокумент	- ТабличныйДокумент				- Произвольный табличный документ, данные которого необходимо получить.
//	ТипФайла			- ТипФайлаТабличногоДокумента	- Тип файла, в формате которого будут получены двоичные данные.
//
Функция ПолучитьДвоичныеДанныеТабличногоДокумента(ТабличныйДокумент, ТипФайла) Экспорт
	
	Если ТипФайла = ТипФайлаТабличногоДокумента.ANSITXT Тогда 
		РасширениеФайла = "txt";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.DOCX Тогда 
		РасширениеФайла = "docx"; 	
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.HTML Тогда 
		РасширениеФайла = "html";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.HTML3 Тогда 
		РасширениеФайла = "html";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.HTML4 Тогда 
		РасширениеФайла = "html";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.HTML5 Тогда 
		РасширениеФайла = "html";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.MXL Тогда 
		РасширениеФайла = "mxl";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.MXL7 Тогда 
		РасширениеФайла = "mxl";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.ODS Тогда 
		РасширениеФайла = "ods";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.PDF Тогда 
		РасширениеФайла = "pdf";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.TXT Тогда 
		РасширениеФайла = "txt";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.XLS Тогда 
		РасширениеФайла = "xls";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.XLS95 Тогда 
		РасширениеФайла = "xls";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.XLS97 Тогда 
		РасширениеФайла = "xls";
	ИначеЕсли ТипФайла = ТипФайлаТабличногоДокумента.XLSX Тогда 
		РасширениеФайла = "xlsx";
	Иначе
		Возврат Неопределено;
	КонецЕсли;	
	
	ИмяВременноегоФайла = ПолучитьИмяВременногоФайла(РасширениеФайла);
	ТабличныйДокумент.Записать(ИмяВременноегоФайла, ТипФайла);
	ДвоичныеДанные = Новый ДвоичныеДанные(ИмяВременноегоФайла);
	УдалитьФайлы(ИмяВременноегоФайла);
	
	Возврат ДвоичныеДанные;
	
КонецФункции

// Преобразует произвольное значение в строковый вид.
// Формат данных, дополнительно, определяет набор значений, которые можно преобразовать.
//
// Параметры:
//	Значение - Произвольный - Доступные типы определяются форматом данных.
//	ФорматДанных - Строка - Определяет формат данных и доступные типы значений.
//		XML - Поддерживает значения следующих типов: Неопределено, Null, Булево, Число, Строка, Дата, Тип, УникальныйИдентификатор,
//			ДвоичныеДанные, ХранилищеЗначения, ОписаниеТипов, а также ссылки объектов данных и сами объекты данных, 
//			наборы записей регистров, менеджер значения константы.
//		JSON - Поддерживает значения следующих типов: Неопределено, Булево, Число, Строка, Дата (будет преобразована в строку),
//			Структура, ФиксированнаяСтруктура, Массив, ФиксированныйМассив, Соответствие, ФиксированноеСоответствие.
//		XDTO_XML - Поддерживает значения для которых доступна сериализация.
//		XDTO_JSON - Поддерживает значения для которых доступна сериализация.
//
Функция ЗначениеВСтрокуДанных(Значение, ФорматДанных = Неопределено) Экспорт 
	
	SSL_IT_ОбработкаДанных.ОпределитьЗначение(
		ФорматДанных, Тип("ПеречислениеСсылка.SSL_IT_ФорматыДанных"), Перечисления.SSL_IT_ФорматыДанных.XDTO_XML);
	
	Если ФорматДанных = Перечисления.SSL_IT_ФорматыДанных.XML Тогда 
		ЗаписьДанных = Новый ЗаписьXML();
		ЗаписьДанных.УстановитьСтроку();
		ЗаписатьXML(ЗаписьДанных, Значение);
		СтрокаДанных = ЗаписьДанных.Закрыть();
		
	ИначеЕсли ФорматДанных = Перечисления.SSL_IT_ФорматыДанных.JSON	Тогда 
		ЗаписьДанных = Новый ЗаписьJSON();
		ЗаписьДанных.УстановитьСтроку(Новый ПараметрыЗаписиJSON());
		ЗаписатьJSON(ЗаписьДанных, Значение);
		СтрокаДанных = ЗаписьДанных.Закрыть();	
		
	ИначеЕсли ФорматДанных = Перечисления.SSL_IT_ФорматыДанных.XDTO_XML Тогда 	
		ЗаписьДанных = Новый ЗаписьXML();
		ЗаписьДанных.УстановитьСтроку();
		СериализаторXDTO.ЗаписатьXML(ЗаписьДанных, Значение);
		СтрокаДанных = ЗаписьДанных.Закрыть();	
		
	ИначеЕсли ФорматДанных = Перечисления.SSL_IT_ФорматыДанных.XDTO_JSON Тогда 
		ЗаписьДанных = Новый ЗаписьJSON();
		ЗаписьДанных.УстановитьСтроку(Новый ПараметрыЗаписиJSON());
		СериализаторXDTO.ЗаписатьJSON(ЗаписьДанных, Значение, НазначениеТипаXML.Явное);
		СтрокаДанных = ЗаписьДанных.Закрыть();	
		
	КонецЕсли;
	
	// Возврат
	Возврат СтрокаДанных;	
	
КонецФункции

// Преобразует строку в произвольное значение.
//  
// Параметры:
//	СтрокаДанных - Строка - Строковое представление данных.
//	ФорматСтроки - Строка - Определяет конвертер.
//		XML - Конвертер: ПрочитатьXML.
//		JSON - Конвертер: ПрочитатьJSON.
//		XDTO_XML - Конвертер: СериализаторXDTO.ПрочитатьXML.
//		XDTO_JSON - Конвертер: СериализаторXDTO.ПрочитатьJSON.
//
Функция СтрокуДанныхВЗначение(СтрокаДанных, ФорматСтроки = Неопределено) Экспорт 
	
	SSL_IT_ОбработкаДанных.ОпределитьЗначение(
		ФорматСтроки, Тип("ПеречислениеСсылка.SSL_IT_ФорматыДанных"), Перечисления.SSL_IT_ФорматыДанных.XDTO_XML);
	
	Если ФорматСтроки = Перечисления.SSL_IT_ФорматыДанных.XML Тогда  
		ЧтениеДанных = Новый ЧтениеXML();
		ЧтениеДанных.УстановитьСтроку(СтрокаДанных);
		Значение = ПрочитатьXML(ЧтениеДанных);
		ЧтениеДанных.Закрыть();
		
	ИначеЕсли ФорматСтроки = Перечисления.SSL_IT_ФорматыДанных.JSON	Тогда
		ЧтениеДанных = Новый ЧтениеJSON();
		ЧтениеДанных.УстановитьСтроку(СтрокаДанных);
		Значение = ПрочитатьJSON(ЧтениеДанных);
		ЧтениеДанных.Закрыть();		
		
	ИначеЕсли ФорматСтроки = Перечисления.SSL_IT_ФорматыДанных.XDTO_XML	Тогда
		ЧтениеДанных = Новый ЧтениеXML();
		ЧтениеДанных.УстановитьСтроку(СтрокаДанных);
		Значение = СериализаторXDTO.ПрочитатьXML(ЧтениеДанных);	
		ЧтениеДанных.Закрыть();
		
	ИначеЕсли ФорматСтроки = Перечисления.SSL_IT_ФорматыДанных.XDTO_JSON Тогда
		ЧтениеДанных = Новый ЧтениеJSON();
		ЧтениеДанных.УстановитьСтроку(СтрокаДанных);
		Значение = СериализаторXDTO.ПрочитатьJSON(ЧтениеДанных);
		ЧтениеДанных.Закрыть();
		
	КонецЕсли;
	
	// Возврат
    Возврат Значение;
	
КонецФункции	

// Устарела. Следует использовать метод "ЗначениеВСтрокуДанных".
//
Функция ЗначениеВСтрокуXDTO(Значение) Экспорт
	
	// Возврат
	Возврат ЗначениеВСтрокуДанных(Значение);
	
КонецФункции

// Устарела. Следует использовать метод "СтрокуДанныхВЗначение".
//
Функция СтрокаXDTOВЗначение(СтрокаXDTO) Экспорт
	
	// Возврат
    Возврат СтрокуДанныхВЗначение(СтрокаXDTO);
	
КонецФункции	

Функция ПолучитьСтруктуруСвойствЗначения(Значение, Знач ИменаСвойств = Неопределено) Экспорт
	
	СтруктураСвойств = Новый Структура();
	
	Если ИменаСвойств = Неопределено Тогда 
		СтруктураСвойств.Вставить("Ключ", Значение);		
	Иначе
		ИменаСвойств = ПолучитьКоллекциюКакМассив(ИменаСвойств);
		
		Для Каждого ИмяСвойства Из ИменаСвойств Цикл 
			СтруктураСвойств.Вставить(ИмяСвойства);		
		КонецЦикла;	
		
		ЗаполнитьЗначенияСвойств(СтруктураСвойств, Значение);
	КонецЕсли;	
	
	// Возврат
	Возврат СтруктураСвойств;	
	
КонецФункции	

#КонецОбласти

#КонецОбласти
	

	

	

	



	



	

	

	

	





	
