
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = Новый Структура;
	
	ИмяОтчета = "Товары без движений";
	
	РегистрационныеДанные.Вставить("Наименование", 		ИмяОтчета);
	РегистрационныеДанные.Вставить("БезопасныйРежим", 	Ложь);
	РегистрационныеДанные.Вставить("Версия", 			"1.0");
	РегистрационныеДанные.Вставить("Вид", 				"ДополнительныйОтчет");
	РегистрационныеДанные.Вставить("Информация", 		ИмяОтчета);
	
	тзКоманд = Новый ТаблицаЗначений;
	
	тзКоманд.Колонки.Добавить("Идентификатор");
	тзКоманд.Колонки.Добавить("Представление");
	тзКоманд.Колонки.Добавить("Модификатор");
	тзКоманд.Колонки.Добавить("ПоказыватьОповещение");
	тзКоманд.Колонки.Добавить("Использование");
	тзКоманд.Колонки.Добавить("ПроверкаПроведенияПередПечатью");
	 
	строкаКоманды = тзКоманд.Добавить();
	
	строкаКоманды.Идентификатор 		= "ТоварыБезДвижений";
	строкаКоманды.Представление 		= ИмяОтчета;
	строкаКоманды.ПоказыватьОповещение	= Истина;
	строкаКоманды.Использование 		= "ОткрытиеФормы";
	
	РегистрационныеДанные.Вставить("Команды", тзКоманд);
	
	Возврат РегистрационныеДанные;

	
КонецФункции

