// Модуль менеджера справочника "Организации"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


////////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура заполнения предопределенных элементов справочника
//
Процедура ВыполнитьНачальноеЗаполнение() Экспорт
	
	// Заполним формы собственности
	Запрос=Новый Запрос;
	Запрос.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	             |	Организации.Ссылка КАК Организация
	             |ИЗ
	             |	Справочник.Организации КАК Организации
	             |ГДЕ
	             |	Организации.ФормаСобственности = &ФормаСобственностиПустая";
	Запрос.УстановитьПараметр("ФормаСобственностиПустая",Перечисления.ФормыСобственности.ПустаяСсылка());
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ОбъектОрганизация = Выборка.Организация.ПолучитьОбъект();
		ОбъектОрганизация.ФормаСобственности=Перечисления.ФормыСобственности.ЮридическоеЛицо;
		ОбъектОрганизация.ОбменДанными.Загрузка = Истина;
		ОбъектОрганизация.Записать();
	КонецЦикла;
	
КонецПроцедуры // ВыполнитьНачальноеЗаполнение()

// Возвращает организацию основную для текущего пользователя системы
//
// Возвращаемое значение:
//   Ссылка   - 
//
Функция ОрганизацияПоУмолчанию() Экспорт
	
	Возврат ПараметрыСеанса.Организация;
	
КонецФункции // ОрганизацияПоУмолчанию()


// функция устанавливает актуальное значение КПП
Процедура УстановитьАктуальноеЗначениеИсторииКПП(КПП, ИсторияКПП) Экспорт
	
	КоличествоЗаписей = ИсторияКПП.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияКПП.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияКПП[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.КПП = КПП;
		
	КонецЕсли;
	
КонецПроцедуры

// функция устанавливает актуальное значение наименования
Процедура УстановитьАктуальноеЗначениеИсторииНаименований(НаименованиеПолное, ИсторияНаименований) Экспорт
	
	КоличествоЗаписей = ИсторияНаименований.Количество();
	
	Если КоличествоЗаписей > 0 Тогда
		
		ИсторияНаименований.Сортировать("Период");
		АктуальнаяЗаписьИстории = ИсторияНаименований[КоличествоЗаписей - 1];
		АктуальнаяЗаписьИстории.НаименованиеПолное = НаименованиеПолное;
		
	КонецЕсли;
	
КонецПроцедуры

// функция получает актуальный КПП на дату
Функция КППНаДату(Организация, ДатаСведений) Экспорт
	
	Если НЕ ЗначениеЗаполнено(Организация)
		ИЛИ ТипЗнч(Организация) <> Тип("СправочникСсылка.Организации") Тогда
		Возврат "";
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ДатаСведений) Тогда
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "КПП");
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Параметры.Вставить("Организация", Организация);
	Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	МАКСИМУМ(ИсторияКППОрганизаций.Период) КАК Период,
	|	ИсторияКППОрганизаций.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ЗначенияКПП
	|ИЗ
	|	Справочник.Организации.ИсторияКПП КАК ИсторияКППОрганизаций
	|ГДЕ
	|	ИсторияКППОрганизаций.Ссылка = &Организация
	|	И ИсторияКППОрганизаций.Период <= &ДатаСведений
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсторияКППОрганизаций.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсторияКППОрганизаций.КПП КАК КПП
	|ИЗ
	|	ЗначенияКПП КАК ЗначенияКПП
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации.ИсторияКПП КАК ИсторияКППОрганизаций
	|		ПО ЗначенияКПП.Ссылка = ИсторияКППОрганизаций.Ссылка
	|			И ЗначенияКПП.Период = ИсторияКППОрганизаций.Период";
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.КПП;
	Иначе
		Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "КПП");
	КонецЕсли;
КонецФункции

// функция получает актуальные наименования на дату
Функция НаименованияНаДату(Организация, ДатаСведений) Экспорт
	
	НаименованияОрганизации = Новый Структура("СокращенноеНаименование, НаименованиеПолное, НаименованиеДляПечатныхФорм", "", "", "");
	
	Если НЕ ЗначениеЗаполнено(Организация)
		ИЛИ ТипЗнч(Организация) <> Тип("СправочникСсылка.Организации") Тогда
		Возврат НаименованияОрганизации;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДатаСведений) Тогда
		Запрос = Новый Запрос();
		Запрос.Параметры.Вставить("Организация", Организация);
		Запрос.Параметры.Вставить("ДатаСведений", ДатаСведений);
		Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МАКСИМУМ(ИсторияНаименованийОрганизаций.Период) КАК Период,
		|	ИсторияНаименованийОрганизаций.Ссылка КАК Ссылка
		|ПОМЕСТИТЬ ЗначенияНаименований
		|ИЗ
		|	Справочник.Контрагенты.ИсторияНаименований КАК ИсторияНаименованийОрганизаций
		|ГДЕ
		|	ИсторияНаименованийОрганизаций.Ссылка = &Организация
		|	И ИсторияНаименованийОрганизаций.Период <= &ДатаСведений
		|
		|СГРУППИРОВАТЬ ПО
		|	ИсторияНаименованийОрганизаций.Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИсторияНаименованийОрганизаций.Ссылка.Наименование КАК Наименование,
		|	ИсторияНаименованийОрганизаций.НаименованиеПолное КАК НаименованиеПолное
		|ИЗ
		|	ЗначенияНаименований КАК ЗначенияНаименований
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Организации.ИсторияНаименований КАК ИсторияНаименованийОрганизаций
		|		ПО ЗначенияНаименований.Ссылка = ИсторияНаименованийОрганизаций.Ссылка
		|			И ЗначенияНаименований.Период = ИсторияНаименованийОрганизаций.Период";
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			НаименованияОрганизации.СокращенноеНаименование     = Выборка.Наименование;
			НаименованияОрганизации.НаименованиеПолное          = Выборка.НаименованиеПолное;
			НаименованияОрганизации.НаименованиеДляПечатныхФорм = Выборка.НаименованиеПолное;
			Возврат НаименованияОрганизации;
		КонецЕсли;
	КонецЕсли;
	
	ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Организация, "Наименование, НаименованиеПолное");
	НаименованияОрганизации.СокращенноеНаименование     = ЗначенияРеквизитов.Наименование;
	НаименованияОрганизации.НаименованиеПолное          = ЗначенияРеквизитов.НаименованиеПолное;
	НаименованияОрганизации.НаименованиеДляПечатныхФорм = ЗначенияРеквизитов.НаименованиеПолное;
	Возврат НаименованияОрганизации;
	
КонецФункции

////////////////////////////////////////////////////////////////////////////////
// ПАРАМЕТРЫ ОБРАБОТКИ РЕКВИЗИТОВ ОБЪЕКТА

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Массив - Возвращаемый массив содержит строковые идентификаторы реквизитов.
//
Функция ПолучитьОбязательныеРеквизиты(Объект) Экспорт
	
	// Обязательные реквизиты объекта
	ОбязательныеРеквизиты = Новый Массив();
	ОбязательныеРеквизиты.Добавить("Наименование");
	ОбязательныеРеквизиты.Добавить("ФормаСобственности");
	
	// Возвращаем сформированные параметры проверки
	Возврат ОбязательныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()

// Производит формирование параметров проверки заполнения реквизитов объекта на предмет обязательности и уникальности.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется получение параметров проверки.
//
// Возвращаемое значение:
//  Структура - Возвращаемая структура содержит строковые идентификаторы реквизитов и вариант проверки его заполнения
//  (1-Обязательный, 2-Уникальный, 3-Уникальный и обязательный). Для описания проверки табличных частей используется
//  вложенная структура.
//
Функция ПолучитьУникальныеРеквизиты(Объект) Экспорт
	
	// Структура уникальных реквизитов
	УникальныеРеквизиты = Новый Структура();
	УникальныеРеквизиты.Вставить("Наименование");
	УникальныеРеквизиты.Вставить("Код");
	
	// Возвращаем сформированные параметры проверки
	Возврат УникальныеРеквизиты;
	
КонецФункции // ПолучитьОбязательныеРеквизиты()


////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ ИЗМЕНЕНИЯ ДАННЫХ РЕКВИЗИТОВ

// Обработчик события возникающего при изменении данных реквизита "Наименование".
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура НаименованиеПриИзменении(Объект, ПараметрыДействия=Неопределено) Экспорт
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;

КонецПроцедуры // НаименованиеПриИзменении()

// Обработчик события при окончании изменения данных реквизита "НаименованиеПолное"
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура НаименованиеПолноеПриИзменении(Объект, ПараметрыДействия) Экспорт
	// смотрим заполнено ли наименование
	Если ЗначениеЗаполнено(Объект.НаименованиеПолное) Тогда
		// получаем структура наименований
		СтруктураНаименований = ОбщегоНазначения.ПолучитьНаименованияНаДату(Объект.Ссылка, ТекущаяДатаСеанса());
		
		// получаем наименование
		НаименованиеНаСегодня = СтруктураНаименований.НаименованиеПолное;
		
		// смотрим заполнено ли значение
		Если Объект.ИсторияНаименований.Количество() > 0 И ЗначениеЗаполнено(НаименованиеНаСегодня) Тогда
			// проверяем изменилось ли наименование
			Если НаименованиеНаСегодня <> Объект.НаименованиеПолное Тогда
				// формируем структуру отбора
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Период", НачалоДня(ТекущаяДатаСеанса()));
				
				// ищем значение на сегодня в ТЧ
				НайденныеСтроки = Объект.ИсторияНаименований.НайтиСтроки(СтруктураОтбора);
				
				// проверяем
				Если НайденныеСтроки.Количество() > 0 Тогда
					// получаем строку
					ТекСтрока = НайденныеСтроки[0];
					ТекСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
				Иначе
					// добавляем строку
					НоваяСтрока = Объект.ИсторияНаименований.Добавить();
					НоваяСтрока.Период = ТекущаяДатаСеанса();
					НоваяСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
				КонецЕсли;
			КонецЕсли;
		Иначе
			// ищем строку с пустым периодом
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Период", Дата("00010101"));
			
			// ищем значение на сегодня в ТЧ
			НайденныеСтроки = Объект.ИсторияНаименований.НайтиСтроки(СтруктураОтбора);
			
			// смотрим нашли или нет
			Если НайденныеСтроки.Количество() > 0 Тогда
				// получаем строку
				ТекСтрока = НайденныеСтроки[0];
				ТекСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
			Иначе
				// добавляем строку
				НоваяСтрока = Объект.ИсторияНаименований.Добавить();
				НоваяСтрока.Период = Дата("00010101");
				НоваяСтрока.НаименованиеПолное = Объект.НаименованиеПолное;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры  //НаименованиеПолноеПриИзменении()


// Обработчик события при окончании изменения данных реквизита "КПП"
//
// Параметры:
//  Объект            - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//  ПараметрыДействия - Структура            - Набор параметров, использующихся при выполнения операции.
//
Процедура КПППриИзменении(Объект, ПараметрыДействия) Экспорт
	// смотрим заполнено ли КПП
	Если ЗначениеЗаполнено(Объект.КПП) Тогда
		// получаем последний КПП               
		КППНаСегодня = ОбщегоНазначения.ПолучитьКППНаДату(Объект.Ссылка, ТекущаяДатаСеанса());
		
		// смотрим заполнено ли значение
		Если Объект.ИсторияКПП.Количество() > 0 И ЗначениеЗаполнено(КППНаСегодня) Тогда 
			// проверяем изменился ли КПП
			Если КППНаСегодня <> Объект.КПП Тогда
				// формируем структуру отбора
				СтруктураОтбора = Новый Структура;
				СтруктураОтбора.Вставить("Период", НачалоДня(ТекущаяДатаСеанса()));
				
				// ищем значение на сегодня в ТЧ
				НайденныеСтроки = Объект.ИсторияКПП.НайтиСтроки(СтруктураОтбора);
				
				// проверяем
				Если НайденныеСтроки.Количество() > 0 Тогда
					// получаем строку
					ТекСтрока = НайденныеСтроки[0];
					ТекСтрока.КПП = Объект.КПП;
				Иначе
					// добавляем строку
					НоваяСтрока = Объект.ИсторияКПП.Добавить();
					НоваяСтрока.Период = ТекущаяДатаСеанса();
					НоваяСтрока.КПП = Объект.КПП;
				КонецЕсли;
			КонецЕсли;
		Иначе
			// ищем строку с пустым периодом
			СтруктураОтбора = Новый Структура;
			СтруктураОтбора.Вставить("Период", Дата("00010101"));
			
			// ищем значение на сегодня в ТЧ
			НайденныеСтроки = Объект.ИсторияКПП.НайтиСтроки(СтруктураОтбора);
			
			// смотрим нашли или нет
			Если НайденныеСтроки.Количество() > 0 Тогда
				// получаем строку
				ТекСтрока = НайденныеСтроки[0];
				ТекСтрока.КПП = Объект.КПП;
			Иначе
				// добавляем строку
				НоваяСтрока = Объект.ИсторияКПП.Добавить();
				НоваяСтрока.Период = Дата("00010101");
				НоваяСтрока.КПП = Объект.КПП;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ФОРМИРОВАНИЯ ПЕЧАТНЫХ ФОРМ

// Процедура используется для указания доступного данному виду объектов перечня вариантов печати.
//
// Параметры:
//  КомандыПечати - ТаблицаЗначений - Каждая строка таблицы соответствует одному из вариантов печати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры // ДобавитьКомандыПечати()

// Производит формирование структуры с доступностью и видимостью команд печати объекта.
//
// Параметры:
//  Объект - ДанныеФормыСтруктура - Объект, для которого выполняется обработка события.
//
Функция ПолучитьПараметрыКомандПечати(Объект) Экспорт
	
	// Команды печати могут быть недоступны и/или невидимы в зависимости от параметров объекта.
	ПараметрыКоманд = Новый Соответствие;
	
	// Возвращаем сформированные параметры доступности команд проверки
	Возврат ПараметрыКоманд;
	
КонецФункции // ПолучитьПараметрыКомандПечати()

// Обработчик события формирования печатной формы.
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры // Печать()

#КонецЕсли