&НаКлиенте
Процедура ПоступлениеТоваровНажатие(Элемент)
	//ВнешняяОбработка = ВнешниеОбработки.Создать(ЭтотОбъект.ИспользуемоеИмяФайла,ложь);
	Объект.Режим = "ПоступлениеТоваров";
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "ПоступлениеТоваров");
	//ОткрытьФорму("ВнешняяОбработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
	ОткрытьФорму("Обработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
//	Обрик = ОткрытьФорму("ВнешняяОбработка.устПриемкаТСДНовая.Форма.Документ1");
	
	ЗакрытьФорму = Истина;
	Закрыть("ОК");	
КонецПроцедуры
&НаКлиенте
Процедура ИнвентаризацияТоваровНажатие(Элемент)
	Объект.Режим = "Инвентаризация";
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "Инвентаризация");
	ПараметрыОткрытияФормы.Вставить("Оператор", Объект.Оператор);
	
	//ОткрытьФорму("ВнешняяОбработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
	ОткрытьФорму("Обработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
	//Обрик = ОткрытьФорму("ВнешняяОбработка.устПриемкаТСДНовая.Форма.Документ1");
	ЗакрытьФорму = Истина;
	Закрыть("ОК");	
КонецПроцедуры
&НаКлиенте
Процедура СписаниеТоваровНажатие(Элемент)
	Объект.Режим = "СписаниеТоваров";
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "СписаниеТоваров");
	//ОткрытьФорму("ВнешняяОбработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
	ОткрытьФорму("Обработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
	ЗакрытьФорму = Истина;
	Закрыть("ОК");
КонецПроцедуры
&НаКлиенте
Процедура ВозвратТоваровНажатие(Элемент)
	Объект.Режим = "ВозвратПоставщику";
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "ВозвратПоставщику");
	//ОткрытьФорму("ВнешняяОбработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
	ОткрытьФорму("Обработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
	ЗакрытьФорму = Истина;
	Закрыть("ОК");
КонецПроцедуры
&НаКлиенте
Процедура ЗакрНажатие(Элемент)	
	//ВнешняяОбработка = ВнешниеОбработки.Создать(ЭтотОбъект.ИспользуемоеИмяФайла,ложь);
	//Обрик = ВнешняяОбработка.Получитьформу();
	//Обрик.Открыть();
	
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", Объект.Режим);
	ОткрытьФорму("Обработка.устПриемкаТСДНовая.Форма.Аутентификация",ПараметрыОткрытияФормы);
	ЗакрытьФорму = Истина;
	Закрыть("ОК");
	
КонецПроцедуры
&НаКлиенте
Процедура ПеремещениеТоваровНажатие(Элемент)
	Объект.Режим = "ПеремещениеТоваров";
	ПараметрыОткрытияФормы = Новый Структура;
	ПараметрыОткрытияФормы.Вставить("Режим", "ПеремещениеТоваров");
	//ОткрытьФорму("ВнешняяОбработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
	ОткрытьФорму("Обработка.устПриемкаТСДНовая.Форма.Документ1", ПараметрыОткрытияФормы);
	//Обрик = ОткрытьФорму("ВнешняяОбработка.устПриемкаТСДНовая.Форма.Документ1");
	ЗакрытьФорму = Истина;
	Закрыть("ОК");
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы = Ложь И (НЕ ЗакрытьФорму) Тогда
		Отказ = Истина;
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		Объект.Оператор = ПолучитьЗначениеПараметраСтруктуры(Параметры, "Оператор", "ПоступлениеТоваров");
КонецПроцедуры
