// Модуль набора записей регистра накоплений "Бюджет закупок"

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда


#Область ОписаниеПеременных

Перем ПодразделениеКомпании Экспорт; // Подразделение компании
Перем ДокументОбъект Экспорт;        // Документ объект (Регистратор)
Перем РежимПроведения Экспорт;       // Режим проведения документа оперативный/неоперативный

#КонецОбласти

// Функция выполняющая приход
Функция Приход() Экспорт
	Результат=Истина;
	
	// Получим документ, по которому будем делать записи в регистр
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	БюджетЗакупокТовары.Ссылка.ПодразделениеКомпании,
	|	БюджетЗакупокТовары.Ссылка.СценарийПланирования,
	|	БюджетЗакупокТовары.Номенклатура,
	|	БюджетЗакупокТовары.Количество,
	|	БюджетЗакупокТовары.СуммаВсегоУпр КАК СуммаУпр,
	|	БюджетЗакупокТовары.СуммаВсегоУпр * &Коэффициент КАК СуммаРег,
	|	БюджетЗакупокТовары.СуммаНДС КАК СуммаНДС,
	|	БюджетЗакупокТовары.Ссылка.ДатаПланирования КАК Период
	|ИЗ
	|	Документ.БюджетЗакупок.Товары КАК БюджетЗакупокТовары
	|ГДЕ
	|	БюджетЗакупокТовары.Ссылка = &Ссылка";	
	
	// Найдем коэффициент пересчета из управленческой валюты в валюту регл.учета
	УпрВал = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаУправленческогоУчетаКомпании.Получить(), ДокументОбъект.Дата);
	РегВал = РаботаСКурсамиВалют.ПолучитьКурсВалюты(Константы.ВалютаРегламентированногоУчетаОрганизаций.Получить(), ДокументОбъект.Дата);  	
	Коэффициент = (УпрВал.Курс/УпрВал.Кратность) / (РегВал.Курс/РегВал.Кратность);
	
	Запрос.УстановитьПараметр("Ссылка",ДокументОбъект);	
	Запрос.УстановитьПараметр("Коэффициент",Коэффициент);	

	Загрузить(Запрос.Выполнить().Выгрузить());
		
	ДокументОбъект=Неопределено;	
	Возврат Результат;
КонецФункции

#КонецЕсли